{
    "title": "CEBoosting: Online Sparse Identification of Dynamical Systems with Regime Switching by Causation Entropy Boosting. (arXiv:2304.07863v1 [math.DS])",
    "abstract": "Regime switching is ubiquitous in many complex dynamical systems with multiscale features, chaotic behavior, and extreme events. In this paper, a causation entropy boosting (CEBoosting) strategy is developed to facilitate the detection of regime switching and the discovery of the dynamics associated with the new regime via online model identification. The causation entropy, which can be efficiently calculated, provides a logic value of each candidate function in a pre-determined library. The reversal of one or a few such causation entropy indicators associated with the model calibrated for the current regime implies the detection of regime switching. Despite the short length of each batch formed by the sequential data, the accumulated value of causation entropy corresponding to a sequence of data batches leads to a robust indicator. With the detected rectification of the model structure, the subsequent parameter estimation becomes a quadratic optimization problem, which is solved using",
    "link": "http://arxiv.org/abs/2304.07863",
    "context": "Title: CEBoosting: Online Sparse Identification of Dynamical Systems with Regime Switching by Causation Entropy Boosting. (arXiv:2304.07863v1 [math.DS])\nAbstract: Regime switching is ubiquitous in many complex dynamical systems with multiscale features, chaotic behavior, and extreme events. In this paper, a causation entropy boosting (CEBoosting) strategy is developed to facilitate the detection of regime switching and the discovery of the dynamics associated with the new regime via online model identification. The causation entropy, which can be efficiently calculated, provides a logic value of each candidate function in a pre-determined library. The reversal of one or a few such causation entropy indicators associated with the model calibrated for the current regime implies the detection of regime switching. Despite the short length of each batch formed by the sequential data, the accumulated value of causation entropy corresponding to a sequence of data batches leads to a robust indicator. With the detected rectification of the model structure, the subsequent parameter estimation becomes a quadratic optimization problem, which is solved using",
    "path": "papers/23/04/2304.07863.json",
    "total_tokens": 931,
    "translated_title": "CEBoosting:基于因果熵增强的动态系统带制度转换的在线稀疏识别",
    "translated_abstract": "多尺度特征、混沌行为和极端事件使得制度转换普遍存在于许多复杂动力学系统中。本文提出了一种因果熵增强(CEBoosting)策略，以便通过在线模型识别促进制度转换的检测和新制度相关动力学的发现。通过计算效率高的因果熵，为预先确定的库中的每个候选函数提供一个逻辑值。与当前制度校准的模型相关的少数一个或几个因果熵指标的反转意味着检测到制度转换。尽管由连续数据组成的每个批次的长度很短，但与一系列数据批次对应的因果熵累积值导致了一个稳健的指标。通过检测模型结构的改正，随后的参数估计成为一个二次优化问题，通过计算进行解决。",
    "tldr": "该论文提出一种因果熵增强(CEBoosting)策略，能够通过在线模型识别来检测制度转换和发现新制度相关动力学。它能够高效地计算因果熵来提供逻辑值，检测到制度转换后会改正模型结构，并通过二次优化问题进行参数估计。",
    "en_tdlr": "This paper proposes a causation entropy boosting (CEBoosting) strategy for online model identification, which facilitates the detection of regime switching and the discovery of the dynamics associated with the new regime. It efficiently calculates causation entropy to provide a logic value, and rectifies the model structure after detecting regime switching to facilitate parameter estimation through a quadratic optimization problem."
}