{
    "title": "Uncertainty over Uncertainty in Environmental Policy Adoption: Bayesian Learning of Unpredictable Socioeconomic Costs. (arXiv:2304.10344v1 [math.OC])",
    "abstract": "The socioeconomic impact of pollution naturally comes with uncertainty due to, e.g., current new technological developments in emissions' abatement or demographic changes. On top of that, the trend of the future costs of the environmental damage is unknown: Will global warming dominate or technological advancements prevail? The truth is that we do not know which scenario will be realised and the scientific debate is still open. This paper captures those two layers of uncertainty by developing a real-options-like model in which a decision maker aims at adopting a once-and-for-all costly reduction in the current emissions rate, when the stochastic dynamics of the socioeconomic costs of pollution are subject to Brownian shocks and the drift is an unobservable random variable. By keeping track of the actual evolution of the costs, the decision maker is able to learn the unknown drift and to form a posterior dynamic belief of its true value. The resulting decision maker's timing problem boi",
    "link": "http://arxiv.org/abs/2304.10344",
    "context": "Title: Uncertainty over Uncertainty in Environmental Policy Adoption: Bayesian Learning of Unpredictable Socioeconomic Costs. (arXiv:2304.10344v1 [math.OC])\nAbstract: The socioeconomic impact of pollution naturally comes with uncertainty due to, e.g., current new technological developments in emissions' abatement or demographic changes. On top of that, the trend of the future costs of the environmental damage is unknown: Will global warming dominate or technological advancements prevail? The truth is that we do not know which scenario will be realised and the scientific debate is still open. This paper captures those two layers of uncertainty by developing a real-options-like model in which a decision maker aims at adopting a once-and-for-all costly reduction in the current emissions rate, when the stochastic dynamics of the socioeconomic costs of pollution are subject to Brownian shocks and the drift is an unobservable random variable. By keeping track of the actual evolution of the costs, the decision maker is able to learn the unknown drift and to form a posterior dynamic belief of its true value. The resulting decision maker's timing problem boi",
    "path": "papers/23/04/2304.10344.json",
    "total_tokens": 962,
    "translated_title": "环境政策采用中的不确定性：对不可预测的社会经济成本的贝叶斯学习(arXiv:2304.10344v1 [math.OC])",
    "translated_abstract": "污染的社会经济影响自然而然地伴随着不确定性，例如，排放减少的新技术发展或人口变化。此外，环境破坏未来成本的趋势是未知的：全球变暖是否占主导地位，还是技术进步会占据主导地位？事实上，我们不知道哪种情况会实现，科学界的辩论仍然存在。本文通过开发一个类似于实物期权的模型，捕捉这两层不确定性。在该模型中，决策者的目标是在当前的排放率中采取一次性昂贵的减少，当污染的社会经济成本的随机动态受到布朗运动的冲击时，漂移是不可观察的随机变量。通过跟踪成本的实际演变，决策者能够学习未知的漂移，并形成后验动态信念其真正价值。由此产生的决策时机问题公司",
    "tldr": "本文开发了一个类似于实物期权的模型，以捕捉环境政策采用中的两层不确定性。决策者能够通过跟踪成本的实际演变来学习未知的漂移，并形成后验动态信念其真正价值。",
    "en_tdlr": "This paper develops a real-options-like model to capture the two layers of uncertainty in environmental policy adoption. Decision makers are able to learn the unknown drift by keeping track of the actual evolution of the costs and forming a posterior dynamic belief of its true value."
}