{
    "title": "A Distributionally Robust Approach to Regret Optimal Control using the Wasserstein Distance. (arXiv:2304.06783v1 [math.OC])",
    "abstract": "This paper proposes a distributionally robust approach to regret optimal control of discrete-time linear dynamical systems with quadratic costs subject to stochastic additive disturbance on the state process. The underlying probability distribution of the disturbance process is unknown, but assumed to lie in a given ball of distributions defined in terms of the type-2 Wasserstein distance. In this framework, strictly causal linear disturbance feedback controllers are designed to minimize the worst-case expected regret. The regret incurred by a controller is defined as the difference between the cost it incurs in response to a realization of the disturbance process and the cost incurred by the optimal noncausal controller which has perfect knowledge of the disturbance process realization at the outset. Building on a well-established duality theory for optimal transport problems, we show how to equivalently reformulate this minimax regret optimal control problem as a tractable semidefini",
    "link": "http://arxiv.org/abs/2304.06783",
    "context": "Title: A Distributionally Robust Approach to Regret Optimal Control using the Wasserstein Distance. (arXiv:2304.06783v1 [math.OC])\nAbstract: This paper proposes a distributionally robust approach to regret optimal control of discrete-time linear dynamical systems with quadratic costs subject to stochastic additive disturbance on the state process. The underlying probability distribution of the disturbance process is unknown, but assumed to lie in a given ball of distributions defined in terms of the type-2 Wasserstein distance. In this framework, strictly causal linear disturbance feedback controllers are designed to minimize the worst-case expected regret. The regret incurred by a controller is defined as the difference between the cost it incurs in response to a realization of the disturbance process and the cost incurred by the optimal noncausal controller which has perfect knowledge of the disturbance process realization at the outset. Building on a well-established duality theory for optimal transport problems, we show how to equivalently reformulate this minimax regret optimal control problem as a tractable semidefini",
    "path": "papers/23/04/2304.06783.json",
    "total_tokens": 853,
    "translated_title": "基于Wasserstein距离的分布鲁棒方法实现后悔最优控制",
    "translated_abstract": "本文提出了一种基于分布鲁棒方法的离散时间线性动态系统的后悔最优控制策略，该系统受到随机加性扰动影响，成本为二次型。扰动过程的概率分布未知，但假定位于给定的分布球内，定义为二阶Wasserstein距离。在该框架下，设计具有严格因果线性扰动反馈控制器，以最小化最坏情况下的预期后悔。控制器所产生的后悔是指它对抗扰动时产生的成本与最优非因果控制器在一开始就有完全了解扰动过程后产生的成本之差。建立在最优输运问题的一个很好的对偶理论基础上，我们展示了如何等价地改写这个极小极大的后悔最优控制问题为一个可行的半定规划问题。",
    "tldr": "提出了一种基于Wasserstein距离的分布鲁棒方法实现后悔最优控制的控制器设计策略。",
    "en_tdlr": "This paper presents a distributionally robust approach utilizing the Wasserstein distance to achieve regret optimal control, and proposes strictly causal linear disturbance feedback controllers designed to minimize the worst-case expected regret for discrete-time linear dynamical systems with quadratic costs subject to stochastic additive disturbance."
}