{
    "title": "EulerNet: Adaptive Feature Interaction Learning via Euler's Formula for CTR Prediction. (arXiv:2304.10711v1 [cs.IR])",
    "abstract": "Learning effective high-order feature interactions is very crucial in the CTR prediction task. However, it is very time-consuming to calculate high-order feature interactions with massive features in online e-commerce platforms. Most existing methods manually design a maximal order and further filter out the useless interactions from them. Although they reduce the high computational costs caused by the exponential growth of high-order feature combinations, they still suffer from the degradation of model capability due to the suboptimal learning of the restricted feature orders. The solution to maintain the model capability and meanwhile keep it efficient is a technical challenge, which has not been adequately addressed. To address this issue, we propose an adaptive feature interaction learning model, named as EulerNet, in which the feature interactions are learned in a complex vector space by conducting space mapping according to Euler's formula. EulerNet converts the exponential power",
    "link": "http://arxiv.org/abs/2304.10711",
    "context": "Title: EulerNet: Adaptive Feature Interaction Learning via Euler's Formula for CTR Prediction. (arXiv:2304.10711v1 [cs.IR])\nAbstract: Learning effective high-order feature interactions is very crucial in the CTR prediction task. However, it is very time-consuming to calculate high-order feature interactions with massive features in online e-commerce platforms. Most existing methods manually design a maximal order and further filter out the useless interactions from them. Although they reduce the high computational costs caused by the exponential growth of high-order feature combinations, they still suffer from the degradation of model capability due to the suboptimal learning of the restricted feature orders. The solution to maintain the model capability and meanwhile keep it efficient is a technical challenge, which has not been adequately addressed. To address this issue, we propose an adaptive feature interaction learning model, named as EulerNet, in which the feature interactions are learned in a complex vector space by conducting space mapping according to Euler's formula. EulerNet converts the exponential power",
    "path": "papers/23/04/2304.10711.json",
    "total_tokens": 890,
    "translated_title": "EulerNet: 基于欧拉公式的复杂向量空间特征交互学习以实现点击率预测",
    "translated_abstract": "在点击率预测任务中，学习高阶特征交互是非常关键的。然而，在在线电子商务平台中，由于海量特征的存在，计算高阶特征交互非常耗时。大多数现有方法手动设计最大阶数，并从中过滤出无用的交互。尽管它们减少了高阶特征组合的指数级增长所引起的高计算成本，但由于受到受限的特征阶数的次优学习的影响，它们仍然会受到模型能力下降的影响。保持模型能力并同时保持其效率的解决方案是一个技术挑战，该问题尚未得到充分解决。为了解决这个问题，我们提出了一个自适应特征交互学习模型，名为EulerNet，在该模型中，通过根据欧拉公式进行空间映射在复杂向量空间中学习特征交互。",
    "tldr": "本文提出了一种自适应特征交互学习模型EulerNet，它采用欧拉公式将高阶特征交互映射到复杂向量空间中学习，从而在保持效率的同时提高模型能力。"
}