{
    "title": "Benchmarking Actor-Critic Deep Reinforcement Learning Algorithms for Robotics Control with Action Constraints. (arXiv:2304.08743v1 [cs.LG])",
    "abstract": "This study presents a benchmark for evaluating action-constrained reinforcement learning (RL) algorithms. In action-constrained RL, each action taken by the learning system must comply with certain constraints. These constraints are crucial for ensuring the feasibility and safety of actions in real-world systems. We evaluate existing algorithms and their novel variants across multiple robotics control environments, encompassing multiple action constraint types. Our evaluation provides the first in-depth perspective of the field, revealing surprising insights, including the effectiveness of a straightforward baseline approach. The benchmark problems and associated code utilized in our experiments are made available online at github.com/omron-sinicx/action-constrained-RL-benchmark for further research and development.",
    "link": "http://arxiv.org/abs/2304.08743",
    "context": "Title: Benchmarking Actor-Critic Deep Reinforcement Learning Algorithms for Robotics Control with Action Constraints. (arXiv:2304.08743v1 [cs.LG])\nAbstract: This study presents a benchmark for evaluating action-constrained reinforcement learning (RL) algorithms. In action-constrained RL, each action taken by the learning system must comply with certain constraints. These constraints are crucial for ensuring the feasibility and safety of actions in real-world systems. We evaluate existing algorithms and their novel variants across multiple robotics control environments, encompassing multiple action constraint types. Our evaluation provides the first in-depth perspective of the field, revealing surprising insights, including the effectiveness of a straightforward baseline approach. The benchmark problems and associated code utilized in our experiments are made available online at github.com/omron-sinicx/action-constrained-RL-benchmark for further research and development.",
    "path": "papers/23/04/2304.08743.json",
    "total_tokens": 797,
    "translated_title": "带操作约束的机器人控制下的演员-评论家深度强化学习算法基准测试",
    "translated_abstract": "本研究提出了一个用于评估操作约束的强化学习（RL）算法的基准测试。在操作受限的RL中，学习系统采取的每个操作都必须符合某些约束条件。这些约束条件对于确保实际系统中的操作的可行性和安全性至关重要。我们在多个机器人控制环境中评估了现有算法及其新颖的变体，涵盖多种操作限制类型。我们的评估提供了该领域的第一个深入视角，揭示了一些出人意料的见解，包括基线方法的有效性。我们的实验中使用的基准问题和相关代码可在github.com/omron-sinicx/action-constrained-RL-benchmark上在线获取，以进一步开展研究和开发。",
    "tldr": "本研究提出基准测试评估带操作约束的强化学习算法在多种机器人控制环境中的表现，并公开GitHub代码，为未来的研究和开发提供参考。",
    "en_tdlr": "This study presents a benchmark for evaluating action-constrained reinforcement learning (RL) algorithms in multiple robotics control environments and provides insights into the effectiveness of existing and novel variants. The associated code and benchmark problems are made publicly available on GitHub to aid future research and development."
}