{
    "title": "Patterns of gender-specializing query reformulation. (arXiv:2304.13129v1 [cs.IR])",
    "abstract": "Users of search systems often reformulate their queries by adding query terms to reflect their evolving information need or to more precisely express their information need when the system fails to surface relevant content. Analyzing these query reformulations can inform us about both system and user behavior. In this work, we study a special category of query reformulations that involve specifying demographic group attributes, such as gender, as part of the reformulated query (e.g., \"olympic 2021 soccer results\" to \"olympic 2021 women's soccer results\"). There are many ways a query, the search results, and a demographic attribute such as gender may relate, leading us to hypothesize different causes for these reformulation patterns, such as under-representation on the original result page or based on the linguistic theory of markedness. This paper reports on an observational study of gender-specializing query reformulations -- their contexts and effects -- as a lens on the relationship",
    "link": "http://arxiv.org/abs/2304.13129",
    "context": "Title: Patterns of gender-specializing query reformulation. (arXiv:2304.13129v1 [cs.IR])\nAbstract: Users of search systems often reformulate their queries by adding query terms to reflect their evolving information need or to more precisely express their information need when the system fails to surface relevant content. Analyzing these query reformulations can inform us about both system and user behavior. In this work, we study a special category of query reformulations that involve specifying demographic group attributes, such as gender, as part of the reformulated query (e.g., \"olympic 2021 soccer results\" to \"olympic 2021 women's soccer results\"). There are many ways a query, the search results, and a demographic attribute such as gender may relate, leading us to hypothesize different causes for these reformulation patterns, such as under-representation on the original result page or based on the linguistic theory of markedness. This paper reports on an observational study of gender-specializing query reformulations -- their contexts and effects -- as a lens on the relationship",
    "path": "papers/23/04/2304.13129.json",
    "total_tokens": 826,
    "translated_title": "查询重构中的性别专业化模式",
    "translated_abstract": "搜索系统的用户经常通过添加查询术语来反映他们日益发展的信息需求，或者当系统无法提供相关内容时更准确地表达他们的信息需求。分析这些查询重构可以为我们提供有关系统和用户行为的信息。在这项工作中，我们研究了一个特殊类别的查询重构，这种查询重构涉及指定人口统计属性，比如性别，作为重构查询的一部分（例如，“奥运会2021年足球比赛结果”变成“奥运会2021年女子足球比赛结果”）。查询、搜索结果和人口统计属性（如性别）之间可能存在许多关系，这导致我们假设不同的原因，如原始结果页面上的欠代表性或标记理论基础。本文报告了一项性别专业化查询重构的观察性研究——它们的上下文和影响——作为探索用户和搜索系统之间关系的一种方法。",
    "tldr": "本文研究了一类查询重构，即在查询中添加人口统计属性，以探索用户和搜索系统之间的关系。",
    "en_tdlr": "This paper studies a category of query reformulations that involve adding demographic group attributes, such as gender, to explore the relationship between users and search systems."
}