{
    "title": "Exploring the Use of ChatGPT as a Tool for Learning and Assessment in Undergraduate Computer Science Curriculum: Opportunities and Challenges. (arXiv:2304.11214v1 [cs.CY])",
    "abstract": "The application of Artificial intelligence for teaching and learning in the academic sphere is a trending subject of interest in the computing education. ChatGPT, as an AI-based tool, provides various advantages, such as heightened student involvement, cooperation, accessibility and availability. This paper addresses the prospects and obstacles associated with utilizing ChatGPT as a tool for learning and assessment in undergraduate Computer Science curriculum in particular to teaching and learning fundamental programming courses. Students having completed the course work for a Data Structures and Algorithms (a sophomore level course) participated in this study. Two groups of students were given programming challenges to solve within a short period of time. The control group (group A) had access to text books and notes of programming courses, however no Internet access was provided. Group B students were given access to ChatGPT and were encouraged to use it to help solve the programming",
    "link": "http://arxiv.org/abs/2304.11214",
    "context": "Title: Exploring the Use of ChatGPT as a Tool for Learning and Assessment in Undergraduate Computer Science Curriculum: Opportunities and Challenges. (arXiv:2304.11214v1 [cs.CY])\nAbstract: The application of Artificial intelligence for teaching and learning in the academic sphere is a trending subject of interest in the computing education. ChatGPT, as an AI-based tool, provides various advantages, such as heightened student involvement, cooperation, accessibility and availability. This paper addresses the prospects and obstacles associated with utilizing ChatGPT as a tool for learning and assessment in undergraduate Computer Science curriculum in particular to teaching and learning fundamental programming courses. Students having completed the course work for a Data Structures and Algorithms (a sophomore level course) participated in this study. Two groups of students were given programming challenges to solve within a short period of time. The control group (group A) had access to text books and notes of programming courses, however no Internet access was provided. Group B students were given access to ChatGPT and were encouraged to use it to help solve the programming",
    "path": "papers/23/04/2304.11214.json",
    "total_tokens": 935,
    "translated_title": "探索在本科计算机科学课程中将ChatGPT用作学习和评估工具的机会和挑战",
    "translated_abstract": "在计算机教育领域，应用人工智能进行教学和学习是一个备受关注的趋势。作为一种基于人工智能的工具，ChatGPT提供了许多优势，如增强了学生的参与度、合作性、可访问性和可用性。本文就在本科计算机科学课程中将ChatGPT用作学习和评估工具的前景和障碍进行了讨论，特别是在教授基础编程课程方面。本研究针对已完成数据结构和算法（一门二年级课程）课程作业的学生进行了研究。两组学生被要求在短时间内解决编程挑战问题。对照组（A组）只有编程课程的课本和笔记，并没有提供互联网访问权限。而B组的学生可以使用ChatGPT，并鼓励他们使用它来帮助解决问题。",
    "tldr": "本文讨论了将ChatGPT用作本科计算机科学课程学习和评估工具的前景和障碍，通过对数据结构和算法课程的学生进行短期编程任务的调查，证明了ChatGPT能够提升学生的参与度、合作性、可访问性和可用性。"
}