{
    "title": "TodyNet: Temporal Dynamic Graph Neural Network for Multivariate Time Series Classification. (arXiv:2304.05078v1 [cs.LG])",
    "abstract": "Multivariate time series classification (MTSC) is an important data mining task, which can be effectively solved by popular deep learning technology. Unfortunately, the existing deep learning-based methods neglect the hidden dependencies in different dimensions and also rarely consider the unique dynamic features of time series, which lack sufficient feature extraction capability to obtain satisfactory classification accuracy. To address this problem, we propose a novel temporal dynamic graph neural network (TodyNet) that can extract hidden spatio-temporal dependencies without undefined graph structure. It enables information flow among isolated but implicit interdependent variables and captures the associations between different time slots by dynamic graph mechanism, which further improves the classification performance of the model. Meanwhile, the hierarchical representations of graphs cannot be learned due to the limitation of GNNs. Thus, we also design a temporal graph pooling laye",
    "link": "http://arxiv.org/abs/2304.05078",
    "context": "Title: TodyNet: Temporal Dynamic Graph Neural Network for Multivariate Time Series Classification. (arXiv:2304.05078v1 [cs.LG])\nAbstract: Multivariate time series classification (MTSC) is an important data mining task, which can be effectively solved by popular deep learning technology. Unfortunately, the existing deep learning-based methods neglect the hidden dependencies in different dimensions and also rarely consider the unique dynamic features of time series, which lack sufficient feature extraction capability to obtain satisfactory classification accuracy. To address this problem, we propose a novel temporal dynamic graph neural network (TodyNet) that can extract hidden spatio-temporal dependencies without undefined graph structure. It enables information flow among isolated but implicit interdependent variables and captures the associations between different time slots by dynamic graph mechanism, which further improves the classification performance of the model. Meanwhile, the hierarchical representations of graphs cannot be learned due to the limitation of GNNs. Thus, we also design a temporal graph pooling laye",
    "path": "papers/23/04/2304.05078.json",
    "total_tokens": 980,
    "translated_title": "TodyNet：用于多变量时间序列分类的时间动态图神经网络",
    "translated_abstract": "多变量时间序列分类(MTSC)是一项重要的数据挖掘任务，可以通过流行的深度学习技术有效地解决。然而，现有的基于深度学习的方法忽视了不同维度之间的隐藏依赖关系，并且很少考虑时间序列的独特动态特征，这缺乏足够的特征提取能力来获得令人满意的分类准确性。为了解决这个问题，我们提出了一种新的时间动态图神经网络(TodyNet)，它可以提取隐藏的时空依赖关系，而无需定义图结构。它使得隔离但相互依赖的变量之间能够进行信息流动，并通过动态图机制捕获不同时间槽之间的关联，从而进一步提高模型的分类性能。同时，由于GNN的限制，无法学习到图的层次表示。因此，我们还设计了一个时间图池层，以沿时间维度学习有区分性的多级表示。实验结果表明，TodyNet有效地捕捉了多变量时间序列固有的动态性，并在几个基准测试上显着优于现有方法。",
    "tldr": "TodyNet 提出了一种新的时间动态图神经网络可以提取隐藏的时空依赖关系，通过动态图机制捕获不同时间槽之间的关联，有效地解决了多变量时间序列分类中出现的问题。"
}