{
    "title": "MLCopilot: Unleashing the Power of Large Language Models in Solving Machine Learning Tasks. (arXiv:2304.14979v1 [cs.LG])",
    "abstract": "The field of machine learning (ML) has gained widespread adoption, leading to a significant demand for adapting ML to specific scenarios, which is yet expensive and non-trivial. The predominant approaches towards the automation of solving ML tasks (e.g., AutoML) are often time consuming and hard to understand for human developers. In contrast, though human engineers have the incredible ability to understand tasks and reason about solutions, their experience and knowledge are often sparse and difficult to utilize by quantitative approaches. In this paper, we aim to bridge the gap between machine intelligence and human knowledge by introducing a novel framework MLCopilot, which leverages the state-of-the-art LLMs to develop ML solutions for novel tasks. We showcase the possibility of extending the capability of LLMs to comprehend structured inputs and perform thorough reasoning for solving novel ML tasks. And we find that, after some dedicated design, the LLM can (i) observe from the exi",
    "link": "http://arxiv.org/abs/2304.14979",
    "context": "Title: MLCopilot: Unleashing the Power of Large Language Models in Solving Machine Learning Tasks. (arXiv:2304.14979v1 [cs.LG])\nAbstract: The field of machine learning (ML) has gained widespread adoption, leading to a significant demand for adapting ML to specific scenarios, which is yet expensive and non-trivial. The predominant approaches towards the automation of solving ML tasks (e.g., AutoML) are often time consuming and hard to understand for human developers. In contrast, though human engineers have the incredible ability to understand tasks and reason about solutions, their experience and knowledge are often sparse and difficult to utilize by quantitative approaches. In this paper, we aim to bridge the gap between machine intelligence and human knowledge by introducing a novel framework MLCopilot, which leverages the state-of-the-art LLMs to develop ML solutions for novel tasks. We showcase the possibility of extending the capability of LLMs to comprehend structured inputs and perform thorough reasoning for solving novel ML tasks. And we find that, after some dedicated design, the LLM can (i) observe from the exi",
    "path": "papers/23/04/2304.14979.json",
    "total_tokens": 1097,
    "translated_title": "MLCopilot：释放大语言模型在解决机器学习任务中的能力",
    "translated_abstract": "机器学习（ML）领域受到了广泛的应用，因此逐渐引发了将ML应用于特定场景的需求，但实现起来耗时且不易。 自动化解决ML任务（例如AutoML）的主要方法通常耗费时间且难以理解。 而与之相反，虽然人类工程师具有理解任务和推理解决方案的难以置信的能力，但他们的经验和知识往往不充分且难以借助定量方法利用。 在本文中，我们旨在通过引入一种新颖的框架MLCopilot来弥合机器智能和人类知识之间的差距，该框架利用最先进的LLM来开发新型任务的ML解决方案。 我们展示了扩展LLM的能力以理解结构化输入并进行深入推理以解决新型ML任务的可能性。 经过一些专门设计后，我们发现LLM可以（i）从人类编写的文件中观察现有知识，（ii）制定解决ML任务的具体步骤。 我们对图像分类，文本分类和表格分类三项任务进行了实验，证明了MLCopilot在解决实际ML问题方面的巨大潜力。",
    "tldr": "本文介绍了一种新型框架MLCopilot，通过利用最先进的大语言模型，扩展其能力以理解结构化输入并进行深入推理以解决新型ML任务的能力，展示了MLCopilot在解决图像分类，文本分类和表格分类三项任务方面的巨大潜力。"
}