{
    "title": "Controlled physics-informed data generation for deep learning-based remaining useful life prediction under unseen operation conditions. (arXiv:2304.11702v2 [cs.LG] UPDATED)",
    "abstract": "Limited availability of representative time-to-failure (TTF) trajectories either limits the performance of deep learning (DL)-based approaches on remaining useful life (RUL) prediction in practice or even precludes their application. Generating synthetic data that is physically plausible is a promising way to tackle this challenge. In this study, a novel hybrid framework combining the controlled physics-informed data generation approach with a deep learning-based prediction model for prognostics is proposed. In the proposed framework, a new controlled physics-informed generative adversarial network (CPI-GAN) is developed to generate synthetic degradation trajectories that are physically interpretable and diverse. Five basic physics constraints are proposed as the controllable settings in the generator. A physics-informed loss function with penalty is designed as the regularization term, which ensures that the changing trend of system health state recorded in the synthetic data is consi",
    "link": "http://arxiv.org/abs/2304.11702",
    "context": "Title: Controlled physics-informed data generation for deep learning-based remaining useful life prediction under unseen operation conditions. (arXiv:2304.11702v2 [cs.LG] UPDATED)\nAbstract: Limited availability of representative time-to-failure (TTF) trajectories either limits the performance of deep learning (DL)-based approaches on remaining useful life (RUL) prediction in practice or even precludes their application. Generating synthetic data that is physically plausible is a promising way to tackle this challenge. In this study, a novel hybrid framework combining the controlled physics-informed data generation approach with a deep learning-based prediction model for prognostics is proposed. In the proposed framework, a new controlled physics-informed generative adversarial network (CPI-GAN) is developed to generate synthetic degradation trajectories that are physically interpretable and diverse. Five basic physics constraints are proposed as the controllable settings in the generator. A physics-informed loss function with penalty is designed as the regularization term, which ensures that the changing trend of system health state recorded in the synthetic data is consi",
    "path": "papers/23/04/2304.11702.json",
    "total_tokens": 880,
    "translated_title": "基于可控物理信息的数据生成用于未知操作条件下深度学习剩余寿命预测的研究",
    "translated_abstract": "实际应用中，有限的代表性故障时间轨迹限制了深度学习（DL）的性能，使得剩余使用寿命（RUL）预测变得更加困难。生成合理物理上可行的合成数据是解决这一问题的一种有效方式。本研究提出了一种新的混合框架，将可控物理信息的数据生成方法与深度学习预测模型相结合，用于预测学。在该框架中，开发了一种新的可控物理信息生成对抗网络（CPI-GAN），用于生成物理可解释且多样的合成寿命衰减轨迹。在生成器中提出了五个基本物理约束条件作为可控设置。并设计了一个基于物理信息的惩罚函数，用作正则化项，确保记录在合成数据中的系统健康状态变化趋势的合理性。",
    "tldr": "本研究提出了一种新的混合框架，使用可控物理信息的生成模型生成可信、多样的数据来预测设备的使用寿命。其中使用了基本物理约束条件，以保证数据的真实性。",
    "en_tdlr": "This study proposes a novel hybrid framework that uses a controlled physics-based generative model to generate trustworthy and diverse data for predicting equipment's remaining useful life. The framework incorporates five basic physics constraints to ensure the realness of data."
}