{
    "title": "HGWaveNet: A Hyperbolic Graph Neural Network for Temporal Link Prediction. (arXiv:2304.07302v1 [cs.LG])",
    "abstract": "Temporal link prediction, aiming to predict future edges between paired nodes in a dynamic graph, is of vital importance in diverse applications. However, existing methods are mainly built upon uniform Euclidean space, which has been found to be conflict with the power-law distributions of real-world graphs and unable to represent the hierarchical connections between nodes effectively. With respect to the special data characteristic, hyperbolic geometry offers an ideal alternative due to its exponential expansion property. In this paper, we propose HGWaveNet, a novel hyperbolic graph neural network that fully exploits the fitness between hyperbolic spaces and data distributions for temporal link prediction. Specifically, we design two key modules to learn the spatial topological structures and temporal evolutionary information separately. On the one hand, a hyperbolic diffusion graph convolution (HDGC) module effectively aggregates information from a wider range of neighbors. On the ot",
    "link": "http://arxiv.org/abs/2304.07302",
    "context": "Title: HGWaveNet: A Hyperbolic Graph Neural Network for Temporal Link Prediction. (arXiv:2304.07302v1 [cs.LG])\nAbstract: Temporal link prediction, aiming to predict future edges between paired nodes in a dynamic graph, is of vital importance in diverse applications. However, existing methods are mainly built upon uniform Euclidean space, which has been found to be conflict with the power-law distributions of real-world graphs and unable to represent the hierarchical connections between nodes effectively. With respect to the special data characteristic, hyperbolic geometry offers an ideal alternative due to its exponential expansion property. In this paper, we propose HGWaveNet, a novel hyperbolic graph neural network that fully exploits the fitness between hyperbolic spaces and data distributions for temporal link prediction. Specifically, we design two key modules to learn the spatial topological structures and temporal evolutionary information separately. On the one hand, a hyperbolic diffusion graph convolution (HDGC) module effectively aggregates information from a wider range of neighbors. On the ot",
    "path": "papers/23/04/2304.07302.json",
    "total_tokens": 1053,
    "translated_title": "HGWaveNet: 一种用于时间链接预测的双曲图神经网络",
    "translated_abstract": "时间链接预测旨在预测动态图中成对节点之间的未来边缘，是各种应用中非常重要的领域。然而，现有方法主要建立在均匀的欧几里得空间上，这与现实世界图形的幂律分布相矛盾，无法有效地表示节点之间的分层连接。针对这种特殊的数据特征，双曲几何提供了一种理想的替代方案，因为它具有指数扩展特性。在本文中，我们提出了HGWaveNet，一种新颖的双曲图神经网络，充分利用了超几何空间与数据分布之间的相适应性，用于时间链接预测。具体而言，我们设计了两个关键模块来分别学习空间拓扑结构和时间演变信息。一方面，超曲率扩散图卷积 (HDGC) 模块有效地聚合了更广泛的邻居信息。另一方面，基于小波的时间卷积 (WTC) 模块通过转换时间域特征来捕捉时间依赖性。在真实世界数据集上的实验表明，HGWaveNet在精度和效率方面优于现有的最先进方法。",
    "tldr": "HGWaveNet是一种双曲图神经网络，用于时间链接预测。它包括超曲率扩散图卷积和小波时间卷积两个关键模块，可有效聚合邻居信息和捕捉时间依赖，并在真实世界数据集上表现出更好的精度和效率。",
    "en_tdlr": "HGWaveNet is a hyperbolic graph neural network for temporal link prediction, which includes HDGC and WTC modules to aggregate neighbor information and capture temporal dependencies. It outperforms state-of-the-art methods on real-world datasets in terms of accuracy and efficiency."
}