{
    "title": "Adjustable Privacy using Autoencoder-based Learning Structure. (arXiv:2304.03538v1 [cs.LG])",
    "abstract": "Inference centers need more data to have a more comprehensive and beneficial learning model, and for this purpose, they need to collect data from data providers. On the other hand, data providers are cautious about delivering their datasets to inference centers in terms of privacy considerations. In this paper, by modifying the structure of the autoencoder, we present a method that manages the utility-privacy trade-off well. To be more precise, the data is first compressed using the encoder, then confidential and non-confidential features are separated and uncorrelated using the classifier. The confidential feature is appropriately combined with noise, and the non-confidential feature is enhanced, and at the end, data with the original data format is produced by the decoder. The proposed architecture also allows data providers to set the level of privacy required for confidential features. The proposed method has been examined for both image and categorical databases, and the results s",
    "link": "http://arxiv.org/abs/2304.03538",
    "context": "Title: Adjustable Privacy using Autoencoder-based Learning Structure. (arXiv:2304.03538v1 [cs.LG])\nAbstract: Inference centers need more data to have a more comprehensive and beneficial learning model, and for this purpose, they need to collect data from data providers. On the other hand, data providers are cautious about delivering their datasets to inference centers in terms of privacy considerations. In this paper, by modifying the structure of the autoencoder, we present a method that manages the utility-privacy trade-off well. To be more precise, the data is first compressed using the encoder, then confidential and non-confidential features are separated and uncorrelated using the classifier. The confidential feature is appropriately combined with noise, and the non-confidential feature is enhanced, and at the end, data with the original data format is produced by the decoder. The proposed architecture also allows data providers to set the level of privacy required for confidential features. The proposed method has been examined for both image and categorical databases, and the results s",
    "path": "papers/23/04/2304.03538.json",
    "total_tokens": 862,
    "translated_title": "基于自编码器的学习结构的可调节隐私",
    "translated_abstract": "推理中心需要更多数据才能拥有更全面和有益的学习模型，为此，他们需要从数据提供者处收集数据。另一方面，数据提供者在隐私方面非常谨慎，不愿将其数据集提供给推理中心。本文通过修改自编码器的结构，提出了一种很好地管理效用-隐私权衡的方法。具体而言，数据首先通过编码器压缩，然后使用分类器分离与相关的机密和非机密特征。机密特征与噪声适当地结合，非机密特征则得到加强，最后通过解码器产生具有原始数据格式的数据。所提出的架构还允许数据提供者设置机密特征所需的隐私级别。所提出的方法已在图像和分类数据库上进行了测试，结果很好。",
    "tldr": "本论文介绍了一种基于自编码器的学习结构，可以管理数据提供商与推理中心之间的效用-隐私权衡，同时在保持机密特征的隐私的同时提供有关数据的非机密特征。"
}