{
    "title": "Neural Approaches to Entity-Centric Information Extraction. (arXiv:2304.07625v1 [cs.CL])",
    "abstract": "Artificial Intelligence (AI) has huge impact on our daily lives with applications such as voice assistants, facial recognition, chatbots, autonomously driving cars, etc. Natural Language Processing (NLP) is a cross-discipline of AI and Linguistics, dedicated to study the understanding of the text. This is a very challenging area due to unstructured nature of the language, with many ambiguous and corner cases. In this thesis we address a very specific area of NLP that involves the understanding of entities (e.g., names of people, organizations, locations) in text. First, we introduce a radically different, entity-centric view of the information in text. We argue that instead of using individual mentions in text to understand their meaning, we should build applications that would work in terms of entity concepts. Next, we present a more detailed model on how the entity-centric approach can be used for the entity linking task. In our work, we show that this task can be improved by conside",
    "link": "http://arxiv.org/abs/2304.07625",
    "context": "Title: Neural Approaches to Entity-Centric Information Extraction. (arXiv:2304.07625v1 [cs.CL])\nAbstract: Artificial Intelligence (AI) has huge impact on our daily lives with applications such as voice assistants, facial recognition, chatbots, autonomously driving cars, etc. Natural Language Processing (NLP) is a cross-discipline of AI and Linguistics, dedicated to study the understanding of the text. This is a very challenging area due to unstructured nature of the language, with many ambiguous and corner cases. In this thesis we address a very specific area of NLP that involves the understanding of entities (e.g., names of people, organizations, locations) in text. First, we introduce a radically different, entity-centric view of the information in text. We argue that instead of using individual mentions in text to understand their meaning, we should build applications that would work in terms of entity concepts. Next, we present a more detailed model on how the entity-centric approach can be used for the entity linking task. In our work, we show that this task can be improved by conside",
    "path": "papers/23/04/2304.07625.json",
    "total_tokens": 861,
    "translated_title": "实体中心信息提取的神经方法",
    "translated_abstract": "人工智能对我们的日常生活有着巨大的影响，包括语音助手、人脸识别、聊天机器人、自动驾驶汽车等等应用。自然语言处理是人工智能和语言学的跨学科领域，致力于研究文本理解。本论文探讨了自然语言处理中涉及到的一个非常特殊的领域，即实体（如人名、组织机构名、地名）在文本中的理解。我们首先引入了一种完全不同的，以实体为中心的文本信息视角，提出应该构建能够按实体概念工作的应用程序，而不是使用文本中的个体提及来理解其含义。接下来，我们提出了更详细的模型，介绍了实体中心方法如何用于实体链接任务。本文研究表明，这种方法可以提高实体链接任务的效果。",
    "tldr": "本文介绍了实体中心的信息提取方法，通过考虑实体概念，提出构建按实体概念工作的应用程序的新思路，且该方法可以有效地提高实体链接任务的效果。",
    "en_tdlr": "This thesis introduces a neural approach to entity-centric information extraction, which proposes a new perspective of constructing applications based on entity concepts rather than individual mentions in text, and demonstrates its effectiveness in improving entity linking task."
}