{
    "title": "Compatibility between stability and strategy-proofness with single-peaked preferences on trees. (arXiv:2304.11494v1 [econ.TH])",
    "abstract": "This paper studies the stability and strategy-proofness aspect of the two-sided one-to-one matching market. Agents have single-peaked preferences on trees. In this setting, we characterize all rich anonymous tree-single-peaked domains where a stable and (weakly group) strategy-proof matching rule exists. We also show that whenever there exists a stable and strategy-proof matching rule on a rich anonymous tree-single-peaked domain, one or both of the deferred acceptance rules (Gale and Shapley, 1962) satisfy stability and weak group strategy-proofness on that domain. Finally, we show that for markets with a size of at least five, there is no rich anonymous domain where a stable and non-bossy matching rule exists. As a corollary, we show incompatibility between stability and group strategy-proofness on rich anonymous tree-single-peaked domains for markets with a size of at least five.",
    "link": "http://arxiv.org/abs/2304.11494",
    "context": "Title: Compatibility between stability and strategy-proofness with single-peaked preferences on trees. (arXiv:2304.11494v1 [econ.TH])\nAbstract: This paper studies the stability and strategy-proofness aspect of the two-sided one-to-one matching market. Agents have single-peaked preferences on trees. In this setting, we characterize all rich anonymous tree-single-peaked domains where a stable and (weakly group) strategy-proof matching rule exists. We also show that whenever there exists a stable and strategy-proof matching rule on a rich anonymous tree-single-peaked domain, one or both of the deferred acceptance rules (Gale and Shapley, 1962) satisfy stability and weak group strategy-proofness on that domain. Finally, we show that for markets with a size of at least five, there is no rich anonymous domain where a stable and non-bossy matching rule exists. As a corollary, we show incompatibility between stability and group strategy-proofness on rich anonymous tree-single-peaked domains for markets with a size of at least five.",
    "path": "papers/23/04/2304.11494.json",
    "total_tokens": 1037,
    "translated_title": "树形结构中单峰偏好对稳定性和战略无谋的兼容性",
    "translated_abstract": "本文研究了双边一对一匹配市场的稳定性和策略无谋性。代理人对树形对象具有单峰偏好。在该设置中，我们表征了所有丰富的匿名的树形单峰域，其中存在稳定和（弱团体）策略无谋匹配规则。我们还展示了每当存在一个稳定且策略无谋匹配规则在一个丰富的匿名树形单峰域上，一个或两个延迟接受规则（Gale 和 Shapley，1962）都满足该域上的稳定和弱团体策略无谋性。最后，我们表明对于大小至少为五的市场，不存在丰富的匿名域，其中存在稳定且非bossy匹配规则。作为推论，对于至少有五个市场的丰富匿名树形单峰域，稳定性和团体策略无谋性之间不兼容。",
    "tldr": "本文在树形结构中研究了双边一对一匹配市场的稳定性和策略无谋性。当代理人对树形对象具有单峰偏好时，所有丰富的匿名的树形单峰域中都存在稳定和（弱团体）策略无谋匹配规则。对于大小至少为五的市场，不存在丰富的匿名域，其中存在稳定且非bossy匹配规则。",
    "en_tdlr": "This paper examines the stability and strategy-proofness of the two-sided one-to-one matching market with agents having single-peaked preferences on trees. The authors characterize rich anonymous tree-single-peaked domains where stable and (weakly group) strategy-proof matching rules exist, and show that the deferred acceptance rules both satisfy stability and weak group strategy-proofness in these domains. They also demonstrate the incompatibility of stability and group strategy-proofness for rich anonymous tree-single-peaked domains with at least five agents."
}