{
    "title": "Deep state-space modeling for explainable representation, analysis, and generation of professional human poses. (arXiv:2304.14502v1 [cs.CV])",
    "abstract": "The analysis of human movements has been extensively studied due to its wide variety of practical applications. Nevertheless, the state-of-the-art still faces scientific challenges while modeling human movements. Firstly, new models that account for the stochasticity of human movement and the physical structure of the human body are required to accurately predict the evolution of full-body motion descriptors over time. Secondly, the explainability of existing deep learning algorithms regarding their body posture predictions while generating human movements still needs to be improved as they lack comprehensible representations of human movement. This paper addresses these challenges by introducing three novel approaches for creating explainable representations of human movement. In this work, full-body movement is formulated as a state-space model of a dynamic system whose parameters are estimated using deep learning and statistical algorithms. The representations adhere to the structur",
    "link": "http://arxiv.org/abs/2304.14502",
    "context": "Title: Deep state-space modeling for explainable representation, analysis, and generation of professional human poses. (arXiv:2304.14502v1 [cs.CV])\nAbstract: The analysis of human movements has been extensively studied due to its wide variety of practical applications. Nevertheless, the state-of-the-art still faces scientific challenges while modeling human movements. Firstly, new models that account for the stochasticity of human movement and the physical structure of the human body are required to accurately predict the evolution of full-body motion descriptors over time. Secondly, the explainability of existing deep learning algorithms regarding their body posture predictions while generating human movements still needs to be improved as they lack comprehensible representations of human movement. This paper addresses these challenges by introducing three novel approaches for creating explainable representations of human movement. In this work, full-body movement is formulated as a state-space model of a dynamic system whose parameters are estimated using deep learning and statistical algorithms. The representations adhere to the structur",
    "path": "papers/23/04/2304.14502.json",
    "total_tokens": 931,
    "translated_title": "用于可解释的姿势表达、分析和生成的深层状态空间建模",
    "translated_abstract": "由于其广泛的实际应用，人体动作的分析已被广泛研究。然而，当前的前沿仍然面临建模人体运动的科学挑战。首先，需要新的模型来考虑人类运动的随机性和人体的物理结构，以准确预测全身运动描述符随时间的演变。其次，现有深度学习算法在生成人类运动时，对于其身体姿势预测的可解释性仍需改进，因为它们缺乏人类运动的可理解表示。本文通过引入三种新方法来创建人类运动的可解释表示来解决这些挑战。在这项工作中，全身运动被公式化为动态系统的状态空间模型，其参数使用深度学习和统计算法进行估计。这些表示遵循支持人类运动的结构化原则，并且由用户可以理解。所提出的方法能够准确预测人体运动并生成新的运动，同时提供有意义的身体姿势预测解释。",
    "tldr": "本文提出一种新方法，通过引入三种新方法来创建人类运动的可解释表示，以解决建模人体运动的科学挑战，并且该方法能准确预测人体运动并生成新的运动。",
    "en_tdlr": "This paper proposes a new method to create explainable representations of human movement, and addresses scientific challenges in modeling human motion by introducing three novel approaches. The proposed method accurately predicts and generates human motion while providing meaningful explanations of body posture predictions."
}