{
    "title": "A framework for fully autonomous design of materials via multiobjective optimization and active learning: challenges and next steps. (arXiv:2304.07445v1 [cs.LG])",
    "abstract": "In order to deploy machine learning in a real-world self-driving laboratory where data acquisition is costly and there are multiple competing design criteria, systems need to be able to intelligently sample while balancing performance trade-offs and constraints. For these reasons, we present an active learning process based on multiobjective black-box optimization with continuously updated machine learning models. This workflow is built on open-source technologies for real-time data streaming and modular multiobjective optimization software development. We demonstrate a proof of concept for this workflow through the autonomous operation of a continuous-flow chemistry laboratory, which identifies ideal manufacturing conditions for the electrolyte 2,2,2-trifluoroethyl methyl carbonate.",
    "link": "http://arxiv.org/abs/2304.07445",
    "context": "Title: A framework for fully autonomous design of materials via multiobjective optimization and active learning: challenges and next steps. (arXiv:2304.07445v1 [cs.LG])\nAbstract: In order to deploy machine learning in a real-world self-driving laboratory where data acquisition is costly and there are multiple competing design criteria, systems need to be able to intelligently sample while balancing performance trade-offs and constraints. For these reasons, we present an active learning process based on multiobjective black-box optimization with continuously updated machine learning models. This workflow is built on open-source technologies for real-time data streaming and modular multiobjective optimization software development. We demonstrate a proof of concept for this workflow through the autonomous operation of a continuous-flow chemistry laboratory, which identifies ideal manufacturing conditions for the electrolyte 2,2,2-trifluoroethyl methyl carbonate.",
    "path": "papers/23/04/2304.07445.json",
    "total_tokens": 817,
    "translated_title": "多目标优化和主动学习实现材料全自动设计的框架：挑战和下一步",
    "translated_abstract": "为了在数据获取昂贵且存在多个竞争设计标准的实际自动驾驶实验室中部署机器学习，系统需要能够智能采样，平衡性能权衡和约束。因此，我们提出了一种基于多目标黑盒优化和不断更新的机器学习模型的主动学习过程。这个工作流建立在实时数据流和模块化多目标优化软件开发的开源技术之上。我们通过连续流化学实验室的自主操作，证明了这个工作流的概念证明，该实验室确定了2,2,2-三氟乙基甲基碳酸酯的理想制造条件。",
    "tldr": "该研究介绍了一个基于多目标黑盒优化和不断更新的机器学习模型的主动学习过程，实现了材料的全自动设计。通过自主操作实验室，该工作流成功确定了2,2,2-三氟乙基甲基碳酸酯的理想制造条件。",
    "en_tdlr": "This paper presents a framework for fully autonomous design of materials through a multiobjective black-box optimization process and continuously updated machine learning models. The workflow was demonstrated through autonomous operation of a continuous-flow chemistry laboratory and successfully identified ideal manufacturing conditions for 2,2,2-trifluoroethyl methyl carbonate."
}