{
    "title": "Balancing Unobserved Confounding with a Few Unbiased Ratings in Debiased Recommendations. (arXiv:2304.09085v1 [cs.IR])",
    "abstract": "Recommender systems are seen as an effective tool to address information overload, but it is widely known that the presence of various biases makes direct training on large-scale observational data result in sub-optimal prediction performance. In contrast, unbiased ratings obtained from randomized controlled trials or A/B tests are considered to be the golden standard, but are costly and small in scale in reality. To exploit both types of data, recent works proposed to use unbiased ratings to correct the parameters of the propensity or imputation models trained on the biased dataset. However, the existing methods fail to obtain accurate predictions in the presence of unobserved confounding or model misspecification. In this paper, we propose a theoretically guaranteed model-agnostic balancing approach that can be applied to any existing debiasing method with the aim of combating unobserved confounding and model misspecification. The proposed approach makes full use of unbiased data by ",
    "link": "http://arxiv.org/abs/2304.09085",
    "context": "Title: Balancing Unobserved Confounding with a Few Unbiased Ratings in Debiased Recommendations. (arXiv:2304.09085v1 [cs.IR])\nAbstract: Recommender systems are seen as an effective tool to address information overload, but it is widely known that the presence of various biases makes direct training on large-scale observational data result in sub-optimal prediction performance. In contrast, unbiased ratings obtained from randomized controlled trials or A/B tests are considered to be the golden standard, but are costly and small in scale in reality. To exploit both types of data, recent works proposed to use unbiased ratings to correct the parameters of the propensity or imputation models trained on the biased dataset. However, the existing methods fail to obtain accurate predictions in the presence of unobserved confounding or model misspecification. In this paper, we propose a theoretically guaranteed model-agnostic balancing approach that can be applied to any existing debiasing method with the aim of combating unobserved confounding and model misspecification. The proposed approach makes full use of unbiased data by ",
    "path": "papers/23/04/2304.09085.json",
    "total_tokens": 852,
    "translated_title": "利用少量无偏评分平衡未观测混淆的去偏推荐",
    "translated_abstract": "推荐系统被视为解决信息过载的有效工具，但众所周知，存在各种偏差使得在大规模观测数据上进行直接训练会导致次优的预测性能。与之相反，从随机控制试验或A/B测试中获得的无偏评分被认为是黄金标准，但在现实中成本高且规模较小。为了利用这两种类型的数据，最近的研究提出利用无偏评分来修正在有偏数据集上训练的倾向性或插补模型的参数。然而，现有方法在存在未观测混淆或模型规范误差时无法获得准确的预测。本文提出了一种理论上保证的模型不可知平衡方法，可应用于任何现有的去偏方法，旨在对抗未观测混淆和模型规范误差。所提出的方法充分利用了无偏数据。",
    "tldr": "本文提出了利用无偏评分平衡已有的去偏方法来对抗未观测混淆和模型规范误差的方法。"
}