{
    "title": "Equilibrium with Heterogeneous Information Flows. (arXiv:2304.01272v1 [q-fin.PR])",
    "abstract": "We study a continuous time economy where throughout time, insiders receive private signals regarding the risky assets' terminal payoff. We prove existence of a partial communication equilibrium where, at each private signal time, the public receives a signal of the same form as the associated insider, but of lower quality. This causes a jump in both the public information flow and equilibrium asset price. The resultant markets, while complete between each jump time, are incomplete over each jump. After establishing equilibrium for a finite number of private signal times, we consider the limit as the private signals become more and more frequent. Under appropriate scaling we prove convergence of the public filtration to the natural filtration generated by both the fundamental factor process $X$ and a continuous time process $J$ taking the form $J_t = X_1 + Y_t$ where $X_1$ is the terminal payoff and $Y$ an independent Gaussian process. This coincides with the filtration considered in 'A",
    "link": "http://arxiv.org/abs/2304.01272",
    "context": "Title: Equilibrium with Heterogeneous Information Flows. (arXiv:2304.01272v1 [q-fin.PR])\nAbstract: We study a continuous time economy where throughout time, insiders receive private signals regarding the risky assets' terminal payoff. We prove existence of a partial communication equilibrium where, at each private signal time, the public receives a signal of the same form as the associated insider, but of lower quality. This causes a jump in both the public information flow and equilibrium asset price. The resultant markets, while complete between each jump time, are incomplete over each jump. After establishing equilibrium for a finite number of private signal times, we consider the limit as the private signals become more and more frequent. Under appropriate scaling we prove convergence of the public filtration to the natural filtration generated by both the fundamental factor process $X$ and a continuous time process $J$ taking the form $J_t = X_1 + Y_t$ where $X_1$ is the terminal payoff and $Y$ an independent Gaussian process. This coincides with the filtration considered in 'A",
    "path": "papers/23/04/2304.01272.json",
    "total_tokens": 917,
    "tldr": "本文研究了一个连续时间的经济体，在异质信息流的情况下存在部分通信平衡，公共信息流和均衡资产价格跳跃。随着私人信号变得更频繁，公共过滤会收敛到通过基本因素过程和连续时间过程生成的自然过滤。",
    "en_tdlr": "This paper studies a continuous-time economy where partial communication equilibrium exists with heterogeneous information flows, causing jumps in both public information flow and equilibrium asset price. As private signals become more frequent, the public filtration converges to the natural filtration generated by the fundamental factor process and a continuous time process."
}