{
    "title": "Personality-aware Human-centric Multimodal Reasoning: A New Task. (arXiv:2304.02313v1 [cs.CL])",
    "abstract": "Multimodal reasoning, an area of artificial intelligence that aims at make inferences from multimodal signals such as vision, language and speech, has drawn more and more attention in recent years. People with different personalities may respond differently to the same situation. However, such individual personalities were ignored in the previous studies. In this work, we introduce a new Personality-aware Human-centric Multimodal Reasoning (Personality-aware HMR) task, and accordingly construct a new dataset based on The Big Bang Theory television shows, to predict the behavior of a specific person at a specific moment, given the multimodal information of its past and future moments. The Myers-Briggs Type Indicator (MBTI) was annotated and utilized in the task to represent individuals' personalities. We benchmark the task by proposing three baseline methods, two were adapted from the related tasks and one was newly proposed for our task. The experimental results demonstrate that person",
    "link": "http://arxiv.org/abs/2304.02313",
    "context": "Title: Personality-aware Human-centric Multimodal Reasoning: A New Task. (arXiv:2304.02313v1 [cs.CL])\nAbstract: Multimodal reasoning, an area of artificial intelligence that aims at make inferences from multimodal signals such as vision, language and speech, has drawn more and more attention in recent years. People with different personalities may respond differently to the same situation. However, such individual personalities were ignored in the previous studies. In this work, we introduce a new Personality-aware Human-centric Multimodal Reasoning (Personality-aware HMR) task, and accordingly construct a new dataset based on The Big Bang Theory television shows, to predict the behavior of a specific person at a specific moment, given the multimodal information of its past and future moments. The Myers-Briggs Type Indicator (MBTI) was annotated and utilized in the task to represent individuals' personalities. We benchmark the task by proposing three baseline methods, two were adapted from the related tasks and one was newly proposed for our task. The experimental results demonstrate that person",
    "path": "papers/23/04/2304.02313.json",
    "total_tokens": 962,
    "translated_title": "个性化情感驱动的多模态推理：一个新的任务",
    "translated_abstract": "多模态推理是一种人工智能领域，旨在从诸如视觉、语言和语音等多模态信号中进行推理和判断，近年来越来越受到关注。不同个性的人可能对同一情境做出不同反应。然而，在以前的研究中，个性这一方面并没有得到很好的考虑。本文提出了一个新的个性化情感驱动的多模态推理任务（Personality-aware HMR），并根据《生活大爆炸》电视剧构建了一个新的数据集，以预测特定时刻特定人物的行为，基于其过去和未来时刻的多模态信息。Myers-Briggs类型指标（MBTI）被注释并用于表示个体的个性。我们通过提出三种基线方法来基准测试该任务，其中两种是从相关任务中进行调整的，而一种是新提出的。实验结果表明，个性化情感驱动的多模态推理是一项具有挑战性和前景的任务，需要考虑个体个性的多模态推理。",
    "tldr": "本文介绍了一个新的个性化情感驱动的多模态推理任务，利用《生活大爆炸》电视剧构建了数据集，考虑个体个性，提出了三种基线方法，证明该任务具有挑战性和前景。",
    "en_tdlr": "This paper proposes a new task of Personality-aware Human-centric Multimodal Reasoning (Personality-aware HMR), constructs a dataset based on The Big Bang Theory, and utilizes Myers-Briggs Type Indicator (MBTI) to represent individual personalities. Three baseline methods are proposed and experimental results demonstrate the challenging and promising nature of Personality-aware HMR."
}