{
    "title": "Who are the gatekeepers of economics? Geographic diversity, gender composition, and interlocking editorship of journal boards. (arXiv:2304.04242v1 [econ.GN])",
    "abstract": "Members of editorial boards play the role of gatekeepers of science because. This paper analyses the national distribution of editorial boards members of economics journal, their affiliation, and their gender. It studies also the interlocking editorship network generated by the presence of a same person on the editorial board of more than one journal. The analysis is based on a unique database comprising all the 1,516 journals indexed in the database EconLit with an active editorial board in 2019. For each journal, we manually collected the names of the board members along with their affiliation, obtaining a database containing more than 44,000 members from more than 6,000 institutions and 142 countries. These data allow to investigate the phenomenon of gatekeeping in contemporary economics on an unprecedented large scale. The obtained results highlight some common issues concerning the editorial gatekeeping, leading to the conclusion that in Economics the academic publishing environme",
    "link": "http://arxiv.org/abs/2304.04242",
    "context": "Title: Who are the gatekeepers of economics? Geographic diversity, gender composition, and interlocking editorship of journal boards. (arXiv:2304.04242v1 [econ.GN])\nAbstract: Members of editorial boards play the role of gatekeepers of science because. This paper analyses the national distribution of editorial boards members of economics journal, their affiliation, and their gender. It studies also the interlocking editorship network generated by the presence of a same person on the editorial board of more than one journal. The analysis is based on a unique database comprising all the 1,516 journals indexed in the database EconLit with an active editorial board in 2019. For each journal, we manually collected the names of the board members along with their affiliation, obtaining a database containing more than 44,000 members from more than 6,000 institutions and 142 countries. These data allow to investigate the phenomenon of gatekeeping in contemporary economics on an unprecedented large scale. The obtained results highlight some common issues concerning the editorial gatekeeping, leading to the conclusion that in Economics the academic publishing environme",
    "path": "papers/23/04/2304.04242.json",
    "total_tokens": 920,
    "translated_title": "经济学的门户是谁？地理多样性、性别比例和杂志编辑委员会的交叉指挥。",
    "translated_abstract": "编辑委员会成员在科学门户的角色非常重要，本研究分析了经济学期刊的编辑委员会成员的国家分布、所属机构和性别。同时，它还研究了由同一人在多个期刊编辑委员会任职所产生的交叉指挥网络。分析基于一个独特的数据库，包含了2019年在EconLit数据库中具有活跃编辑委员会的所有1,516个期刊。对于每个期刊，我们手动收集了委员会成员的姓名和所属机构，得到了一个包含来自142个国家的6,000多个机构的44,000多个成员的数据库。这些数据使得我们能够在前所未有的大规模上研究当代经济学的门户现象。结果突出了有关编辑门户的一些共同问题，得出的结论是在经济学领域，学术出版环境仍然远未达到足够多样化和包容性的水平。",
    "tldr": "本研究分析了经济学期刊的编辑委员会成员的国家分布、所属机构和性别，发现经济学领域的学术出版环境仍然缺乏多样性和包容性。",
    "en_tdlr": "This study analyzes the geographic distribution, affiliation, and gender of the editorial board members of economics journals, revealing the lack of diversity and inclusiveness in the academic publishing environment of economics."
}