{
    "title": "ChartReader: A Unified Framework for Chart Derendering and Comprehension without Heuristic Rules. (arXiv:2304.02173v1 [cs.CV])",
    "abstract": "Charts are a powerful tool for visually conveying complex data, but their comprehension poses a challenge due to the diverse chart types and intricate components. Existing chart comprehension methods suffer from either heuristic rules or an over-reliance on OCR systems, resulting in suboptimal performance. To address these issues, we present ChartReader, a unified framework that seamlessly integrates chart derendering and comprehension tasks. Our approach includes a transformer-based chart component detection module and an extended pre-trained vision-language model for chart-to-X tasks. By learning the rules of charts automatically from annotated datasets, our approach eliminates the need for manual rule-making, reducing effort and enhancing accuracy.~We also introduce a data variable replacement technique and extend the input and position embeddings of the pre-trained model for cross-task training. We evaluate ChartReader on Chart-to-Table, ChartQA, and Chart-to-Text tasks, demonstrat",
    "link": "http://arxiv.org/abs/2304.02173",
    "context": "Title: ChartReader: A Unified Framework for Chart Derendering and Comprehension without Heuristic Rules. (arXiv:2304.02173v1 [cs.CV])\nAbstract: Charts are a powerful tool for visually conveying complex data, but their comprehension poses a challenge due to the diverse chart types and intricate components. Existing chart comprehension methods suffer from either heuristic rules or an over-reliance on OCR systems, resulting in suboptimal performance. To address these issues, we present ChartReader, a unified framework that seamlessly integrates chart derendering and comprehension tasks. Our approach includes a transformer-based chart component detection module and an extended pre-trained vision-language model for chart-to-X tasks. By learning the rules of charts automatically from annotated datasets, our approach eliminates the need for manual rule-making, reducing effort and enhancing accuracy.~We also introduce a data variable replacement technique and extend the input and position embeddings of the pre-trained model for cross-task training. We evaluate ChartReader on Chart-to-Table, ChartQA, and Chart-to-Text tasks, demonstrat",
    "path": "papers/23/04/2304.02173.json",
    "total_tokens": 933,
    "translated_title": "ChartReader：一个无启发式规则的图表去渲染与理解的统一框架",
    "translated_abstract": "图表是一种传达复杂数据的强大工具，但由于图表类型的多样性和复杂的组件，其理解对于我们来说是一个挑战。现有的图表理解方法要么依赖启发式规则，要么过度依赖OCR系统，结果表现不佳。为了解决这些问题，我们提出了ChartReader，一个无缝集成图表去渲染和理解任务的统一框架。我们的方法包括基于Transformer的图表组件检测模块和一个扩展的预训练视觉语言模型，用于图表到X任务。通过从注释数据集中自动学习图表规则，我们的方法消除了手动规则制定的需求，减少了工作量并提高了准确性。我们还引入了一种数据变量替换技术，并扩展了预训练模型的输入和位置嵌入，实现跨任务训练。我们对ChartReader进行了Chart-to-Table、ChartQA和Chart-to-Text任务的评估，表明其性能优于现有的图表理解方法。",
    "tldr": "ChartReader 是一个统一框架，可以无启发式规则进行图表去渲染和理解，通过从注释数据集中自动学习图表规则，消除了手动规则制定的需求，提高了准确性，在多项任务中表现优于现有算法。",
    "en_tdlr": "ChartReader is a unified framework for chart derendering and comprehension without heuristic rules. By learning the rules of charts automatically from annotated datasets, it eliminates the need for manual rule-making and enhances accuracy. ChartReader outperforms current methods in various tasks."
}