{
    "title": "Resources and Few-shot Learners for In-context Learning in Slavic Languages. (arXiv:2304.01922v1 [cs.CL])",
    "abstract": "Despite the rapid recent progress in creating accurate and compact in-context learners, most recent work focuses on in-context learning (ICL) for tasks in English. However, the ability to interact with users of languages outside English presents a great potential for broadening the applicability of language technologies to non-English speakers.  In this work, we collect the infrastructure necessary for training and evaluation of ICL in a selection of Slavic languages: Czech, Polish, and Russian. We link a diverse set of datasets and cast these into a unified instructional format through a set of transformations and newly-crafted templates written purely in target languages. Using the newly-curated dataset, we evaluate a set of the most recent in-context learners and compare their results to the supervised baselines. Finally, we train, evaluate and publish a set of in-context learning models that we train on the collected resources and compare their performance to previous work.  We fin",
    "link": "http://arxiv.org/abs/2304.01922",
    "context": "Title: Resources and Few-shot Learners for In-context Learning in Slavic Languages. (arXiv:2304.01922v1 [cs.CL])\nAbstract: Despite the rapid recent progress in creating accurate and compact in-context learners, most recent work focuses on in-context learning (ICL) for tasks in English. However, the ability to interact with users of languages outside English presents a great potential for broadening the applicability of language technologies to non-English speakers.  In this work, we collect the infrastructure necessary for training and evaluation of ICL in a selection of Slavic languages: Czech, Polish, and Russian. We link a diverse set of datasets and cast these into a unified instructional format through a set of transformations and newly-crafted templates written purely in target languages. Using the newly-curated dataset, we evaluate a set of the most recent in-context learners and compare their results to the supervised baselines. Finally, we train, evaluate and publish a set of in-context learning models that we train on the collected resources and compare their performance to previous work.  We fin",
    "path": "papers/23/04/2304.01922.json",
    "total_tokens": 897,
    "translated_title": "资源和少样本学习器在斯拉夫语境下学习的应用研究",
    "translated_abstract": "尽管最近创建了准确且紧凑的境中学习器，在场景学习 (ICL) 的工作大多集中在英文任务上。然而，与使用英语以外语言的用户互动的能力为将语言技术应用于非英语使用者提供了巨大的潜力。在这项工作中，我们收集了一些基础设施，用于在捷克语、波兰语和俄语等多种斯拉夫语言中进行ICL的训练和评估。我们通过一系列转换和纯目标语言编写的新模板，将各种各样的数据集连接成一个统一的教学格式。利用新策划的数据集，我们评估了一组最新的境中学习器，并将其结果与监督基线进行了比较。最后，我们使用收集的资源训练、评估和发布了一组境中学习模型，并将其性能与以前的工作进行了比较。",
    "tldr": "该论文通过收集一些基础设施，用于在斯拉夫语言环境中进行ICL的训练和评估，并使用新的数据集评估了一组最新的境中学习器，并将其性能与以前的工作进行了比较。",
    "en_tdlr": "This paper collects infrastructure for training and evaluation of in-context learning (ICL) in Slavic languages, and evaluates a set of recent ICL learners on a newly-curated dataset, comparing their performance to previous work."
}