{
    "title": "End-User Development for Artificial Intelligence: A Systematic Literature Review. (arXiv:2304.09863v1 [cs.HC])",
    "abstract": "In recent years, Artificial Intelligence has become more and more relevant in our society. Creating AI systems is almost always the prerogative of IT and AI experts. However, users may need to create intelligent solutions tailored to their specific needs. In this way, AI systems can be enhanced if new approaches are devised to allow non-technical users to be directly involved in the definition and personalization of AI technologies. End-User Development (EUD) can provide a solution to these problems, allowing people to create, customize, or adapt AI-based systems to their own needs. This paper presents a systematic literature review that aims to shed the light on the current landscape of EUD for AI systems, i.e., how users, even without skills in AI and/or programming, can customize the AI behavior to their needs. This study also discusses the current challenges of EUD for AI, the potential benefits, and the future implications of integrating EUD into the overall AI development process",
    "link": "http://arxiv.org/abs/2304.09863",
    "context": "Title: End-User Development for Artificial Intelligence: A Systematic Literature Review. (arXiv:2304.09863v1 [cs.HC])\nAbstract: In recent years, Artificial Intelligence has become more and more relevant in our society. Creating AI systems is almost always the prerogative of IT and AI experts. However, users may need to create intelligent solutions tailored to their specific needs. In this way, AI systems can be enhanced if new approaches are devised to allow non-technical users to be directly involved in the definition and personalization of AI technologies. End-User Development (EUD) can provide a solution to these problems, allowing people to create, customize, or adapt AI-based systems to their own needs. This paper presents a systematic literature review that aims to shed the light on the current landscape of EUD for AI systems, i.e., how users, even without skills in AI and/or programming, can customize the AI behavior to their needs. This study also discusses the current challenges of EUD for AI, the potential benefits, and the future implications of integrating EUD into the overall AI development process",
    "path": "papers/23/04/2304.09863.json",
    "total_tokens": 910,
    "translated_title": "人工智能的终端用户开发：系统性文献综述",
    "translated_abstract": "近年来，人工智能在我们社会中变得越来越重要。然而，创建人工智能系统几乎总是IT和人工智能专家的专属权利。本文提出了一种新的方法——终端用户开发（EUD），使得非技术人员可以直接参与定义和个性化人工智能技术，从而增强AI系统的效果。本文通过系统性文献综述阐述了当前EUD对AI系统的发展格局，即如何使用户在没有人工智能和/或编程技能的情况下，定制人工智能的行为来满足他们的需求。此外，本研究还讨论了EUD面对的当前挑战、潜在的好处以及将EUD整合到整个人工智能开发过程中的未来影响。",
    "tldr": "本文综述了终端用户开发（EUD）对人工智能系统的影响，目的是使非技术用户直接以满足其需求的方式参与到人工智能的定义和个性化中。此外，文章还评估了EUD面临的挑战、潜在的好处以及将其整合到整个人工智能开发中的未来影响。"
}