{
    "title": "The Seven Worlds and Experiences of the Wireless Metaverse: Challenges and Opportunities. (arXiv:2304.10282v1 [cs.IT])",
    "abstract": "The wireless metaverse will create diverse user experiences at the intersection of the physical, digital, and virtual worlds. These experiences will enable novel interactions between the constituents (e.g., extended reality (XR) users and avatars) of the three worlds. However, remarkably, to date, there is no holistic vision that identifies the full set of metaverse worlds, constituents, and experiences, and the implications of their associated interactions on next-generation communication and computing systems. In this paper, we present a holistic vision of a limitless, wireless metaverse that distills the metaverse into an intersection of seven worlds and experiences that include the: i) physical, digital, and virtual worlds, along with the ii) cyber, extended, live, and parallel experiences. We then articulate how these experiences bring forth interactions between diverse metaverse constituents, namely, a) humans and avatars and b) connected intelligence systems and their digital tw",
    "link": "http://arxiv.org/abs/2304.10282",
    "context": "Title: The Seven Worlds and Experiences of the Wireless Metaverse: Challenges and Opportunities. (arXiv:2304.10282v1 [cs.IT])\nAbstract: The wireless metaverse will create diverse user experiences at the intersection of the physical, digital, and virtual worlds. These experiences will enable novel interactions between the constituents (e.g., extended reality (XR) users and avatars) of the three worlds. However, remarkably, to date, there is no holistic vision that identifies the full set of metaverse worlds, constituents, and experiences, and the implications of their associated interactions on next-generation communication and computing systems. In this paper, we present a holistic vision of a limitless, wireless metaverse that distills the metaverse into an intersection of seven worlds and experiences that include the: i) physical, digital, and virtual worlds, along with the ii) cyber, extended, live, and parallel experiences. We then articulate how these experiences bring forth interactions between diverse metaverse constituents, namely, a) humans and avatars and b) connected intelligence systems and their digital tw",
    "path": "papers/23/04/2304.10282.json",
    "total_tokens": 936,
    "translated_title": "无线元宇宙的七个世界和体验：挑战和机遇",
    "translated_abstract": "无线元宇宙将会在实体、数字和虚拟世界的交叉点创造多样化的用户体验。这些体验将会促进这三个世界的构成要素（如扩展现实（XR）用户和虚拟化角色）之间的新颖互动。然而，令人瞩目的是，迄今为止没有一个全面的愿景能够确定元宇宙的全部世界、构成要素和体验的集合，以及它们相关互动对未来通信和计算系统的影响。在本文中，我们提出了一个无尽的、无线的、综合的元宇宙视野，将元宇宙浓缩为七个世界和体验的交叉点，包括：i）实体、数字和虚拟世界，以及ii）网络、扩展、实时和平行的体验。然后，我们阐述了这些经验如何呈现不同的元宇宙构成要素之间的互动，即a）人类和虚拟化角色，和b）连接的智能系统及其数字孪生。",
    "tldr": "本文提出了一个无限的、无线的元宇宙视野，将元宇宙浓缩为七个世界和体验的交叉点，支持人类和虚拟化角色之间以及连接的智能系统和其数字孪生之间的新颖互动。",
    "en_tdlr": "This paper presents a limitless, wireless vision of the metaverse, distilling it into an intersection of seven worlds and experiences. It supports novel interactions between humans and avatars, as well as connected intelligence systems and their digital twins."
}