{
    "title": "Detecting Political Opinions in Tweets through Bipartite Graph Analysis: A Skip Aggregation Graph Convolution Approach. (arXiv:2304.11367v1 [cs.SI])",
    "abstract": "Public opinion is a crucial factor in shaping political decision-making. Nowadays, social media has become an essential platform for individuals to engage in political discussions and express their political views, presenting researchers with an invaluable resource for analyzing public opinion. In this paper, we focus on the 2020 US presidential election and create a large-scale dataset from Twitter. To detect political opinions in tweets, we build a user-tweet bipartite graph based on users' posting and retweeting behaviors and convert the task into a Graph Neural Network (GNN)-based node classification problem. Then, we introduce a novel skip aggregation mechanism that makes tweet nodes aggregate information from second-order neighbors, which are also tweet nodes due to the graph's bipartite nature, effectively leveraging user behavioral information. The experimental results show that our proposed model significantly outperforms several competitive baselines. Further analyses demonst",
    "link": "http://arxiv.org/abs/2304.11367",
    "context": "Title: Detecting Political Opinions in Tweets through Bipartite Graph Analysis: A Skip Aggregation Graph Convolution Approach. (arXiv:2304.11367v1 [cs.SI])\nAbstract: Public opinion is a crucial factor in shaping political decision-making. Nowadays, social media has become an essential platform for individuals to engage in political discussions and express their political views, presenting researchers with an invaluable resource for analyzing public opinion. In this paper, we focus on the 2020 US presidential election and create a large-scale dataset from Twitter. To detect political opinions in tweets, we build a user-tweet bipartite graph based on users' posting and retweeting behaviors and convert the task into a Graph Neural Network (GNN)-based node classification problem. Then, we introduce a novel skip aggregation mechanism that makes tweet nodes aggregate information from second-order neighbors, which are also tweet nodes due to the graph's bipartite nature, effectively leveraging user behavioral information. The experimental results show that our proposed model significantly outperforms several competitive baselines. Further analyses demonst",
    "path": "papers/23/04/2304.11367.json",
    "total_tokens": 879,
    "translated_title": "通过双分图分析检测 Twitter 中的政治观点：一种基于 Skip Aggregation 图卷积的方法。",
    "translated_abstract": "公众舆论是影响政治决策的关键因素。如今，社交媒体成为个人参与政治讨论和表达政治观点的重要平台，为研究公众舆论提供了宝贵的资源。本文聚焦于2020年美国总统选举，并从 Twitter 中创建了大规模的数据集。我们建立了一个基于用户的发布和转推行为的用户-推文双分图，并将任务转换为一个基于图神经网络（GNN）的节点分类问题，以检测推文中的政治观点。然后，我们引入了一种新颖的 Skip Aggregation 机制，使推文节点从二阶邻居（也是推文节点）聚合信息，有效利用用户行为信息。实验结果表明，我们提出的模型显著优于几种竞争性的基准模型。进一步的分析表明",
    "tldr": "本文聚焦于2020年美国总统选举，通过构建用户-推文双分图并利用图神经网络以检测 Twitter 中的政治观点。通过引入 Skip Aggregation 机制，有效利用用户行为信息，提高了模型效果。",
    "en_tdlr": "This paper focuses on the 2020 US presidential election and uses a user-tweet bipartite graph and Graph Neural Network (GNN) for detecting political opinions in Twitter. A novel skip aggregation mechanism is introduced to effectively utilize user behavioral information and improve model performance."
}