{
    "title": "An extension of martingale transport and stability in robust finance. (arXiv:2304.09551v1 [math.PR])",
    "abstract": "While many questions in robust finance can be posed in the martingale optimal transport framework or its weak extension, others like the subreplication price of VIX futures, the robust pricing of American options or the construction of shadow couplings necessitate additional information to be incorporated into the optimization problem beyond that of the underlying asset. In the present paper, we take into account this extra information by introducing an additional parameter to the weak martingale optimal transport problem. We prove the stability of the resulting problem with respect to the risk neutral marginal distributions of the underlying asset, thus extending the results in \\cite{BeJoMaPa21b}. A key step is the generalization of the main result in \\cite{BJMP22} to include the extra parameter into the setting. This result establishes that any martingale coupling can be approximated by a sequence of martingale couplings with specified marginals, provided that the marginals of this s",
    "link": "http://arxiv.org/abs/2304.09551",
    "context": "Title: An extension of martingale transport and stability in robust finance. (arXiv:2304.09551v1 [math.PR])\nAbstract: While many questions in robust finance can be posed in the martingale optimal transport framework or its weak extension, others like the subreplication price of VIX futures, the robust pricing of American options or the construction of shadow couplings necessitate additional information to be incorporated into the optimization problem beyond that of the underlying asset. In the present paper, we take into account this extra information by introducing an additional parameter to the weak martingale optimal transport problem. We prove the stability of the resulting problem with respect to the risk neutral marginal distributions of the underlying asset, thus extending the results in \\cite{BeJoMaPa21b}. A key step is the generalization of the main result in \\cite{BJMP22} to include the extra parameter into the setting. This result establishes that any martingale coupling can be approximated by a sequence of martingale couplings with specified marginals, provided that the marginals of this s",
    "path": "papers/23/04/2304.09551.json",
    "total_tokens": 931,
    "translated_title": "鲁棒金融中的鞅输运扩展与稳定性",
    "translated_abstract": "虽然鲁棒金融中的许多问题可以在鞅最优输运框架或其弱扩展中提出，例如 VIX 期货的次复制价格、美式期权的鲁棒定价或影子耦合的构造，但其他问题则需要将额外的信息纳入优化问题中。在本篇论文中，我们通过在弱鞅最优输运问题中引入一个额外参数来考虑这个额外信息。我们证明了所得问题相对于基础资产的风险中性边际分布的稳定性，从而扩展了 \\cite{BeJoMaPa21b} 中的结果。其中一个关键步骤是将 \\cite{BJMP22} 中的主要结果推广到该设置中，该结果确立了任何鞅耦合都可以通过一系列具有指定边际分布的鞅耦合逼近，前提是这些子序列的边际分布在适当的意义下收敛。",
    "tldr": "本文介绍了在鲁棒金融中考虑额外信息的弱鞅最优输运问题，证明了所得问题的风险中性边际分布的稳定性，并提供了一个关键步骤，它将任何鞅耦合逼近为具有指定边际分布的鞅耦合。",
    "en_tdlr": "This paper introduces the weak martingale optimal transport problem with additional information for robust finance, proves the stability of the resulting problem with respect to the risk neutral marginal distributions of the underlying asset, and provides a key step that approximates any martingale coupling with specified marginals."
}