{
    "title": "Towards ethical multimodal systems. (arXiv:2304.13765v1 [cs.AI])",
    "abstract": "The impact of artificial intelligence systems on our society is increasing at an unprecedented speed. For instance, ChatGPT is being tested in mental health treatment applications such as Koko, Stable Diffusion generates pieces of art competitive with (or outperforming) human artists, and so on. Ethical concerns regarding the behavior and applications of generative AI systems have been increasing over the past years, and the field of AI alignment - steering the behavior of AI systems towards being aligned with human values - is a rapidly growing subfield of modern AI. In this paper, we address the challenges involved in ethical evaluation of a multimodal artificial intelligence system. The multimodal systems we focus on take both text and an image as input and output text, completing the sentence or answering the question asked as input. We perform the evaluation of these models in two steps: we first discus the creation of a multimodal ethical database and then use this database to co",
    "link": "http://arxiv.org/abs/2304.13765",
    "context": "Title: Towards ethical multimodal systems. (arXiv:2304.13765v1 [cs.AI])\nAbstract: The impact of artificial intelligence systems on our society is increasing at an unprecedented speed. For instance, ChatGPT is being tested in mental health treatment applications such as Koko, Stable Diffusion generates pieces of art competitive with (or outperforming) human artists, and so on. Ethical concerns regarding the behavior and applications of generative AI systems have been increasing over the past years, and the field of AI alignment - steering the behavior of AI systems towards being aligned with human values - is a rapidly growing subfield of modern AI. In this paper, we address the challenges involved in ethical evaluation of a multimodal artificial intelligence system. The multimodal systems we focus on take both text and an image as input and output text, completing the sentence or answering the question asked as input. We perform the evaluation of these models in two steps: we first discus the creation of a multimodal ethical database and then use this database to co",
    "path": "papers/23/04/2304.13765.json",
    "total_tokens": 848,
    "translated_title": "走向伦理多模态系统",
    "translated_abstract": "人工智能系统对我们社会的影响正在以前所未有的速度增长。例如，ChatGPT正在进行心理健康治疗应用的测试，如Koko，Stable Diffusion生成的艺术作品与人类艺术家相比具有竞争力，甚至表现更好。对生成型人工智能系统行为和应用的伦理问题近年来不断增加，AI对齐领域——将人工智能系统的行为引导向与人类价值观相一致的方向——是现代人工智能的一个快速发展的子领域。在本文中，我们探讨了伦理评价多模态人工智能系统的挑战。我们专注于同时以文本和图像作为输入并输出文本的多模态系统，完成作为输入的句子或问题的回答。我们分两步对这些模型进行评估：我们首先讨论了多模态伦理数据库的创建，然后使用这个数据库来协同判断系统是否满足伦理要求。",
    "tldr": "本文讨论了伦理评价多模态人工智能系统的挑战，通过创建多模态伦理数据库来协同判断系统是否满足伦理要求。",
    "en_tdlr": "This paper discusses the challenges involved in ethical evaluation of a multimodal artificial intelligence system and proposes the creation of a multimodal ethical database to evaluate the system's compliance with ethical standards."
}