{
    "title": "A comparison between Recurrent Neural Networks and classical machine learning approaches In Laser induced breakdown spectroscopy. (arXiv:2304.08500v1 [cs.LG])",
    "abstract": "Recurrent Neural Networks are classes of Artificial Neural Networks that establish connections between different nodes form a directed or undirected graph for temporal dynamical analysis. In this research, the laser induced breakdown spectroscopy (LIBS) technique is used for quantitative analysis of aluminum alloys by different Recurrent Neural Network (RNN) architecture. The fundamental harmonic (1064 nm) of a nanosecond Nd:YAG laser pulse is employed to generate the LIBS plasma for the prediction of constituent concentrations of the aluminum standard samples. Here, Recurrent Neural Networks based on different networks, such as Long Short Term Memory (LSTM), Gated Recurrent Unit (GRU), Simple Recurrent Neural Network (Simple RNN), and as well as Recurrent Convolutional Networks comprising of Conv-SimpleRNN, Conv-LSTM and Conv-GRU are utilized for concentration prediction. Then a comparison is performed among prediction by classical machine learning methods of support vector regressor ",
    "link": "http://arxiv.org/abs/2304.08500",
    "context": "Title: A comparison between Recurrent Neural Networks and classical machine learning approaches In Laser induced breakdown spectroscopy. (arXiv:2304.08500v1 [cs.LG])\nAbstract: Recurrent Neural Networks are classes of Artificial Neural Networks that establish connections between different nodes form a directed or undirected graph for temporal dynamical analysis. In this research, the laser induced breakdown spectroscopy (LIBS) technique is used for quantitative analysis of aluminum alloys by different Recurrent Neural Network (RNN) architecture. The fundamental harmonic (1064 nm) of a nanosecond Nd:YAG laser pulse is employed to generate the LIBS plasma for the prediction of constituent concentrations of the aluminum standard samples. Here, Recurrent Neural Networks based on different networks, such as Long Short Term Memory (LSTM), Gated Recurrent Unit (GRU), Simple Recurrent Neural Network (Simple RNN), and as well as Recurrent Convolutional Networks comprising of Conv-SimpleRNN, Conv-LSTM and Conv-GRU are utilized for concentration prediction. Then a comparison is performed among prediction by classical machine learning methods of support vector regressor ",
    "path": "papers/23/04/2304.08500.json",
    "total_tokens": 1032,
    "translated_title": "递归神经网络与传统机器学习方法在激光诱导击穿光谱技术中的比较",
    "translated_abstract": "递归神经网络是一类人工神经网络，在时间动力学分析中建立不同节点之间的连接形成有向或无向图。本研究利用激光诱导击穿光谱技术对铝合金进行定量分析，并采用不同的递归神经网络结构，如长短时记忆网络(LSTM)、门控循环单元(GRU)、简单递归神经网络(Simple RNN)以及由卷积-简单递归网络(Conv-SimpleRNN)、卷积-LSTM(Conv-LSTM)和卷积-GRU(Conv-GRU)组成的递归卷积网络用于铝标准样品浓度预测。然后，将递归神经网络与支持向量回归机(SVR)、随机森林(RF)、k最近邻(k-NN)和多元线性回归(MLR)等传统机器学习方法进行比较。结果表明，基于递归神经网络的模型，特别是LSTM和GRU，提供比传统机器学习模型更好的预测结果。",
    "tldr": "本文比较了递归神经网络和传统机器学习方法在激光诱导击穿光谱技术中的应用，结果表明，基于递归神经网络的模型，特别是LSTM和GRU，提供比传统机器学习模型更好的预测结果。",
    "en_tdlr": "This paper compares the applications of Recurrent Neural Networks and classical machine learning methods in laser induced breakdown spectroscopy, and demonstrates that the RNN-based models, especially LSTM and GRU, provide better prediction results than the classical machine learning models."
}