{
    "title": "Harnessing the Power of Text-image Contrastive Models for Automatic Detection of Online Misinformation. (arXiv:2304.10249v1 [cs.LG])",
    "abstract": "As growing usage of social media websites in the recent decades, the amount of news articles spreading online rapidly, resulting in an unprecedented scale of potentially fraudulent information. Although a plenty of studies have applied the supervised machine learning approaches to detect such content, the lack of gold standard training data has hindered the development. Analysing the single data format, either fake text description or fake image, is the mainstream direction for the current research. However, the misinformation in real-world scenario is commonly formed as a text-image pair where the news article/news title is described as text content, and usually followed by the related image. Given the strong ability of learning features without labelled data, contrastive learning, as a self-learning approach, has emerged and achieved success on the computer vision. In this paper, our goal is to explore the constrastive learning in the domain of misinformation identification. We devel",
    "link": "http://arxiv.org/abs/2304.10249",
    "context": "Title: Harnessing the Power of Text-image Contrastive Models for Automatic Detection of Online Misinformation. (arXiv:2304.10249v1 [cs.LG])\nAbstract: As growing usage of social media websites in the recent decades, the amount of news articles spreading online rapidly, resulting in an unprecedented scale of potentially fraudulent information. Although a plenty of studies have applied the supervised machine learning approaches to detect such content, the lack of gold standard training data has hindered the development. Analysing the single data format, either fake text description or fake image, is the mainstream direction for the current research. However, the misinformation in real-world scenario is commonly formed as a text-image pair where the news article/news title is described as text content, and usually followed by the related image. Given the strong ability of learning features without labelled data, contrastive learning, as a self-learning approach, has emerged and achieved success on the computer vision. In this paper, our goal is to explore the constrastive learning in the domain of misinformation identification. We devel",
    "path": "papers/23/04/2304.10249.json",
    "total_tokens": 1032,
    "translated_title": "利用文本-图像对比模型自动检测在线虚假信息的能力",
    "translated_abstract": "随着社交媒体网站的日益普及，新闻文章的数量在网上迅速传播，因此可能存在大规模的潜在虚假信息。虽然大量的研究已经应用监督机器学习方法来检测这样的内容，但缺乏黄金标准训练数据已经阻碍了发展。分析单个数据格式，即虚假的文本描述或虚假的图像，是目前研究的主流方向。然而，在现实世界的情况下，虚假信息通常以文本-图像对的形式形成，新闻文章/新闻标题被描述为文本内容，并通常跟随相关的图像。鉴于对没有标签数据进行学习特征的强大能力，对比学习作为自学习方法已经出现并在计算机视觉中取得了成功。本文旨在探索对比学习在虚假信息识别领域的应用。我们开发了一个文本-图像对比模型，该模型学习区分正宗和虚假新闻中的文本和图像之间的关系，并将其用于自动检测在线虚假信息。我们的实验结果表明，这种提出的模型在使用文本-图像对检测假新闻方面优于现有的方法。",
    "tldr": "本文研究了一种基于对比学习的虚假信息识别方法，在文本-图像对中区分正宗和虚假新闻，具有很好的效果。"
}