{
    "title": "System Identification with Copula Entropy. (arXiv:2304.12922v1 [eess.SY])",
    "abstract": "Identifying differential equation governing dynamical system is an important problem with wide applications. Copula Entropy (CE) is a mathematical concept for measuring statistical independence in information theory. In this paper we propose a method for identifying differential equation of dynamical systems with CE. The problem is considered as a variable selection problem and solved with the previously proposed CE-based method for variable selection. The proposed method composed of two components: the difference operator and the CE estimator. Since both components can be done non-parametrically, the proposed method is therefore model-free and hyperparameter-free. The simulation experiment with the 3D Lorenz system verified the effectiveness of the proposed method.",
    "link": "http://arxiv.org/abs/2304.12922",
    "context": "Title: System Identification with Copula Entropy. (arXiv:2304.12922v1 [eess.SY])\nAbstract: Identifying differential equation governing dynamical system is an important problem with wide applications. Copula Entropy (CE) is a mathematical concept for measuring statistical independence in information theory. In this paper we propose a method for identifying differential equation of dynamical systems with CE. The problem is considered as a variable selection problem and solved with the previously proposed CE-based method for variable selection. The proposed method composed of two components: the difference operator and the CE estimator. Since both components can be done non-parametrically, the proposed method is therefore model-free and hyperparameter-free. The simulation experiment with the 3D Lorenz system verified the effectiveness of the proposed method.",
    "path": "papers/23/04/2304.12922.json",
    "total_tokens": 714,
    "translated_title": "基于Copula熵的系统辨识",
    "translated_abstract": "确定动态系统的微分方程是一个具有广泛应用的重要问题。Copula熵（CE）是信息论中用于测量统计独立性的数学概念。本文提出了一种使用CE识别动态系统微分方程的方法。该问题被视为一个变量选择问题，并通过先前提出的基于CE的变量选择方法来解决。所提出的方法由两个组件组成：差分算子和CE估计器。由于两个组件都可以进行非参数化，因此所提出的方法是无模型和超参数。在三维Lorenz系统的模拟实验中验证了所提出方法的有效性。",
    "tldr": "本文提出了一种使用Copula熵方法无模型超参数地对动态系统进行微分方程识别的方法，并在三维Lorenz系统的模拟实验中验证了该方法的有效性。",
    "en_tdlr": "This paper proposes a Copula Entropy (CE) based method for identifying the differential equation of dynamical systems. The proposed method is model-free, hyperparameter-free, and composed of the difference operator and CE estimator. Its effectiveness is verified through a simulation experiment on the 3D Lorenz system."
}