{
    "title": "Cross-Class Feature Augmentation for Class Incremental Learning. (arXiv:2304.01899v1 [cs.CV])",
    "abstract": "We propose a novel class incremental learning approach by incorporating a feature augmentation technique motivated by adversarial attacks. We employ a classifier learned in the past to complement training examples rather than simply play a role as a teacher for knowledge distillation towards subsequent models. The proposed approach has a unique perspective to utilize the previous knowledge in class incremental learning since it augments features of arbitrary target classes using examples in other classes via adversarial attacks on a previously learned classifier. By allowing the cross-class feature augmentations, each class in the old tasks conveniently populates samples in the feature space, which alleviates the collapse of the decision boundaries caused by sample deficiency for the previous tasks, especially when the number of stored exemplars is small. This idea can be easily incorporated into existing class incremental learning algorithms without any architecture modification. Exte",
    "link": "http://arxiv.org/abs/2304.01899",
    "context": "Title: Cross-Class Feature Augmentation for Class Incremental Learning. (arXiv:2304.01899v1 [cs.CV])\nAbstract: We propose a novel class incremental learning approach by incorporating a feature augmentation technique motivated by adversarial attacks. We employ a classifier learned in the past to complement training examples rather than simply play a role as a teacher for knowledge distillation towards subsequent models. The proposed approach has a unique perspective to utilize the previous knowledge in class incremental learning since it augments features of arbitrary target classes using examples in other classes via adversarial attacks on a previously learned classifier. By allowing the cross-class feature augmentations, each class in the old tasks conveniently populates samples in the feature space, which alleviates the collapse of the decision boundaries caused by sample deficiency for the previous tasks, especially when the number of stored exemplars is small. This idea can be easily incorporated into existing class incremental learning algorithms without any architecture modification. Exte",
    "path": "papers/23/04/2304.01899.json",
    "total_tokens": 858,
    "tldr": "该论文提出了一种类增量学习方法，通过对先前学习的分类器进行对抗攻击增强任意目标类的特征，方便地填充旧任务中的每个类的特征空间，并最终减轻因样本不足而导致的决策边界崩溃问题。",
    "en_tdlr": "This paper proposes a novel class incremental learning approach that incorporates a feature augmentation technique motivated by adversarial attacks. The approach utilizes a previously learned classifier to augment features of arbitrary target classes, filling sample deficiency for previous tasks and preventing decision boundary collapse."
}