{
    "title": "Adaptive Services Function Chain Orchestration For Digital Health Twin Use Cases: Heuristic-boosted Q-Learning Approach. (arXiv:2304.12853v1 [cs.NI])",
    "abstract": "Digital Twin (DT) is a prominent technology to utilise and deploy within the healthcare sector. Yet, the main challenges facing such applications are: Strict health data-sharing policies, high-performance network requirements, and possible infrastructure resource limitations. In this paper, we address all the challenges by provisioning adaptive Virtual Network Functions (VNFs) to enforce security policies associated with different data-sharing scenarios. We define a Cloud-Native Network orchestrator on top of a multi-node cluster mesh infrastructure for flexible and dynamic container scheduling. The proposed framework considers the intended data-sharing use case, the policies associated, and infrastructure configurations, then provision Service Function Chaining (SFC) and provides routing configurations accordingly with little to no human intervention. Moreover, what is \\textit{optimal} when deploying SFC is dependent on the use case itself, and we tune the hyperparameters to prioritis",
    "link": "http://arxiv.org/abs/2304.12853",
    "context": "Title: Adaptive Services Function Chain Orchestration For Digital Health Twin Use Cases: Heuristic-boosted Q-Learning Approach. (arXiv:2304.12853v1 [cs.NI])\nAbstract: Digital Twin (DT) is a prominent technology to utilise and deploy within the healthcare sector. Yet, the main challenges facing such applications are: Strict health data-sharing policies, high-performance network requirements, and possible infrastructure resource limitations. In this paper, we address all the challenges by provisioning adaptive Virtual Network Functions (VNFs) to enforce security policies associated with different data-sharing scenarios. We define a Cloud-Native Network orchestrator on top of a multi-node cluster mesh infrastructure for flexible and dynamic container scheduling. The proposed framework considers the intended data-sharing use case, the policies associated, and infrastructure configurations, then provision Service Function Chaining (SFC) and provides routing configurations accordingly with little to no human intervention. Moreover, what is \\textit{optimal} when deploying SFC is dependent on the use case itself, and we tune the hyperparameters to prioritis",
    "path": "papers/23/04/2304.12853.json",
    "total_tokens": 935,
    "translated_title": "数字健康孪生使用案例的自适应服务功能链编排: 启发式增强的Q学习方法",
    "translated_abstract": "数字孪生(DT)是利用和部署在医疗保健行业的突出技术。然而，此类应用面临的主要挑战是: 严格的医疗数据共享政策、高性能网络要求和可能的基础设施资源限制。本文通过提供自适应虚拟网络功能(VNF)，以执行与不同数据共享场景相关的安全策略，来解决所有这些挑战。我们在多节点集群网格基础设施上定义了一个云原生网络编排器，用于灵活和动态的容器调度。所提出的框架考虑了预期的数据共享用例、相关策略和基础设施配置，然后配置服务功能链(SFC)并相应地提供路由配置，几乎没有人为干预。此外，部署SFC时的“最优”取决于用例本身，我们调整超参数以优先考虑用例的贡献。",
    "tldr": "本文提出了一种用于数字健康孪生系统的自适应服务功能链编排方法，能够根据不同数据共享场景提供安全策略，并考虑到预期的用例、策略和基础设施配置，动态地提供服务编排和路由配置。",
    "en_tdlr": "This paper proposes an adaptive service function chain orchestration method for digital health twin systems, which can provide security policies according to different data-sharing scenarios, considering the intended use case, policies and infrastructure configurations. The proposed framework dynamically provides service chaining and routing configurations with little to no human intervention, and optimizes the deployment of service function chains based on the specific use case."
}