{
    "title": "Application of Tensor Neural Networks to Pricing Bermudan Swaptions. (arXiv:2304.09750v1 [q-fin.CP])",
    "abstract": "The Cheyette model is a quasi-Gaussian volatility interest rate model widely used to price interest rate derivatives such as European and Bermudan Swaptions for which Monte Carlo simulation has become the industry standard. In low dimensions, these approaches provide accurate and robust prices for European Swaptions but, even in this computationally simple setting, they are known to underestimate the value of Bermudan Swaptions when using the state variables as regressors. This is mainly due to the use of a finite number of predetermined basis functions in the regression. Moreover, in high-dimensional settings, these approaches succumb to the Curse of Dimensionality. To address these issues, Deep-learning techniques have been used to solve the backward Stochastic Differential Equation associated with the value process for European and Bermudan Swaptions; however, these methods are constrained by training time and memory. To overcome these limitations, we propose leveraging Tensor Neura",
    "link": "http://arxiv.org/abs/2304.09750",
    "context": "Title: Application of Tensor Neural Networks to Pricing Bermudan Swaptions. (arXiv:2304.09750v1 [q-fin.CP])\nAbstract: The Cheyette model is a quasi-Gaussian volatility interest rate model widely used to price interest rate derivatives such as European and Bermudan Swaptions for which Monte Carlo simulation has become the industry standard. In low dimensions, these approaches provide accurate and robust prices for European Swaptions but, even in this computationally simple setting, they are known to underestimate the value of Bermudan Swaptions when using the state variables as regressors. This is mainly due to the use of a finite number of predetermined basis functions in the regression. Moreover, in high-dimensional settings, these approaches succumb to the Curse of Dimensionality. To address these issues, Deep-learning techniques have been used to solve the backward Stochastic Differential Equation associated with the value process for European and Bermudan Swaptions; however, these methods are constrained by training time and memory. To overcome these limitations, we propose leveraging Tensor Neura",
    "path": "papers/23/04/2304.09750.json",
    "total_tokens": 1015,
    "translated_title": "张量神经网络在百慕大掉期定价中的应用",
    "translated_abstract": "Cheyette模型是一种准高斯波动率利率模型，广泛用于定价利率衍生品，例如欧式掉期和百慕大掉期，而蒙特卡罗模拟已成为行业标准。在低维度下，这些方法为欧式掉期提供了准确而稳健的价格，但即使在这种计算简单的情况下，当使用状态变量作为回归器时，它们也会低估百慕大掉期的价值。这主要是由于所用回归器中预先确定的基函数数量有限。此外，在高维环境中，这些方法也面临着维度灾难的问题。为了解决这些问题，研究者提出利用张量神经网络(TNN)来进行百慕大掉期的定价。研究结果表明，与传统方法相比，TNN具有更快的收敛速度，对于回归器中所用基函数的数量等参数，减少了敏感度。数值实验证实TNN能够在高维度情况下准确地定价欧式掉期和百慕大掉期。",
    "tldr": "本论文用张量神经网络(TNN)对百慕大掉期进行定价，相比于传统方法，TNN具有更快的收敛速度和减少参数敏感度的优点。"
}