{
    "title": "Communication-Constrained Bandits under Additive Gaussian Noise. (arXiv:2304.12680v1 [cs.LG])",
    "abstract": "We study a distributed stochastic multi-armed bandit where a client supplies the learner with communication-constrained feedback based on the rewards for the corresponding arm pulls. In our setup, the client must encode the rewards such that the second moment of the encoded rewards is no more than $P$, and this encoded reward is further corrupted by additive Gaussian noise of variance $\\sigma^2$; the learner only has access to this corrupted reward. For this setting, we derive an information-theoretic lower bound of $\\Omega\\left(\\sqrt{\\frac{KT}{\\mathtt{SNR} \\wedge1}} \\right)$ on the minimax regret of any scheme, where $ \\mathtt{SNR} := \\frac{P}{\\sigma^2}$, and $K$ and $T$ are the number of arms and time horizon, respectively. Furthermore, we propose a multi-phase bandit algorithm, $\\mathtt{UE\\text{-}UCB++}$, which matches this lower bound to a minor additive factor. $\\mathtt{UE\\text{-}UCB++}$ performs uniform exploration in its initial phases and then utilizes the {\\em upper confidence",
    "link": "http://arxiv.org/abs/2304.12680",
    "context": "Title: Communication-Constrained Bandits under Additive Gaussian Noise. (arXiv:2304.12680v1 [cs.LG])\nAbstract: We study a distributed stochastic multi-armed bandit where a client supplies the learner with communication-constrained feedback based on the rewards for the corresponding arm pulls. In our setup, the client must encode the rewards such that the second moment of the encoded rewards is no more than $P$, and this encoded reward is further corrupted by additive Gaussian noise of variance $\\sigma^2$; the learner only has access to this corrupted reward. For this setting, we derive an information-theoretic lower bound of $\\Omega\\left(\\sqrt{\\frac{KT}{\\mathtt{SNR} \\wedge1}} \\right)$ on the minimax regret of any scheme, where $ \\mathtt{SNR} := \\frac{P}{\\sigma^2}$, and $K$ and $T$ are the number of arms and time horizon, respectively. Furthermore, we propose a multi-phase bandit algorithm, $\\mathtt{UE\\text{-}UCB++}$, which matches this lower bound to a minor additive factor. $\\mathtt{UE\\text{-}UCB++}$ performs uniform exploration in its initial phases and then utilizes the {\\em upper confidence",
    "path": "papers/23/04/2304.12680.json",
    "total_tokens": 1048,
    "translated_title": "受限通信加性高斯噪声下的多臂赌博机问题研究",
    "translated_abstract": "本文研究了一个分布式随机多臂赌博机,其中客户端根据相应的拉臂奖励提供受限通信反馈给学习者。在我们的设定下,客户端必须编码奖励，使得编码奖励的二阶矩不超过P，并且这个编码奖励会被方差为$\\sigma^2$的加性高斯噪声所污染；学习者只能访问这个被污染的奖励。我们在这个设置中导出了任何方案的最小化后悔的信息论下限$\\Omega\\left(\\sqrt{\\frac{KT}{\\mathtt{SNR} \\wedge1}} \\right)$，其中 $ \\mathtt{SNR} := \\frac{P}{\\sigma^2}$，$K$和$T$分别是臂数和时间长度。此外，我们提出了一个多阶段赌博算法$\\mathtt{UE\\text{-}UCB++}$，它可以将这个下限的值加上一个微小的可加性因子。$\\mathtt{UE\\text{-}UCB++}$在其初始阶段执行均匀探索，然后在后续阶段使用“上置信界”(UCB)算法。我们还展示了数值结果，表明在实际情况下需要这样的通信有效算法。",
    "tldr": "本文研究了在受限通信和加性高斯噪声下的多臂赌博机问题，提出了一个多阶段赌博算法，并给出了信息理论下限。",
    "en_tdlr": "This paper studies the distributed stochastic multi-armed bandit problem under communication constraints and additive Gaussian noise, proposes a multi-phase bandit algorithm, and provides an information-theoretic lower bound for the problem."
}