{
    "title": "Uncertainty Propagation in Node Classification. (arXiv:2304.00918v1 [cs.LG])",
    "abstract": "Quantifying predictive uncertainty of neural networks has recently attracted increasing attention. In this work, we focus on measuring uncertainty of graph neural networks (GNNs) for the task of node classification. Most existing GNNs model message passing among nodes. The messages are often deterministic. Questions naturally arise: Does there exist uncertainty in the messages? How could we propagate such uncertainty over a graph together with messages? To address these issues, we propose a Bayesian uncertainty propagation (BUP) method, which embeds GNNs in a Bayesian modeling framework, and models predictive uncertainty of node classification with Bayesian confidence of predictive probability and uncertainty of messages. Our method proposes a novel uncertainty propagation mechanism inspired by Gaussian models. Moreover, we present an uncertainty oriented loss for node classification that allows the GNNs to clearly integrate predictive uncertainty in learning procedure. Consequently, t",
    "link": "http://arxiv.org/abs/2304.00918",
    "context": "Title: Uncertainty Propagation in Node Classification. (arXiv:2304.00918v1 [cs.LG])\nAbstract: Quantifying predictive uncertainty of neural networks has recently attracted increasing attention. In this work, we focus on measuring uncertainty of graph neural networks (GNNs) for the task of node classification. Most existing GNNs model message passing among nodes. The messages are often deterministic. Questions naturally arise: Does there exist uncertainty in the messages? How could we propagate such uncertainty over a graph together with messages? To address these issues, we propose a Bayesian uncertainty propagation (BUP) method, which embeds GNNs in a Bayesian modeling framework, and models predictive uncertainty of node classification with Bayesian confidence of predictive probability and uncertainty of messages. Our method proposes a novel uncertainty propagation mechanism inspired by Gaussian models. Moreover, we present an uncertainty oriented loss for node classification that allows the GNNs to clearly integrate predictive uncertainty in learning procedure. Consequently, t",
    "path": "papers/23/04/2304.00918.json",
    "total_tokens": 832,
    "translated_abstract": "近年来，量化神经网络的预测不确定性越来越引起人们的关注。本文重点研究了图神经网络（GNN）在节点分类任务中的不确定性传播。大多数现有的GNN模型都对节点之间的消息进行了确定性建模。这就自然地引发了问题：这些消息中是否存在不确定性？如何将这种不确定性与消息一起传播到整个图上？为了解决这些问题，我们提出了一种贝叶斯不确定性传播（BUP）方法，它将GNN嵌入到贝叶斯建模框架中，并使用预测概率的贝叶斯置信度和消息不确定性来建模节点分类的预测不确定性。我们的方法提出了一种受高斯模型启发的新型不确定性传播机制。此外，我们还提出了一种面向不确定性的节点分类损失函数，使得GNN可以在学习过程中明确地整合预测不确定性。",
    "tldr": "本文提出了一种贝叶斯不确定性传播方法，在节点分类任务中可以有效地处理图神经网络消息不确定性，并提出了一种可以整合预测不确定性的节点分类损失函数。",
    "en_tdlr": "This paper proposes a Bayesian uncertainty propagation method that effectively handles message uncertainty in graph neural networks for node classification, and introduces an uncertainty oriented loss allowing the integration of predictive uncertainty in the learning process."
}