{
    "title": "PAM: Plaid Atoms Model for Bayesian Nonparametric Analysis of Grouped Data. (arXiv:2304.14954v1 [stat.ME])",
    "abstract": "We consider dependent clustering of observations in groups. The proposed model, called the plaid atoms model (PAM), estimates a set of clusters for each group and allows some clusters to be either shared with other groups or uniquely possessed by the group. PAM is based on an extension to the well-known stick-breaking process by adding zero as a possible value for the cluster weights, resulting in a zero-augmented beta (ZAB) distribution in the model. As a result, ZAB allows some cluster weights to be exactly zero in multiple groups, thereby enabling shared and unique atoms across groups. We explore theoretical properties of PAM and show its connection to known Bayesian nonparametric models. We propose an efficient slice sampler for posterior inference. Minor extensions of the proposed model for multivariate or count data are presented. Simulation studies and applications using real-world datasets illustrate the model's desirable performance.",
    "link": "http://arxiv.org/abs/2304.14954",
    "context": "Title: PAM: Plaid Atoms Model for Bayesian Nonparametric Analysis of Grouped Data. (arXiv:2304.14954v1 [stat.ME])\nAbstract: We consider dependent clustering of observations in groups. The proposed model, called the plaid atoms model (PAM), estimates a set of clusters for each group and allows some clusters to be either shared with other groups or uniquely possessed by the group. PAM is based on an extension to the well-known stick-breaking process by adding zero as a possible value for the cluster weights, resulting in a zero-augmented beta (ZAB) distribution in the model. As a result, ZAB allows some cluster weights to be exactly zero in multiple groups, thereby enabling shared and unique atoms across groups. We explore theoretical properties of PAM and show its connection to known Bayesian nonparametric models. We propose an efficient slice sampler for posterior inference. Minor extensions of the proposed model for multivariate or count data are presented. Simulation studies and applications using real-world datasets illustrate the model's desirable performance.",
    "path": "papers/23/04/2304.14954.json",
    "total_tokens": 907,
    "translated_title": "PAM：基于贝叶斯非参数的分组数据分析的格子原子模型",
    "translated_abstract": "我们考虑对观测数据进行相关聚类的问题。所提出的模型称为格子原子模型（PAM），对于每个组估计一组聚类，并允许一些聚类与其他组共享或仅为该组所拥有。PAM基于对众所周知的粘性破裂过程的扩展，通过将零添加为聚类权重的可能值之一，从而在模型中产生零增强贝塔（ZAB）分布。因此，ZAB允许在多个组中一些聚类的权重恰好为零，从而实现组间共享和独特的原子。我们探讨了PAM的理论属性，并展示了其与已知贝叶斯非参数模型的联系。我们提出了一种有效的切片取样器用于后验推断。我们还针对多元或计数数据提出了所提出模型的轻微扩展。通过使用真实世界数据集进行的模拟研究和应用说明了该模型的良好性能。",
    "tldr": "PAM模型是基于贝叶斯非参数的分组数据分析的新方法，它通过使用零增强贝塔（ZAB）分布实现了多组间的原子共享和独特性，并且在实际应用中表现出良好的性能。",
    "en_tdlr": "PAM model is a new method for Bayesian nonparametric analysis of grouped data, which enables atomic sharing and uniqueness across multiple groups by using zero-augmented beta (ZAB) distribution, and demonstrates desirable performance in practical applications."
}