{
    "title": "Rethinking the Role of Token Retrieval in Multi-Vector Retrieval. (arXiv:2304.01982v1 [cs.CL])",
    "abstract": "Multi-vector retrieval models such as ColBERT [Khattab and Zaharia, 2020] allow token-level interactions between queries and documents, and hence achieve state of the art on many information retrieval benchmarks. However, their non-linear scoring function cannot be scaled to millions of documents, necessitating a three-stage process for inference: retrieving initial candidates via token retrieval, accessing all token vectors, and scoring the initial candidate documents. The non-linear scoring function is applied over all token vectors of each candidate document, making the inference process complicated and slow. In this paper, we aim to simplify the multi-vector retrieval by rethinking the role of token retrieval. We present XTR, ConteXtualized Token Retriever, which introduces a simple, yet novel, objective function that encourages the model to retrieve the most important document tokens first. The improvement to token retrieval allows XTR to rank candidates only using the retrieved t",
    "link": "http://arxiv.org/abs/2304.01982",
    "context": "Title: Rethinking the Role of Token Retrieval in Multi-Vector Retrieval. (arXiv:2304.01982v1 [cs.CL])\nAbstract: Multi-vector retrieval models such as ColBERT [Khattab and Zaharia, 2020] allow token-level interactions between queries and documents, and hence achieve state of the art on many information retrieval benchmarks. However, their non-linear scoring function cannot be scaled to millions of documents, necessitating a three-stage process for inference: retrieving initial candidates via token retrieval, accessing all token vectors, and scoring the initial candidate documents. The non-linear scoring function is applied over all token vectors of each candidate document, making the inference process complicated and slow. In this paper, we aim to simplify the multi-vector retrieval by rethinking the role of token retrieval. We present XTR, ConteXtualized Token Retriever, which introduces a simple, yet novel, objective function that encourages the model to retrieve the most important document tokens first. The improvement to token retrieval allows XTR to rank candidates only using the retrieved t",
    "path": "papers/23/04/2304.01982.json",
    "total_tokens": 893,
    "translated_abstract": "多向量检索模型（如ColBERT）允许查询和文档之间进行标记级别的交互，从而在许多信息检索基准上取得了最新技术成果。然而，它们的非线性评分函数无法扩展到数百万个文档，需要一个三阶段的推理过程：通过标记检索检索初始候选项，访问所有标记向量，并对初始候选文档进行评分。非线性评分函数应用于每个候选文档的所有标记向量，使推理过程复杂且缓慢。本文旨在通过重新思考Token检索的作用来简化多向量检索。我们提出了XTR，即ConteXtualized Token Retriever，它引入了一个简单而新颖的目标函数，鼓励模型首先检索最重要的文档标记。Token检索的改进使得XTR能够仅使用检索到的Top-k标记向量来对候选项进行排序。",
    "tldr": "本文针对多向量检索中的Token检索问题提出了XTR，通过鼓励模型首先检索最重要的文档标记，优化了Token检索的作用，使得XTR能够仅使用检索到的Top-k标记向量对候选项进行排序。",
    "en_tdlr": "This paper proposes XTR to address the token retrieval problem in multi-vector retrieval by encouraging the model to retrieve the most important document tokens first. The improvement optimizes the role of token retrieval and enables XTR to rank candidates only using the retrieved top-k token vectors."
}