{
    "title": "A Random-patch based Defense Strategy Against Physical Attacks for Face Recognition Systems. (arXiv:2304.07822v1 [cs.CV])",
    "abstract": "The physical attack has been regarded as a kind of threat against real-world computer vision systems. Still, many existing defense methods are only useful for small perturbations attacks and can't detect physical attacks effectively. In this paper, we propose a random-patch based defense strategy to robustly detect physical attacks for Face Recognition System (FRS). Different from mainstream defense methods which focus on building complex deep neural networks (DNN) to achieve high recognition rate on attacks, we introduce a patch based defense strategy to a standard DNN aiming to obtain robust detection models. Extensive experimental results on the employed datasets show the superiority of the proposed defense method on detecting white-box attacks and adaptive attacks which attack both FRS and the defense method. Additionally, due to the simpleness yet robustness of our method, it can be easily applied to the real world face recognition system and extended to other defense methods to b",
    "link": "http://arxiv.org/abs/2304.07822",
    "context": "Title: A Random-patch based Defense Strategy Against Physical Attacks for Face Recognition Systems. (arXiv:2304.07822v1 [cs.CV])\nAbstract: The physical attack has been regarded as a kind of threat against real-world computer vision systems. Still, many existing defense methods are only useful for small perturbations attacks and can't detect physical attacks effectively. In this paper, we propose a random-patch based defense strategy to robustly detect physical attacks for Face Recognition System (FRS). Different from mainstream defense methods which focus on building complex deep neural networks (DNN) to achieve high recognition rate on attacks, we introduce a patch based defense strategy to a standard DNN aiming to obtain robust detection models. Extensive experimental results on the employed datasets show the superiority of the proposed defense method on detecting white-box attacks and adaptive attacks which attack both FRS and the defense method. Additionally, due to the simpleness yet robustness of our method, it can be easily applied to the real world face recognition system and extended to other defense methods to b",
    "path": "papers/23/04/2304.07822.json",
    "total_tokens": 945,
    "translated_title": "基于随机补丁的人脸识别系统防物理攻击策略",
    "translated_abstract": "物理攻击被视为真实世界计算机视觉系统的一种威胁。然而，许多现有的防御方法只适用于小扰动攻击，并且不能有效检测物理攻击。本文提出了一种基于随机补丁的防御策略，用于强化人脸识别系统（FRS）来检测物理攻击。不同于主流防御方法着眼于构建复杂的深度神经网络（DNN）以在攻击中获得高识别率，我们将基于补丁的防御策略引入到标准DNN中，旨在获得强大的检测模型。利用所采用数据集的广泛实验结果表明了所提出的防御方法在检测白盒攻击和攻击FRS和防御方法的自适应攻击方面的优越性。此外，由于我们方法的简单而强大，它可以轻松应用于真实世界的人脸识别系统，并扩展到其他防御方法。",
    "tldr": "本文提出了一种基于随机补丁的防御策略，用于强化人脸识别系统（FRS）来检测物理攻击，该方法在检测白盒攻击和自适应攻击方面表现出优越性，且简单易用。"
}