{
    "title": "Machine Perception-Driven Image Compression: A Layered Generative Approach. (arXiv:2304.06896v1 [eess.IV] CROSS LISTED)",
    "abstract": "In this age of information, images are a critical medium for storing and transmitting information. With the rapid growth of image data amount, visual compression and visual data perception are two important research topics attracting a lot attention. However, those two topics are rarely discussed together and follow separate research path. Due to the compact compressed domain representation offered by learning-based image compression methods, there exists possibility to have one stream targeting both efficient data storage and compression, and machine perception tasks. In this paper, we propose a layered generative image compression model achieving high human vision-oriented image reconstructed quality, even at extreme compression ratios. To obtain analysis efficiency and flexibility, a task-agnostic learning-based compression model is proposed, which effectively supports various compressed domain-based analytical tasks while reserves outstanding reconstructed perceptual quality, compa",
    "link": "http://arxiv.org/abs/2304.06896",
    "context": "Title: Machine Perception-Driven Image Compression: A Layered Generative Approach. (arXiv:2304.06896v1 [eess.IV] CROSS LISTED)\nAbstract: In this age of information, images are a critical medium for storing and transmitting information. With the rapid growth of image data amount, visual compression and visual data perception are two important research topics attracting a lot attention. However, those two topics are rarely discussed together and follow separate research path. Due to the compact compressed domain representation offered by learning-based image compression methods, there exists possibility to have one stream targeting both efficient data storage and compression, and machine perception tasks. In this paper, we propose a layered generative image compression model achieving high human vision-oriented image reconstructed quality, even at extreme compression ratios. To obtain analysis efficiency and flexibility, a task-agnostic learning-based compression model is proposed, which effectively supports various compressed domain-based analytical tasks while reserves outstanding reconstructed perceptual quality, compa",
    "path": "papers/23/04/2304.06896.json",
    "total_tokens": 787,
    "translated_title": "基于机器感知的图像压缩：一种分层生成方法",
    "translated_abstract": "在这个信息时代，图像是存储和传输信息的重要媒介。随着图像数据量的快速增长，视觉压缩和视觉数据感知成为了两个重要的研究课题。然而，这两个课题很少被一起讨论，遵循着不同的研究路径。本文提出了一种分层生成图像压缩模型，即使在极端压缩比下，也能实现高质量的视觉重建。为了获得分析效率和灵活性，提出了一种任务不可知的学习型压缩模型，有效地支持各种基于压缩域的分析任务，同时保留了出色的视觉重建感知质量。",
    "tldr": "本文提出了一种分层生成图像压缩模型，能够在极端压缩比下实现高质量的视觉重建，同时支持各种基于压缩域的分析任务。",
    "en_tdlr": "This paper proposes a layered generative image compression model that achieves high-quality visual reconstruction even at extreme compression ratios, while supporting various compressed domain-based analytical tasks using a task-agnostic learning-based compression model."
}