{
    "title": "Online Spatio-Temporal Learning with Target Projection. (arXiv:2304.05124v1 [cs.NE])",
    "abstract": "Recurrent neural networks trained with the backpropagation through time (BPTT) algorithm have led to astounding successes in various temporal tasks. However, BPTT introduces severe limitations, such as the requirement to propagate information backwards through time, the weight symmetry requirement, as well as update-locking in space and time. These problems become roadblocks for AI systems where online training capabilities are vital. Recently, researchers have developed biologically-inspired training algorithms, addressing a subset of those problems. In this work, we propose a novel learning algorithm called online spatio-temporal learning with target projection (OSTTP) that resolves all aforementioned issues of BPTT. In particular, OSTTP equips a network with the capability to simultaneously process and learn from new incoming data, alleviating the weight symmetry and update-locking problems. We evaluate OSTTP on two temporal tasks, showcasing competitive performance compared to BPTT",
    "link": "http://arxiv.org/abs/2304.05124",
    "context": "Title: Online Spatio-Temporal Learning with Target Projection. (arXiv:2304.05124v1 [cs.NE])\nAbstract: Recurrent neural networks trained with the backpropagation through time (BPTT) algorithm have led to astounding successes in various temporal tasks. However, BPTT introduces severe limitations, such as the requirement to propagate information backwards through time, the weight symmetry requirement, as well as update-locking in space and time. These problems become roadblocks for AI systems where online training capabilities are vital. Recently, researchers have developed biologically-inspired training algorithms, addressing a subset of those problems. In this work, we propose a novel learning algorithm called online spatio-temporal learning with target projection (OSTTP) that resolves all aforementioned issues of BPTT. In particular, OSTTP equips a network with the capability to simultaneously process and learn from new incoming data, alleviating the weight symmetry and update-locking problems. We evaluate OSTTP on two temporal tasks, showcasing competitive performance compared to BPTT",
    "path": "papers/23/04/2304.05124.json",
    "total_tokens": 854,
    "translated_title": "带目标投影的在线时空学习",
    "translated_abstract": "通过时间反向传播（BPTT）算法训练的循环神经网络已经在各种时间任务中取得了惊人的成功。但是，BPTT引入了严重的限制，例如需要向后通过时间传播信息，权重对称要求以及空间和时间上的更新锁定。这些问题成为在线训练能力至关重要的AI系统的障碍。最近，研究人员开发了受生物启发的训练算法，解决了其中的一部分问题。在这项工作中，我们提出了一种名为带目标投影的在线时空学习（OSTTP）的新型学习算法，解决了BPTT的所有前述问题。具体而言，OSTTP使网络同时处理和学习新的传入数据的能力，缓解了权重对称和更新锁定问题。我们在两个时间任务上评估了OSTTP，展示了与BPTT相比的竞争性能。",
    "tldr": "提出了一种名为OSTTP的新型学习算法，解决了通过时间反向传播算法所引入的限制，使网络能够同时处理和学习新的传入数据，具有竞争性能。",
    "en_tdlr": "A novel learning algorithm called OSTTP is proposed to solve the limitations introduced by backpropagation through time (BPTT) algorithm, which equips a network with the ability to process and learn from new incoming data simultaneously and shows competitive performance on two temporal tasks compared to BPTT."
}