{
    "title": "Rehabilitation Exercise Repetition Segmentation and Counting using Skeletal Body Joints. (arXiv:2304.09735v1 [cs.CV])",
    "abstract": "Physical exercise is an essential component of rehabilitation programs that improve quality of life and reduce mortality and re-hospitalization rates. In AI-driven virtual rehabilitation programs, patients complete their exercises independently at home, while AI algorithms analyze the exercise data to provide feedback to patients and report their progress to clinicians. To analyze exercise data, the first step is to segment it into consecutive repetitions. There has been a significant amount of research performed on segmenting and counting the repetitive activities of healthy individuals using raw video data, which raises concerns regarding privacy and is computationally intensive. Previous research on patients' rehabilitation exercise segmentation relied on data collected by multiple wearable sensors, which are difficult to use at home by rehabilitation patients. Compared to healthy individuals, segmenting and counting exercise repetitions in patients is more challenging because of th",
    "link": "http://arxiv.org/abs/2304.09735",
    "context": "Title: Rehabilitation Exercise Repetition Segmentation and Counting using Skeletal Body Joints. (arXiv:2304.09735v1 [cs.CV])\nAbstract: Physical exercise is an essential component of rehabilitation programs that improve quality of life and reduce mortality and re-hospitalization rates. In AI-driven virtual rehabilitation programs, patients complete their exercises independently at home, while AI algorithms analyze the exercise data to provide feedback to patients and report their progress to clinicians. To analyze exercise data, the first step is to segment it into consecutive repetitions. There has been a significant amount of research performed on segmenting and counting the repetitive activities of healthy individuals using raw video data, which raises concerns regarding privacy and is computationally intensive. Previous research on patients' rehabilitation exercise segmentation relied on data collected by multiple wearable sensors, which are difficult to use at home by rehabilitation patients. Compared to healthy individuals, segmenting and counting exercise repetitions in patients is more challenging because of th",
    "path": "papers/23/04/2304.09735.json",
    "total_tokens": 919,
    "translated_title": "基于骨架身体关节点的康复运动重复分割和计数",
    "translated_abstract": "体育锻炼是提高生活质量、降低死亡率和再住院率的康复计划的重要组成部分。在AI驱动的虚拟康复计划中，患者独立在家完成运动，而AI算法分析运动数据，向患者提供反馈，并向临床医生报告他们的进展情况。分析运动数据的第一步是将其分割成连续的重复动作。之前已经有大量关于使用原始视频数据对健康人进行重复活动分割和计数的研究，这引发了隐私问题，并且计算复杂度较高。以前关于患者的康复运动分割的研究依赖于多个可穿戴传感器收集的数据，这些传感器在康复患者家中使用起来很困难。与健康人相比，在患者中分割和计数运动重复更具挑战性，这是因为康复过程中涉及到疾病和身体损伤的各种因素。",
    "tldr": "本研究提出了一种通过骨架身体关节点实现患者康复运动重复分割和计数的方法，可克服传感器难以使用和隐私问题的困境。",
    "en_tdlr": "This study proposes a method for segmentation and counting of patients' rehabilitation exercise repetitions using skeletal body joints, overcoming the challenges of difficult sensor usage and privacy issues."
}