{
    "title": "An Ecosystem for Personal Knowledge Graphs: A Survey and Research Roadmap. (arXiv:2304.09572v1 [cs.AI])",
    "abstract": "This paper presents an ecosystem for personal knowledge graphs (PKG), commonly defined as resources of structured information about entities related to an individual, their attributes, and the relations between them. PKGs are a key enabler of secure and sophisticated personal data management and personalized services. However, there are challenges that need to be addressed before PKGs can achieve widespread adoption. One of the fundamental challenges is the very definition of what constitutes a PKG, as there are multiple interpretations of the term. We propose our own definition of a PKG, emphasizing the aspects of (1) data ownership by a single individual and (2) the delivery of personalized services as the primary purpose. We further argue that a holistic view of PKGs is needed to unlock their full potential, and propose a unified framework for PKGs, where the PKG is a part of a larger ecosystem with clear interfaces towards data services and data sources. A comprehensive survey and ",
    "link": "http://arxiv.org/abs/2304.09572",
    "context": "Title: An Ecosystem for Personal Knowledge Graphs: A Survey and Research Roadmap. (arXiv:2304.09572v1 [cs.AI])\nAbstract: This paper presents an ecosystem for personal knowledge graphs (PKG), commonly defined as resources of structured information about entities related to an individual, their attributes, and the relations between them. PKGs are a key enabler of secure and sophisticated personal data management and personalized services. However, there are challenges that need to be addressed before PKGs can achieve widespread adoption. One of the fundamental challenges is the very definition of what constitutes a PKG, as there are multiple interpretations of the term. We propose our own definition of a PKG, emphasizing the aspects of (1) data ownership by a single individual and (2) the delivery of personalized services as the primary purpose. We further argue that a holistic view of PKGs is needed to unlock their full potential, and propose a unified framework for PKGs, where the PKG is a part of a larger ecosystem with clear interfaces towards data services and data sources. A comprehensive survey and ",
    "path": "papers/23/04/2304.09572.json",
    "total_tokens": 887,
    "translated_title": "个人知识图谱生态系统：调查与研究路线图",
    "translated_abstract": "本论文提出了一个个人知识图谱（PKG）的生态系统，通常定义为有关个人相关实体、其属性和它们之间关系的结构化信息资源。PKG是安全、精密的个人数据管理和个性化服务的关键支持。然而，在PKG能够广泛应用之前需要解决一些挑战。其中一个基本挑战是关于PKG的定义，因为术语有多种解释。我们提出了自己的PKG定义，强调了（1）单个个体拥有数据和（2）提供个性化服务作为主要目的的方面。我们进一步提出了一个综合的PKG视图，需要解锁它们的全部潜力，并提出了一个统一的框架，其中PKG是更大的生态系统的一部分，具有明确的与数据服务和数据源的接口。本文还展示了对当前PKG研究的全面调查和研究路线图。",
    "tldr": "本论文提出了一个个人知识图谱（PKG）的生态系统，PKG的主要目的是数据管理和个性化服务。要解锁PKG的全部潜力，需要一个统一的框架，并提出了一个关于PKG的综合视图。"
}