{
    "title": "Generative modeling for time series via Schr{\\\"o}dinger bridge. (arXiv:2304.05093v1 [math.OC])",
    "abstract": "We propose a novel generative model for time series based on Schr{\\\"o}dinger bridge (SB) approach. This consists in the entropic interpolation via optimal transport between a reference probability measure on path space and a target measure consistent with the joint data distribution of the time series. The solution is characterized by a stochastic differential equation on finite horizon with a path-dependent drift function, hence respecting the temporal dynamics of the time series distribution. We can estimate the drift function from data samples either by kernel regression methods or with LSTM neural networks, and the simulation of the SB diffusion yields new synthetic data samples of the time series. The performance of our generative model is evaluated through a series of numerical experiments. First, we test with a toy autoregressive model, a GARCH Model, and the example of fractional Brownian motion, and measure the accuracy of our algorithm with marginal and temporal dependencies ",
    "link": "http://arxiv.org/abs/2304.05093",
    "context": "Title: Generative modeling for time series via Schr{\\\"o}dinger bridge. (arXiv:2304.05093v1 [math.OC])\nAbstract: We propose a novel generative model for time series based on Schr{\\\"o}dinger bridge (SB) approach. This consists in the entropic interpolation via optimal transport between a reference probability measure on path space and a target measure consistent with the joint data distribution of the time series. The solution is characterized by a stochastic differential equation on finite horizon with a path-dependent drift function, hence respecting the temporal dynamics of the time series distribution. We can estimate the drift function from data samples either by kernel regression methods or with LSTM neural networks, and the simulation of the SB diffusion yields new synthetic data samples of the time series. The performance of our generative model is evaluated through a series of numerical experiments. First, we test with a toy autoregressive model, a GARCH Model, and the example of fractional Brownian motion, and measure the accuracy of our algorithm with marginal and temporal dependencies ",
    "path": "papers/23/04/2304.05093.json",
    "total_tokens": 1003,
    "translated_title": "基于Schr{\\\"o}dinger bridge的时序生成建模",
    "translated_abstract": "本文提出了一种新的基于Schr{\\\"o}dinger bridge (SB)方法的时序生成模型。该方法通过熵插值最优传输来处理参考路径空间上的参考概率分布和与时间序列的联合数据分布一致的目标测度之间的关系，模型的解由有限时间区间内的随机微分方程和路径依赖漂移函数组成，因此能很好地保持时间序列分布的时域特性。我们可以通过核回归方法或LSTM神经网络从数据样本中估计漂移函数，并通过模拟SB扩散过程产生新的合成数据样本。文章通过一系列数值实验评估了我们的生成模型的性能。首先，我们用玩具自回归模型、GARCH模型和分形布朗运动来测试，用边际和时间依赖度量我们算法的准确性。",
    "tldr": "本文提出了一种基于Schr{\\\"o}dinger bridge的时序生成模型，可以通过熵插值最优传输来处理参考路径空间上的参考概率分布和目标测度之间的关系，模型的解由有限时间区间内的随机微分方程和由数据估计的路径依赖漂移函数组成，通过模拟SB扩散过程产生新的合成数据样本，实验证明该方法在玩具自回归模型、GARCH模型和分形布朗运动方面具有很好的性能。",
    "en_tdlr": "This paper proposes a generative model for time series based on Schr{\\\"o}dinger bridge, which can handle the relationship between a reference probability distribution on the path space and a target distribution consistent with the joint data distribution of the time series through entropic interpolation and optimal transport. The solution is characterized by a stochastic differential equation with a path-dependent drift function, and new synthetic data samples can be generated by simulating the SB diffusion process. The effectiveness of the proposed method is demonstrated through experiments on autoregressive models, GARCH models, and fractional Brownian motions."
}