{
    "title": "Arrhythmia Classifier Based on Ultra-Lightweight Binary Neural Network. (arXiv:2304.01568v1 [eess.SP])",
    "abstract": "Reasonably and effectively monitoring arrhythmias through ECG signals has significant implications for human health. With the development of deep learning, numerous ECG classification algorithms based on deep learning have emerged. However, most existing algorithms trade off high accuracy for complex models, resulting in high storage usage and power consumption. This also inevitably increases the difficulty of implementation on wearable Artificial Intelligence-of-Things (AIoT) devices with limited resources. In this study, we proposed a universally applicable ultra-lightweight binary neural network(BNN) that is capable of 5-class and 17-class arrhythmia classification based on ECG signals. Our BNN achieves 96.90% (full precision 97.09%) and 97.50% (full precision 98.00%) accuracy for 5-class and 17-class classification, respectively, with state-of-the-art storage usage (3.76 KB and 4.45 KB). Compared to other binarization works, our approach excels in supporting two multi-classificatio",
    "link": "http://arxiv.org/abs/2304.01568",
    "context": "Title: Arrhythmia Classifier Based on Ultra-Lightweight Binary Neural Network. (arXiv:2304.01568v1 [eess.SP])\nAbstract: Reasonably and effectively monitoring arrhythmias through ECG signals has significant implications for human health. With the development of deep learning, numerous ECG classification algorithms based on deep learning have emerged. However, most existing algorithms trade off high accuracy for complex models, resulting in high storage usage and power consumption. This also inevitably increases the difficulty of implementation on wearable Artificial Intelligence-of-Things (AIoT) devices with limited resources. In this study, we proposed a universally applicable ultra-lightweight binary neural network(BNN) that is capable of 5-class and 17-class arrhythmia classification based on ECG signals. Our BNN achieves 96.90% (full precision 97.09%) and 97.50% (full precision 98.00%) accuracy for 5-class and 17-class classification, respectively, with state-of-the-art storage usage (3.76 KB and 4.45 KB). Compared to other binarization works, our approach excels in supporting two multi-classificatio",
    "path": "papers/23/04/2304.01568.json",
    "total_tokens": 950,
    "translated_title": "基于超轻量级二值神经网络的心律失常分类器",
    "translated_abstract": "合理有效地通过心电图(ECG)信号监测心律失常对人类健康具有重要意义。随着深度学习的发展，出现了许多基于深度学习的ECG分类算法。但是，大多数现有算法在高精度和复杂模型之间进行权衡，导致存储使用率和功耗很高。这也不可避免地增加了在资源有限的可穿戴人工智能物联网设备上实现的难度。本研究提出了一种通用的超轻量级二值神经网络(BNN)，能够通过ECG信号进行5类和17类心律失常分类。我们的BNN在5类和17类分类中分别达到了96.90% (完全精度97.09%)和97.50% (完全精度98.00%)的准确率，存储使用率最低(3.76 KB和4.45 KB)。与其他二值化作品相比，我们的方法在支持两个多分类方面表现出色。",
    "tldr": "本研究提出了一种能够通过ECG信号进行5类和17类心律失常分类的超轻量级二值神经网络(BNN)，在存储使用率最低的情况下，分别达到了96.90%和97.50%的准确率。",
    "en_tdlr": "The study proposes a universally applicable ultra-lightweight binary neural network(BNN) capable of 5-class and 17-class arrhythmia classification based on ECG signals. Our BNN achieves 96.90% and 97.50% accuracy, respectively, with state-of-the-art storage usage, and excels in supporting two multi-classification."
}