{
    "title": "Reformulating CTR Prediction: Learning Invariant Feature Interactions for Recommendation. (arXiv:2304.13643v1 [cs.IR])",
    "abstract": "Click-Through Rate (CTR) prediction plays a core role in recommender systems, serving as the final-stage filter to rank items for a user. The key to addressing the CTR task is learning feature interactions that are useful for prediction, which is typically achieved by fitting historical click data with the Empirical Risk Minimization (ERM) paradigm. Representative methods include Factorization Machines and Deep Interest Network, which have achieved wide success in industrial applications. However, such a manner inevitably learns unstable feature interactions, i.e., the ones that exhibit strong correlations in historical data but generalize poorly for future serving. In this work, we reformulate the CTR task -- instead of pursuing ERM on historical data, we split the historical data chronologically into several periods (a.k.a, environments), aiming to learn feature interactions that are stable across periods. Such feature interactions are supposed to generalize better to predict future ",
    "link": "http://arxiv.org/abs/2304.13643",
    "context": "Title: Reformulating CTR Prediction: Learning Invariant Feature Interactions for Recommendation. (arXiv:2304.13643v1 [cs.IR])\nAbstract: Click-Through Rate (CTR) prediction plays a core role in recommender systems, serving as the final-stage filter to rank items for a user. The key to addressing the CTR task is learning feature interactions that are useful for prediction, which is typically achieved by fitting historical click data with the Empirical Risk Minimization (ERM) paradigm. Representative methods include Factorization Machines and Deep Interest Network, which have achieved wide success in industrial applications. However, such a manner inevitably learns unstable feature interactions, i.e., the ones that exhibit strong correlations in historical data but generalize poorly for future serving. In this work, we reformulate the CTR task -- instead of pursuing ERM on historical data, we split the historical data chronologically into several periods (a.k.a, environments), aiming to learn feature interactions that are stable across periods. Such feature interactions are supposed to generalize better to predict future ",
    "path": "papers/23/04/2304.13643.json",
    "total_tokens": 850,
    "translated_title": "重构CTR预测：学习推荐系统中不变的特征交互",
    "translated_abstract": "点击率（CTR）预测在推荐系统中起着核心作用，作为用户排名项目的最终过滤器。解决CTR任务的关键是学习对预测有用的特征交互作用，通常通过使用经验风险最小化模式来适配历史点击数据来实现。代表方法包括分解机和深度兴趣网络，在工业应用中取得了广泛成功。然而，这种方法不可避免地学习到不稳定的特征交互作用，即在历史数据中表现出强相关性但在未来交付中的泛化性能差。在这项工作中，我们重构了CTR任务 - 不再关注历史数据上的经验风险最小化，而是将历史数据按时间顺序分成几个期间（称为环境），旨在学习稳定的特征交互作用。这些特征交互作用应该能够更好地推广到预测未来。",
    "tldr": "重塑CTR预测：学习稳定的特征交互，以实现更好的未来预测结果。",
    "en_tdlr": "This paper proposes a reformulation of CTR prediction in recommender systems by learning stable feature interactions across different periods of data, instead of fitting historical data with the Empirical Risk Minimization paradigm. The goal is to achieve better future prediction performance."
}