{
    "title": "Individual Welfare Analysis: Random Quasilinear Utility, Independence, and Confidence Bounds. (arXiv:2304.01921v1 [econ.EM])",
    "abstract": "We introduce a novel framework for individual-level welfare analysis. It builds on a parametric model for continuous demand with a quasilinear utility function, allowing for unobserved individual-product-level preference shocks. We obtain bounds on the individual-level consumer welfare loss at any confidence level due to a hypothetical price increase, solving a scalable optimization problem constrained by a new confidence set under an independence restriction. This confidence set is computationally simple, robust to weak instruments and nonlinearity, and may have applications beyond welfare analysis. Monte Carlo simulations and two empirical applications on gasoline and food demand demonstrate the effectiveness of our method.",
    "link": "http://arxiv.org/abs/2304.01921",
    "context": "Title: Individual Welfare Analysis: Random Quasilinear Utility, Independence, and Confidence Bounds. (arXiv:2304.01921v1 [econ.EM])\nAbstract: We introduce a novel framework for individual-level welfare analysis. It builds on a parametric model for continuous demand with a quasilinear utility function, allowing for unobserved individual-product-level preference shocks. We obtain bounds on the individual-level consumer welfare loss at any confidence level due to a hypothetical price increase, solving a scalable optimization problem constrained by a new confidence set under an independence restriction. This confidence set is computationally simple, robust to weak instruments and nonlinearity, and may have applications beyond welfare analysis. Monte Carlo simulations and two empirical applications on gasoline and food demand demonstrate the effectiveness of our method.",
    "path": "papers/23/04/2304.01921.json",
    "total_tokens": 867,
    "translated_title": "个体福利分析：随机准线性效用、独立性和置信区间",
    "translated_abstract": "我们介绍了一种新的个体水平福利分析框架。它建立在一个具有准线性效用函数的连续需求参数模型上，允许存在未观测到的个体-产品水平的偏好冲击。我们得出了由于假想价格上涨导致的个人级别消费者福利损失的任何置信水平的下限，并在独立性限制下受新的置信区间约束的可扩展优化问题中求解。这个置信区间非常简单，鲁棒性强，对于弱工具和非线性模型敏感度都很低，并且可能适用于福利分析之外的其他领域。Monte Carlo模拟和两个关于汽油和食品需求的实证应用证明了我们的方法的实效性。",
    "tldr": "本论文提出了一种基于随机准线性效用函数的个体福利分析框架，通过新的置信区间约束求解任意置信水平下的个人消费者福利损失下限，该求解方法简单高效，且适用范围广泛，具有很强的实际应用价值。",
    "en_tdlr": "This paper proposes a novel framework for individual-level welfare analysis based on a random quasilinear utility function, which obtains the lower bounds on individual-level consumer welfare loss at any confidence level due to a hypothetical price increase by solving a scalable optimization problem constrained by a new confidence set under an independence restriction. The proposed method is computationally simple, robust, and has potential applications beyond welfare analysis. Monte Carlo simulations and two empirical applications on gasoline and food demand prove the effectiveness of the method."
}