{
    "title": "Intent-aware Ranking Ensemble for Personalized Recommendation. (arXiv:2304.07450v1 [cs.IR])",
    "abstract": "Ranking ensemble is a critical component in real recommender systems. When a user visits a platform, the system will prepare several item lists, each of which is generally from a single behavior objective recommendation model. As multiple behavior intents, e.g., both clicking and buying some specific item category, are commonly concurrent in a user visit, it is necessary to integrate multiple single-objective ranking lists into one. However, previous work on rank aggregation mainly focused on fusing homogeneous item lists with the same objective while ignoring ensemble of heterogeneous lists ranked with different objectives with various user intents.  In this paper, we treat a user's possible behaviors and the potential interacting item categories as the user's intent. And we aim to study how to fuse candidate item lists generated from different objectives aware of user intents. To address such a task, we propose an Intent-aware ranking Ensemble Learning~(IntEL) model to fuse multiple ",
    "link": "http://arxiv.org/abs/2304.07450",
    "context": "Title: Intent-aware Ranking Ensemble for Personalized Recommendation. (arXiv:2304.07450v1 [cs.IR])\nAbstract: Ranking ensemble is a critical component in real recommender systems. When a user visits a platform, the system will prepare several item lists, each of which is generally from a single behavior objective recommendation model. As multiple behavior intents, e.g., both clicking and buying some specific item category, are commonly concurrent in a user visit, it is necessary to integrate multiple single-objective ranking lists into one. However, previous work on rank aggregation mainly focused on fusing homogeneous item lists with the same objective while ignoring ensemble of heterogeneous lists ranked with different objectives with various user intents.  In this paper, we treat a user's possible behaviors and the potential interacting item categories as the user's intent. And we aim to study how to fuse candidate item lists generated from different objectives aware of user intents. To address such a task, we propose an Intent-aware ranking Ensemble Learning~(IntEL) model to fuse multiple ",
    "path": "papers/23/04/2304.07450.json",
    "total_tokens": 976,
    "tldr": "本文提出了一种意图感知的排名集成学习（IntEL）模型，以在考虑用户意图的情况下，从不同目标的候选商品列表中提高推荐系统的个性化推荐能力。"
}