{
    "title": "T2Ranking: A large-scale Chinese Benchmark for Passage Ranking. (arXiv:2304.03679v1 [cs.IR])",
    "abstract": "Passage ranking involves two stages: passage retrieval and passage re-ranking, which are important and challenging topics for both academics and industries in the area of Information Retrieval (IR). However, the commonly-used datasets for passage ranking usually focus on the English language. For non-English scenarios, such as Chinese, the existing datasets are limited in terms of data scale, fine-grained relevance annotation and false negative issues. To address this problem, we introduce T2Ranking, a large-scale Chinese benchmark for passage ranking. T2Ranking comprises more than 300K queries and over 2M unique passages from real-world search engines. Expert annotators are recruited to provide 4-level graded relevance scores (fine-grained) for query-passage pairs instead of binary relevance judgments (coarse-grained). To ease the false negative issues, more passages with higher diversities are considered when performing relevance annotations, especially in the test set, to ensure a m",
    "link": "http://arxiv.org/abs/2304.03679",
    "context": "Title: T2Ranking: A large-scale Chinese Benchmark for Passage Ranking. (arXiv:2304.03679v1 [cs.IR])\nAbstract: Passage ranking involves two stages: passage retrieval and passage re-ranking, which are important and challenging topics for both academics and industries in the area of Information Retrieval (IR). However, the commonly-used datasets for passage ranking usually focus on the English language. For non-English scenarios, such as Chinese, the existing datasets are limited in terms of data scale, fine-grained relevance annotation and false negative issues. To address this problem, we introduce T2Ranking, a large-scale Chinese benchmark for passage ranking. T2Ranking comprises more than 300K queries and over 2M unique passages from real-world search engines. Expert annotators are recruited to provide 4-level graded relevance scores (fine-grained) for query-passage pairs instead of binary relevance judgments (coarse-grained). To ease the false negative issues, more passages with higher diversities are considered when performing relevance annotations, especially in the test set, to ensure a m",
    "path": "papers/23/04/2304.03679.json",
    "total_tokens": 909,
    "translated_title": "T2Ranking：一个大规模的中文段落排序基准数据集",
    "translated_abstract": "段落排名包括两个阶段：段落检索和段落重新排序，这是信息检索领域中学术界和工业界都关注的重要而具有挑战性的主题。然而，用于段落排名的常用数据集通常关注英语语言。对于非英语语境，如中文，现有的数据集在数据规模、细粒度相关性注释和错误负面问题方面受到限制。为了解决这个问题，我们引入了T2Ranking，这是一个针对中文段落排序的大规模基准数据集。T2Ranking包括来自真实搜索引擎的超过300K个查询和超过2M个唯一的段落。专家评注员被招募，为查询-段落对提供4级分级相关性评分（细粒度），而不是二进制相关性判断（粗粒度）。为了减少错误负面问题，在执行相关性注释时考虑更多具有较高多样性的段落，特别是在测试集中，以确保最大化评注的质量。",
    "tldr": "T2Ranking是一个大规模的中文段落排序基准数据集，使用了4级分级相关性评分，以解决现有数据集在数据规模、细粒度相关性注释和错误负面问题方面的限制。",
    "en_tdlr": "T2Ranking is a large-scale Chinese benchmark dataset for passage ranking, using 4-level graded relevance scores to address the limitations of existing datasets in terms of data scale, fine-grained relevance annotation, and false negative issues."
}