{
    "title": "Reusing Deep Neural Network Models through Model Re-engineering. (arXiv:2304.00245v1 [cs.SE])",
    "abstract": "Training deep neural network (DNN) models, which has become an important task in today's software development, is often costly in terms of computational resources and time. With the inspiration of software reuse, building DNN models through reusing existing ones has gained increasing attention recently. Prior approaches to DNN model reuse have two main limitations: 1) reusing the entire model, while only a small part of the model's functionalities (labels) are required, would cause much overhead (e.g., computational and time costs for inference), and 2) model reuse would inherit the defects and weaknesses of the reused model, and hence put the new system under threats of security attack. To solve the above problem, we propose SeaM, a tool that re-engineers a trained DNN model to improve its reusability. Specifically, given a target problem and a trained model, SeaM utilizes a gradient-based search method to search for the model's weights that are relevant to the target problem. The re-",
    "link": "http://arxiv.org/abs/2304.00245",
    "context": "Title: Reusing Deep Neural Network Models through Model Re-engineering. (arXiv:2304.00245v1 [cs.SE])\nAbstract: Training deep neural network (DNN) models, which has become an important task in today's software development, is often costly in terms of computational resources and time. With the inspiration of software reuse, building DNN models through reusing existing ones has gained increasing attention recently. Prior approaches to DNN model reuse have two main limitations: 1) reusing the entire model, while only a small part of the model's functionalities (labels) are required, would cause much overhead (e.g., computational and time costs for inference), and 2) model reuse would inherit the defects and weaknesses of the reused model, and hence put the new system under threats of security attack. To solve the above problem, we propose SeaM, a tool that re-engineers a trained DNN model to improve its reusability. Specifically, given a target problem and a trained model, SeaM utilizes a gradient-based search method to search for the model's weights that are relevant to the target problem. The re-",
    "path": "papers/23/04/2304.00245.json",
    "total_tokens": 885,
    "tldr": "通过梯度搜索方法，提高深度神经网络模型的可重用性，对于维护和更新已有的模型以及为新任务快速构建模型非常有益。"
}