{
    "title": "LARD -- Landing Approach Runway Detection -- Dataset for Vision Based Landing. (arXiv:2304.09938v1 [cs.CV])",
    "abstract": "As the interest in autonomous systems continues to grow, one of the major challenges is collecting sufficient and representative real-world data. Despite the strong practical and commercial interest in autonomous landing systems in the aerospace field, there is a lack of open-source datasets of aerial images. To address this issue, we present a dataset-lard-of high-quality aerial images for the task of runway detection during approach and landing phases. Most of the dataset is composed of synthetic images but we also provide manually labelled images from real landing footages, to extend the detection task to a more realistic setting. In addition, we offer the generator which can produce such synthetic front-view images and enables automatic annotation of the runway corners through geometric transformations. This dataset paves the way for further research such as the analysis of dataset quality or the development of models to cope with the detection tasks. Find data, code and more up-to",
    "link": "http://arxiv.org/abs/2304.09938",
    "context": "Title: LARD -- Landing Approach Runway Detection -- Dataset for Vision Based Landing. (arXiv:2304.09938v1 [cs.CV])\nAbstract: As the interest in autonomous systems continues to grow, one of the major challenges is collecting sufficient and representative real-world data. Despite the strong practical and commercial interest in autonomous landing systems in the aerospace field, there is a lack of open-source datasets of aerial images. To address this issue, we present a dataset-lard-of high-quality aerial images for the task of runway detection during approach and landing phases. Most of the dataset is composed of synthetic images but we also provide manually labelled images from real landing footages, to extend the detection task to a more realistic setting. In addition, we offer the generator which can produce such synthetic front-view images and enables automatic annotation of the runway corners through geometric transformations. This dataset paves the way for further research such as the analysis of dataset quality or the development of models to cope with the detection tasks. Find data, code and more up-to",
    "path": "papers/23/04/2304.09938.json",
    "total_tokens": 906,
    "translated_title": "基于视觉的着陆数据集-- LARD（Landing Approach Runway Detection Dataset）",
    "translated_abstract": "随着对自主系统的兴趣不断增长，收集足够且代表性的真实世界数据成为一个关键挑战。尽管航空航天领域的自主着陆系统具有强烈的实用和商业价值，但缺乏开源的航空影像数据集。为了解决这一问题，我们提出了一个高质量的航拍图像数据集-LARD，用于着陆和进场阶段的跑道检测任务。数据集大部分由合成图像组成，但我们还提供了人工标注的实际着陆镜头图像，以扩展检测任务到更现实的场景。此外，我们提供了生成器，可以产生这样的合成前视图像，并通过几何变换实现跑道拐角点的自动注释。该数据集为进一步研究，如数据集质量分析或开发模型应对检测任务，铺平了道路。",
    "tldr": "LARD数据集是用于着陆和进场阶段的跑道检测任务的高质量航拍图像数据集。它由大量合成图像和一些人工标注的实际着陆镜头图像组成，同时还提供了生成器以产生此类合成图像并自动注释跑道拐角点。",
    "en_tdlr": "The LARD dataset is a high-quality aerial image dataset for runway detection during landing and approach phases. It comprises mainly of synthetic images, along with some manually labelled images from real landings, and provides a generator to produce synthetic front-view images with automatic annotation of runway corners through geometric transformations."
}