{
    "title": "A Personalized Dense Retrieval Framework for Unified Information Access. (arXiv:2304.13654v1 [cs.IR])",
    "abstract": "Developing a universal model that can efficiently and effectively respond to a wide range of information access requests -- from retrieval to recommendation to question answering -- has been a long-lasting goal in the information retrieval community. This paper argues that the flexibility, efficiency, and effectiveness brought by the recent development in dense retrieval and approximate nearest neighbor search have smoothed the path towards achieving this goal. We develop a generic and extensible dense retrieval framework, called \\framework, that can handle a wide range of (personalized) information access requests, such as keyword search, query by example, and complementary item recommendation. Our proposed approach extends the capabilities of dense retrieval models for ad-hoc retrieval tasks by incorporating user-specific preferences through the development of a personalized attentive network. This allows for a more tailored and accurate personalized information access experience. Ou",
    "link": "http://arxiv.org/abs/2304.13654",
    "context": "Title: A Personalized Dense Retrieval Framework for Unified Information Access. (arXiv:2304.13654v1 [cs.IR])\nAbstract: Developing a universal model that can efficiently and effectively respond to a wide range of information access requests -- from retrieval to recommendation to question answering -- has been a long-lasting goal in the information retrieval community. This paper argues that the flexibility, efficiency, and effectiveness brought by the recent development in dense retrieval and approximate nearest neighbor search have smoothed the path towards achieving this goal. We develop a generic and extensible dense retrieval framework, called \\framework, that can handle a wide range of (personalized) information access requests, such as keyword search, query by example, and complementary item recommendation. Our proposed approach extends the capabilities of dense retrieval models for ad-hoc retrieval tasks by incorporating user-specific preferences through the development of a personalized attentive network. This allows for a more tailored and accurate personalized information access experience. Ou",
    "path": "papers/23/04/2304.13654.json",
    "total_tokens": 827,
    "translated_title": "个性化稠密检索框架：统一信息访问",
    "translated_abstract": "开发一种通用的模型，可以高效、有效地响应从检索到推荐、到回答问题等广泛的信息访问请求，一直是信息检索社区的长期目标。本文认为近年来稠密检索和近邻搜索的发展带来的灵活性、高效性和有效性已经为实现这一目标铺平了道路。我们开发了一个名为「\\framework」的通用且可扩展的稠密检索框架，可以处理各种（个性化的）信息访问请求，例如关键字搜索、示例查询和补充物品推荐。我们提出的方法通过开发个性化关注网络，将用户特定的偏好纳入考虑，从而扩展了稠密检索模型在即时检索任务中的功能，使个性化信息访问体验更加贴心和准确。",
    "tldr": "本文提出了一个名为「\\framework」的通用且可扩展的稠密检索框架，它可以处理各种个性化的信息访问请求，并通过个性化关注网络将用户的偏好纳入考虑，从而提供更加贴心和准确的个性化信息访问体验。",
    "en_tdlr": "This paper proposes a generic and extensible dense retrieval framework called \"framework\" that handles various personalized information access requests by incorporating user-specific preferences through personalized attentive network, providing a more tailored and accurate personalized experience."
}