{
    "title": "Testing and Identifying Substitution and Complementarity Patterns. (arXiv:2304.00678v1 [econ.EM])",
    "abstract": "This paper studies semiparametric identification of substitution and complementarity patterns between two goods using a panel multinomial choice model with bundles. The model allows the two goods to be either substitutes or complements and admits heterogeneous complementarity through observed characteristics. I first provide testable implications for the complementarity relationship between goods. I then characterize the sharp identified set for the model parameters and provide sufficient conditions for point identification. The identification analysis accommodates endogenous covariates through flexible dependence structures between observed characteristics and fixed effects while placing no distributional assumptions on unobserved preference shocks. My method is shown to perform more robustly than the parametric method through Monte Carlo simulations. As an extension, I allow for unobserved heterogeneity in the complementarity, investigate scenarios involving more than two goods, and ",
    "link": "http://arxiv.org/abs/2304.00678",
    "context": "Title: Testing and Identifying Substitution and Complementarity Patterns. (arXiv:2304.00678v1 [econ.EM])\nAbstract: This paper studies semiparametric identification of substitution and complementarity patterns between two goods using a panel multinomial choice model with bundles. The model allows the two goods to be either substitutes or complements and admits heterogeneous complementarity through observed characteristics. I first provide testable implications for the complementarity relationship between goods. I then characterize the sharp identified set for the model parameters and provide sufficient conditions for point identification. The identification analysis accommodates endogenous covariates through flexible dependence structures between observed characteristics and fixed effects while placing no distributional assumptions on unobserved preference shocks. My method is shown to perform more robustly than the parametric method through Monte Carlo simulations. As an extension, I allow for unobserved heterogeneity in the complementarity, investigate scenarios involving more than two goods, and ",
    "path": "papers/23/04/2304.00678.json",
    "total_tokens": 877,
    "translated_title": "检测和确认替代与互补模式",
    "translated_abstract": "本文研究了使用包含商品组合的面板多项式选择模型对两种商品之间的替代和互补模式进行半参数识别。该模型允许两种商品是替代品或互补品，并通过观测到的特征允许异质互补。我首先提供了商品之间互补关系的可检验推论。然后，我描述了该模型参数的尖锐识别集并提供了点识别的充分条件。该识别分析适应了内生协变量，并通过观测特征和固定效应之间的柔性依赖结构放弃对未观测到的偏好震荡的分布假设。通过蒙特卡罗模拟，我的方法被证明比参数方法更加稳健。扩展中，我允许互补中存在未观测到的异质性，研究涉及两个以上商品的情况。",
    "tldr": "本文提出了一种面板多项式选择模型，通过观测到的特征允许两种商品的替代和互补，并提供了商品之间互补关系的可检验推论和点识别的充分条件。",
    "en_tdlr": "This paper proposes a panel multinomial choice model that allows for substitution and complementarity between two goods through observed characteristics, and provides testable implications and sufficient conditions for point identification of the complementarity relationship between the goods. The method is shown to be more robust than parametric methods, and can also accommodate endogenous covariates and unobserved heterogeneity."
}