{
    "title": "Multi-Modality Multi-Scale Cardiovascular Disease Subtypes Classification Using Raman Image and Medical History. (arXiv:2304.09322v1 [eess.IV])",
    "abstract": "Raman spectroscopy (RS) has been widely used for disease diagnosis, e.g., cardiovascular disease (CVD), owing to its efficiency and component-specific testing capabilities. A series of popular deep learning methods have recently been introduced to learn nuance features from RS for binary classifications and achieved outstanding performance than conventional machine learning methods. However, these existing deep learning methods still confront some challenges in classifying subtypes of CVD. For example, the nuance between subtypes is quite hard to capture and represent by intelligent models due to the chillingly similar shape of RS sequences. Moreover, medical history information is an essential resource for distinguishing subtypes, but they are underutilized. In light of this, we propose a multi-modality multi-scale model called M3S, which is a novel deep learning method with two core modules to address these issues. First, we convert RS data to various resolution images by the Gramian",
    "link": "http://arxiv.org/abs/2304.09322",
    "context": "Title: Multi-Modality Multi-Scale Cardiovascular Disease Subtypes Classification Using Raman Image and Medical History. (arXiv:2304.09322v1 [eess.IV])\nAbstract: Raman spectroscopy (RS) has been widely used for disease diagnosis, e.g., cardiovascular disease (CVD), owing to its efficiency and component-specific testing capabilities. A series of popular deep learning methods have recently been introduced to learn nuance features from RS for binary classifications and achieved outstanding performance than conventional machine learning methods. However, these existing deep learning methods still confront some challenges in classifying subtypes of CVD. For example, the nuance between subtypes is quite hard to capture and represent by intelligent models due to the chillingly similar shape of RS sequences. Moreover, medical history information is an essential resource for distinguishing subtypes, but they are underutilized. In light of this, we propose a multi-modality multi-scale model called M3S, which is a novel deep learning method with two core modules to address these issues. First, we convert RS data to various resolution images by the Gramian",
    "path": "papers/23/04/2304.09322.json",
    "total_tokens": 1089,
    "translated_title": "基于 Raman 成像和病史的多模态多尺度心血管疾病亚型分类",
    "translated_abstract": "基于 Raman 光谱学的诊断可靠性和成分特异性测试能力，其被广泛应用于疾病诊断，例如心血管疾病(CVD)。最近引入了一系列流行的深度学习方法，以学习 RS 的细微特征进行二元分类，并取得了优异的表现。然而，这些现有的深度学习方法在分类 CVD 子类型方面仍然面临一些挑战。为了解决这些问题，我们提出了一种名为 M3S 的多模态多尺度模型，该模型具有两个核心模块，通过 Gramian Angular Summation Field 方法将 RS 数据转换为各种分辨率的图像来丰富 RS 序列的表示，并将病史信息引入我们的模型作为辅助输入，并增强了我们模型的区分能力。我们对一个拥有四个 CVD 亚型的大型数据集进行了评估，并取得了95.71% 的准确率，优于现有的最先进方法。",
    "tldr": "本研究提出了一种名为 M3S 的多模态多尺度模型，通过 Gramian Angular Summation Field 方法将 Raman 光谱数据转换为各种分辨率的图像丰富了其表示，并引入病史信息作为辅助输入，最终在四种 CVD 亚型的大型数据集上取得了95.71%的准确率。",
    "en_tdlr": "This paper proposes a novel multi-modality multi-scale approach, called M3S, to classify subtypes of cardiovascular disease using Raman imaging and medical history. The approach utilizes the Gramian Angular Summation Field method to enrich the representation of Raman sequences and introduces medical history information as auxiliary input to enhance the discrimination ability of the model. M3S outperforms state-of-the-art methods with 95.71% accuracy on a large-scale dataset with four subtypes of CVD."
}