{
    "title": "Gini-stable Lorenz curves and their relation to the generalised Pareto distribution. (arXiv:2304.07480v1 [physics.soc-ph])",
    "abstract": "We study an iterative discrete information production process (IPP) where we can extend ordered normalised vectors by new elements based on a simple affine transformation, while preserving the predefined level of inequality, G, as measured by the Gini index. Then, we derive the family of Lorenz curves of the corresponding vectors and prove that it is stochastically ordered with respect to both the sample size and G which plays the role of the uncertainty parameter. A case study of family income data in nine countries shows a very good fit of our model. Moreover, we show that asymptotically, we obtain all, and only, Lorenz curves generated by a new, intuitive parametrisation of the finite-mean Generalised Pareto Distribution (GPD) that unifies three other families, namely: the Pareto Type II, exponential, and scaled beta ones. The family is not only ordered with respect to the parameter G, but also, thanks to our derivations, has a nice underlying interpretation. Our result may thus she",
    "link": "http://arxiv.org/abs/2304.07480",
    "context": "Title: Gini-stable Lorenz curves and their relation to the generalised Pareto distribution. (arXiv:2304.07480v1 [physics.soc-ph])\nAbstract: We study an iterative discrete information production process (IPP) where we can extend ordered normalised vectors by new elements based on a simple affine transformation, while preserving the predefined level of inequality, G, as measured by the Gini index. Then, we derive the family of Lorenz curves of the corresponding vectors and prove that it is stochastically ordered with respect to both the sample size and G which plays the role of the uncertainty parameter. A case study of family income data in nine countries shows a very good fit of our model. Moreover, we show that asymptotically, we obtain all, and only, Lorenz curves generated by a new, intuitive parametrisation of the finite-mean Generalised Pareto Distribution (GPD) that unifies three other families, namely: the Pareto Type II, exponential, and scaled beta ones. The family is not only ordered with respect to the parameter G, but also, thanks to our derivations, has a nice underlying interpretation. Our result may thus she",
    "path": "papers/23/04/2304.07480.json",
    "total_tokens": 930,
    "translated_title": "Gini稳定的Lorenz曲线及其与广义帕累托分布的关系",
    "translated_abstract": "本文研究了一种迭代离散信息生产过程（IPP），在此过程中，我们可以根据简单的仿射变换扩展有序归一化向量的新元素，同时保持由Gini指数衡量的预定义不平等水平G。然后，我们推导了相应向量的Lorenz曲线家族，并证明其在样本大小和G所扮演的不确定性参数方面是随机有序的。九个国家的家庭收入数据的案例研究表明，我们的模型非常适合。此外，我们还表明，在渐近意义下，我们获得了由新的直观参数化的有限均值广义帕累托分布（GPD）生成的所有，仅有的Lorenz曲线，该分布统一了三个其他家族，即Pareto II型，指数和缩放beta分布。这个家族不仅在参数G方面有序，而且，由于我们的导出结果，具有不错的潜在解释性。因此，我们的结果可以是",
    "tldr": "本文研究了一种IPP，可得到Gini稳定的Lorenz曲线家族，并证明其随机有序。同时，我们发现该家族与广义帕累托分布相关联且具有不错的潜在解释性。",
    "en_tdlr": "This paper studies an IPP that generates Gini-stable Lorenz curve family, which is stochastically ordered and related to the generalized Pareto distribution. The family unifies three other families and has a nice underlying interpretation."
}