{
    "title": "KINLP at SemEval-2023 Task 12: Kinyarwanda Tweet Sentiment Analysis. (arXiv:2304.12569v1 [cs.CL])",
    "abstract": "This paper describes the system entered by the author to the SemEval-2023 Task 12: Sentiment analysis for African languages. The system focuses on the Kinyarwanda language and uses a language-specific model. Kinyarwanda morphology is modeled in a two tier transformer architecture and the transformer model is pre-trained on a large text corpus using multi-task masked morphology prediction. The model is deployed on an experimental platform that allows users to experiment with the pre-trained language model fine-tuning without the need to write machine learning code. Our final submission to the shared task achieves second ranking out of 34 teams in the competition, achieving 72.50% weighted F1 score. Our analysis of the evaluation results highlights challenges in achieving high accuracy on the task and identifies areas for improvement.",
    "link": "http://arxiv.org/abs/2304.12569",
    "context": "Title: KINLP at SemEval-2023 Task 12: Kinyarwanda Tweet Sentiment Analysis. (arXiv:2304.12569v1 [cs.CL])\nAbstract: This paper describes the system entered by the author to the SemEval-2023 Task 12: Sentiment analysis for African languages. The system focuses on the Kinyarwanda language and uses a language-specific model. Kinyarwanda morphology is modeled in a two tier transformer architecture and the transformer model is pre-trained on a large text corpus using multi-task masked morphology prediction. The model is deployed on an experimental platform that allows users to experiment with the pre-trained language model fine-tuning without the need to write machine learning code. Our final submission to the shared task achieves second ranking out of 34 teams in the competition, achieving 72.50% weighted F1 score. Our analysis of the evaluation results highlights challenges in achieving high accuracy on the task and identifies areas for improvement.",
    "path": "papers/23/04/2304.12569.json",
    "total_tokens": 828,
    "translated_title": "KINLP在SemEval-2023任务12中的应用：金亚琳达推文情感分析",
    "translated_abstract": "本文介绍了作者参加SemEval-2023任务12（非洲语言情感分析）的系统。该系统着重于金亚琳达语，并使用了具有语言特异性的模型。金亚琳达语的词汇形态学被建模为两层变形金刚体系结构，并且变形金刚模型是使用多任务掩码形态预测在大型文本语料库上进行预训练的。该模型部署在一个实验平台上，使用户可以在无需编写机器学习代码的情况下对预训练语言模型进行微调。我们在共享任务的最终提交中获得了34支团队中的第二名，取得了72.50%的加权F1分数。我们的评估结果分析突出了在该任务上实现高准确度的挑战，并确定了需要改进的领域。",
    "tldr": "本文介绍了作者在SemEval-2023任务12中使用的针对金亚琳达推文情感分析的系统，并在该竞赛中取得了第二高的成绩。",
    "en_tdlr": "This paper presents the author's system for sentiment analysis of Kinyarwanda tweets in the SemEval-2023 Task 12 competition, achieving the second highest score out of 34 teams, highlighting challenges in achieving high accuracy in the task and identifying areas for improvement."
}