{
    "title": "Using Implicit Feedback to Improve Question Generation. (arXiv:2304.13664v1 [cs.CL])",
    "abstract": "Question Generation (QG) is a task of Natural Language Processing (NLP) that aims at automatically generating questions from text. Many applications can benefit from automatically generated questions, but often it is necessary to curate those questions, either by selecting or editing them. This task is informative on its own, but it is typically done post-generation, and, thus, the effort is wasted. In addition, most existing systems cannot incorporate this feedback back into them easily. In this work, we present a system, GEN, that learns from such (implicit) feedback. Following a pattern-based approach, it takes as input a small set of sentence/question pairs and creates patterns which are then applied to new unseen sentences. Each generated question, after being corrected by the user, is used as a new seed in the next iteration, so more patterns are created each time. We also take advantage of the corrections made by the user to score the patterns and therefore rank the generated qu",
    "link": "http://arxiv.org/abs/2304.13664",
    "context": "Title: Using Implicit Feedback to Improve Question Generation. (arXiv:2304.13664v1 [cs.CL])\nAbstract: Question Generation (QG) is a task of Natural Language Processing (NLP) that aims at automatically generating questions from text. Many applications can benefit from automatically generated questions, but often it is necessary to curate those questions, either by selecting or editing them. This task is informative on its own, but it is typically done post-generation, and, thus, the effort is wasted. In addition, most existing systems cannot incorporate this feedback back into them easily. In this work, we present a system, GEN, that learns from such (implicit) feedback. Following a pattern-based approach, it takes as input a small set of sentence/question pairs and creates patterns which are then applied to new unseen sentences. Each generated question, after being corrected by the user, is used as a new seed in the next iteration, so more patterns are created each time. We also take advantage of the corrections made by the user to score the patterns and therefore rank the generated qu",
    "path": "papers/23/04/2304.13664.json",
    "total_tokens": 837,
    "translated_title": "使用隐式反馈提高问答生成质量",
    "translated_abstract": "问答生成(QG)是自然语言处理(NLP)的一个任务，旨在从文本中自动生成问题。许多应用程序可以从自动生成的问题中受益，但通常需要通过选择或编辑这些问题来使其更准确。本研究提出了一个名为GEN的系统，该系统从这些（隐式）反馈中学习。该系统采用基于模式的方法，将一小组句子/问题对作为输入，并创建模式，然后将其应用于新的未见过的句子。每个由用户纠正后生成的问题都作为下一次迭代的新种子使用，因此每次都会创建更多的模式。我们还利用用户所做的更正来评分模式，从而对生成的问题进行排序。实验表明，该系统优于现有的QG模型，可以生成高质量的问题。",
    "tldr": "本研究提出了一个名为GEN的系统，利用一小组句子/问题对作为输入，通过基于模式的方法生成问题。该系统可以从用户的反馈中学习并提高生成问题的质量。",
    "en_tdlr": "This study proposes a system named GEN, which generates questions based on a pattern-based approach using a small set of sentence/question pairs as input. The system learns from user feedback to improve the quality of the generated questions."
}