{
    "title": "When Crowd Meets Persona: Creating a Large-Scale Open-Domain Persona Dialogue Corpus. (arXiv:2304.00350v1 [cs.CL])",
    "abstract": "Building a natural language dataset requires caution since word semantics is vulnerable to subtle text change or the definition of the annotated concept. Such a tendency can be seen in generative tasks like question-answering and dialogue generation and also in tasks that create a categorization-based corpus, like topic classification or sentiment analysis. Open-domain conversations involve two or more crowdworkers freely conversing about any topic, and collecting such data is particularly difficult for two reasons: 1) the dataset should be ``crafted\" rather than ``obtained\" due to privacy concerns, and 2) paid creation of such dialogues may differ from how crowdworkers behave in real-world settings. In this study, we tackle these issues when creating a large-scale open-domain persona dialogue corpus, where persona implies that the conversation is performed by several actors with a fixed persona and user-side workers from an unspecified crowd.",
    "link": "http://arxiv.org/abs/2304.00350",
    "context": "Title: When Crowd Meets Persona: Creating a Large-Scale Open-Domain Persona Dialogue Corpus. (arXiv:2304.00350v1 [cs.CL])\nAbstract: Building a natural language dataset requires caution since word semantics is vulnerable to subtle text change or the definition of the annotated concept. Such a tendency can be seen in generative tasks like question-answering and dialogue generation and also in tasks that create a categorization-based corpus, like topic classification or sentiment analysis. Open-domain conversations involve two or more crowdworkers freely conversing about any topic, and collecting such data is particularly difficult for two reasons: 1) the dataset should be ``crafted\" rather than ``obtained\" due to privacy concerns, and 2) paid creation of such dialogues may differ from how crowdworkers behave in real-world settings. In this study, we tackle these issues when creating a large-scale open-domain persona dialogue corpus, where persona implies that the conversation is performed by several actors with a fixed persona and user-side workers from an unspecified crowd.",
    "path": "papers/23/04/2304.00350.json",
    "total_tokens": 848,
    "translated_title": "当众包遇到角色扮演：创建一个大规模的开放领域角色扮演对话语料库",
    "translated_abstract": "构建自然语言数据集需要小心，因为单词的语义容易受到微妙的文本变化或被注释概念的定义影响。这种趋势可以在生成任务（例如问答和对话生成）以及创建基于分类的语料库（例如主题分类或情感分析）中看到。开放领域会话涉及两个或多个众包工人自由谈论任何主题，收集这种数据尤其困难，原因是：1）由于隐私问题，数据集应该“创造”而不是“获得”；2）有偿创建这类对话可能与众包工作人员在现实世界中的行为不同。在本研究中，我们解决了创建一个大规模的开放领域角色扮演对话语料库时的这些问题，其中“角色扮演”意味着对话由固定角色的多个演员和来自未指定的群众的用户端工作者执行。",
    "tldr": "该论文讨论了创建大规模开放领域角色扮演对话语料库的困难，并解决了众包和隐私等问题。",
    "en_tdlr": "This paper discusses the difficulties of creating a large-scale open-domain persona dialogue corpus, and addresses issues related to crowdsourcing and privacy concerns."
}