{
    "title": "Unfolded Self-Reconstruction LSH: Towards Machine Unlearning in Approximate Nearest Neighbour Search. (arXiv:2304.02350v1 [cs.IR])",
    "abstract": "Approximate nearest neighbour (ANN) search is an essential component of search engines, recommendation systems, etc. Many recent works focus on learning-based data-distribution-dependent hashing and achieve good retrieval performance. However, due to increasing demand for users' privacy and security, we often need to remove users' data information from Machine Learning (ML) models to satisfy specific privacy and security requirements. This need requires the ANN search algorithm to support fast online data deletion and insertion. Current learning-based hashing methods need retraining the hash function, which is prohibitable due to the vast time-cost of large-scale data. To address this problem, we propose a novel data-dependent hashing method named unfolded self-reconstruction locality-sensitive hashing (USR-LSH). Our USR-LSH unfolded the optimization update for instance-wise data reconstruction, which is better for preserving data information than data-independent LSH. Moreover, our US",
    "link": "http://arxiv.org/abs/2304.02350",
    "context": "Title: Unfolded Self-Reconstruction LSH: Towards Machine Unlearning in Approximate Nearest Neighbour Search. (arXiv:2304.02350v1 [cs.IR])\nAbstract: Approximate nearest neighbour (ANN) search is an essential component of search engines, recommendation systems, etc. Many recent works focus on learning-based data-distribution-dependent hashing and achieve good retrieval performance. However, due to increasing demand for users' privacy and security, we often need to remove users' data information from Machine Learning (ML) models to satisfy specific privacy and security requirements. This need requires the ANN search algorithm to support fast online data deletion and insertion. Current learning-based hashing methods need retraining the hash function, which is prohibitable due to the vast time-cost of large-scale data. To address this problem, we propose a novel data-dependent hashing method named unfolded self-reconstruction locality-sensitive hashing (USR-LSH). Our USR-LSH unfolded the optimization update for instance-wise data reconstruction, which is better for preserving data information than data-independent LSH. Moreover, our US",
    "path": "papers/23/04/2304.02350.json",
    "total_tokens": 1148,
    "translated_title": "未折叠自重建局部敏感哈希：走向近似最近邻搜索中的机器遗忘",
    "translated_abstract": "近似最近邻搜索是搜索引擎、推荐系统等的重要组成部分。许多最近的工作都是基于学习的数据分布依赖哈希，实现了良好的检索性能。但是，由于对用户隐私和安全的需求不断增加，我们经常需要从机器学习模型中删除用户数据信息以满足特定的隐私和安全要求。这种需求需要ANN搜索算法支持快速的在线数据删除和插入。当前的基于学习的哈希方法需要重新训练哈希函数，这是由于大规模数据的时间成本太高而难以承受的。为了解决这个问题，我们提出了一种新型的数据依赖哈希方法，名为unfolded self-reconstruction locality-sensitive hashing (USR-LSH)。我们的USR-LSH展开了实例级数据重建的优化更新，这比数据无关的LSH更能保留数据信息。此外，我们的USR-LSH提出了一种动态的遗忘机制，用于快速的数据删除和插入，无需重新训练。实验结果表明，USR-LSH在检索准确性和时间效率方面优于现有的哈希方法。USR-LSH是具有数据隐私和安全要求的在线ANN搜索的实际解决方案。",
    "tldr": "本文提出了一种基于数据依赖的哈希方法USR-LSH，该方法通过展开实例级数据重建的优化更新，提高了数据的信息保留能力，同时还提出了一种动态的遗忘机制，使得数据可以快速删除和插入，无需重新训练，这是一种具有数据隐私和安全要求的在线ANN搜索的实际解决方案。",
    "en_tdlr": "This paper proposes a data-dependent hashing method called USR-LSH, which preserves data information better than data-independent LSH by unfolding the optimization update for instance-wise data reconstruction, and proposes a dynamic unlearning mechanism for fast data deletion and insertion without retraining. USR-LSH outperforms existing hashing methods in retrieval accuracy and time efficiency, and can serve as a practical solution for online ANN search with data privacy and security requirements."
}