{
    "title": "Data-Driven Response Regime Exploration and Identification for Dynamical Systems. (arXiv:2304.05822v1 [eess.SY])",
    "abstract": "Data-Driven Response Regime Exploration and Identification (DR$^2$EI) is a novel and fully data-driven method for identifying and classifying response regimes of a dynamical system without requiring human intervention. This approach is a valuable tool for exploring and discovering response regimes in complex dynamical systems, especially when the governing equations and the number of response regimes are unknown, and the system is expensive to sample. Additionally, the method is useful for order reduction, as it can be used to identify the most dominant response regimes of a given dynamical system. DR$^2$EI utilizes unsupervised learning algorithms to transform the system's response into an embedding space that facilitates regime classification. An active sequential sampling approach based on Gaussian Process Regression (GPR) is used to efficiently sample the parameter space, quantify uncertainty, and provide optimal trade-offs between exploration and exploitation. The performance of t",
    "link": "http://arxiv.org/abs/2304.05822",
    "context": "Title: Data-Driven Response Regime Exploration and Identification for Dynamical Systems. (arXiv:2304.05822v1 [eess.SY])\nAbstract: Data-Driven Response Regime Exploration and Identification (DR$^2$EI) is a novel and fully data-driven method for identifying and classifying response regimes of a dynamical system without requiring human intervention. This approach is a valuable tool for exploring and discovering response regimes in complex dynamical systems, especially when the governing equations and the number of response regimes are unknown, and the system is expensive to sample. Additionally, the method is useful for order reduction, as it can be used to identify the most dominant response regimes of a given dynamical system. DR$^2$EI utilizes unsupervised learning algorithms to transform the system's response into an embedding space that facilitates regime classification. An active sequential sampling approach based on Gaussian Process Regression (GPR) is used to efficiently sample the parameter space, quantify uncertainty, and provide optimal trade-offs between exploration and exploitation. The performance of t",
    "path": "papers/23/04/2304.05822.json",
    "total_tokens": 844,
    "translated_abstract": "数据驱动的响应区域探索与识别（DR $ ^ 2 $ EI）是一种新颖且完全数据驱动的方法，用于识别和分类动力系统的响应区域，无需人为干预。该方法是一种有价值的工具，可用于探索和发现复杂动力系统中的响应区域，特别是当控制方程和响应区域数量未知，系统采样代价高时。此外，该方法对于降阶也有用处，因为它可以用于识别给定动态系统的最主导响应区域。DR $ ^ 2 $ EI利用无监督学习算法将系统的响应转换为一个嵌入空间，从而便于进行响应区域分类。基于高斯过程回归的主动顺序采样方法用于高效地对参数空间进行采样、量化不确定性并在探索和开发之间提供最优权衡。",
    "tldr": "DR$^2$EI是一种无需人为干预的数据驱动方法，能够探索和发现复杂动力系统的响应区域，并对于降阶也有帮助。",
    "en_tdlr": "DR$^2$EI is a data-driven method that can explore and discover response regimes in complex dynamical systems without human intervention. It is also useful for order reduction."
}