{
    "title": "Quantum machine learning for image classification. (arXiv:2304.09224v1 [quant-ph])",
    "abstract": "Image recognition and classification are fundamental tasks with diverse practical applications across various industries, making them critical in the modern world. Recently, machine learning models, particularly neural networks, have emerged as powerful tools for solving these problems. However, the utilization of quantum effects through hybrid quantum-classical approaches can further enhance the capabilities of traditional classical models. Here, we propose two hybrid quantum-classical models: a neural network with parallel quantum layers and a neural network with a quanvolutional layer, which address image classification problems. One of our hybrid quantum approaches demonstrates remarkable accuracy of more than 99% on the MNIST dataset. Notably, in the proposed quantum circuits all variational parameters are trainable, and we divide the quantum part into multiple parallel variational quantum circuits for efficient neural network learning. In summary, our study contributes to the ong",
    "link": "http://arxiv.org/abs/2304.09224",
    "context": "Title: Quantum machine learning for image classification. (arXiv:2304.09224v1 [quant-ph])\nAbstract: Image recognition and classification are fundamental tasks with diverse practical applications across various industries, making them critical in the modern world. Recently, machine learning models, particularly neural networks, have emerged as powerful tools for solving these problems. However, the utilization of quantum effects through hybrid quantum-classical approaches can further enhance the capabilities of traditional classical models. Here, we propose two hybrid quantum-classical models: a neural network with parallel quantum layers and a neural network with a quanvolutional layer, which address image classification problems. One of our hybrid quantum approaches demonstrates remarkable accuracy of more than 99% on the MNIST dataset. Notably, in the proposed quantum circuits all variational parameters are trainable, and we divide the quantum part into multiple parallel variational quantum circuits for efficient neural network learning. In summary, our study contributes to the ong",
    "path": "papers/23/04/2304.09224.json",
    "total_tokens": 863,
    "translated_title": "图像分类的量子机器学习方法",
    "translated_abstract": "图像识别和分类是各行各业中多种实际应用的基本任务，是现代世界中至关重要的领域。近年来，尤其是神经网络，机器学习模型已成为解决这些问题的强大工具。然而，通过混合量子-经典方法利用量子效应可以进一步增强传统经典模型的能力。在这里，我们提出两种混合量子-经典模型：一个具有并行量子层的神经网络和一个具有量子卷积层的神经网络，来解决图像分类问题。我们其中一个混合量子方法在MNIST数据集上展现了超过99%的惊人准确率。值得注意的是，在我们提出的量子电路中，所有可变参数都是可训练的，并且我们将量子部分分成多个并行可变量子电路以提高神经网络学习的效率。",
    "tldr": "本论文提出了两种混合量子-经典的神经网络模型用于图像分类，其中包括一个具有并行量子层的神经网络和一个具有量子卷积层的神经网络。其中一个混合量子方法在MNIST数据集上展现了超过99%的惊人准确率。",
    "en_tdlr": "This paper proposes two hybrid quantum-classical neural network models for image classification, including a neural network with parallel quantum layers and a neural network with a quanvolutional layer. One of the hybrid quantum models achieves an impressive accuracy of over 99% on the MNIST dataset."
}