{
    "title": "STraM: a framework for strategic national freight transport modeling. (arXiv:2304.14001v1 [econ.GN])",
    "abstract": "To achieve carbon emission targets worldwide, decarbonization of the freight transport sector will be an important factor. To this end, national governments must make plans that facilitate this transition. National freight transport models are a useful tool to assess what the effects of various policies and investments may be. The state of the art consists of very detailed, static models. While useful for short-term policy assessment, these models are less suitable for the long-term planning necessary to facilitate the transition to low-carbon transportation in the upcoming decades.  In this paper, we fill this gap by developing a framework for strategic national freight transport modeling, which we call STraM, and which can be characterized as a multi-period stochastic network design model, based on a multimodal freight transport formulation. In STraM, we explicitly include several aspects that are lacking in state-of-the art national freight transport models: the dynamic nature of lo",
    "link": "http://arxiv.org/abs/2304.14001",
    "context": "Title: STraM: a framework for strategic national freight transport modeling. (arXiv:2304.14001v1 [econ.GN])\nAbstract: To achieve carbon emission targets worldwide, decarbonization of the freight transport sector will be an important factor. To this end, national governments must make plans that facilitate this transition. National freight transport models are a useful tool to assess what the effects of various policies and investments may be. The state of the art consists of very detailed, static models. While useful for short-term policy assessment, these models are less suitable for the long-term planning necessary to facilitate the transition to low-carbon transportation in the upcoming decades.  In this paper, we fill this gap by developing a framework for strategic national freight transport modeling, which we call STraM, and which can be characterized as a multi-period stochastic network design model, based on a multimodal freight transport formulation. In STraM, we explicitly include several aspects that are lacking in state-of-the art national freight transport models: the dynamic nature of lo",
    "path": "papers/23/04/2304.14001.json",
    "total_tokens": 868,
    "translated_title": "STraM: 一个战略性国家货运运输建模框架",
    "translated_abstract": "为了实现全球碳排放目标，货运运输部门的脱碳将是一个重要因素。为此，各国政府必须制定计划以促进这一转变。国家货运运输模型是评估各种政策和投资可能产生的影响的有用工具。现有技术水平包括非常详细的静态模型。虽然对于短期政策评估有用，但这些模型不太适合为促进未来数十年的低碳交通转型所必需的长期规划。在本文中，我们通过开发一个名为STraM的战略性国家货运运输建模框架来填补这一差距，其可被描述为基于多模式货运运输公式的多期随机网络设计模型。在STraM中，我们明确包含了几个现有国家货运运输模型缺乏的方面：货物流的动态性和它对环境、能源和经济的影响。",
    "tldr": "STraM为长期规划提供了更具动态性的国家货运运输建模框架，可以评估政策和投资措施对环境、能源和经济的影响。",
    "en_tdlr": "STraM provides a more dynamic national freight transport modeling framework for long-term planning that can assess the impact of policies and investment measures on the environment, energy, and economy."
}