{
    "title": "Dynamic Datasets and Market Environments for Financial Reinforcement Learning. (arXiv:2304.13174v1 [cs.LG])",
    "abstract": "The financial market is a particularly challenging playground for deep reinforcement learning due to its unique feature of dynamic datasets. Building high-quality market environments for training financial reinforcement learning (FinRL) agents is difficult due to major factors such as the low signal-to-noise ratio of financial data, survivorship bias of historical data, and model overfitting. In this paper, we present FinRL-Meta, a data-centric and openly accessible library that processes dynamic datasets from real-world markets into gym-style market environments and has been actively maintained by the AI4Finance community. First, following a DataOps paradigm, we provide hundreds of market environments through an automatic data curation pipeline. Second, we provide homegrown examples and reproduce popular research papers as stepping stones for users to design new trading strategies. We also deploy the library on cloud platforms so that users can visualize their own results and assess t",
    "link": "http://arxiv.org/abs/2304.13174",
    "context": "Title: Dynamic Datasets and Market Environments for Financial Reinforcement Learning. (arXiv:2304.13174v1 [cs.LG])\nAbstract: The financial market is a particularly challenging playground for deep reinforcement learning due to its unique feature of dynamic datasets. Building high-quality market environments for training financial reinforcement learning (FinRL) agents is difficult due to major factors such as the low signal-to-noise ratio of financial data, survivorship bias of historical data, and model overfitting. In this paper, we present FinRL-Meta, a data-centric and openly accessible library that processes dynamic datasets from real-world markets into gym-style market environments and has been actively maintained by the AI4Finance community. First, following a DataOps paradigm, we provide hundreds of market environments through an automatic data curation pipeline. Second, we provide homegrown examples and reproduce popular research papers as stepping stones for users to design new trading strategies. We also deploy the library on cloud platforms so that users can visualize their own results and assess t",
    "path": "papers/23/04/2304.13174.json",
    "total_tokens": 768,
    "translated_abstract": "金融市场由于其独特的动态数据集而对深度强化学习提出了特殊的挑战。构建高质量的市场环境以训练金融强化学习代理人很困难，其中包括金融数据的低信噪比，历史数据的存活偏差和模型过拟合等主要因素。本文介绍了FinRL-Meta，这是一个以数据为中心、公开可访问的库，将来自现实市场的动态数据集处理成gym-style市场环境，并由AI4Finance社区积极维护。",
    "tldr": "本文提出了FinRL-Meta库，通过DataOps范例提供了数百个市场环境，开发人员可以基于这些环境设计新的交易策略，并使用云平台来可视化结果和评估模型性能。",
    "en_tdlr": "This paper introduces the FinRL-Meta library, which provides hundreds of market environments via a DataOps pipeline for developing new trading strategies in dynamic financial datasets, and can be easily deployed on cloud platforms for result visualization and model evaluation."
}