{
    "title": "{\\Pi}-ML: A dimensional analysis-based machine learning parameterization of optical turbulence in the atmospheric surface layer. (arXiv:2304.12177v2 [physics.ao-ph] UPDATED)",
    "abstract": "Turbulent fluctuations of the atmospheric refraction index, so-called optical turbulence, can significantly distort propagating laser beams. Therefore, modeling the strength of these fluctuations ($C_n^2$) is highly relevant for the successful development and deployment of future free-space optical communication links. In this letter, we propose a physics-informed machine learning (ML) methodology, $\\Pi$-ML, based on dimensional analysis and gradient boosting to estimate $C_n^2$. Through a systematic feature importance analysis, we identify the normalized variance of potential temperature as the dominating feature for predicting $C_n^2$. For statistical robustness, we train an ensemble of models which yields high performance on the out-of-sample data of $R^2=0.958\\pm0.001$.",
    "link": "http://arxiv.org/abs/2304.12177",
    "context": "Title: {\\Pi}-ML: A dimensional analysis-based machine learning parameterization of optical turbulence in the atmospheric surface layer. (arXiv:2304.12177v2 [physics.ao-ph] UPDATED)\nAbstract: Turbulent fluctuations of the atmospheric refraction index, so-called optical turbulence, can significantly distort propagating laser beams. Therefore, modeling the strength of these fluctuations ($C_n^2$) is highly relevant for the successful development and deployment of future free-space optical communication links. In this letter, we propose a physics-informed machine learning (ML) methodology, $\\Pi$-ML, based on dimensional analysis and gradient boosting to estimate $C_n^2$. Through a systematic feature importance analysis, we identify the normalized variance of potential temperature as the dominating feature for predicting $C_n^2$. For statistical robustness, we train an ensemble of models which yields high performance on the out-of-sample data of $R^2=0.958\\pm0.001$.",
    "path": "papers/23/04/2304.12177.json",
    "total_tokens": 918,
    "translated_title": "{\\Pi}-ML：基于尺寸分析的大气表层光学湍流机器学习参数化",
    "translated_abstract": "大气折射率的湍流波动，即光学湍流，可以导致激光束的显著扭曲。因此，建立模型来估计这些波动的强度 ($C_n^2$) 对于成功开发和部署未来自由空间光通信链路非常重要。在本文中，我们提出了一种基于尺寸分析和梯度提升的物理信息机器学习 (ML) 方法 $\\Pi$-ML 来估计 $C_n^2$。通过系统的特征重要性分析，我们确定了潜在温度归一化方差作为预测 $C_n^2$ 的主要特征。为了保证统计鲁棒性，我们训练了一个模型集合，该集合在 $R^2=0.958\\pm0.001$ 的样本外数据上表现出高性能。",
    "tldr": "{\\Pi}-ML是一种基于尺寸分析的机器学习方法，用于估计大气表层光学湍流的强度($C_n^2$)。 物理属性的特征分析表明，潜在温度的归一化方差是预测 $C_n^2$ 的关键特征。 通过训练模型集合，我们在样本外数据上取得了高性能。",
    "en_tdlr": "{\\Pi}-ML is a machine learning method based on dimensional analysis for estimating the strength of optical turbulence in the atmospheric surface layer ($C_n^2$). The feature importance analysis reveals that the normalized variance of potential temperature is the key feature for predicting $C_n^2$. By training an ensemble of models, we achieve high performance on out-of-sample data."
}