{
    "title": "Early Detection of Parkinson's Disease using Motor Symptoms and Machine Learning. (arXiv:2304.09245v1 [cs.LG])",
    "abstract": "Parkinson's disease (PD) has been found to affect 1 out of every 1000 people, being more inclined towards the population above 60 years. Leveraging wearable-systems to find accurate biomarkers for diagnosis has become the need of the hour, especially for a neurodegenerative condition like Parkinson's. This work aims at focusing on early-occurring, common symptoms, such as motor and gait related parameters to arrive at a quantitative analysis on the feasibility of an economical and a robust wearable device. A subset of the Parkinson's Progression Markers Initiative (PPMI), PPMI Gait dataset has been utilised for feature-selection after a thorough analysis with various Machine Learning algorithms. Identified influential features has then been used to test real-time data for early detection of Parkinson Syndrome, with a model accuracy of 91.9%",
    "link": "http://arxiv.org/abs/2304.09245",
    "context": "Title: Early Detection of Parkinson's Disease using Motor Symptoms and Machine Learning. (arXiv:2304.09245v1 [cs.LG])\nAbstract: Parkinson's disease (PD) has been found to affect 1 out of every 1000 people, being more inclined towards the population above 60 years. Leveraging wearable-systems to find accurate biomarkers for diagnosis has become the need of the hour, especially for a neurodegenerative condition like Parkinson's. This work aims at focusing on early-occurring, common symptoms, such as motor and gait related parameters to arrive at a quantitative analysis on the feasibility of an economical and a robust wearable device. A subset of the Parkinson's Progression Markers Initiative (PPMI), PPMI Gait dataset has been utilised for feature-selection after a thorough analysis with various Machine Learning algorithms. Identified influential features has then been used to test real-time data for early detection of Parkinson Syndrome, with a model accuracy of 91.9%",
    "path": "papers/23/04/2304.09245.json",
    "total_tokens": 889,
    "translated_title": "利用运动症状和机器学习进行帕金森病的早期检测",
    "translated_abstract": "帕金森病(PD)已经发现影响到每1000人中的1个人，更倾向于60岁以上的人群。利用可穿戴设备寻找准确的诊断生物标志物已成为时代的需求，特别是对于像帕金森这样的神经退行性疾病。本文旨在关注早期发生的常见症状，如运动和步态相关参数，以便对经济和稳健的可穿戴设备的可行性进行定量分析。经过各种机器学习算法的彻底分析，利用帕金森疾病进展标志倡议 (PPMI) 的一个子集PPMI步态数据集进行特征选择。确认的重要特征已被用于测试实时数据以早期检测帕金森综合症，模型准确率达91.9％。",
    "tldr": "本研究利用机器学习算法分析运动症状和步态相关参数，以筛选出有效的生物标志物，进而实现帕金森病的早期检测。该方法基于经济和稳健的可穿戴设备，模型准确率高达91.9％。",
    "en_tdlr": "This study uses machine learning algorithms to analyze motor symptoms and gait-related parameters to screen for effective biomarkers and achieve early detection of Parkinson's disease. The method is based on an economical and robust wearable device and has an accuracy rate of 91.9%."
}