{
    "title": "Reconstructing firm-level input-output networks from partial information. (arXiv:2304.00081v1 [econ.GN])",
    "abstract": "There is a large consensus on the fundamental role of firm-level supply chain networks in macroeconomics. However, data on supply chains at the fine-grained, firm level are scarce and frequently incomplete. For listed firms, some commercial datasets exist but only contain information about the existence of a trade relationship between two companies, not the value of the monetary transaction. We use a recently developed maximum entropy method to reconstruct the values of the transactions based on information about their existence and aggregate information disclosed by firms in financial statements. We test the method on the administrative dataset of Ecuador and reconstruct a commercial dataset (FactSet). We test the method's performance on the weights, the technical and allocation coefficients (microscale quantities), two measures of firms' systemic importance and GDP volatility. The method reconstructs the distribution of microscale quantities reasonably well but shows diverging result",
    "link": "http://arxiv.org/abs/2304.00081",
    "context": "Title: Reconstructing firm-level input-output networks from partial information. (arXiv:2304.00081v1 [econ.GN])\nAbstract: There is a large consensus on the fundamental role of firm-level supply chain networks in macroeconomics. However, data on supply chains at the fine-grained, firm level are scarce and frequently incomplete. For listed firms, some commercial datasets exist but only contain information about the existence of a trade relationship between two companies, not the value of the monetary transaction. We use a recently developed maximum entropy method to reconstruct the values of the transactions based on information about their existence and aggregate information disclosed by firms in financial statements. We test the method on the administrative dataset of Ecuador and reconstruct a commercial dataset (FactSet). We test the method's performance on the weights, the technical and allocation coefficients (microscale quantities), two measures of firms' systemic importance and GDP volatility. The method reconstructs the distribution of microscale quantities reasonably well but shows diverging result",
    "path": "papers/23/04/2304.00081.json",
    "total_tokens": 845,
    "translated_title": "从部分信息中重构公司级别的投入产出网络",
    "translated_abstract": "在宏观经济学中，人们普遍认为公司级别的供应链网络起着基础性的作用。然而，关于公司级别供应链的数据往往是缺乏和不完整的。对于上市公司，已有一些商业数据集，但只包含两家公司之间存在贸易关系的信息，而没有货币交易价值的信息。我们使用最大熵方法来根据存在的信息以及公司财报中披露的聚合信息来重构交易价值。我们在厄瓜多尔的行政数据集上测试了该方法，并重构了一个商业数据集（FactSet）。我们测试了该方法在权重、技术和分配系数（微观量）、公司系统重要性和GDP波动率两个量度上的性能。该方法在合理范围内重构了微观量的分布，但结果存在差异。",
    "tldr": "该论文介绍了一种从不完整信息中重构公司级别投入产出网络的最大熵方法。作者将这一方法应用到了厄瓜多尔的行政数据集中，并用结果构建了一个商业数据集，结果表明该方法在重构微观量分布方面具有很好的性能。",
    "en_tdlr": "This paper presents a maximum entropy method for reconstructing firm-level input-output networks from incomplete information. The authors applied this method to an administrative dataset of Ecuador and constructed a commercial dataset, demonstrating good performance in reconstructing the distribution of microscale quantities."
}