{
    "title": "Multi-kernel Correntropy-based Orientation Estimation of IMUs: Gradient Descent Methods. (arXiv:2304.06548v1 [eess.SY])",
    "abstract": "This paper presents two computationally efficient algorithms for the orientation estimation of inertial measurement units (IMUs): the correntropy-based gradient descent (CGD) and the correntropy-based decoupled orientation estimation (CDOE). Traditional methods, such as gradient descent (GD) and decoupled orientation estimation (DOE), rely on the mean squared error (MSE) criterion, making them vulnerable to external acceleration and magnetic interference. To address this issue, we demonstrate that the multi-kernel correntropy loss (MKCL) is an optimal objective function for maximum likelihood estimation (MLE) when the noise follows a type of heavy-tailed distribution. In certain situations, the estimation error of the MKCL is bounded even in the presence of arbitrarily large outliers. By replacing the standard MSE cost function with MKCL, we develop the CGD and CDOE algorithms. We evaluate the effectiveness of our proposed methods by comparing them with existing algorithms in various s",
    "link": "http://arxiv.org/abs/2304.06548",
    "context": "Title: Multi-kernel Correntropy-based Orientation Estimation of IMUs: Gradient Descent Methods. (arXiv:2304.06548v1 [eess.SY])\nAbstract: This paper presents two computationally efficient algorithms for the orientation estimation of inertial measurement units (IMUs): the correntropy-based gradient descent (CGD) and the correntropy-based decoupled orientation estimation (CDOE). Traditional methods, such as gradient descent (GD) and decoupled orientation estimation (DOE), rely on the mean squared error (MSE) criterion, making them vulnerable to external acceleration and magnetic interference. To address this issue, we demonstrate that the multi-kernel correntropy loss (MKCL) is an optimal objective function for maximum likelihood estimation (MLE) when the noise follows a type of heavy-tailed distribution. In certain situations, the estimation error of the MKCL is bounded even in the presence of arbitrarily large outliers. By replacing the standard MSE cost function with MKCL, we develop the CGD and CDOE algorithms. We evaluate the effectiveness of our proposed methods by comparing them with existing algorithms in various s",
    "path": "papers/23/04/2304.06548.json",
    "total_tokens": 992,
    "translated_title": "基于多核重对比损失的IMU定向估计：梯度下降法",
    "translated_abstract": "本文介绍了两个计算效率高的算法，用于惯性测量单元（IMUs）的定向估计：重对比梯度下降（CGD）和重对比解耦定向估计（CDOE）。传统方法，如梯度下降（GD）和解耦定向估计（DOE），依赖于均方误差（MSE）准则，使其容易受到外部加速度和磁干扰的影响。为解决这个问题，我们证明了当噪声遵循一种重尾分布时，多核重对比损失（MKCL）是最优的极大似然估计（MLE）目标函数。在某些情况下，即使存在任意大的离群值，MKCL的估计误差也是有界的。通过用MKCL替换标准MSE成本函数，我们开发了CGD和CDOE算法。我们通过比较这些方法在各种传感器设置和运动场景中的表现来评估它们的有效性。实验结果表明，CGD和CDOE在精度、健壮性和计算效率方面均达到了卓越的表现。",
    "tldr": "本文提出了两种基于重对比损失的算法，用于IMU定向估计，相比传统方法具有更好的准确性、鲁棒性和计算效率。",
    "en_tdlr": "This paper proposes two correntropy-based algorithms for IMU orientation estimation, which outperform traditional methods in accuracy, robustness, and computational efficiency. By using the multi-kernel correntropy loss function, the proposed algorithms are able to handle heavy-tailed noise distributions and large outliers."
}