{
    "title": "Analog Feedback-Controlled Memristor programming Circuit for analog Content Addressable Memory. (arXiv:2304.11030v1 [cs.ET])",
    "abstract": "Recent breakthroughs in associative memories suggest that silicon memories are coming closer to human memories, especially for memristive Content Addressable Memories (CAMs) which are capable to read and write in analog values. However, the Program-Verify algorithm, the state-of-the-art memristor programming algorithm, requires frequent switching between verifying and programming memristor conductance, which brings many defects such as high dynamic power and long programming time. Here, we propose an analog feedback-controlled memristor programming circuit that makes use of a novel look-up table-based (LUT-based) programming algorithm. With the proposed algorithm, the programming and the verification of a memristor can be performed in a single-direction sequential process. Besides, we also integrated a single proposed programming circuit with eight analog CAM (aCAM) cells to build an aCAM array. We present SPICE simulations on TSMC 28nm process. The theoretical analysis shows that 1. A",
    "link": "http://arxiv.org/abs/2304.11030",
    "context": "Title: Analog Feedback-Controlled Memristor programming Circuit for analog Content Addressable Memory. (arXiv:2304.11030v1 [cs.ET])\nAbstract: Recent breakthroughs in associative memories suggest that silicon memories are coming closer to human memories, especially for memristive Content Addressable Memories (CAMs) which are capable to read and write in analog values. However, the Program-Verify algorithm, the state-of-the-art memristor programming algorithm, requires frequent switching between verifying and programming memristor conductance, which brings many defects such as high dynamic power and long programming time. Here, we propose an analog feedback-controlled memristor programming circuit that makes use of a novel look-up table-based (LUT-based) programming algorithm. With the proposed algorithm, the programming and the verification of a memristor can be performed in a single-direction sequential process. Besides, we also integrated a single proposed programming circuit with eight analog CAM (aCAM) cells to build an aCAM array. We present SPICE simulations on TSMC 28nm process. The theoretical analysis shows that 1. A",
    "path": "papers/23/04/2304.11030.json",
    "total_tokens": 937,
    "translated_title": "用于模拟内容可寻址存储器的模拟反馈控制忆阻器编程电路",
    "translated_abstract": "最近的联想存储器突破表明，硅存储器正越来越接近人类记忆，特别是对于能够读写模拟值的忆阻器内容可寻址存储器（CAM）。然而，现有的忆阻器编程算法需要频繁地在验证和编程忆阻器导纳之间进行切换，这带来许多缺陷，如高动态功率和长的编程时间。本文提出了一种模拟反馈控制忆阻器编程电路，该电路采用新颖的基于查找表的编程算法。使用所提出的算法，可以在单向顺序过程中执行忆阻器的编程和验证。此外，我们还将单个所提出的编程电路与8个模拟CAM（aCAM）单元集成，以构建aCAM阵列。我们在TSMC 28nm工艺上进行了SPICE仿真。理论分析表明：1. A",
    "tldr": "本文提出了一种模拟反馈控制忆阻器编程电路，使用新颖的基于查找表的编程算法，可以在单向顺序过程中执行忆阻器的编程和验证，解决了现有算法中频繁切换带来的高动态功率和长编程时间的缺陷。",
    "en_tdlr": "This paper proposes an analog feedback-controlled memristor programming circuit, which uses a novel lookup table-based programming algorithm to perform programming and verification of a memristor in a single-direction sequential process, solving the issues of high dynamic power and long programming time caused by frequent switching in existing algorithms."
}