{
    "title": "Quantifying the Benefit of Artificial Intelligence for Scientific Research. (arXiv:2304.10578v1 [cs.DL])",
    "abstract": "The ongoing artificial intelligence (AI) revolution has the potential to change almost every line of work. As AI capabilities continue to improve in accuracy, robustness, and reach, AI may outperform and even replace human experts across many valuable tasks. Despite enormous efforts devoted to understanding AI's impact on labor and the economy and its recent success in accelerating scientific discovery and progress, we lack a systematic understanding of how advances in AI may benefit scientific research across disciplines and fields. Here we develop a measurement framework to estimate both the direct use of AI and the potential benefit of AI in scientific research by applying natural language processing techniques to 87.6 million publications and 7.1 million patents. We find that the use of AI in research appears widespread throughout the sciences, growing especially rapidly since 2015, and papers that use AI exhibit an impact premium, more likely to be highly cited both within and out",
    "link": "http://arxiv.org/abs/2304.10578",
    "context": "Title: Quantifying the Benefit of Artificial Intelligence for Scientific Research. (arXiv:2304.10578v1 [cs.DL])\nAbstract: The ongoing artificial intelligence (AI) revolution has the potential to change almost every line of work. As AI capabilities continue to improve in accuracy, robustness, and reach, AI may outperform and even replace human experts across many valuable tasks. Despite enormous efforts devoted to understanding AI's impact on labor and the economy and its recent success in accelerating scientific discovery and progress, we lack a systematic understanding of how advances in AI may benefit scientific research across disciplines and fields. Here we develop a measurement framework to estimate both the direct use of AI and the potential benefit of AI in scientific research by applying natural language processing techniques to 87.6 million publications and 7.1 million patents. We find that the use of AI in research appears widespread throughout the sciences, growing especially rapidly since 2015, and papers that use AI exhibit an impact premium, more likely to be highly cited both within and out",
    "path": "papers/23/04/2304.10578.json",
    "total_tokens": 962,
    "translated_title": "量化人工智能在科学研究中的益处",
    "translated_abstract": "持续不断的人工智能（AI）革命有可能改变几乎所有的行业。随着AI能力的提高，精度、鲁棒性和应用范围的增加，AI可能会在许多有价值的任务上超过甚至取代人类专家。尽管人们不断努力研究AI对劳动力和经济的影响，以及它在促进科学发现和进步方面的最近成功，但我们缺乏一个系统的理解，即AI的进步如何在不同学科和领域中受益于科学研究。在此，我们开发了一个衡量框架，通过将自然语言处理技术应用于87.6百万篇论文和7.1百万份专利，来估计AI的直接使用和潜在受益。我们发现，AI在研究中的应用似乎在所有科学领域中普遍，特别是自2015年以来开始迅速增长，并且使用AI的论文具有更高的影响力，更可能在内外部被高度引用。",
    "tldr": "该篇论文通过将自然语言处理技术应用于数百万篇文献来估计人工智能的直接使用和潜在受益，发现人工智能在科学研究中的应用似乎在所有科学领域中普遍，使用人工智能的论文具有更高的影响力。",
    "en_tdlr": "This paper develops a measurement framework to estimate the direct use and potential benefits of artificial intelligence (AI) in scientific research by applying natural language processing techniques to millions of publications and patents, and finds the use of AI to be widespread across all scientific fields, with papers that use AI exhibiting a higher impact."
}