{
    "title": "Gradient-based Maximally Interfered Retrieval for Domain Incremental 3D Object Detection. (arXiv:2304.14460v1 [cs.CV])",
    "abstract": "Accurate 3D object detection in all weather conditions remains a key challenge to enable the widespread deployment of autonomous vehicles, as most work to date has been performed on clear weather data. In order to generalize to adverse weather conditions, supervised methods perform best if trained from scratch on all weather data instead of finetuning a model pretrained on clear weather data. Training from scratch on all data will eventually become computationally infeasible and expensive as datasets continue to grow and encompass the full extent of possible weather conditions. On the other hand, naive finetuning on data from a different weather domain can result in catastrophic forgetting of the previously learned domain. Inspired by the success of replay-based continual learning methods, we propose Gradient-based Maximally Interfered Retrieval (GMIR), a gradient based sampling strategy for replay. During finetuning, GMIR periodically retrieves samples from the previous domain dataset",
    "link": "http://arxiv.org/abs/2304.14460",
    "context": "Title: Gradient-based Maximally Interfered Retrieval for Domain Incremental 3D Object Detection. (arXiv:2304.14460v1 [cs.CV])\nAbstract: Accurate 3D object detection in all weather conditions remains a key challenge to enable the widespread deployment of autonomous vehicles, as most work to date has been performed on clear weather data. In order to generalize to adverse weather conditions, supervised methods perform best if trained from scratch on all weather data instead of finetuning a model pretrained on clear weather data. Training from scratch on all data will eventually become computationally infeasible and expensive as datasets continue to grow and encompass the full extent of possible weather conditions. On the other hand, naive finetuning on data from a different weather domain can result in catastrophic forgetting of the previously learned domain. Inspired by the success of replay-based continual learning methods, we propose Gradient-based Maximally Interfered Retrieval (GMIR), a gradient based sampling strategy for replay. During finetuning, GMIR periodically retrieves samples from the previous domain dataset",
    "path": "papers/23/04/2304.14460.json",
    "total_tokens": 887,
    "translated_title": "基于梯度的最大干扰恢复的域增量3D物体检测",
    "translated_abstract": "在所有天气条件下实现准确的3D物体检测仍然是实现自主车辆广泛部署的关键挑战，因为目前大部分工作是在清晰的天气数据上进行的。为了推广到逆境天气条件，监督方法在所有天气数据上从头开始训练表现得最好，而不是在清晰天气数据上微调预训练模型。但是，从所有数据开始训练最终会因数据集不断增长并包含了所有可能的天气条件而变得不可行和昂贵。而在不同天气领域的原始数据上进行简单的微调可能会导致对先前学习领域的灾难性遗忘。受回放式连续学习方法的成功启发，我们提出了基于梯度的最大干扰恢复（GMIR），这是一种对回放进行梯度采样的策略。在微调过程中，GMIR会定期从以前的领域数据集中检索样本。",
    "tldr": "对于域增量3D物体检测，GMIR提出了一种基于梯度的最大干扰恢复策略，可在微调时定期从以前的领域数据集中检索样本。",
    "en_tdlr": "GMIR proposes a gradient-based maximal interfered retrieval strategy for domain incremental 3D object detection, which periodically retrieves samples from the previous domain dataset during finetuning."
}