{
    "title": "ML-Enabled Outdoor User Positioning in 5G NR Systems via Uplink SRS Channel Estimates. (arXiv:2304.06514v1 [eess.SP])",
    "abstract": "Cellular user positioning is a promising service provided by Fifth Generation New Radio (5G NR) networks. Besides, Machine Learning (ML) techniques are foreseen to become an integrated part of 5G NR systems improving radio performance and reducing complexity. In this paper, we investigate ML techniques for positioning using 5G NR fingerprints consisting of uplink channel estimates from the physical layer channel. We show that it is possible to use Sounding Reference Signals (SRS) channel fingerprints to provide sufficient data to infer user position. Furthermore, we show that small fully-connected moderately Deep Neural Networks, even when applied to very sparse SRS data, can achieve successful outdoor user positioning with meter-level accuracy in a commercial 5G environment.",
    "link": "http://arxiv.org/abs/2304.06514",
    "context": "Title: ML-Enabled Outdoor User Positioning in 5G NR Systems via Uplink SRS Channel Estimates. (arXiv:2304.06514v1 [eess.SP])\nAbstract: Cellular user positioning is a promising service provided by Fifth Generation New Radio (5G NR) networks. Besides, Machine Learning (ML) techniques are foreseen to become an integrated part of 5G NR systems improving radio performance and reducing complexity. In this paper, we investigate ML techniques for positioning using 5G NR fingerprints consisting of uplink channel estimates from the physical layer channel. We show that it is possible to use Sounding Reference Signals (SRS) channel fingerprints to provide sufficient data to infer user position. Furthermore, we show that small fully-connected moderately Deep Neural Networks, even when applied to very sparse SRS data, can achieve successful outdoor user positioning with meter-level accuracy in a commercial 5G environment.",
    "path": "papers/23/04/2304.06514.json",
    "total_tokens": 805,
    "translated_title": "通过上行SRS通道估计在5G NR系统中实现的ML辅助室外用户定位",
    "translated_abstract": "手机用户的定位是5G NR网络提供的一项重要服务，同时，机器学习技术被预见将成为5G NR系统的集成部分，可提高无线电性能并减少复杂度。本文探讨了使用来自物理层通道的上行信道估计构成的5G NR指纹进行定位的ML技术。我们展示了使用探测参考信号（SRS）信道指纹提供足够的数据推断用户位置是可能的。此外，我们还证明即使在非常稀疏的SRS数据情况下，小型全连接较深的神经网络也可以在商用5G环境中实现具有米级精度的成功室外用户定位。",
    "tldr": "本文研究了通过机器学习技术在5G NR系统中使用上行SRS信道估计进行用户定位，证明了在商用5G环境中即使使用很少的数据，也可以用小型神经网络实现具有米级精度的室外用户定位。",
    "en_tdlr": "This paper investigates the use of Machine Learning techniques for user positioning in 5G NR systems using uplink channel estimates, and demonstrates that it is possible to achieve successful outdoor user positioning with meter-level accuracy in commercial 5G environments even with small neural networks applied to very sparse data."
}