{
    "title": "Personalized State Anxiety Detection: An Empirical Study with Linguistic Biomarkers and A Machine Learning Pipeline. (arXiv:2304.09928v1 [cs.HC])",
    "abstract": "Individuals high in social anxiety symptoms often exhibit elevated state anxiety in social situations. Research has shown it is possible to detect state anxiety by leveraging digital biomarkers and machine learning techniques. However, most existing work trains models on an entire group of participants, failing to capture individual differences in their psychological and behavioral responses to social contexts. To address this concern, in Study 1, we collected linguistic data from N=35 high socially anxious participants in a variety of social contexts, finding that digital linguistic biomarkers significantly differ between evaluative vs. non-evaluative social contexts and between individuals having different trait psychological symptoms, suggesting the likely importance of personalized approaches to detect state anxiety. In Study 2, we used the same data and results from Study 1 to model a multilayer personalized machine learning pipeline to detect state anxiety that considers contextu",
    "link": "http://arxiv.org/abs/2304.09928",
    "context": "Title: Personalized State Anxiety Detection: An Empirical Study with Linguistic Biomarkers and A Machine Learning Pipeline. (arXiv:2304.09928v1 [cs.HC])\nAbstract: Individuals high in social anxiety symptoms often exhibit elevated state anxiety in social situations. Research has shown it is possible to detect state anxiety by leveraging digital biomarkers and machine learning techniques. However, most existing work trains models on an entire group of participants, failing to capture individual differences in their psychological and behavioral responses to social contexts. To address this concern, in Study 1, we collected linguistic data from N=35 high socially anxious participants in a variety of social contexts, finding that digital linguistic biomarkers significantly differ between evaluative vs. non-evaluative social contexts and between individuals having different trait psychological symptoms, suggesting the likely importance of personalized approaches to detect state anxiety. In Study 2, we used the same data and results from Study 1 to model a multilayer personalized machine learning pipeline to detect state anxiety that considers contextu",
    "path": "papers/23/04/2304.09928.json",
    "total_tokens": 933,
    "translated_title": "个性化状态焦虑检测：基于语言生物标志物和机器学习流程的实证研究",
    "translated_abstract": "高社交焦虑症状的人往往在社交场合中表现出较高的状态焦虑。研究表明，利用数字生物标志物和机器学习技术可以检测状态焦虑。然而，大多数现有工作是在整个参与者群体上训练模型，未能捕捉到他们的心理和行为反应在社交环境中的个体差异。为了解决这个问题，在第一项研究中，我们收集了来自35名高社交焦虑参与者在各种社交环境中的语言数据，发现数字语言生物标志物在评价性与非评价性社交环境下以及在具有不同特质心理症状的个体之间显著不同，这表明个性化方法检测状态焦虑的重要性。在第二项研究中，我们使用相同的数据和第一项研究的结果来建立多层个性化机器学习流程来检测状态焦虑，考虑上下文。",
    "tldr": "该论文研究了个性化状态焦虑检测，利用数字生物标志物和机器学习技术检测状态焦虑，并通过多层个性化机器学习流程，考虑上下文，从而更好地捕捉个体之间的心理和行为反应的差异。",
    "en_tdlr": "This paper investigates personalized state anxiety detection by leveraging digital biomarkers and machine learning techniques, and proposes a personalized machine learning pipeline that takes context into account to better capture individual differences in psychological and behavioral responses."
}