{
    "title": "Automatic Geo-alignment of Artwork in Children's Story Books. (arXiv:2304.01204v1 [cs.AI])",
    "abstract": "A study was conducted to prove AI software could be used to translate and generate illustrations without any human intervention. This was done with the purpose of showing and distributing it to the external customer, Pratham Books. The project aligns with the company's vision by leveraging the generalisation and scalability of Machine Learning algorithms, offering significant cost efficiency increases to a wide range of literary audiences in varied geographical locations. A comparative study methodology was utilised to determine the best performant method out of the 3 devised, Prompt Augmentation using Keywords, CLIP Embedding Mask, and Cross Attention Control with Editorial Prompts. A thorough evaluation process was completed using both quantitative and qualitative measures. Each method had its own strengths and weaknesses, but through the evaluation, method 1 was found to have the best yielding results. Promising future advancements may be made to further increase image quality by in",
    "link": "http://arxiv.org/abs/2304.01204",
    "context": "Title: Automatic Geo-alignment of Artwork in Children's Story Books. (arXiv:2304.01204v1 [cs.AI])\nAbstract: A study was conducted to prove AI software could be used to translate and generate illustrations without any human intervention. This was done with the purpose of showing and distributing it to the external customer, Pratham Books. The project aligns with the company's vision by leveraging the generalisation and scalability of Machine Learning algorithms, offering significant cost efficiency increases to a wide range of literary audiences in varied geographical locations. A comparative study methodology was utilised to determine the best performant method out of the 3 devised, Prompt Augmentation using Keywords, CLIP Embedding Mask, and Cross Attention Control with Editorial Prompts. A thorough evaluation process was completed using both quantitative and qualitative measures. Each method had its own strengths and weaknesses, but through the evaluation, method 1 was found to have the best yielding results. Promising future advancements may be made to further increase image quality by in",
    "path": "papers/23/04/2304.01204.json",
    "total_tokens": 881,
    "translated_title": "儿童故事书中艺术作品的自动地理对准",
    "translated_abstract": "进行了一项研究，证明了可以使用AI软件在没有人类干预的情况下翻译和生成插图。这样做的目的是展示给外部客户Pratham Books并进行分发。该项目符合公司的愿景，利用机器学习算法的普适性和可扩展性，为广泛的文学受众在不同地理位置上提供显着的成本效益提高。采用比较研究方法，确定了3种方法中最佳性能的方法，包括使用关键字的提示增强，CLIP嵌入掩膜和带有编辑提示的交叉注意力控制。使用定量和定性措施完成了彻底的评估过程。每种方法都有自己的优点和缺点，但通过评估，发现方法1的产量最佳。未来有望进行有前途的进步，进一步提高图片质量。",
    "tldr": "这项研究证明AI软件可以在没有人类干预的情况下翻译和生成插图，通过比较研究，最佳的方法是使用关键字的提示增强。这对于向广泛的文学受众提供显着的成本效益提高具有重要意义。",
    "en_tdlr": "This study proves that AI software can translate and generate illustrations without any human intervention. Through comparative research, the best performing method is using keyword prompt augmentation. This has significant cost efficiency increases for a wide range of literary audiences."
}