{
    "title": "COUPA: An Industrial Recommender System for Online to Offline Service Platforms. (arXiv:2304.12549v1 [cs.IR])",
    "abstract": "Aiming at helping users locally discovery retail services (e.g., entertainment and dinning), Online to Offline (O2O) service platforms have become popular in recent years, which greatly challenge current recommender systems. With the real data in Alipay, a feeds-like scenario for O2O services, we find that recurrence based temporal patterns and position biases commonly exist in our scenarios, which seriously threaten the recommendation effectiveness. To this end, we propose COUPA, an industrial system targeting for characterizing user preference with following two considerations: (1) Time aware preference: we employ the continuous time aware point process equipped with an attention mechanism to fully capture temporal patterns for recommendation. (2) Position aware preference: a position selector component equipped with a position personalization module is elaborately designed to mitigate position bias in a personalized manner. Finally, we carefully implement and deploy COUPA on Alipay ",
    "link": "http://arxiv.org/abs/2304.12549",
    "context": "Title: COUPA: An Industrial Recommender System for Online to Offline Service Platforms. (arXiv:2304.12549v1 [cs.IR])\nAbstract: Aiming at helping users locally discovery retail services (e.g., entertainment and dinning), Online to Offline (O2O) service platforms have become popular in recent years, which greatly challenge current recommender systems. With the real data in Alipay, a feeds-like scenario for O2O services, we find that recurrence based temporal patterns and position biases commonly exist in our scenarios, which seriously threaten the recommendation effectiveness. To this end, we propose COUPA, an industrial system targeting for characterizing user preference with following two considerations: (1) Time aware preference: we employ the continuous time aware point process equipped with an attention mechanism to fully capture temporal patterns for recommendation. (2) Position aware preference: a position selector component equipped with a position personalization module is elaborately designed to mitigate position bias in a personalized manner. Finally, we carefully implement and deploy COUPA on Alipay ",
    "path": "papers/23/04/2304.12549.json",
    "total_tokens": 850,
    "translated_title": "COUPA: 一种面向在线到线下服务平台的工业级推荐系统",
    "translated_abstract": "在线到线下（O2O）服务平台旨在帮助用户在本地发现零售服务（例如娱乐和餐饮），近年来变得越来越流行，这极大地挑战了现有的推荐系统。本文基于支付宝平台的真实数据，针对O2O服务的特殊情景发现了递归基础上的时间模式和位置偏置普遍存在，严重影响了推荐效果。基于此，我们提出了COUPA，这是一个工业级系统，旨在通过考虑以下两个方面来表征用户偏好：(1)时间感知偏好：我们采用了具有注意机制的连续时间感知点过程，以完全捕捉推荐的时间模式。(2)位置感知偏好：一个配备了位置个性化模块的位置选择器组件被精心设计，以以个性化的方式减轻位置偏差。最后，我们仔细实现并部署COUPA在支付宝平台上。",
    "tldr": "COUPA是一个面向O2O服务平台的工业级推荐系统，通过时间感知偏好和位置感知偏好来提高推荐效果。",
    "en_tdlr": "COUPA is an industrial recommender system for O2O service platforms, which improves recommendation effectiveness through time-aware and position-aware preferences."
}