{
    "title": "The tale of two MS MARCO -- and their unfair comparisons. (arXiv:2304.12904v1 [cs.IR])",
    "abstract": "The MS MARCO-passage dataset has been the main large-scale dataset open to the IR community and it has fostered successfully the development of novel neural retrieval models over the years. But, it turns out that two different corpora of MS MARCO are used in the literature, the official one and a second one where passages were augmented with titles, mostly due to the introduction of the Tevatron code base. However, the addition of titles actually leaks relevance information, while breaking the original guidelines of the MS MARCO-passage dataset. In this work, we investigate the differences between the two corpora and demonstrate empirically that they make a significant difference when evaluating a new method. In other words, we show that if a paper does not properly report which version is used, reproducing fairly its results is basically impossible. Furthermore, given the current status of reviewing, where monitoring state-of-the-art results is of great importance, having two differen",
    "link": "http://arxiv.org/abs/2304.12904",
    "context": "Title: The tale of two MS MARCO -- and their unfair comparisons. (arXiv:2304.12904v1 [cs.IR])\nAbstract: The MS MARCO-passage dataset has been the main large-scale dataset open to the IR community and it has fostered successfully the development of novel neural retrieval models over the years. But, it turns out that two different corpora of MS MARCO are used in the literature, the official one and a second one where passages were augmented with titles, mostly due to the introduction of the Tevatron code base. However, the addition of titles actually leaks relevance information, while breaking the original guidelines of the MS MARCO-passage dataset. In this work, we investigate the differences between the two corpora and demonstrate empirically that they make a significant difference when evaluating a new method. In other words, we show that if a paper does not properly report which version is used, reproducing fairly its results is basically impossible. Furthermore, given the current status of reviewing, where monitoring state-of-the-art results is of great importance, having two differen",
    "path": "papers/23/04/2304.12904.json",
    "total_tokens": 935,
    "translated_title": "两个MS MARCO的故事--他们不公平的比较",
    "translated_abstract": "MS MARCO-passage 数据集是IR社区主要的大规模数据集，多年来它成功地推动了新型神经检索模型的发展。但是，事实证明文献中使用了两个不同的MS MARCO语料库，一个是官方版本，一个是加入了标题的第二个版本，主要是由于引入了Tevatron代码库。然而，添加标题实际上泄漏了相关信息，而且违反了MS MARCO-passage数据集的原始指南。在这项工作中，我们研究了两个版本之间的差异，并且通过实验证明，当评估新方法时，它们会产生显著的差异。换句话说，我们展示了如果一个论文没有恰当地报告所使用的版本，那么就基本上不可能公平地复现其结果。此外，鉴于当前审查的状态，监测最新进展是非常重要的，拥有两个不同版本的MS MARCO数据集可能会导致不公平的比较和信息检索领域不可靠的进展。",
    "tldr": "论文介绍了MS MARCO-passage数据集中包含公正性和可重复性的重要性，并指出了文献中使用了两个不同版本的数据集以及版本之间的差异，这可能导致不公平的比较和领域不可靠的进展。",
    "en_tdlr": "The paper highlights the importance of fairness and reproducibility in the MS MARCO-passage dataset and identifies the use of two different versions of the dataset in literature and their differences, which can lead to unfair comparisons and unreliable progress in the field."
}