{
    "title": "CAM2: Conformity-Aware Multi-Task Ranking Model for Large-Scale Recommender Systems. (arXiv:2304.08562v1 [cs.IR])",
    "abstract": "Learning large-scale industrial recommender system models by fitting them to historical user interaction data makes them vulnerable to conformity bias. This may be due to a number of factors, including the fact that user interests may be difficult to determine and that many items are often interacted with based on ecosystem factors other than their relevance to the individual user. In this work, we introduce CAM2, a conformity-aware multi-task ranking model to serve relevant items to users on one of the largest industrial recommendation platforms. CAM2 addresses these challenges systematically by leveraging causal modeling to disentangle users' conformity to popular items from their true interests. This framework is generalizable and can be scaled to support multiple representations of conformity and user relevance in any large-scale recommender system. We provide deeper practical insights and demonstrate the effectiveness of the proposed model through improvements in offline evaluatio",
    "link": "http://arxiv.org/abs/2304.08562",
    "context": "Title: CAM2: Conformity-Aware Multi-Task Ranking Model for Large-Scale Recommender Systems. (arXiv:2304.08562v1 [cs.IR])\nAbstract: Learning large-scale industrial recommender system models by fitting them to historical user interaction data makes them vulnerable to conformity bias. This may be due to a number of factors, including the fact that user interests may be difficult to determine and that many items are often interacted with based on ecosystem factors other than their relevance to the individual user. In this work, we introduce CAM2, a conformity-aware multi-task ranking model to serve relevant items to users on one of the largest industrial recommendation platforms. CAM2 addresses these challenges systematically by leveraging causal modeling to disentangle users' conformity to popular items from their true interests. This framework is generalizable and can be scaled to support multiple representations of conformity and user relevance in any large-scale recommender system. We provide deeper practical insights and demonstrate the effectiveness of the proposed model through improvements in offline evaluatio",
    "path": "papers/23/04/2304.08562.json",
    "total_tokens": 887,
    "translated_title": "CAM2: 面向大规模推荐系统的一致性感知多任务排名模型",
    "translated_abstract": "将历史用户交互数据拟合到大规模工业推荐系统模型中，可能会导致一致性偏见，因为用户兴趣可能很难确定，而许多项目通常基于生态系统因素而不是与个体用户相关性交互。在本研究中，我们引入了CAM2，这是一个一致性感知的多任务排名模型，旨在为其中一个最大的工业推荐平台向用户提供相关物品。CAM2通过利用因果建模系统地解开用户对流行物品的一致性与他们真正兴趣的联系。这个框架是可推广的，并且可以扩展以支持在任何大规模推荐系统中的多个一致性和用户相关性的表示。我们提供更深入的实践见解，并通过离线评估的改进来演示所提出模型的有效性。",
    "tldr": "CAM2是一个面向大规模推荐系统的一致性感知多任务排名模型，通过利用因果建模系统地解开用户对流行物品的一致性与他们真正兴趣的联系，来消除历史用户交互数据带来的一致性偏见，并在实践中得到有效的应用。",
    "en_tdlr": "CAM2 is a conformity-aware multi-task ranking model for large-scale recommender systems. It systematically addresses the issue of conformity bias caused by fitting historical user interaction data into recommender system models. CAM2 leverages causal modeling to disentangle users' conformity to popular items from their true interests and has been demonstrated to be effective in practical applications."
}