{
    "title": "CoReFusion: Contrastive Regularized Fusion for Guided Thermal Super-Resolution. (arXiv:2304.01243v1 [eess.IV])",
    "abstract": "Thermal imaging has numerous advantages over regular visible-range imaging since it performs well in low-light circumstances. Super-Resolution approaches can broaden their usefulness by replicating accurate high-resolution thermal pictures using measurements from low-cost, low-resolution thermal sensors. Because of the spectral range mismatch between the images, Guided Super-Resolution of thermal images utilizing visible range images is difficult. However, In case of failure to capture Visible Range Images can prevent the operations of applications in critical areas. We present a novel data fusion framework and regularization technique for Guided Super Resolution of Thermal images. The proposed architecture is computationally in-expensive and lightweight with the ability to maintain performance despite missing one of the modalities, i.e., high-resolution RGB image or the lower-resolution thermal image, and is designed to be robust in the presence of missing data. The proposed method pr",
    "link": "http://arxiv.org/abs/2304.01243",
    "context": "Title: CoReFusion: Contrastive Regularized Fusion for Guided Thermal Super-Resolution. (arXiv:2304.01243v1 [eess.IV])\nAbstract: Thermal imaging has numerous advantages over regular visible-range imaging since it performs well in low-light circumstances. Super-Resolution approaches can broaden their usefulness by replicating accurate high-resolution thermal pictures using measurements from low-cost, low-resolution thermal sensors. Because of the spectral range mismatch between the images, Guided Super-Resolution of thermal images utilizing visible range images is difficult. However, In case of failure to capture Visible Range Images can prevent the operations of applications in critical areas. We present a novel data fusion framework and regularization technique for Guided Super Resolution of Thermal images. The proposed architecture is computationally in-expensive and lightweight with the ability to maintain performance despite missing one of the modalities, i.e., high-resolution RGB image or the lower-resolution thermal image, and is designed to be robust in the presence of missing data. The proposed method pr",
    "path": "papers/23/04/2304.01243.json",
    "total_tokens": 997,
    "translated_title": "CoReFusion: 基于对比正则化融合实现热红外引导超分辨率",
    "translated_abstract": "热成像由于在低光情况下表现出色而比一般可见光成像具有更多优势。 超分辨率技术可以通过使用低成本、低分辨率的热成像传感器测量来复制准确的高分辨率热成像图片，而且在关键地区，无法捕捉到可见光再生能力的应用程序可能会失败。然而，由于成像光谱范围不一致，使用可见光图像进行热成像引导超分辨率很困难。我们提出了一种新颖的数据融合框架和正则化技术，用于热成像的引导超分辨率。所提出的体系结构在丢失一个模态（高分辨率RGB图像或更低分辨率的热成像）时仍具备计算效率和轻量级的特点，并且在数据缺失的情况下具备鲁棒性。该方法在基准数据集上提供了最先进的性能，并在视觉质量和客观指标方面优于现有方法。",
    "tldr": "本文提出了一种新颖的数据融合框架和正则化技术，用于热成像的引导超分辨率，具有计算效率，轻量级和鲁棒性，实现了在缺失数据的情况下性能不受影响，并且在基准数据集上表现出较高的性能。",
    "en_tdlr": "This paper proposes a novel data fusion framework and regularization technique for guided super resolution of thermal images, which is computationally efficient, lightweight, and robust in the presence of missing data. It achieves state-of-the-art performance on benchmark datasets and outperforms existing methods in terms of both visual quality and objective metrics."
}