{
    "title": "Learnable Pillar-based Re-ranking for Image-Text Retrieval. (arXiv:2304.12570v1 [cs.CV])",
    "abstract": "Image-text retrieval aims to bridge the modality gap and retrieve cross-modal content based on semantic similarities. Prior work usually focuses on the pairwise relations (i.e., whether a data sample matches another) but ignores the higher-order neighbor relations (i.e., a matching structure among multiple data samples). Re-ranking, a popular post-processing practice, has revealed the superiority of capturing neighbor relations in single-modality retrieval tasks. However, it is ineffective to directly extend existing re-ranking algorithms to image-text retrieval. In this paper, we analyze the reason from four perspectives, i.e., generalization, flexibility, sparsity, and asymmetry, and propose a novel learnable pillar-based re-ranking paradigm. Concretely, we first select top-ranked intra- and inter-modal neighbors as pillars, and then reconstruct data samples with the neighbor relations between them and the pillars. In this way, each sample can be mapped into a multimodal pillar space",
    "link": "http://arxiv.org/abs/2304.12570",
    "context": "Title: Learnable Pillar-based Re-ranking for Image-Text Retrieval. (arXiv:2304.12570v1 [cs.CV])\nAbstract: Image-text retrieval aims to bridge the modality gap and retrieve cross-modal content based on semantic similarities. Prior work usually focuses on the pairwise relations (i.e., whether a data sample matches another) but ignores the higher-order neighbor relations (i.e., a matching structure among multiple data samples). Re-ranking, a popular post-processing practice, has revealed the superiority of capturing neighbor relations in single-modality retrieval tasks. However, it is ineffective to directly extend existing re-ranking algorithms to image-text retrieval. In this paper, we analyze the reason from four perspectives, i.e., generalization, flexibility, sparsity, and asymmetry, and propose a novel learnable pillar-based re-ranking paradigm. Concretely, we first select top-ranked intra- and inter-modal neighbors as pillars, and then reconstruct data samples with the neighbor relations between them and the pillars. In this way, each sample can be mapped into a multimodal pillar space",
    "path": "papers/23/04/2304.12570.json",
    "total_tokens": 904,
    "translated_title": "可学习的基于支柱的图文检索重排",
    "translated_abstract": "图文检索旨在通过语义相似性跨模态检索内容。先前的工作通常关注二元关系（即数据样本是否匹配），而忽略了高阶邻居关系（即多个数据样本之间的匹配结构）。重排是一种流行的后处理实践，已经证明在单模态检索任务中捕捉邻居关系的优越性。然而，将现有的重排算法直接扩展到图文检索是无效的。在此论文中，我们从一般化、灵活性、稀疏性和不对称性四个方面分析了原因，并提出了一种新颖的可学习的基于支柱的图文检索重排。具体而言，我们首先选择等级最高的内部和跨模态邻居作为支柱，然后使用它们之间和支柱之间的邻居关系重构数据样本。通过这种方式，每个样本可以映射到多模态支柱空间中。",
    "tldr": "本文提出了一种新颖的可学习的基于支柱的图文检索重排方法，通过选择等级最高的内部和跨模态邻居作为支柱，并使用它们之间的邻居关系重构数据样本，将每个样本映射到多模态支柱空间中。",
    "en_tdlr": "This paper proposes a novel learnable pillar-based re-ranking method for image-text retrieval, which selects top-ranked intra- and inter-modal neighbors as pillars and reconstructs data samples using their neighbor relations to map each sample into a multimodal pillar space."
}