{
    "title": "Enhancing Model Learning and Interpretation Using Multiple Molecular Graph Representations for Compound Property and Activity Prediction. (arXiv:2304.06253v1 [q-bio.BM])",
    "abstract": "Graph neural networks (GNNs) demonstrate great performance in compound property and activity prediction due to their capability to efficiently learn complex molecular graph structures. However, two main limitations persist including compound representation and model interpretability. While atom-level molecular graph representations are commonly used because of their ability to capture natural topology, they may not fully express important substructures or functional groups which significantly influence molecular properties. Consequently, recent research proposes alternative representations employing reduction techniques to integrate higher-level information and leverages both representations for model learning. However, there is still a lack of study about different molecular graph representations on model learning and interpretation. Interpretability is also crucial for drug discovery as it can offer chemical insights and inspiration for optimization. Numerous studies attempt to inclu",
    "link": "http://arxiv.org/abs/2304.06253",
    "context": "Title: Enhancing Model Learning and Interpretation Using Multiple Molecular Graph Representations for Compound Property and Activity Prediction. (arXiv:2304.06253v1 [q-bio.BM])\nAbstract: Graph neural networks (GNNs) demonstrate great performance in compound property and activity prediction due to their capability to efficiently learn complex molecular graph structures. However, two main limitations persist including compound representation and model interpretability. While atom-level molecular graph representations are commonly used because of their ability to capture natural topology, they may not fully express important substructures or functional groups which significantly influence molecular properties. Consequently, recent research proposes alternative representations employing reduction techniques to integrate higher-level information and leverages both representations for model learning. However, there is still a lack of study about different molecular graph representations on model learning and interpretation. Interpretability is also crucial for drug discovery as it can offer chemical insights and inspiration for optimization. Numerous studies attempt to inclu",
    "path": "papers/23/04/2304.06253.json",
    "total_tokens": 890,
    "translated_title": "使用多种分子图表示增强化合物性质和活性预测中的模型学习和解释能力",
    "translated_abstract": "图神经网络（GNN）由于能够高效地学习复杂的分子结构而在化合物性质和活性预测中表现出色。然而，化合物的表示和模型的解释性仍存在两个主要限制。虽然基于原子级别的分子图表示通常被使用，因为它们能够捕捉自然拓扑，但它们可能不能完全表达重要的亚结构或功能基团，这些基团对分子性质有着重要的影响。因此，近期的研究提出了采用降维技术融合高级信息的替代表示，同时利用两种表示进行模型学习。然而，关于不同分子图表示对模型学习和解释的研究仍不够充分。解释性对于药物发现也至关重要，它可以提供化学洞察力和优化灵感。许多研究尝试通过可解释性的方法来增强GNN模型的解释性能力。",
    "tldr": "本文研究了使用多种分子图表示增强化合物属性和活性预测中的模型学习和解释能力的方法，并提出了利用可解释性方法增强图神经网络模型的解释性能力，对于药物发现有重要帮助。",
    "en_tdlr": "This paper explores the use of multiple molecular graph representations to enhance model learning and interpretation for compound property and activity prediction, as well as proposing methods to improve the interpretability of graph neural networks for drug discovery."
}