{
    "title": "The StatCan Dialogue Dataset: Retrieving Data Tables through Conversations with Genuine Intents. (arXiv:2304.01412v1 [cs.CL])",
    "abstract": "We introduce the StatCan Dialogue Dataset consisting of 19,379 conversation turns between agents working at Statistics Canada and online users looking for published data tables. The conversations stem from genuine intents, are held in English or French, and lead to agents retrieving one of over 5000 complex data tables. Based on this dataset, we propose two tasks: (1) automatic retrieval of relevant tables based on a on-going conversation, and (2) automatic generation of appropriate agent responses at each turn. We investigate the difficulty of each task by establishing strong baselines. Our experiments on a temporal data split reveal that all models struggle to generalize to future conversations, as we observe a significant drop in performance across both tasks when we move from the validation to the test set. In addition, we find that response generation models struggle to decide when to return a table. Considering that the tasks pose significant challenges to existing models, we enc",
    "link": "http://arxiv.org/abs/2304.01412",
    "context": "Title: The StatCan Dialogue Dataset: Retrieving Data Tables through Conversations with Genuine Intents. (arXiv:2304.01412v1 [cs.CL])\nAbstract: We introduce the StatCan Dialogue Dataset consisting of 19,379 conversation turns between agents working at Statistics Canada and online users looking for published data tables. The conversations stem from genuine intents, are held in English or French, and lead to agents retrieving one of over 5000 complex data tables. Based on this dataset, we propose two tasks: (1) automatic retrieval of relevant tables based on a on-going conversation, and (2) automatic generation of appropriate agent responses at each turn. We investigate the difficulty of each task by establishing strong baselines. Our experiments on a temporal data split reveal that all models struggle to generalize to future conversations, as we observe a significant drop in performance across both tasks when we move from the validation to the test set. In addition, we find that response generation models struggle to decide when to return a table. Considering that the tasks pose significant challenges to existing models, we enc",
    "path": "papers/23/04/2304.01412.json",
    "total_tokens": 925,
    "translated_title": "StatCan对话数据集：通过真实意图的对话检索数据表",
    "translated_abstract": "我们介绍了StatCan对话数据集，其中包含了19379次代表Statistics Canada的代理和在线用户之间的对话转换，涉及真实意图，使用英语或法语进行，代理会检索到5000多个复杂数据表之一。基于这个数据集，我们提出了两个任务：（1）基于正在进行的对话自动检索相关数据表，（2）在每个回合自动生成适当的代理响应。我们通过建立强基线来研究每个任务的难度。在时间数据分割的实验中，我们发现所有模型都难以推广到未来的对话中，当我们从验证集移动到测试集时，我们观察到两个任务的性能都显著下降。此外，我们发现响应生成模型在何时返回表格方面存在困难。考虑到这些任务对现有模型的挑战，我们鼓励进一步研究基于对话的数据检索。",
    "tldr": "该论文介绍了StatCan对话数据集，这是一个涉及真实意图的对话转换，提出了两个任务：基于正在进行的对话自动检索相关数据表和在每个回合自动生成适当的代理响应。该研究对现有模型持续提出挑战，鼓励更多基于对话的数据检索研究。",
    "en_tdlr": "The paper presents the StatCan Dialogue Dataset, which involves genuine intents and proposes two tasks: automatic retrieval of relevant tables based on an ongoing conversation and automatic generation of appropriate agent responses at each turn. This research continuously challenges existing models and encourages further research in dialogue-based data retrieval."
}