{
    "title": "Polygonizer: An auto-regressive building delineator. (arXiv:2304.04048v1 [cs.CV])",
    "abstract": "In geospatial planning, it is often essential to represent objects in a vectorized format, as this format easily translates to downstream tasks such as web development, graphics, or design. While these problems are frequently addressed using semantic segmentation, which requires additional post-processing to vectorize objects in a non-trivial way, we present an Image-to-Sequence model that allows for direct shape inference and is ready for vector-based workflows out of the box. We demonstrate the model's performance in various ways, including perturbations to the image input that correspond to variations or artifacts commonly encountered in remote sensing applications. Our model outperforms prior works when using ground truth bounding boxes (one object per image), achieving the lowest maximum tangent angle error.",
    "link": "http://arxiv.org/abs/2304.04048",
    "context": "Title: Polygonizer: An auto-regressive building delineator. (arXiv:2304.04048v1 [cs.CV])\nAbstract: In geospatial planning, it is often essential to represent objects in a vectorized format, as this format easily translates to downstream tasks such as web development, graphics, or design. While these problems are frequently addressed using semantic segmentation, which requires additional post-processing to vectorize objects in a non-trivial way, we present an Image-to-Sequence model that allows for direct shape inference and is ready for vector-based workflows out of the box. We demonstrate the model's performance in various ways, including perturbations to the image input that correspond to variations or artifacts commonly encountered in remote sensing applications. Our model outperforms prior works when using ground truth bounding boxes (one object per image), achieving the lowest maximum tangent angle error.",
    "path": "papers/23/04/2304.04048.json",
    "total_tokens": 786,
    "translated_title": "多边形化器：一种自回归建筑轮廓线提取算法",
    "translated_abstract": "在地理空间规划中，以矢量格式表示对象通常是必不可少的，因为这种格式可以轻松转换为下游任务，如Web开发、图形或设计。虽然这些问题通常使用语义分割来解决，但需要额外的后处理才能对对象进行非平凡地矢量化，我们提出了一种图像到序列的模型，可以直接进行形状推断，并且可以直接用于基于矢量的工作流。我们以各种方式展示了模型的性能，包括对与遥感应用中常见的变化或伪影对应的图像输入的扰动。当使用地面真值边界框（每个图像一个对象）时，我们的模型在误差方面优于先前的作品，实现了最低的最大切线角误差。",
    "tldr": "一种新的图像自回归模型，可以直接进行形状推断，并且可以直接用于基于矢量的工作流，该模型在地理空间规划中的矢量化表现中领先于先前的方法。",
    "en_tdlr": "A new Image-to-Sequence model that allows for direct shape inference and is ready for vector-based workflows, which outperforms prior works in vectorization performance especially in geospatial planning."
}