{
    "title": "Identifying Stochasticity in Time-Series with Autoencoder-Based Content-aware 2D Representation: Application to Black Hole Data. (arXiv:2304.11560v1 [cs.LG])",
    "abstract": "In this work, we report an autoencoder-based 2D representation to classify a time-series as stochastic or non-stochastic, to understand the underlying physical process. Content-aware conversion of 1D time-series to 2D representation, that simultaneously utilizes time- and frequency-domain characteristics, is proposed. An autoencoder is trained with a loss function to learn latent space (using both time- and frequency domains) representation, that is designed to be, time-invariant. Every element of the time-series is represented as a tuple with two components, one each, from latent space representation in time- and frequency-domains, forming a binary image. In this binary image, those tuples that represent the points in the time-series, together form the ``Latent Space Signature\" (LSS) of the input time-series. The obtained binary LSS images are fed to a classification network. The EfficientNetv2-S classifier is trained using 421 synthetic time-series, with fair representation from both",
    "link": "http://arxiv.org/abs/2304.11560",
    "context": "Title: Identifying Stochasticity in Time-Series with Autoencoder-Based Content-aware 2D Representation: Application to Black Hole Data. (arXiv:2304.11560v1 [cs.LG])\nAbstract: In this work, we report an autoencoder-based 2D representation to classify a time-series as stochastic or non-stochastic, to understand the underlying physical process. Content-aware conversion of 1D time-series to 2D representation, that simultaneously utilizes time- and frequency-domain characteristics, is proposed. An autoencoder is trained with a loss function to learn latent space (using both time- and frequency domains) representation, that is designed to be, time-invariant. Every element of the time-series is represented as a tuple with two components, one each, from latent space representation in time- and frequency-domains, forming a binary image. In this binary image, those tuples that represent the points in the time-series, together form the ``Latent Space Signature\" (LSS) of the input time-series. The obtained binary LSS images are fed to a classification network. The EfficientNetv2-S classifier is trained using 421 synthetic time-series, with fair representation from both",
    "path": "papers/23/04/2304.11560.json",
    "total_tokens": 924,
    "translated_title": "利用基于自编码器的内容感知二维表示识别时间序列中的随机性：黑洞数据应用。",
    "translated_abstract": "本文报告了一种基于自编码器的2D表示方法，用于将时间序列分类为随机或非随机，以了解其潜在的物理过程。提出了一种内容感知的1D时间序列到2D表示的转换，同时利用时间和频域特征。使用损失函数训练自编码器学习潜在空间（同时使用时间和频域）表示，旨在是时间不变的。时间序列的每个元素都表示为一个元组，每个元组从时间和频率域的潜在空间表示中各取一个元素，形成一个二进制图像。在这个二进制图像中，代表时间序列点的那些元组组合在一起形成了输入时间序列的“潜空间签名”（LSS）。获得的二进制LSS图像被送入分类网络。使用421个合成时间序列训练EfficientNetv2-S分类器，其中包括随机和非随机序列，以进行评估和比较。",
    "tldr": "通过自编码器和内容感知2D表示，该论文提出了一个识别随机性的方法并对黑洞数据进行了应用。",
    "en_tdlr": "This paper proposes a method to identify stochasticity with autoencoder-based content-aware 2D representation and applies it to black hole data. The method converts 1D time-series to 2D representation, uses a loss function to learn a time-invariant latent space representation with both time and frequency domain, and feeds the binary \"Latent Space Signature\" images to a classification network trained with synthetic time-series."
}