{
    "title": "Weighted Siamese Network to Predict the Time to Onset of Alzheimer's Disease from MRI Images. (arXiv:2304.07097v1 [eess.IV])",
    "abstract": "Alzheimer's Disease (AD), which is the most common cause of dementia, is a progressive disease preceded by Mild Cognitive Impairment (MCI). Early detection of the disease is crucial for making treatment decisions. However, most of the literature on computer-assisted detection of AD focuses on classifying brain images into one of three major categories: healthy, MCI, and AD; or categorising MCI patients into one of (1) progressive: those who progress from MCI to AD at a future examination time during a given study period, and (2) stable: those who stay as MCI and never progress to AD. This misses the opportunity to accurately identify the trajectory of progressive MCI patients. In this paper, we revisit the brain image classification task for AD identification and re-frame it as an ordinal classification task to predict how close a patient is to the severe AD stage. To this end, we select progressive MCI patients from the Alzheimer's Disease Neuroimaging Initiative (ADNI) dataset and co",
    "link": "http://arxiv.org/abs/2304.07097",
    "context": "Title: Weighted Siamese Network to Predict the Time to Onset of Alzheimer's Disease from MRI Images. (arXiv:2304.07097v1 [eess.IV])\nAbstract: Alzheimer's Disease (AD), which is the most common cause of dementia, is a progressive disease preceded by Mild Cognitive Impairment (MCI). Early detection of the disease is crucial for making treatment decisions. However, most of the literature on computer-assisted detection of AD focuses on classifying brain images into one of three major categories: healthy, MCI, and AD; or categorising MCI patients into one of (1) progressive: those who progress from MCI to AD at a future examination time during a given study period, and (2) stable: those who stay as MCI and never progress to AD. This misses the opportunity to accurately identify the trajectory of progressive MCI patients. In this paper, we revisit the brain image classification task for AD identification and re-frame it as an ordinal classification task to predict how close a patient is to the severe AD stage. To this end, we select progressive MCI patients from the Alzheimer's Disease Neuroimaging Initiative (ADNI) dataset and co",
    "path": "papers/23/04/2304.07097.json",
    "total_tokens": 951,
    "translated_title": "权重连体网络用于从MRI图像预测阿尔茨海默病发病时间",
    "translated_abstract": "阿尔茨海默病（AD）是痴呆症最常见的原因，是一种进行性疾病，会先出现轻度认知障碍（MCI）。早期检测对于做出治疗决策至关重要。然而，大多数关于计算机辅助检测AD的文献聚焦于将脑图像分类为三个主要类别之一：健康、MCI和AD；或将MCI患者分类为(1)进展：在给定研究期内的未来检查时间进展到AD的患者，以及(2)稳定：持续作为MCI患者而从未进展为AD。这种方法错过了准确识别进展性MCI患者轨迹的机会。本文重新审视了AD识别的脑图像分类任务，将其重新构建为一个序数分类任务，以预测患者距离严重AD阶段有多近。为此，我们从阿尔茨海默病神经影像计划（ADNI）数据集中选择进展性MCI患者，并使用加权连体网络进行实验。",
    "tldr": "本文提出使用加权连体网络对进展性MCI患者进行序数分类，以预测他们距离严重AD阶段的距离，从而实现更准确的早期检测。"
}