{
    "title": "Biologically inspired structure learning with reverse knowledge distillation for spiking neural networks. (arXiv:2304.09500v1 [cs.NE])",
    "abstract": "Spiking neural networks (SNNs) have superb characteristics in sensory information recognition tasks due to their biological plausibility. However, the performance of some current spiking-based models is limited by their structures which means either fully connected or too-deep structures bring too much redundancy. This redundancy from both connection and neurons is one of the key factors hindering the practical application of SNNs. Although Some pruning methods were proposed to tackle this problem, they normally ignored the fact the neural topology in the human brain could be adjusted dynamically. Inspired by this, this paper proposed an evolutionary-based structure construction method for constructing more reasonable SNNs. By integrating the knowledge distillation and connection pruning method, the synaptic connections in SNNs can be optimized dynamically to reach an optimal state. As a result, the structure of SNNs could not only absorb knowledge from the teacher model but also searc",
    "link": "http://arxiv.org/abs/2304.09500",
    "context": "Title: Biologically inspired structure learning with reverse knowledge distillation for spiking neural networks. (arXiv:2304.09500v1 [cs.NE])\nAbstract: Spiking neural networks (SNNs) have superb characteristics in sensory information recognition tasks due to their biological plausibility. However, the performance of some current spiking-based models is limited by their structures which means either fully connected or too-deep structures bring too much redundancy. This redundancy from both connection and neurons is one of the key factors hindering the practical application of SNNs. Although Some pruning methods were proposed to tackle this problem, they normally ignored the fact the neural topology in the human brain could be adjusted dynamically. Inspired by this, this paper proposed an evolutionary-based structure construction method for constructing more reasonable SNNs. By integrating the knowledge distillation and connection pruning method, the synaptic connections in SNNs can be optimized dynamically to reach an optimal state. As a result, the structure of SNNs could not only absorb knowledge from the teacher model but also searc",
    "path": "papers/23/04/2304.09500.json",
    "total_tokens": 852,
    "translated_title": "反向知识蒸馏结合仿生结构学习用于脉冲神经网络的构建",
    "translated_abstract": "由于生物学本源，脉冲神经网络(SNNs)在感知信息识别任务方面具有独特的特点。然而，一些当前基于脉冲的模型的性能受到结构的限制，这意味着全连接或过深的结构会带来过多的冗余，这是阻碍SNNs实际应用的关键因素之一。针对这个问题，本文提出了一种基于进化的结构构建方法来构建更合理的SNNs。通过集成知识蒸馏和连接剪枝方法，SNNs的突触连接可以动态优化以达到最佳状态。因此，SNNs的结构不仅可以吸收来自教师模型的知识，还可以进行迭代搜索以优化结构。",
    "tldr": "本文提出了一种基于进化的结构构建方法用于构建更合理的脉冲神经网络。通过结合知识蒸馏和连接剪枝方法，动态优化突触连接可以达到最优状态。",
    "en_tdlr": "This paper proposes an evolutionary-based structure construction method for constructing more reasonable spiking neural networks (SNNs). By integrating knowledge distillation and connection pruning methods, dynamically optimizing synaptic connections can achieve an optimal state, making SNNs not only absorb knowledge from the teacher model but also conduct iterative searches to optimize their structure."
}