{
    "title": "Mapping historical forest biomass for stock-change assessments at parcel to landscape scales. (arXiv:2304.02632v1 [stat.AP])",
    "abstract": "Understanding historical forest dynamics, specifically changes in forest biomass and carbon stocks, has become critical for assessing current forest climate benefits and projecting future benefits under various policy, regulatory, and stewardship scenarios. Carbon accounting frameworks based exclusively on national forest inventories are limited to broad-scale estimates, but model-based approaches that combine these inventories with remotely sensed data can yield contiguous fine-resolution maps of forest biomass and carbon stocks across landscapes over time. Here we describe a fundamental step in building a map-based stock-change framework: mapping historical forest biomass at fine temporal and spatial resolution (annual, 30m) across all of New York State (USA) from 1990 to 2019, using freely available data and open-source tools.  Using Landsat imagery, US Forest Service Forest Inventory and Analysis (FIA) data, and off-the-shelf LiDAR collections we developed three modeling approaches",
    "link": "http://arxiv.org/abs/2304.02632",
    "context": "Title: Mapping historical forest biomass for stock-change assessments at parcel to landscape scales. (arXiv:2304.02632v1 [stat.AP])\nAbstract: Understanding historical forest dynamics, specifically changes in forest biomass and carbon stocks, has become critical for assessing current forest climate benefits and projecting future benefits under various policy, regulatory, and stewardship scenarios. Carbon accounting frameworks based exclusively on national forest inventories are limited to broad-scale estimates, but model-based approaches that combine these inventories with remotely sensed data can yield contiguous fine-resolution maps of forest biomass and carbon stocks across landscapes over time. Here we describe a fundamental step in building a map-based stock-change framework: mapping historical forest biomass at fine temporal and spatial resolution (annual, 30m) across all of New York State (USA) from 1990 to 2019, using freely available data and open-source tools.  Using Landsat imagery, US Forest Service Forest Inventory and Analysis (FIA) data, and off-the-shelf LiDAR collections we developed three modeling approaches",
    "path": "papers/23/04/2304.02632.json",
    "total_tokens": 860,
    "translated_title": "历史森林生物量的地图制作，用于精确评估个体和景观尺度的库存变化",
    "translated_abstract": "理解历史森林动态，特别是森林生物量和碳储量的变化，已成为评估目前森林气候效益并在各种政策、监管和管理方案下预测未来效益的关键。本文利用Landsat影像、美国森林局森林库存与分析（FIA）数据和现成的激光雷达数据，以年度30米的时间和空间分辨率（1990年至2019年，包括纽约州的所有地区），使用免费的数据和开源工具，描述了建立基于地图的库存变化框架的基本步骤：制作历史森林生物量地图。",
    "tldr": "本文介绍了一项基本步骤，即利用Landsat影像、激光雷达和FIA数据，在整个纽约州（1990年至2019年）以较高时间和空间分辨率制作历史森林生物量地图，以便实现个体和景观尺度的库存变化评估。",
    "en_tdlr": "This paper describes a fundamental step in building a map-based stock-change framework by mapping historical forest biomass at high temporal and spatial resolution across all of New York State (from 1990 to 2019) using Landsat imagery, LiDAR and FIA data, which enables individual and landscape scale assessments of stock changes."
}