{
    "title": "Efficient Feature Description for Small Body Relative Navigation using Binary Convolutional Neural Networks. (arXiv:2304.04985v1 [cs.CV])",
    "abstract": "Missions to small celestial bodies rely heavily on optical feature tracking for characterization of and relative navigation around the target body. While techniques for feature tracking based on deep learning are a promising alternative to current human-in-the-loop processes, designing deep architectures that can operate onboard spacecraft is challenging due to onboard computational and memory constraints. This paper introduces a novel deep local feature description architecture that leverages binary convolutional neural network layers to significantly reduce computational and memory requirements. We train and test our models on real images of small bodies from legacy and ongoing missions and demonstrate increased performance relative to traditional handcrafted methods. Moreover, we implement our models onboard a surrogate for the next-generation spacecraft processor and demonstrate feasible runtimes for online feature tracking.",
    "link": "http://arxiv.org/abs/2304.04985",
    "context": "Title: Efficient Feature Description for Small Body Relative Navigation using Binary Convolutional Neural Networks. (arXiv:2304.04985v1 [cs.CV])\nAbstract: Missions to small celestial bodies rely heavily on optical feature tracking for characterization of and relative navigation around the target body. While techniques for feature tracking based on deep learning are a promising alternative to current human-in-the-loop processes, designing deep architectures that can operate onboard spacecraft is challenging due to onboard computational and memory constraints. This paper introduces a novel deep local feature description architecture that leverages binary convolutional neural network layers to significantly reduce computational and memory requirements. We train and test our models on real images of small bodies from legacy and ongoing missions and demonstrate increased performance relative to traditional handcrafted methods. Moreover, we implement our models onboard a surrogate for the next-generation spacecraft processor and demonstrate feasible runtimes for online feature tracking.",
    "path": "papers/23/04/2304.04985.json",
    "total_tokens": 833,
    "translated_title": "使用二进制卷积神经网络的小天体相对导航的高效特征描述",
    "translated_abstract": "小天体任务依赖于光学特征跟踪来表征和绕目标天体进行相对导航。虽然基于深度学习的特征跟踪技术是当前人机交互过程的一个有前途的替代方案，但由于航天器的计算和内存限制，设计能够在机载上运行的深度网络结构具有挑战性。本文提出了一种新的深度局部特征描述结构，利用二进制卷积神经网络层显着降低了计算和内存需求。我们使用传统任务和正在进行的任务的小天体真实图像对模型进行训练和测试，并展示了相对于传统手工设计的方法，提高了性能。此外，我们在下一代航天器处理器的代理中实现了我们的模型，并展示了在线特征跟踪的可行运行时间。",
    "tldr": "本文提出了一种基于二进制卷积神经网络层的局部特征描述结构，有效降低了小天体相对导航的计算和内存需求，同时提高了性能。",
    "en_tdlr": "This paper proposes a novel deep local feature description architecture leveraging binary convolutional neural network layers to significantly reduce computational and memory requirements for small body relative navigation. The architecture demonstrates increased performance compared to traditional handcrafted methods, and feasible runtimes for online feature tracking are demonstrated onboard a surrogate for the next-generation spacecraft processor."
}