{
    "title": "ChatGPT is all you need to decolonize sub-Saharan Vocational Education. (arXiv:2304.13728v1 [cs.LG])",
    "abstract": "The advances of Generative AI models with interactive capabilities over the past few years offer unique opportunities for socioeconomic mobility. Their potential for scalability, accessibility, affordability, personalizing and convenience sets a first-class opportunity for poverty-stricken countries to adapt and modernize their educational order. As a result, this position paper makes the case for an educational policy framework that would succeed in this transformation by prioritizing vocational and technical training over academic education in sub-Saharan African countries. We highlight substantial applications of Large Language Models, tailor-made to their respective cultural background(s) and needs, that would reinforce their systemic decolonization. Lastly, we provide specific historical examples of diverse states successfully implementing such policies in the elementary steps of their socioeconomic transformation, in order to corroborate our proposal to sub-Saharan African countr",
    "link": "http://arxiv.org/abs/2304.13728",
    "context": "Title: ChatGPT is all you need to decolonize sub-Saharan Vocational Education. (arXiv:2304.13728v1 [cs.LG])\nAbstract: The advances of Generative AI models with interactive capabilities over the past few years offer unique opportunities for socioeconomic mobility. Their potential for scalability, accessibility, affordability, personalizing and convenience sets a first-class opportunity for poverty-stricken countries to adapt and modernize their educational order. As a result, this position paper makes the case for an educational policy framework that would succeed in this transformation by prioritizing vocational and technical training over academic education in sub-Saharan African countries. We highlight substantial applications of Large Language Models, tailor-made to their respective cultural background(s) and needs, that would reinforce their systemic decolonization. Lastly, we provide specific historical examples of diverse states successfully implementing such policies in the elementary steps of their socioeconomic transformation, in order to corroborate our proposal to sub-Saharan African countr",
    "path": "papers/23/04/2304.13728.json",
    "total_tokens": 876,
    "translated_title": "ChatGPT是非洲撒哈拉以南职业教育去殖民化的必需品",
    "translated_abstract": "过去几年中具有交互能力的生成型AI模型的进步为社会经济流动性提供了独特的机会。它们在可扩展性、可访问性、可负担性、个性化和便利性方面的潜力为贫困国家适应和现代化其教育秩序提供了一流的机会。因此，本文提出了一个教育政策框架的论点，通过将撒哈拉以南非洲国家的职业和技术培训置于学术教育之上，来在这一转变中取得成功。我们重点介绍了针对其文化背景和需求量身定制的大型语言模型的实际应用，以加强其系统去殖民化。最后，我们提供了具有代表性的历史例子，说明不同国家在其社会经济转型的基本步骤中成功实施了此类政策，以支持我们对南撒哈拉非洲国家的建议。",
    "tldr": "本文提出在南撒哈拉非洲国家中将职业和技术培训置于学术教育之上的教育政策框架，并使用大型语言模型来加强去殖民化，实现社会经济流动性。",
    "en_tdlr": "This paper advocates an educational policy framework that prioritizes vocational and technical training over academic education in sub-Saharan African countries, using large language models to reinforce decolonization and achieve socioeconomic mobility."
}