{
    "title": "Entity-Level Sentiment Analysis (ELSA): An exploratory task survey. (arXiv:2304.14241v1 [cs.CL])",
    "abstract": "This paper explores the task of identifying the overall sentiment expressed towards volitional entities (persons and organizations) in a document -- what we refer to as Entity-Level Sentiment Analysis (ELSA). While identifying sentiment conveyed towards an entity is well researched for shorter texts like tweets, we find little to no research on this specific task for longer texts with multiple mentions and opinions towards the same entity. This lack of research would be understandable if ELSA can be derived from existing tasks and models. To assess this, we annotate a set of professional reviews for their overall sentiment towards each volitional entity in the text. We sample from data already annotated for document-level, sentence-level, and target-level sentiment in a multi-domain review corpus, and our results indicate that there is no single proxy task that provides this overall sentiment we seek for the entities at a satisfactory level of performance. We present a suite of experim",
    "link": "http://arxiv.org/abs/2304.14241",
    "context": "Title: Entity-Level Sentiment Analysis (ELSA): An exploratory task survey. (arXiv:2304.14241v1 [cs.CL])\nAbstract: This paper explores the task of identifying the overall sentiment expressed towards volitional entities (persons and organizations) in a document -- what we refer to as Entity-Level Sentiment Analysis (ELSA). While identifying sentiment conveyed towards an entity is well researched for shorter texts like tweets, we find little to no research on this specific task for longer texts with multiple mentions and opinions towards the same entity. This lack of research would be understandable if ELSA can be derived from existing tasks and models. To assess this, we annotate a set of professional reviews for their overall sentiment towards each volitional entity in the text. We sample from data already annotated for document-level, sentence-level, and target-level sentiment in a multi-domain review corpus, and our results indicate that there is no single proxy task that provides this overall sentiment we seek for the entities at a satisfactory level of performance. We present a suite of experim",
    "path": "papers/23/04/2304.14241.json",
    "total_tokens": 1048,
    "translated_title": "实体级情感分析（ELSA）：一项探索性任务概述",
    "translated_abstract": "本文探讨了识别文档中自愿实体（人和组织）所表达总体情绪的任务，即我们所称的实体级情感分析（ELSA）。虽然对于像推文这样的较短文本识别对实体表达情感已经有了较多研究，但我们发现对于在文本中多次提及同一实体的较长文本，几乎没有相关研究。如果现有任务和模型可以推导出ELSA，这种缺乏研究是可以理解的。为了评估这一点，我们注释了一组专业评论以了解文本中每个自愿实体的总体情感。我们从一个多领域评论语料库中已经注释为文档级、句子级和目标级情感的数据中进行采样，我们的结果表明，没有一个单一的代理任务能够以令人满意的表现提供这种我们寻求的对实体的总体情感。我们提供了一套实验。",
    "tldr": "本文探索了实体级情感分析（ELSA）的任务，即识别文档中自愿实体（人和组织）所表达总体情绪的能力。虽然对于像推文这样的较短文本识别对实体表达情感已经有了较多研究，但我们发现对于在文本中多次提及同一实体的较长文本，几乎没有相关研究。作者注释了一组专业评论以评估现有任务和模型是否可以推导出ELSA，结果表明没有单一代理任务能够以令人满意的表现提供这种我们寻求的对实体的总体情感。"
}