{
    "title": "Uncertainty-aware Self-supervised Learning for Cross-domain Technical Skill Assessment in Robot-assisted Surgery. (arXiv:2304.14589v1 [cs.RO])",
    "abstract": "Objective technical skill assessment is crucial for effective training of new surgeons in robot-assisted surgery. With advancements in surgical training programs in both physical and virtual environments, it is imperative to develop generalizable methods for automatically assessing skills. In this paper, we propose a novel approach for skill assessment by transferring domain knowledge from labeled kinematic data to unlabeled data. Our approach leverages labeled data from common surgical training tasks such as Suturing, Needle Passing, and Knot Tying to jointly train a model with both labeled and unlabeled data. Pseudo labels are generated for the unlabeled data through an iterative manner that incorporates uncertainty estimation to ensure accurate labeling. We evaluate our method on a virtual reality simulated training task (Ring Transfer) using data from the da Vinci Research Kit (dVRK). The results show that trainees with robotic assistance have significantly higher expert probabilit",
    "link": "http://arxiv.org/abs/2304.14589",
    "context": "Title: Uncertainty-aware Self-supervised Learning for Cross-domain Technical Skill Assessment in Robot-assisted Surgery. (arXiv:2304.14589v1 [cs.RO])\nAbstract: Objective technical skill assessment is crucial for effective training of new surgeons in robot-assisted surgery. With advancements in surgical training programs in both physical and virtual environments, it is imperative to develop generalizable methods for automatically assessing skills. In this paper, we propose a novel approach for skill assessment by transferring domain knowledge from labeled kinematic data to unlabeled data. Our approach leverages labeled data from common surgical training tasks such as Suturing, Needle Passing, and Knot Tying to jointly train a model with both labeled and unlabeled data. Pseudo labels are generated for the unlabeled data through an iterative manner that incorporates uncertainty estimation to ensure accurate labeling. We evaluate our method on a virtual reality simulated training task (Ring Transfer) using data from the da Vinci Research Kit (dVRK). The results show that trainees with robotic assistance have significantly higher expert probabilit",
    "path": "papers/23/04/2304.14589.json",
    "total_tokens": 913,
    "translated_title": "机器人辅助手术交叉领域技能评估的不确定性自监督学习",
    "translated_abstract": "目标技能评估对新医生进行机器人辅助手术的有效培训至关重要。随着物理和虚拟环境下的手术培训计划的进展，开发自动评估技能的通用方法至关重要。本文提出了一种新颖的方法，通过将标记运动数据的领域知识转移至未标记数据中进行技能评估。我们的方法利用来自常见手术训练任务（如缝合、穿针和打结）的标记数据来联合训练具有标记和未标记数据的模型。通过迭代方式生成未标记数据的伪标签，其中包含不确定度估计以确保准确标记。我们使用来自da Vinci Research Kit（dVRK）的数据在虚拟现实模拟的训练任务（Ring Transfer）上评估我们的方法。结果表明，在机器人辅助下进行培训的实习生具有显著更高的专家概率。",
    "tldr": "本文提出了一种采用不确定性自监督学习方法的机器人手术技能评估技术，通过将标记数据领域知识转移到未标记数据中进行训练，最终在虚拟现实模拟的训练任务中取得了显著的成果。",
    "en_tdlr": "This paper proposes an uncertainty-aware self-supervised learning technique for robot-assisted surgery skill assessment, which transfers domain knowledge from labeled data to train unlabeled data. The method achieved significant results in a virtual reality simulated training task."
}