{
    "title": "Robust Tickets Can Transfer Better: Drawing More Transferable Subnetworks in Transfer Learning. (arXiv:2304.11834v2 [cs.LG] UPDATED)",
    "abstract": "Transfer learning leverages feature representations of deep neural networks (DNNs) pretrained on source tasks with rich data to empower effective finetuning on downstream tasks. However, the pretrained models are often prohibitively large for delivering generalizable representations, which limits their deployment on edge devices with constrained resources. To close this gap, we propose a new transfer learning pipeline, which leverages our finding that robust tickets can transfer better, i.e., subnetworks drawn with properly induced adversarial robustness can win better transferability over vanilla lottery ticket subnetworks. Extensive experiments and ablation studies validate that our proposed transfer learning pipeline can achieve enhanced accuracy-sparsity trade-offs across both diverse downstream tasks and sparsity patterns, further enriching the lottery ticket hypothesis.",
    "link": "http://arxiv.org/abs/2304.11834",
    "context": "Title: Robust Tickets Can Transfer Better: Drawing More Transferable Subnetworks in Transfer Learning. (arXiv:2304.11834v2 [cs.LG] UPDATED)\nAbstract: Transfer learning leverages feature representations of deep neural networks (DNNs) pretrained on source tasks with rich data to empower effective finetuning on downstream tasks. However, the pretrained models are often prohibitively large for delivering generalizable representations, which limits their deployment on edge devices with constrained resources. To close this gap, we propose a new transfer learning pipeline, which leverages our finding that robust tickets can transfer better, i.e., subnetworks drawn with properly induced adversarial robustness can win better transferability over vanilla lottery ticket subnetworks. Extensive experiments and ablation studies validate that our proposed transfer learning pipeline can achieve enhanced accuracy-sparsity trade-offs across both diverse downstream tasks and sparsity patterns, further enriching the lottery ticket hypothesis.",
    "path": "papers/23/04/2304.11834.json",
    "total_tokens": 845,
    "translated_title": "鲁棒门票能够更好地传输: 在迁移学习中绘制更具传输性的子网络",
    "translated_abstract": "迁移学习利用在丰富数据的源任务上预训练的深度神经网络(DNN)的特征表示，以赋予下游任务的有效微调。然而，预训练模型往往过于庞大，无法提供可推广的表示，这限制了它们在资源受限的边缘设备上的部署。为了弥补这一差距，我们提出了一种新的迁移学习流程，利用我们的发现：鲁棒门票能够更好地传输，即通过适当引入对抗鲁棒性的方式绘制的子网络可以在传统的彩票门票子网络上取得更好的传输能力。大量实验和消融研究验证了我们提出的迁移学习流程在各种下游任务和稀疏模式中都能实现增强的准确度-稀疏度权衡，进一步丰富了彩票门票假设。",
    "tldr": "该论文提出了一种新的迁移学习流程，通过绘制具有鲁棒性的子网络，改进了预训练模型在资源受限的边缘设备上的传输能力。",
    "en_tdlr": "This paper proposes a new transfer learning pipeline that enhances the transferability of pretrained models on edge devices with constrained resources by drawing subnetworks with adversarial robustness."
}