{
    "title": "Geometric constraints improve inference of sparsely observed stochastic dynamics. (arXiv:2304.00423v1 [stat.ME])",
    "abstract": "The dynamics of systems of many degrees of freedom evolving on multiple scales are often modeled in terms of stochastic differential equations. Usually the structural form of these equations is unknown and the only manifestation of the system's dynamics are observations at discrete points in time. Despite their widespread use, accurately inferring these systems from sparse-in-time observations remains challenging. Conventional inference methods either focus on the temporal structure of observations, neglecting the geometry of the system's invariant density, or use geometric approximations of the invariant density, which are limited to conservative driving forces. To address these limitations, here, we introduce a novel approach that reconciles these two perspectives. We propose a path augmentation scheme that employs data-driven control to account for the geometry of the invariant system's density. Non-parametric inference on the augmented paths, enables efficient identification of the",
    "link": "http://arxiv.org/abs/2304.00423",
    "context": "Title: Geometric constraints improve inference of sparsely observed stochastic dynamics. (arXiv:2304.00423v1 [stat.ME])\nAbstract: The dynamics of systems of many degrees of freedom evolving on multiple scales are often modeled in terms of stochastic differential equations. Usually the structural form of these equations is unknown and the only manifestation of the system's dynamics are observations at discrete points in time. Despite their widespread use, accurately inferring these systems from sparse-in-time observations remains challenging. Conventional inference methods either focus on the temporal structure of observations, neglecting the geometry of the system's invariant density, or use geometric approximations of the invariant density, which are limited to conservative driving forces. To address these limitations, here, we introduce a novel approach that reconciles these two perspectives. We propose a path augmentation scheme that employs data-driven control to account for the geometry of the invariant system's density. Non-parametric inference on the augmented paths, enables efficient identification of the",
    "path": "papers/23/04/2304.00423.json",
    "total_tokens": 860,
    "translated_title": "几何约束提高了对稀疏观测的随机动力学的推断",
    "translated_abstract": "许多自由度的系统在多个尺度上演化的动力学通常以随机微分方程的形式进行建模。通常这些方程的结构形式是未知的，系统动力学的唯一表现形式是在离散时间点上的观测。尽管它们被广泛使用，但准确地从稀疏时域观测中推断这些系统仍然具有挑战性。传统的推断方法要么集中于观测的时间结构，忽略系统不变密度的几何形状，要么使用系统不变密度的几何逼近，这些逼近仅适用于保守的驱动力。为了解决这些局限性，我们在此提出了一种新的方法，它将这两个视角调和在一起。我们提出了一种路径增强方案，它使用数据驱动的控制来考虑不变系统密度的几何形状。对增强路径的非参数推断，实现了对系统的有效识别。",
    "tldr": "本文提出一种新的方法，该方法利用数据驱动的控制，既考虑了系统不变密度的几何形状，又能对系统进行有效识别。",
    "en_tdlr": "This paper introduces a novel approach that reconciles the temporal structure of observations and geometric approximations of the invariant density, enabling efficient identification of the system using data-driven control to account for the geometry of the invariant system's density."
}