{
    "title": "Managed Campaigns and Data-Augmented Auctions for Digital Advertising. (arXiv:2304.08432v1 [econ.TH])",
    "abstract": "We develop an auction model for digital advertising. A monopoly platform has access to data on the value of the match between advertisers and consumers. The platform support bidding with additional information and increase the feasible surplus for on-platform matches. Advertisers jointly determine their pricing strategy both on and off the platform, as well as their bidding for digital advertising on the platform. We compare a data-augmented second-price auction and a managed campaign mechanism. In the data-augmented auction, the bids by the advertisers are informed by the data of the platform regarding the value of the match. This results in a socially efficient allocation on the platform, but the advertisers increase their product prices off the platform to be more competitive on the platform. In consequence, the allocation off the platform is inefficient due to excessively high product prices. The managed campaign mechanism allows advertisers to submit budgets that are then transfor",
    "link": "http://arxiv.org/abs/2304.08432",
    "context": "Title: Managed Campaigns and Data-Augmented Auctions for Digital Advertising. (arXiv:2304.08432v1 [econ.TH])\nAbstract: We develop an auction model for digital advertising. A monopoly platform has access to data on the value of the match between advertisers and consumers. The platform support bidding with additional information and increase the feasible surplus for on-platform matches. Advertisers jointly determine their pricing strategy both on and off the platform, as well as their bidding for digital advertising on the platform. We compare a data-augmented second-price auction and a managed campaign mechanism. In the data-augmented auction, the bids by the advertisers are informed by the data of the platform regarding the value of the match. This results in a socially efficient allocation on the platform, but the advertisers increase their product prices off the platform to be more competitive on the platform. In consequence, the allocation off the platform is inefficient due to excessively high product prices. The managed campaign mechanism allows advertisers to submit budgets that are then transfor",
    "path": "papers/23/04/2304.08432.json",
    "total_tokens": 875,
    "translated_title": "数字广告的托管活动和数据增强拍卖模型",
    "translated_abstract": "本研究针对数字广告开发了拍卖模型。垄断平台具有广告主和消费者之间匹配价值的数据。平台支持利用额外信息进行竞标，从而增加平台内匹配的可行剩余。广告主共同决定其在平台上和平台外的定价策略，以及他们在平台上进行数字广告的竞标。我们比较了数据增强的二价拍卖和托管活动机制。在数据增强的拍卖中，广告主的竞标受到平台匹配价值数据的影响。这导致了平台上的社会有效配置，但广告主会提高其在平台外的产品价格，以在平台上更具竞争力。因此，由于产品价格过高，平台外的分配效率不高。托管活动机制允许广告主提交预算，然后转移",
    "tldr": "拍卖模型为数字广告提供了数据增强的竞标机制，同时托管活动机制有助于优化广告配置。平台上的社会有效配置会影响广告主在平台外的产品价格，导致平台外的分配效率低下。",
    "en_tdlr": "An auction model for digital advertising is developed in this paper, which provides a data-augmented bidding mechanism and a managed campaign mechanism to optimize the allocation of advertisements. The socially-efficient allocation on the platform affects the product prices off the platform, leading to inefficient allocation. The managed campaign mechanism allows advertisers to submit budgets for optimal allocation."
}