{
    "title": "Human Activity Recognition Using Self-Supervised Representations of Wearable Data. (arXiv:2304.14912v1 [eess.SP])",
    "abstract": "Automated and accurate human activity recognition (HAR) using body-worn sensors enables practical and cost efficient remote monitoring of Activity of DailyLiving (ADL), which are shown to provide clinical insights across multiple therapeutic areas. Development of accurate algorithms for human activity recognition(HAR) is hindered by the lack of large real-world labeled datasets. Furthermore, algorithms seldom work beyond the specific sensor on which they are prototyped, prompting debate about whether accelerometer-based HAR is even possible [Tong et al., 2020]. Here we develop a 6-class HAR model with strong performance when evaluated on real-world datasets not seen during training. Our model is based on a frozen self-supervised representation learned on a large unlabeled dataset, combined with a shallow multi-layer perceptron with temporal smoothing. The model obtains in-dataset state-of-the art performance on the Capture24 dataset ($\\kappa= 0.86$). Out-of-distribution (OOD) performan",
    "link": "http://arxiv.org/abs/2304.14912",
    "context": "Title: Human Activity Recognition Using Self-Supervised Representations of Wearable Data. (arXiv:2304.14912v1 [eess.SP])\nAbstract: Automated and accurate human activity recognition (HAR) using body-worn sensors enables practical and cost efficient remote monitoring of Activity of DailyLiving (ADL), which are shown to provide clinical insights across multiple therapeutic areas. Development of accurate algorithms for human activity recognition(HAR) is hindered by the lack of large real-world labeled datasets. Furthermore, algorithms seldom work beyond the specific sensor on which they are prototyped, prompting debate about whether accelerometer-based HAR is even possible [Tong et al., 2020]. Here we develop a 6-class HAR model with strong performance when evaluated on real-world datasets not seen during training. Our model is based on a frozen self-supervised representation learned on a large unlabeled dataset, combined with a shallow multi-layer perceptron with temporal smoothing. The model obtains in-dataset state-of-the art performance on the Capture24 dataset ($\\kappa= 0.86$). Out-of-distribution (OOD) performan",
    "path": "papers/23/04/2304.14912.json",
    "total_tokens": 927,
    "translated_title": "使用自监督表示法识别穿戴数据的人类活动",
    "translated_abstract": "利用佩戴传感器进行自动化和准确的人类活动识别（HAR）可以实现实用和经济效益的日常生活活动（ADL）的远程监测，这些活动已被证明可提供跨多个治疗领域的临床洞见。准确地识别人类活动（HAR）的算法的发展受到缺乏大型真实世界标记数据集的阻碍。此外，算法很少能够超越它们原型上的特定传感器，引发了有关是否可能基于加速度计的HAR的争议[Tong等人，2020]。在这里，我们开发了一个六类HAR模型，当在训练期间未见过的真实世界数据集上进行评估时，具有较强的性能。我们的模型基于在大型未标记数据集上学习的冻结自监督表示法，结合具有时间平滑的浅层多层感知器。该模型在Capture24数据集[$\\kappa$=0.86]内部数据集达到最先进的性能水平。分布外（OOD）表现",
    "tldr": "本文提出了一个基于自监督表示法识别人类活动的模型，该模型在大量未标记数据集的基础上获得了较强性能，并在真实世界数据集上展现出了很好的效果。",
    "en_tdlr": "This paper proposes a model for human activity recognition based on self-supervised representations, which achieves strong performance on a large unlabeled dataset and shows good results on real-world datasets."
}