{
    "title": "Exploring the Use of Foundation Models for Named Entity Recognition and Lemmatization Tasks in Slavic Languages. (arXiv:2304.05336v1 [cs.CL])",
    "abstract": "This paper describes Adam Mickiewicz University's (AMU) solution for the 4th Shared Task on SlavNER. The task involves the identification, categorization, and lemmatization of named entities in Slavic languages. Our approach involved exploring the use of foundation models for these tasks. In particular, we used models based on the popular BERT and T5 model architectures. Additionally, we used external datasets to further improve the quality of our models. Our solution obtained promising results, achieving high metrics scores in both tasks. We describe our approach and the results of our experiments in detail, showing that the method is effective for NER and lemmatization in Slavic languages. Additionally, our models for lemmatization will be available at: https://huggingface.co/amu-cai.",
    "link": "http://arxiv.org/abs/2304.05336",
    "context": "Title: Exploring the Use of Foundation Models for Named Entity Recognition and Lemmatization Tasks in Slavic Languages. (arXiv:2304.05336v1 [cs.CL])\nAbstract: This paper describes Adam Mickiewicz University's (AMU) solution for the 4th Shared Task on SlavNER. The task involves the identification, categorization, and lemmatization of named entities in Slavic languages. Our approach involved exploring the use of foundation models for these tasks. In particular, we used models based on the popular BERT and T5 model architectures. Additionally, we used external datasets to further improve the quality of our models. Our solution obtained promising results, achieving high metrics scores in both tasks. We describe our approach and the results of our experiments in detail, showing that the method is effective for NER and lemmatization in Slavic languages. Additionally, our models for lemmatization will be available at: https://huggingface.co/amu-cai.",
    "path": "papers/23/04/2304.05336.json",
    "total_tokens": 907,
    "translated_title": "探究基础模型在斯拉夫语命名实体识别和词形还原任务中的应用",
    "translated_abstract": "本文介绍了亚当·密茨凯维奇大学 (AMU) 在SlavNER第四次共享任务中的解决方案。该任务涉及斯拉夫语中命名实体的识别、分类和词形还原。我们的方法主要涉及基础模型的应用，特别是使用基于流行的BERT和T5模型架构的模型。此外，我们还使用外部数据集进一步提高了模型的质量。我们的解决方案在两个任务中均取得了有希望的结果，达到了较高的指标得分。我们详细描述了我们的方法以及实验结果，表明该方法对斯拉夫语的NER和词形还原非常有效。此外，我们的词形还原模型将在 https://huggingface.co/amu-cai 上进行公开。",
    "tldr": "本文介绍了亚当·密茨凯维奇大学 (AMU) 在SlavNER第四次共享任务中探究使用基础模型的解决方案，通过使用基于流行的BERT和T5模型架构的模型和外部数据集，该方法对斯拉夫语的NER和词形还原非常有效，结果有希望。",
    "en_tdlr": "This paper describes Adam Mickiewicz University's (AMU) solution for the 4th Shared Task on SlavNER, which involves exploring the use of foundation models for NER and lemmatization tasks in Slavic languages. The approach used models based on BERT and T5 architectures and external datasets, achieving promising results in both tasks. The method was found to be effective for NER and lemmatization in Slavic languages."
}