{
    "title": "The Capacity and Robustness Trade-off: Revisiting the Channel Independent Strategy for Multivariate Time Series Forecasting. (arXiv:2304.05206v1 [cs.LG])",
    "abstract": "Multivariate time series data comprises various channels of variables. The multivariate forecasting models need to capture the relationship between the channels to accurately predict future values. However, recently, there has been an emergence of methods that employ the Channel Independent (CI) strategy. These methods view multivariate time series data as separate univariate time series and disregard the correlation between channels. Surprisingly, our empirical results have shown that models trained with the CI strategy outperform those trained with the Channel Dependent (CD) strategy, usually by a significant margin. Nevertheless, the reasons behind this phenomenon have not yet been thoroughly explored in the literature. This paper provides comprehensive empirical and theoretical analyses of the characteristics of multivariate time series datasets and the CI/CD strategy. Our results conclude that the CD approach has higher capacity but often lacks robustness to accurately predict dis",
    "link": "http://arxiv.org/abs/2304.05206",
    "context": "Title: The Capacity and Robustness Trade-off: Revisiting the Channel Independent Strategy for Multivariate Time Series Forecasting. (arXiv:2304.05206v1 [cs.LG])\nAbstract: Multivariate time series data comprises various channels of variables. The multivariate forecasting models need to capture the relationship between the channels to accurately predict future values. However, recently, there has been an emergence of methods that employ the Channel Independent (CI) strategy. These methods view multivariate time series data as separate univariate time series and disregard the correlation between channels. Surprisingly, our empirical results have shown that models trained with the CI strategy outperform those trained with the Channel Dependent (CD) strategy, usually by a significant margin. Nevertheless, the reasons behind this phenomenon have not yet been thoroughly explored in the literature. This paper provides comprehensive empirical and theoretical analyses of the characteristics of multivariate time series datasets and the CI/CD strategy. Our results conclude that the CD approach has higher capacity but often lacks robustness to accurately predict dis",
    "path": "papers/23/04/2304.05206.json",
    "total_tokens": 1007,
    "translated_title": "容量与鲁棒性之间的折衷：重访多元时间序列预测的通道独立策略",
    "translated_abstract": "多元时间序列数据包含各种变量通道。多元预测模型需要捕捉通道之间的关系，以准确预测未来的值。然而，最近出现了一些采用通道独立（CI）策略的方法。这些方法将多元时间序列数据视为分离的单元时间序列，忽略通道之间的相关性。令人惊讶的是，我们的实证结果表明，采用CI策略训练的模型通常比采用通道相关（CD）策略的模型表现更好，差距显著。然而，这种现象背后的原因尚未在文献中得到深入探讨。本文全面分析了多元时间序列数据集和CI / CD策略的特征。我们的结果表明，CD方法具有更高的容量，但通常缺乏鲁棒性以准确预测中断的时间序列。另一方面，CI方法牺牲了一些容量，但具有更高的鲁棒性，并且可以更好地处理缺失值和不规则的时间间隔。",
    "tldr": "本文研究了多元时间序列预测中的通道相关（CD）与通道独立（CI）策略。结果表明，CD策略容量更高但鲁棒性较差，CI策略鲁棒性更强且能更好地处理缺失值和不规则时间间隔。",
    "en_tdlr": "This paper studies the Channel Dependent (CD) and Channel Independent (CI) strategies for multivariate time series forecasting. Results show that CD approach has higher capacity but lower robustness, while CI approach has strong robustness and can handle missing values and irregular time intervals better at the cost of some capacity."
}