{
    "title": "A modular framework for stabilizing deep reinforcement learning control. (arXiv:2304.03422v1 [eess.SY])",
    "abstract": "We propose a framework for the design of feedback controllers that combines the optimization-driven and model-free advantages of deep reinforcement learning with the stability guarantees provided by using the Youla-Kucera parameterization to define the search domain. Recent advances in behavioral systems allow us to construct a data-driven internal model; this enables an alternative realization of the Youla-Kucera parameterization based entirely on input-output exploration data. Using a neural network to express a parameterized set of nonlinear stable operators enables seamless integration with standard deep learning libraries. We demonstrate the approach on a realistic simulation of a two-tank system.",
    "link": "http://arxiv.org/abs/2304.03422",
    "context": "Title: A modular framework for stabilizing deep reinforcement learning control. (arXiv:2304.03422v1 [eess.SY])\nAbstract: We propose a framework for the design of feedback controllers that combines the optimization-driven and model-free advantages of deep reinforcement learning with the stability guarantees provided by using the Youla-Kucera parameterization to define the search domain. Recent advances in behavioral systems allow us to construct a data-driven internal model; this enables an alternative realization of the Youla-Kucera parameterization based entirely on input-output exploration data. Using a neural network to express a parameterized set of nonlinear stable operators enables seamless integration with standard deep learning libraries. We demonstrate the approach on a realistic simulation of a two-tank system.",
    "path": "papers/23/04/2304.03422.json",
    "total_tokens": 870,
    "translated_title": "用于稳定深度强化学习控制的模块化框架",
    "translated_abstract": "我们提出了一个框架来设计反馈控制器，该框架结合了深度强化学习的优化驱动和无模型优势，以及使用Youla-Kucera参数化定义搜索域提供的稳定性保证。最近行为系统的进展使我们能够构建数据驱动的内部模型；这使得可以基于输入输出探索数据完全实现使用Youla-Kucera参数化的替代方法。使用神经网络来表示参数化的非线性稳定算子集，可以无缝地与标准深度学习库集成。我们在一个真实的两个水箱系统的模拟中演示了这种方法。",
    "tldr": "该论文提出了一个结合了深度强化学习的优化驱动和无模型优势、使用Youla-Kucera参数化定义搜索域提供稳定性保证的框架，利用一个数据驱动的内部模型实现替代方法，采用神经网络无缝地与标准深度学习库集成，实现了在一个真实的两个水箱系统的模拟中，通过表达参数化的非线性稳定算子集的方法，设计反馈控制器。",
    "en_tdlr": "This paper proposes a framework that combines the optimization-driven and model-free advantages of deep reinforcement learning with the stability guarantees provided by using the Youla-Kucera parameterization to define the search domain. By using a data-driven internal model, the framework achieves an alternative realization of the Youla-Kucera parameterization and seamlessly integrates with standard deep learning libraries through the use of a neural network to express a parameterized set of nonlinear stable operators. The approach is demonstrated on a realistic simulation of a two-tank system, where feedback controllers are designed by expressing a parameterized set of nonlinear stable operators."
}