{
    "title": "An experimental study in Real-time Facial Emotion Recognition on new 3RL dataset. (arXiv:2304.03064v1 [cs.CV])",
    "abstract": "Although real-time facial emotion recognition is a hot topic research domain in the field of human-computer interaction, state-of the-art available datasets still suffer from various problems, such as some unrelated photos such as document photos, unbalanced numbers of photos in each class, and misleading images that can negatively affect correct classification. The 3RL dataset was created, which contains approximately 24K images and will be publicly available, to overcome previously available dataset problems. The 3RL dataset is labelled with five basic emotions: happiness, fear, sadness, disgust, and anger. Moreover, we compared the 3RL dataset with other famous state-of-the-art datasets (FER dataset, CK+ dataset), and we applied the most commonly used algorithms in previous works, SVM and CNN. The results show a noticeable improvement in generalization on the 3RL dataset. Experiments have shown an accuracy of up to 91.4% on 3RL dataset using CNN where results on FER2013, CK+ are, re",
    "link": "http://arxiv.org/abs/2304.03064",
    "context": "Title: An experimental study in Real-time Facial Emotion Recognition on new 3RL dataset. (arXiv:2304.03064v1 [cs.CV])\nAbstract: Although real-time facial emotion recognition is a hot topic research domain in the field of human-computer interaction, state-of the-art available datasets still suffer from various problems, such as some unrelated photos such as document photos, unbalanced numbers of photos in each class, and misleading images that can negatively affect correct classification. The 3RL dataset was created, which contains approximately 24K images and will be publicly available, to overcome previously available dataset problems. The 3RL dataset is labelled with five basic emotions: happiness, fear, sadness, disgust, and anger. Moreover, we compared the 3RL dataset with other famous state-of-the-art datasets (FER dataset, CK+ dataset), and we applied the most commonly used algorithms in previous works, SVM and CNN. The results show a noticeable improvement in generalization on the 3RL dataset. Experiments have shown an accuracy of up to 91.4% on 3RL dataset using CNN where results on FER2013, CK+ are, re",
    "path": "papers/23/04/2304.03064.json",
    "total_tokens": 939,
    "translated_title": "一项关于新3RL数据集实时面部情感识别的实验研究",
    "translated_abstract": "虽然实时面部情感识别是人机交互领域的一个热门研究领域，但现有的最先进数据集仍存在各种问题，如一些与情感无关的照片（如文件照片），每类照片数量不平衡以及可能对正确分类产生负面影响的误导性图像。为了克服以前可用数据集的问题，我们创建了3RL数据集，其中包含约24K张图像，并且将公开提供。这个数据集被标记为五种基本情绪：快乐、恐惧、悲伤、厌恶和愤怒。此外，我们将3RL数据集与其他著名的最先进数据集（FER数据集、CK+数据集）进行了比较，并应用了先前工作中最常用的算法，如SVM和CNN。结果表明，在3RL数据集的泛化上有明显的提高。实验结果显示，使用CNN在3RL数据集上的准确率可达91.4％，而FER2013、CK +的结果则略低。",
    "tldr": "该论文介绍了新的3RL数据集，它是一种用于面部情感识别的数据集，通过与其他数据集进行比较，表现出了更好的泛化能力，并使用最先进的算法(cnn)实现了91.4％的准确率。",
    "en_tdlr": "This paper introduces a new dataset called 3RL, which is designed for facial emotion recognition. Through comparison with other datasets, it shows better generalization ability and achieves an accuracy rate of 91.4% using CNN, the state-of-the-art algorithm."
}