{
    "title": "MUDiff: Unified Diffusion for Complete Molecule Generation. (arXiv:2304.14621v1 [cs.LG])",
    "abstract": "We present a new model for generating molecular data by combining discrete and continuous diffusion processes. Our model generates a comprehensive representation of molecules, including atom features, 2D discrete molecule structures, and 3D continuous molecule coordinates. The use of diffusion processes allows for capturing the probabilistic nature of molecular processes and the ability to explore the effect of different factors on molecular structures and properties. Additionally, we propose a novel graph transformer architecture to denoise the diffusion process. The transformer is equivariant to Euclidean transformations, allowing it to learn invariant atom and edge representations while preserving the equivariance of atom coordinates. This transformer can be used to learn molecular representations robust to geometric transformations. We evaluate the performance of our model through experiments and comparisons with existing methods, showing its ability to generate more stable and val",
    "link": "http://arxiv.org/abs/2304.14621",
    "context": "Title: MUDiff: Unified Diffusion for Complete Molecule Generation. (arXiv:2304.14621v1 [cs.LG])\nAbstract: We present a new model for generating molecular data by combining discrete and continuous diffusion processes. Our model generates a comprehensive representation of molecules, including atom features, 2D discrete molecule structures, and 3D continuous molecule coordinates. The use of diffusion processes allows for capturing the probabilistic nature of molecular processes and the ability to explore the effect of different factors on molecular structures and properties. Additionally, we propose a novel graph transformer architecture to denoise the diffusion process. The transformer is equivariant to Euclidean transformations, allowing it to learn invariant atom and edge representations while preserving the equivariance of atom coordinates. This transformer can be used to learn molecular representations robust to geometric transformations. We evaluate the performance of our model through experiments and comparisons with existing methods, showing its ability to generate more stable and val",
    "path": "papers/23/04/2304.14621.json",
    "total_tokens": 918,
    "translated_title": "MUDiff: 统一扩散生成完整分子",
    "translated_abstract": "我们提出了一种新的分子数据生成模型，通过组合离散和连续扩散过程来生成分子数据。我们的模型生成了分子的全面表示，包括原子特征、二维离散分子结构和三维连续分子坐标。使用扩散过程可以捕捉分子过程的概率本质，并探索不同因素对分子结构和性质的影响。此外，我们提出了一种新颖的图形转换器架构，用于去噪扩散过程。转换器对欧几里得变换是等变的，使其能够学习不变的原子和边界表示，同时保持原子坐标的等变性。这种转换器可以用于学习对几何变换具有鲁棒性的分子表示。我们通过实验和与现有方法的比较评估了我们模型的性能，展示了其生成更稳定和有效的分子结构的能力。",
    "tldr": "MUDiff 是一种新的分子数据生成模型，它通过组合离散和连续扩散过程来生成全面的分子表示。使用扩散过程可以捕捉分子过程的概率本质，并探索不同因素对分子结构和性质的影响。我们的模型还包括一个新颖的图形转换器架构，用于去噪扩散过程。",
    "en_tdlr": "MUDiff is a new model for generating molecular data by combining discrete and continuous diffusion processes. Its use of diffusion processes allows for capturing the probabilistic nature of molecular processes and exploring the effect of different factors on molecular structures and properties. Additionally, it includes a novel graph transformer architecture for denoising the diffusion process."
}