{
    "title": "The Power of Typed Affine Decision Structures: A Case Study. (arXiv:2304.14888v1 [cs.LG])",
    "abstract": "TADS are a novel, concise white-box representation of neural networks. In this paper, we apply TADS to the problem of neural network verification, using them to generate either proofs or concise error characterizations for desirable neural network properties. In a case study, we consider the robustness of neural networks to adversarial attacks, i.e., small changes to an input that drastically change a neural networks perception, and show that TADS can be used to provide precise diagnostics on how and where robustness errors a occur. We achieve these results by introducing Precondition Projection, a technique that yields a TADS describing network behavior precisely on a given subset of its input space, and combining it with PCA, a traditional, well-understood dimensionality reduction technique. We show that PCA is easily compatible with TADS. All analyses can be implemented in a straightforward fashion using the rich algebraic properties of TADS, demonstrating the utility of the TADS fr",
    "link": "http://arxiv.org/abs/2304.14888",
    "context": "Title: The Power of Typed Affine Decision Structures: A Case Study. (arXiv:2304.14888v1 [cs.LG])\nAbstract: TADS are a novel, concise white-box representation of neural networks. In this paper, we apply TADS to the problem of neural network verification, using them to generate either proofs or concise error characterizations for desirable neural network properties. In a case study, we consider the robustness of neural networks to adversarial attacks, i.e., small changes to an input that drastically change a neural networks perception, and show that TADS can be used to provide precise diagnostics on how and where robustness errors a occur. We achieve these results by introducing Precondition Projection, a technique that yields a TADS describing network behavior precisely on a given subset of its input space, and combining it with PCA, a traditional, well-understood dimensionality reduction technique. We show that PCA is easily compatible with TADS. All analyses can be implemented in a straightforward fashion using the rich algebraic properties of TADS, demonstrating the utility of the TADS fr",
    "path": "papers/23/04/2304.14888.json",
    "total_tokens": 783,
    "translated_title": "有类型仿射决策结构的威力：一项案例研究",
    "translated_abstract": "TADS是一种新颖、简洁的神经网络白盒表示。本文将TADS应用于神经网络验证问题，使用TADS生成有关神经网络属性的证明或简洁误差特征。在一个案例研究中，我们考虑了神经网络对抗攻击（即输入微小变化导致神经网络知觉大幅度改变）的鲁棒性，并展示了TADS可以用于提供关于鲁棒性错误如何及其发生在何处的精确诊断。",
    "tldr": "TADS是一种新的神经网络表示方法，可用于生成有关神经网络属性的证明或者误差特征，本文通过一个案例研究表明TADS可以用于提供关于神经网络鲁棒性错误的精确诊断。",
    "en_tdlr": "TADS is a novel and concise white-box representation of neural networks, which is capable of generating proofs or concise error characterizations for desirable neural network properties. The paper demonstrates the utility of TADS through a case study on robustness of neural networks to adversarial attacks, where it provides precise diagnostics on how and where robustness errors occur."
}