{
    "title": "FLCC: Efficient Distributed Federated Learning on IoMT over CSMA/CA. (arXiv:2304.13549v1 [cs.DC])",
    "abstract": "Federated Learning (FL) has emerged as a promising approach for privacy preservation, allowing sharing of the model parameters between users and the cloud server rather than the raw local data. FL approaches have been adopted as a cornerstone of distributed machine learning (ML) to solve several complex use cases. FL presents an interesting interplay between communication and ML performance when implemented over distributed wireless nodes. Both the dynamics of networking and learning play an important role. In this article, we investigate the performance of FL on an application that might be used to improve a remote healthcare system over ad hoc networks which employ CSMA/CA to schedule its transmissions. Our FL over CSMA/CA (FLCC) model is designed to eliminate untrusted devices and harness frequency reuse and spatial clustering techniques to improve the throughput required for coordinating a distributed implementation of FL in the wireless network.  In our proposed model, frequency a",
    "link": "http://arxiv.org/abs/2304.13549",
    "context": "Title: FLCC: Efficient Distributed Federated Learning on IoMT over CSMA/CA. (arXiv:2304.13549v1 [cs.DC])\nAbstract: Federated Learning (FL) has emerged as a promising approach for privacy preservation, allowing sharing of the model parameters between users and the cloud server rather than the raw local data. FL approaches have been adopted as a cornerstone of distributed machine learning (ML) to solve several complex use cases. FL presents an interesting interplay between communication and ML performance when implemented over distributed wireless nodes. Both the dynamics of networking and learning play an important role. In this article, we investigate the performance of FL on an application that might be used to improve a remote healthcare system over ad hoc networks which employ CSMA/CA to schedule its transmissions. Our FL over CSMA/CA (FLCC) model is designed to eliminate untrusted devices and harness frequency reuse and spatial clustering techniques to improve the throughput required for coordinating a distributed implementation of FL in the wireless network.  In our proposed model, frequency a",
    "path": "papers/23/04/2304.13549.json",
    "total_tokens": 826,
    "translated_title": "FLCC: 无线CSMA/CA网络上高效的分布式联邦学习",
    "translated_abstract": "联邦学习（FL）已成为隐私保护的一种有前途的方法，允许在用户和云服务器之间共享模型参数，而不是原始的本地数据。在分布式无线节点中实现FL时，FL方法在通信和机器学习性能之间呈现出有趣的相互作用。网络动态和学习都发挥着重要作用。本文研究了在应用程序上使用FL来改进远程医疗系统的性能，该系统在采用CSMA/CA进行调度时使用自组织网络。我们提出的FLCC（在CSMA/CA上实现的FL）模型旨在消除不可信的设备，并利用频率复用和空间聚类技术，提高协调分布式实现FL所需的吞吐量。在我们提出的模型中，频率和位置的选择对实现高效的分布式学习至关重要。",
    "tldr": "本文研究了在无线网络中实现FLCC的方法，该方法利用频率复用和空间聚类技术，提高了分布式学习的吞吐量和性能。"
}