{
    "title": "Mask Detection and Classification in Thermal Face Images. (arXiv:2304.02931v1 [cs.CV])",
    "abstract": "Face masks are recommended to reduce the transmission of many viruses, especially SARS-CoV-2. Therefore, the automatic detection of whether there is a mask on the face, what type of mask is worn, and how it is worn is an important research topic. In this work, the use of thermal imaging was considered to analyze the possibility of detecting (localizing) a mask on the face, as well as to check whether it is possible to classify the type of mask on the face. The previously proposed dataset of thermal images was extended and annotated with the description of a type of mask and a location of a mask within a face. Different deep learning models were adapted. The best model for face mask detection turned out to be the Yolov5 model in the \"nano\" version, reaching mAP higher than 97% and precision of about 95%. High accuracy was also obtained for mask type classification. The best results were obtained for the convolutional neural network model built on an autoencoder initially trained in the ",
    "link": "http://arxiv.org/abs/2304.02931",
    "context": "Title: Mask Detection and Classification in Thermal Face Images. (arXiv:2304.02931v1 [cs.CV])\nAbstract: Face masks are recommended to reduce the transmission of many viruses, especially SARS-CoV-2. Therefore, the automatic detection of whether there is a mask on the face, what type of mask is worn, and how it is worn is an important research topic. In this work, the use of thermal imaging was considered to analyze the possibility of detecting (localizing) a mask on the face, as well as to check whether it is possible to classify the type of mask on the face. The previously proposed dataset of thermal images was extended and annotated with the description of a type of mask and a location of a mask within a face. Different deep learning models were adapted. The best model for face mask detection turned out to be the Yolov5 model in the \"nano\" version, reaching mAP higher than 97% and precision of about 95%. High accuracy was also obtained for mask type classification. The best results were obtained for the convolutional neural network model built on an autoencoder initially trained in the ",
    "path": "papers/23/04/2304.02931.json",
    "total_tokens": 785,
    "translated_title": "热成像下口罩的检测和分类",
    "translated_abstract": "口罩的使用可以减少病毒，特别是SARS-CoV-2的传播，因此自动检测口罩的佩戴情况以及口罩类型和佩戴方式等是一个重要的研究课题。本文考虑使用热成像技术分析在面部检测和分类口罩类型的可行性，并扩展并注释了现有的热成像数据集。不同的深度学习模型被适应，最好的模型为nano版本的Yolov5模型，并取得了mAP大于97％和精度约为95％的高精度。",
    "tldr": "本文利用热成像技术，检测口罩是否佩戴及分类类型，最佳模型为nano版本的Yolov5模型，达到97%以上的高准确度。",
    "en_tdlr": "This paper considers the feasibility of detecting and classifying mask types using thermal imaging technology, and extends and annotates an existing thermal imaging dataset. The best model is the nano version of the Yolov5 model, which achieves a high accuracy of over 97% in detecting whether masks are worn and classifying their type."
}