{
    "title": "TGNN: A Joint Semi-supervised Framework for Graph-level Classification. (arXiv:2304.11688v1 [cs.LG])",
    "abstract": "This paper studies semi-supervised graph classification, a crucial task with a wide range of applications in social network analysis and bioinformatics. Recent works typically adopt graph neural networks to learn graph-level representations for classification, failing to explicitly leverage features derived from graph topology (e.g., paths). Moreover, when labeled data is scarce, these methods are far from satisfactory due to their insufficient topology exploration of unlabeled data. We address the challenge by proposing a novel semi-supervised framework called Twin Graph Neural Network (TGNN). To explore graph structural information from complementary views, our TGNN has a message passing module and a graph kernel module. To fully utilize unlabeled data, for each module, we calculate the similarity of each unlabeled graph to other labeled graphs in the memory bank and our consistency loss encourages consistency between two similarity distributions in different embedding spaces. The tw",
    "link": "http://arxiv.org/abs/2304.11688",
    "context": "Title: TGNN: A Joint Semi-supervised Framework for Graph-level Classification. (arXiv:2304.11688v1 [cs.LG])\nAbstract: This paper studies semi-supervised graph classification, a crucial task with a wide range of applications in social network analysis and bioinformatics. Recent works typically adopt graph neural networks to learn graph-level representations for classification, failing to explicitly leverage features derived from graph topology (e.g., paths). Moreover, when labeled data is scarce, these methods are far from satisfactory due to their insufficient topology exploration of unlabeled data. We address the challenge by proposing a novel semi-supervised framework called Twin Graph Neural Network (TGNN). To explore graph structural information from complementary views, our TGNN has a message passing module and a graph kernel module. To fully utilize unlabeled data, for each module, we calculate the similarity of each unlabeled graph to other labeled graphs in the memory bank and our consistency loss encourages consistency between two similarity distributions in different embedding spaces. The tw",
    "path": "papers/23/04/2304.11688.json",
    "total_tokens": 885,
    "translated_abstract": "本文研究半监督图分类，这是社交网络分析和生物信息学中有广泛应用的重要任务。最近的研究通常采用图神经网络学习用于分类的图级表示，但未明确利用从图拓扑（例如路径）中得出的特征。此外，当标记数据不足时，这些方法由于对未标记数据的不足拓扑探索而远非令人满意。为解决这一挑战，我们提出了一种新的半监督框架，称为双图神经网络（TGNN）。为了从互补视角探索图结构信息，我们的TGNN具有消息传递模块和图核模块。为了充分利用未标记数据，对于每个模块，我们计算每个未标记图形与存储在内存库中的其他标记图形的相似度，并且我们的一致性损失鼓励两个嵌入空间中不同相似度分布之间的一致性。",
    "tldr": "TGNN提出了一种新的半监督框架来解决图级分类任务，其利用了从图表征中得到的特征，充分利用了未标记数据，在内存库中计算相似度并鼓励不同嵌入空间中的一致性。",
    "en_tdlr": "TGNN proposes a novel semi-supervised framework for graph-level classification, leveraging features derived from graph topology and fully utilizing unlabeled data by calculating similarity and encouraging consistency between distribution spaces."
}