{
    "title": "Latent diffusion models for generative precipitation nowcasting with accurate uncertainty quantification. (arXiv:2304.12891v1 [physics.ao-ph])",
    "abstract": "Diffusion models have been widely adopted in image generation, producing higher-quality and more diverse samples than generative adversarial networks (GANs). We introduce a latent diffusion model (LDM) for precipitation nowcasting - short-term forecasting based on the latest observational data. The LDM is more stable and requires less computation to train than GANs, albeit with more computationally expensive generation. We benchmark it against the GAN-based Deep Generative Models of Rainfall (DGMR) and a statistical model, PySTEPS. The LDM produces more accurate precipitation predictions, while the comparisons are more mixed when predicting whether the precipitation exceeds predefined thresholds. The clearest advantage of the LDM is that it generates more diverse predictions than DGMR or PySTEPS. Rank distribution tests indicate that the distribution of samples from the LDM accurately reflects the uncertainty of the predictions. Thus, LDMs are promising for any applications where uncer",
    "link": "http://arxiv.org/abs/2304.12891",
    "context": "Title: Latent diffusion models for generative precipitation nowcasting with accurate uncertainty quantification. (arXiv:2304.12891v1 [physics.ao-ph])\nAbstract: Diffusion models have been widely adopted in image generation, producing higher-quality and more diverse samples than generative adversarial networks (GANs). We introduce a latent diffusion model (LDM) for precipitation nowcasting - short-term forecasting based on the latest observational data. The LDM is more stable and requires less computation to train than GANs, albeit with more computationally expensive generation. We benchmark it against the GAN-based Deep Generative Models of Rainfall (DGMR) and a statistical model, PySTEPS. The LDM produces more accurate precipitation predictions, while the comparisons are more mixed when predicting whether the precipitation exceeds predefined thresholds. The clearest advantage of the LDM is that it generates more diverse predictions than DGMR or PySTEPS. Rank distribution tests indicate that the distribution of samples from the LDM accurately reflects the uncertainty of the predictions. Thus, LDMs are promising for any applications where uncer",
    "path": "papers/23/04/2304.12891.json",
    "total_tokens": 979,
    "translated_title": "潜在扩散模型用于具有准确不确定性量化的生成性降水现预报",
    "translated_abstract": "扩散模型已被广泛采用于图像生成，产生的样本质量更高、更多样化，比生成对抗网络（GAN）更有效。我们介绍了一种潜在扩散模型（LDM）用于降水即时预报，即基于最新观测数据的短期预测。LDM比GAN更稳定，需要更少的计算量进行训练，但对于生成而言需要更多的计算量。我们将其与基于GAN的Deep Generative Models of Rainfall（DGMR）和统计模型PySTEPS进行了基准测试。结果表明，LDM产生了更准确的降水预报，当预测降水是否超过预定义阈值时，比较结果更加混合。 LDM的最大优势在于它产生的预测更加多样化。等级分布测试表明，从LDM中取样的分布准确反映了预测的不确定性。因此，LDM在需要关注不确定性和多样性预测的任何应用中都非常有前景，例如在重大气象事件的决策中。",
    "tldr": "LDM模型可以用于降水预测，相较于GAN等其他模型，LDM不仅更稳定、需要更少的计算量，还能产生更多样化和更准确的降水预测，是对于需要考虑不确定性和预测多样性的决策-making 的相关应用非常有前景的。",
    "en_tdlr": "LDM models can be used for precipitation forecasting, which generates more diverse and accurate precipitation predictions compared to other models like GAN while being more stable and requires less computation. It accurately reflects the uncertainty of the predictions, making it promising for decision-making in severe weather events that require considering uncertainty and prediction diversity."
}