{
    "title": "On the Feasibility and Robustness of Pointwise Evaluation of Query Performance Prediction. (arXiv:2304.00310v1 [cs.IR])",
    "abstract": "Despite the retrieval effectiveness of queries being mutually independent of one another, the evaluation of query performance prediction (QPP) systems has been carried out by measuring rank correlation over an entire set of queries. Such a listwise approach has a number of disadvantages, notably that it does not support the common requirement of assessing QPP for individual queries. In this paper, we propose a pointwise QPP framework that allows us to evaluate the quality of a QPP system for individual queries by measuring the deviations between each prediction versus the corresponding true value, and then aggregating the results over a set of queries. Our experiments demonstrate that this new approach leads to smaller variances in QPP evaluations across a range of different target metrics and retrieval models.",
    "link": "http://arxiv.org/abs/2304.00310",
    "context": "Title: On the Feasibility and Robustness of Pointwise Evaluation of Query Performance Prediction. (arXiv:2304.00310v1 [cs.IR])\nAbstract: Despite the retrieval effectiveness of queries being mutually independent of one another, the evaluation of query performance prediction (QPP) systems has been carried out by measuring rank correlation over an entire set of queries. Such a listwise approach has a number of disadvantages, notably that it does not support the common requirement of assessing QPP for individual queries. In this paper, we propose a pointwise QPP framework that allows us to evaluate the quality of a QPP system for individual queries by measuring the deviations between each prediction versus the corresponding true value, and then aggregating the results over a set of queries. Our experiments demonstrate that this new approach leads to smaller variances in QPP evaluations across a range of different target metrics and retrieval models.",
    "path": "papers/23/04/2304.00310.json",
    "total_tokens": 798,
    "translated_title": "论点级别评价系统的可行性和鲁棒性",
    "translated_abstract": "虽然查询的检索有效性彼此独立，但是查询性能预测(QPP)系统的评估一直是通过测量整个查询集合上的等级相关性来完成的。这种列表方法有许多缺点，尤其是它不支持评估单个查询的QPP的常见要求。在本文中，我们提出了一个点对点的QPP框架，通过测量每个预测与相应真实值之间的偏差，然后在一组查询上聚合结果，可以评估QPP系统对各个查询的质量。我们的实验表明，这种新方法在各种目标指标和检索模型上均导致QPP评估方差更小。",
    "tldr": "提出了一种点对点的QPP框架，通过测量每个预测与相应真实值之间的偏差来评估QPP系统的单个查询质量，得到的方法能够在各种目标指标和检索模型上导致更小的QPP评估方差。",
    "en_tdlr": "A pointwise QPP framework is proposed in this paper to evaluate the quality of a QPP system for individual queries by measuring the deviations between each prediction versus the corresponding true value and aggregating the results over a set of queries. The new approach leads to smaller variances in QPP evaluations across a range of different target metrics and retrieval models."
}