{
    "title": "Cross Attention Transformers for Multi-modal Unsupervised Whole-Body PET Anomaly Detection. (arXiv:2304.07147v1 [eess.IV])",
    "abstract": "Cancer is a highly heterogeneous condition that can occur almost anywhere in the human body. 18F-fluorodeoxyglucose is an imaging modality commonly used to detect cancer due to its high sensitivity and clear visualisation of the pattern of metabolic activity. Nonetheless, as cancer is highly heterogeneous, it is challenging to train general-purpose discriminative cancer detection models, with data availability and disease complexity often cited as a limiting factor. Unsupervised anomaly detection models have been suggested as a putative solution. These models learn a healthy representation of tissue and detect cancer by predicting deviations from the healthy norm, which requires models capable of accurately learning long-range interactions between organs and their imaging patterns with high levels of expressivity. Such characteristics are suitably satisfied by transformers, which have been shown to generate state-of-the-art results in unsupervised anomaly detection by training on norma",
    "link": "http://arxiv.org/abs/2304.07147",
    "context": "Title: Cross Attention Transformers for Multi-modal Unsupervised Whole-Body PET Anomaly Detection. (arXiv:2304.07147v1 [eess.IV])\nAbstract: Cancer is a highly heterogeneous condition that can occur almost anywhere in the human body. 18F-fluorodeoxyglucose is an imaging modality commonly used to detect cancer due to its high sensitivity and clear visualisation of the pattern of metabolic activity. Nonetheless, as cancer is highly heterogeneous, it is challenging to train general-purpose discriminative cancer detection models, with data availability and disease complexity often cited as a limiting factor. Unsupervised anomaly detection models have been suggested as a putative solution. These models learn a healthy representation of tissue and detect cancer by predicting deviations from the healthy norm, which requires models capable of accurately learning long-range interactions between organs and their imaging patterns with high levels of expressivity. Such characteristics are suitably satisfied by transformers, which have been shown to generate state-of-the-art results in unsupervised anomaly detection by training on norma",
    "path": "papers/23/04/2304.07147.json",
    "total_tokens": 959,
    "translated_title": "多模态无监督全身PET异常检测的交叉注意力变换器",
    "translated_abstract": "癌症是一种高度异质性的疾病，可以在人体的几乎任何部位发生。18F-氟脱氧葡萄糖是一种常用于检测癌症的成像模式，由于其高灵敏度和代谢活性模式的明显可视化。尽管如此，由于癌症高度异质性，训练通用的区分性癌症检测模型是具有挑战性的，数据可用性和疾病复杂性常常被认为是一项限制性因素。无监督的异常检测模型被提出作为一种解决方案。这些模型学习健康组织的表示，并通过预测与健康正常的偏差来检测癌症，这需要具有高度表现力的器官之间和它们的成像模式之间准确学习长程交互的模型。这些特征通过变换器得到了满足，变换器已经被证明在无监督异常检测方面产生了最先进的结果，通过训练正常的PET成像数据来实现。",
    "tldr": "本论文提出了一种基于交叉注意力变换器的多模态无监督全身PET异常检测方法，该方法利用变换器强大的建模能力实现了高效准确地学习器官间和其成像模式的长程交互，并取得了最先进的结果。",
    "en_tdlr": "This paper proposes a cross attention transformer-based multi-modal unsupervised whole-body PET anomaly detection method, which utilizes the powerful modeling ability of transformers to efficiently and accurately learn long-range interactions between organs and their imaging patterns, and achieves state-of-the-art results."
}