{
    "title": "Portuguese Households Savings in Times of Pandemic: A Way to Better Resist the Escalating Inflation?. (arXiv:2304.02573v1 [econ.GN])",
    "abstract": "March 2020 confinement has shot Portuguese savings to historic levels, reaching 13.4% of gross disposable income in early 2021 (INE, 2023). To find similar savings figures we need to go back to 1999. With consumption reduced to a bare minimum, the Portuguese were forced to save. Households reduced spending more because of a lack of alternatives to consumption than for any other reason. The relationship between consumption, savings, and income has occupied an important role in economic thought [(Keynes, 1936; 1937); (Friedman, 1957)]. Traditionally, high levels of savings have been associated with benefits to the economy, since financing capacity is enhanced (Singh, 2010). However, the effects here can be twofold. On the one hand, it seems that Portugal faced the so-called Savings Paradox (Keynes, 1936). If consumers decide to save a considerable part of their income, there will be less demand for the goods produced. Lower demand will lead to lower supply, production, income, and, parad",
    "link": "http://arxiv.org/abs/2304.02573",
    "context": "Title: Portuguese Households Savings in Times of Pandemic: A Way to Better Resist the Escalating Inflation?. (arXiv:2304.02573v1 [econ.GN])\nAbstract: March 2020 confinement has shot Portuguese savings to historic levels, reaching 13.4% of gross disposable income in early 2021 (INE, 2023). To find similar savings figures we need to go back to 1999. With consumption reduced to a bare minimum, the Portuguese were forced to save. Households reduced spending more because of a lack of alternatives to consumption than for any other reason. The relationship between consumption, savings, and income has occupied an important role in economic thought [(Keynes, 1936; 1937); (Friedman, 1957)]. Traditionally, high levels of savings have been associated with benefits to the economy, since financing capacity is enhanced (Singh, 2010). However, the effects here can be twofold. On the one hand, it seems that Portugal faced the so-called Savings Paradox (Keynes, 1936). If consumers decide to save a considerable part of their income, there will be less demand for the goods produced. Lower demand will lead to lower supply, production, income, and, parad",
    "path": "papers/23/04/2304.02573.json",
    "total_tokens": 873,
    "translated_title": "疫情期间葡萄牙家庭的储蓄: 应对不断上涨的通货膨胀的一种方式?",
    "translated_abstract": "2020年3月的封锁使葡萄牙的储蓄率达到历史最高水平，在2021年初达到可支配总收入的13.4%(INE,2023)。要找到类似的储蓄数据，我们需要回到1999年。由于没有其他消费选择，家庭减少了支出。消费、储蓄和收入之间的关系在经济思想中占据了重要地位 [(Keynes, 1936; 1937); (Friedman, 1957)]。传统上，高水平的储蓄与经济受益有关，因为融资能力得到提升(Singh,2010)。然而，这里的影响可能是两面的。",
    "tldr": "疫情期间，葡萄牙家庭的储蓄率创下历史新高，然而，由于储蓄对经济产生了负面影响，会导致需求下降、生产下降、收入下降等一系列连锁反应。"
}