{
    "title": "SimbaML: Connecting Mechanistic Models and Machine Learning with Augmented Data. (arXiv:2304.04000v1 [cs.LG])",
    "abstract": "Training sophisticated machine learning (ML) models requires large datasets that are difficult or expensive to collect for many applications. If prior knowledge about system dynamics is available, mechanistic representations can be used to supplement real-world data. We present SimbaML (Simulation-Based ML), an open-source tool that unifies realistic synthetic dataset generation from ordinary differential equation-based models and the direct analysis and inclusion in ML pipelines. SimbaML conveniently enables investigating transfer learning from synthetic to real-world data, data augmentation, identifying needs for data collection, and benchmarking physics-informed ML approaches. SimbaML is available from https://pypi.org/project/simba-ml/.",
    "link": "http://arxiv.org/abs/2304.04000",
    "context": "Title: SimbaML: Connecting Mechanistic Models and Machine Learning with Augmented Data. (arXiv:2304.04000v1 [cs.LG])\nAbstract: Training sophisticated machine learning (ML) models requires large datasets that are difficult or expensive to collect for many applications. If prior knowledge about system dynamics is available, mechanistic representations can be used to supplement real-world data. We present SimbaML (Simulation-Based ML), an open-source tool that unifies realistic synthetic dataset generation from ordinary differential equation-based models and the direct analysis and inclusion in ML pipelines. SimbaML conveniently enables investigating transfer learning from synthetic to real-world data, data augmentation, identifying needs for data collection, and benchmarking physics-informed ML approaches. SimbaML is available from https://pypi.org/project/simba-ml/.",
    "path": "papers/23/04/2304.04000.json",
    "total_tokens": 772,
    "translated_title": "SimbaML：使用增强数据连接机械模型和机器学习模型。",
    "translated_abstract": "训练复杂的机器学习模型需要大量数据集，但对于许多应用程序来说，收集这些数据集往往是困难或昂贵的。如果有系统动态的先验知识，则可以使用机械模型来补充真实世界的数据。我们提出了SimbaML（基于仿真的机器学习），这是一个开源工具，它通过普通微分方程模型生成逼真的合成数据集，并直接将其用于机器学习管道的分析和包含。 SimbaML方便地启用了从合成到真实数据的转移学习，数据增强，确定对数据收集的需求以及基准测试物理启发式机器学习方法。SimbaML可在https://pypi.org/project/simba-ml/上获取。",
    "tldr": "SimbaML是一个机器学习工具，它通过机械模型补充真实世界的数据集，实现了从合成到真实数据的转移学习、数据增强、物理启发式机器学习方法的基准测试等多项功能。",
    "en_tdlr": "SimbaML is a machine learning tool that supplements real-world datasets with mechanistic models, enabling various functions such as transfer learning, data augmentation and benchmarking of physics-informed machine learning approaches."
}