{
    "title": "The Estimation Risk in Extreme Systemic Risk Forecasts. (arXiv:2304.10349v1 [stat.ME])",
    "abstract": "Systemic risk measures have been shown to be predictive of financial crises and declines in real activity. Thus, forecasting them is of major importance in finance and economics. In this paper, we propose a new forecasting method for systemic risk as measured by the marginal expected shortfall (MES). It is based on first de-volatilizing the observations and, then, calculating systemic risk for the residuals using an estimator based on extreme value theory. We show the validity of the method by establishing the asymptotic normality of the MES forecasts. The good finite-sample coverage of the implied MES forecast intervals is confirmed in simulations. An empirical application to major US banks illustrates the significant time variation in the precision of MES forecasts, and explores the implications of this fact from a regulatory perspective.",
    "link": "http://arxiv.org/abs/2304.10349",
    "context": "Title: The Estimation Risk in Extreme Systemic Risk Forecasts. (arXiv:2304.10349v1 [stat.ME])\nAbstract: Systemic risk measures have been shown to be predictive of financial crises and declines in real activity. Thus, forecasting them is of major importance in finance and economics. In this paper, we propose a new forecasting method for systemic risk as measured by the marginal expected shortfall (MES). It is based on first de-volatilizing the observations and, then, calculating systemic risk for the residuals using an estimator based on extreme value theory. We show the validity of the method by establishing the asymptotic normality of the MES forecasts. The good finite-sample coverage of the implied MES forecast intervals is confirmed in simulations. An empirical application to major US banks illustrates the significant time variation in the precision of MES forecasts, and explores the implications of this fact from a regulatory perspective.",
    "path": "papers/23/04/2304.10349.json",
    "total_tokens": 795,
    "translated_title": "极端系统性风险预测中的估值风险",
    "translated_abstract": "系统性风险度量已被证明对金融危机和实际活动下降具有预测作用。因此，在金融和经济学中进行预测是至关重要的。本文提出了一种基于极值理论的估计器，针对残差计算系统风险的一种新的系统性风险预测方法，即测度为边际预期损失的系统风险。我们通过建立MES预测的渐近正态性来展示该方法的有效性。通过模拟实验，我们确认了隐含的MES预测区间在有限样本中的覆盖率良好。 美国主要银行的实证应用说明了MES预测精度在时间上的显著变化，并从监管的角度探讨了这一事实的影响。",
    "tldr": "本文提出了一种基于极值理论的估计器的系统性风险预测方法，并通过建立MES预测的渐近正态性展示了其有效性。",
    "en_tdlr": "This paper proposes a new forecasting method for systemic risk using an estimator based on extreme value theory, which is validated by establishing the asymptotic normality of the MES forecasts. The significant time variation in the precision of MES forecasts is illustrated in an empirical application to major US banks."
}