{
    "title": "Robust and Fast Vehicle Detection using Augmented Confidence Map. (arXiv:2304.14462v1 [cs.CV])",
    "abstract": "Vehicle detection in real-time scenarios is challenging because of the time constraints and the presence of multiple types of vehicles with different speeds, shapes, structures, etc. This paper presents a new method relied on generating a confidence map-for robust and faster vehicle detection. To reduce the adverse effect of different speeds, shapes, structures, and the presence of several vehicles in a single image, we introduce the concept of augmentation which highlights the region of interest containing the vehicles. The augmented map is generated by exploring the combination of multiresolution analysis and maximally stable extremal regions (MR-MSER). The output of MR-MSER is supplied to fast CNN to generate a confidence map, which results in candidate regions. Furthermore, unlike existing models that implement complicated models for vehicle detection, we explore the combination of a rough set and fuzzy-based models for robust vehicle detection. To show the effectiveness of the pro",
    "link": "http://arxiv.org/abs/2304.14462",
    "context": "Title: Robust and Fast Vehicle Detection using Augmented Confidence Map. (arXiv:2304.14462v1 [cs.CV])\nAbstract: Vehicle detection in real-time scenarios is challenging because of the time constraints and the presence of multiple types of vehicles with different speeds, shapes, structures, etc. This paper presents a new method relied on generating a confidence map-for robust and faster vehicle detection. To reduce the adverse effect of different speeds, shapes, structures, and the presence of several vehicles in a single image, we introduce the concept of augmentation which highlights the region of interest containing the vehicles. The augmented map is generated by exploring the combination of multiresolution analysis and maximally stable extremal regions (MR-MSER). The output of MR-MSER is supplied to fast CNN to generate a confidence map, which results in candidate regions. Furthermore, unlike existing models that implement complicated models for vehicle detection, we explore the combination of a rough set and fuzzy-based models for robust vehicle detection. To show the effectiveness of the pro",
    "path": "papers/23/04/2304.14462.json",
    "total_tokens": 977,
    "translated_title": "基于增强置信度图的鲁棒快速车辆检测",
    "translated_abstract": "实时场景下的车辆检测由于时间限制和多种类型的车辆（速度、形状、结构等）的存在而具有挑战性。本文提出了一种基于生成置信度图的新方法，用于实现鲁棒快速的车辆检测。为了减少不同速度、形状、结构和单张图像中多个车辆的不良影响，我们引入了增强的概念，强调包含车辆的感兴趣区域。增强的地图是通过探索多分辨率分析和极值稳定区域（MR-MSER）的组合来生成的。 MR-MSER的输出输入快速CNN以生成置信度图，从而得出候选区域。此外，与现有模型实现复杂模型的车辆检测不同，我们探索粗糙集和基于模糊的模型的组合，以实现鲁棒的车辆检测。",
    "tldr": "提出了一种基于增强置信度图的鲁棒快速车辆检测方法，通过组合多分辨率分析和极值稳定区域，生成增强置信度图，再通过快速CNN生成候选区域，有效地减少了不同速度、形状、结构和单张图像中多个车辆的影响，并采用粗糙集和基于模糊的模型实现了鲁棒的车辆检测。"
}