{
    "title": "Bayesian Federated Learning: A Survey. (arXiv:2304.13267v1 [cs.LG])",
    "abstract": "Federated learning (FL) demonstrates its advantages in integrating distributed infrastructure, communication, computing and learning in a privacy-preserving manner. However, the robustness and capabilities of existing FL methods are challenged by limited and dynamic data and conditions, complexities including heterogeneities and uncertainties, and analytical explainability. Bayesian federated learning (BFL) has emerged as a promising approach to address these issues. This survey presents a critical overview of BFL, including its basic concepts, its relations to Bayesian learning in the context of FL, and a taxonomy of BFL from both Bayesian and federated perspectives. We categorize and discuss client- and server-side and FL-based BFL methods and their pros and cons. The limitations of the existing BFL methods and the future directions of BFL research further address the intricate requirements of real-life FL applications.",
    "link": "http://arxiv.org/abs/2304.13267",
    "context": "Title: Bayesian Federated Learning: A Survey. (arXiv:2304.13267v1 [cs.LG])\nAbstract: Federated learning (FL) demonstrates its advantages in integrating distributed infrastructure, communication, computing and learning in a privacy-preserving manner. However, the robustness and capabilities of existing FL methods are challenged by limited and dynamic data and conditions, complexities including heterogeneities and uncertainties, and analytical explainability. Bayesian federated learning (BFL) has emerged as a promising approach to address these issues. This survey presents a critical overview of BFL, including its basic concepts, its relations to Bayesian learning in the context of FL, and a taxonomy of BFL from both Bayesian and federated perspectives. We categorize and discuss client- and server-side and FL-based BFL methods and their pros and cons. The limitations of the existing BFL methods and the future directions of BFL research further address the intricate requirements of real-life FL applications.",
    "path": "papers/23/04/2304.13267.json",
    "total_tokens": 932,
    "translated_title": "贝叶斯联邦学习：综述",
    "translated_abstract": "联邦学习（FL）以隐私保护的方式整合了分布式基础设施、通信、计算和学习，展示了其优势。然而，现有FL方法的鲁棒性和能力受到有限和动态的数据和条件，包括异质性和不确定性，以及分析解释能力的挑战。贝叶斯联邦学习（BFL）已成为解决这些问题的一种有前途的方法。本综述对BFL进行了批判性的概述，包括其基本概念，其在FL上下文中与贝叶斯学习的关系，以及从贝叶斯和联邦学习的角度对BFL进行分类和讨论。我们将客户端和服务器端的BFL方法以及基于FL的BFL方法进行了分类和讨论，分析了它们的优缺点。本文还讨论了现有BFL方法的局限性以及BFL研究的未来方向，以进一步满足现实生活中FL应用的复杂需求。",
    "tldr": "本文综述了贝叶斯联邦学习（BFL）的基本概念和分类，包括客户端、服务器端和基于FL的BFL方法。BFL是解决现有FL方法中受限和动态的数据和条件、异质性和不确定性以及分析解释能力挑战的有前途方法。",
    "en_tdlr": "This survey provides a critical overview of Bayesian federated learning (BFL) and its categorization, including client-side, server-side, and FL-based methods. BFL is a promising approach to address the challenges faced by existing FL methods, including limited and dynamic data, heterogeneities and uncertainties, and analytical explainability challenges in real-life FL applications."
}