{
    "title": "Habits and goals in synergy: a variational Bayesian framework for behavior. (arXiv:2304.05008v1 [cs.LG])",
    "abstract": "How to behave efficiently and flexibly is a central problem for understanding biological agents and creating intelligent embodied AI. It has been well known that behavior can be classified as two types: reward-maximizing habitual behavior, which is fast while inflexible; and goal-directed behavior, which is flexible while slow. Conventionally, habitual and goal-directed behaviors are considered handled by two distinct systems in the brain. Here, we propose to bridge the gap between the two behaviors, drawing on the principles of variational Bayesian theory. We incorporate both behaviors in one framework by introducing a Bayesian latent variable called \"intention\". The habitual behavior is generated by using prior distribution of intention, which is goal-less; and the goal-directed behavior is generated by the posterior distribution of intention, which is conditioned on the goal. Building on this idea, we present a novel Bayesian framework for modeling behaviors. Our proposed framework ",
    "link": "http://arxiv.org/abs/2304.05008",
    "context": "Title: Habits and goals in synergy: a variational Bayesian framework for behavior. (arXiv:2304.05008v1 [cs.LG])\nAbstract: How to behave efficiently and flexibly is a central problem for understanding biological agents and creating intelligent embodied AI. It has been well known that behavior can be classified as two types: reward-maximizing habitual behavior, which is fast while inflexible; and goal-directed behavior, which is flexible while slow. Conventionally, habitual and goal-directed behaviors are considered handled by two distinct systems in the brain. Here, we propose to bridge the gap between the two behaviors, drawing on the principles of variational Bayesian theory. We incorporate both behaviors in one framework by introducing a Bayesian latent variable called \"intention\". The habitual behavior is generated by using prior distribution of intention, which is goal-less; and the goal-directed behavior is generated by the posterior distribution of intention, which is conditioned on the goal. Building on this idea, we present a novel Bayesian framework for modeling behaviors. Our proposed framework ",
    "path": "papers/23/04/2304.05008.json",
    "total_tokens": 900,
    "translated_title": "习惯与目标的协同作用：一种基于变分贝叶斯框架的行为模型",
    "translated_abstract": "如何高效、灵活地行为是理解生物机体和创建智能化身人工智能的核心问题。行为被归类为两种类型：快速而不灵活的奖励最大化的习惯行为，和灵活而慢的目标导向行为。传统上，习惯和目标导向行为被认为是由大脑中的两个不同系统处理的。本文提出基于变分贝叶斯理论，将这两种行为联系起来，引入一种贝叶斯潜变量称为“意图”。习惯性行为是通过使用意图的先验分布生成的，该先验分布是没有目标的；而目标导向行为是由意图的后验分布生成的，该后验分布取决于目标。基于这个想法，我们提出了一种新颖的行为建模的贝叶斯框架。",
    "tldr": "本文提出一种基于变分贝叶斯理论的行为模型，通过引入一种贝叶斯潜变量“意图”，将习惯性行为和目标导向行为联系起来，从而实现更灵活、高效的行为模拟。",
    "en_tdlr": "This paper proposes a novel Bayesian framework for modeling behavior by introducing a Bayesian latent variable called \"intention\", which links habitual and goal-directed behavior, allowing for more flexible and efficient behavior simulation."
}