{
    "title": "Correcting Model Misspecification via Generative Adversarial Networks. (arXiv:2304.03805v1 [cs.LG])",
    "abstract": "Machine learning models are often misspecified in the likelihood, which leads to a lack of robustness in the predictions. In this paper, we introduce a framework for correcting likelihood misspecifications in several paradigm agnostic noisy prior models and test the model's ability to remove the misspecification. The \"ABC-GAN\" framework introduced is a novel generative modeling paradigm, which combines Generative Adversarial Networks (GANs) and Approximate Bayesian Computation (ABC). This new paradigm assists the existing GANs by incorporating any subjective knowledge available about the modeling process via ABC, as a regularizer, resulting in a partially interpretable model that operates well under low data regimes. At the same time, unlike any Bayesian analysis, the explicit knowledge need not be perfect, since the generator in the GAN can be made arbitrarily complex. ABC-GAN eliminates the need for summary statistics and distance metrics as the discriminator implicitly learns them a",
    "link": "http://arxiv.org/abs/2304.03805",
    "context": "Title: Correcting Model Misspecification via Generative Adversarial Networks. (arXiv:2304.03805v1 [cs.LG])\nAbstract: Machine learning models are often misspecified in the likelihood, which leads to a lack of robustness in the predictions. In this paper, we introduce a framework for correcting likelihood misspecifications in several paradigm agnostic noisy prior models and test the model's ability to remove the misspecification. The \"ABC-GAN\" framework introduced is a novel generative modeling paradigm, which combines Generative Adversarial Networks (GANs) and Approximate Bayesian Computation (ABC). This new paradigm assists the existing GANs by incorporating any subjective knowledge available about the modeling process via ABC, as a regularizer, resulting in a partially interpretable model that operates well under low data regimes. At the same time, unlike any Bayesian analysis, the explicit knowledge need not be perfect, since the generator in the GAN can be made arbitrarily complex. ABC-GAN eliminates the need for summary statistics and distance metrics as the discriminator implicitly learns them a",
    "path": "papers/23/04/2304.03805.json",
    "total_tokens": 868,
    "translated_title": "通过生成对抗网络纠正模型错误规范",
    "translated_abstract": "机器学习模型常常在似然性上存在错误规范，这导致预测的鲁棒性不足。本文引入了一种框架，用于纠正多个范式中的似然性错误规范，并测试模型消除错误规范的能力。“ABC-GAN”框架是一种新的生成建模范式，它结合了生成对抗网络（GAN）和近似贝叶斯计算（ABC）。这种新的范式通过ABC合并任何可用于建模过程中的主观知识，作为一个规范化项来协助现有的GAN，从而产生一个在低数据量情况下运行良好、部分可解释的模型。与任何贝叶斯分析不同，生成器可以变得任意复杂，因此ABC-GAN消除了对摘要统计和距离度量的需求，因为鉴别器隐性地学习它们。",
    "tldr": "本文提出了一种新的ABC-GAN范式，通过ABC合并任何可用的主观知识来协助GAN，消除了模型中似然性错误规范的需求，从而产生了一个在低数据量情况下运行良好的模型。"
}