{
    "title": "Asymmetric networks, clientelism and their impacts: households' access to workfare employment in rural India. (arXiv:2304.04236v1 [econ.GN])",
    "abstract": "In this paper we explore two intertwined issues. First, using primary data we examine the impact of asymmetric networks, built on rich relational information on several spheres of living, on access to workfare employment in rural India. We find that unidirectional relations, as opposed to reciprocal relations, and the concentration of such unidirectional relations increase access to workfare jobs. Further in-depth exploration provides evidence that patron-client relations are responsible for this differential access to such employment for rural households. Complementary to our empirical exercises, we construct and analyse a game-theoretical model supporting our findings.",
    "link": "http://arxiv.org/abs/2304.04236",
    "context": "Title: Asymmetric networks, clientelism and their impacts: households' access to workfare employment in rural India. (arXiv:2304.04236v1 [econ.GN])\nAbstract: In this paper we explore two intertwined issues. First, using primary data we examine the impact of asymmetric networks, built on rich relational information on several spheres of living, on access to workfare employment in rural India. We find that unidirectional relations, as opposed to reciprocal relations, and the concentration of such unidirectional relations increase access to workfare jobs. Further in-depth exploration provides evidence that patron-client relations are responsible for this differential access to such employment for rural households. Complementary to our empirical exercises, we construct and analyse a game-theoretical model supporting our findings.",
    "path": "papers/23/04/2304.04236.json",
    "total_tokens": 765,
    "translated_title": "非对称网络、客户主义及其影响：印度农村家庭获取公共就业岗位的途径。",
    "translated_abstract": "本文探讨了两个相互关联的问题。首先，我们使用原始数据，研究了建立在多个生活领域丰富关系信息基础上的非对称网络对印度农村地区获得公共就业机会的影响。我们发现，与相互关系相比，单向关系以及这种单向关系的集中可以提高农村家庭获得公共就业机会的机会。进一步深入的探究提供证据表明，家长-客户关系是决定农村家庭获得这种就业机会的因素。作为我们实证研究的补充，我们构建并分析了一个支持我们发现的博弈理论模型。",
    "tldr": "本文研究了印度农村家庭获得公共就业机会的因素，发现非对称网络和客户主义关系会影响其获得就业机会，并提供了相应的理论模型支持。",
    "en_tdlr": "This paper examines the factors affecting rural households' access to public employment opportunities in India, and finds that asymmetric networks and patron-client relations can affect their chances of getting jobs, supported by a game-theoretical model."
}