{
    "title": "FairRec: Fairness Testing for Deep Recommender Systems. (arXiv:2304.07030v1 [cs.AI])",
    "abstract": "Deep learning-based recommender systems (DRSs) are increasingly and widely deployed in the industry, which brings significant convenience to people's daily life in different ways. However, recommender systems are also shown to suffer from multiple issues,e.g., the echo chamber and the Matthew effect, of which the notation of \"fairness\" plays a core role.While many fairness notations and corresponding fairness testing approaches have been developed for traditional deep classification models, they are essentially hardly applicable to DRSs. One major difficulty is that there still lacks a systematic understanding and mapping between the existing fairness notations and the diverse testing requirements for deep recommender systems, not to mention further testing or debugging activities. To address the gap, we propose FairRec, a unified framework that supports fairness testing of DRSs from multiple customized perspectives, e.g., model utility, item diversity, item popularity, etc. We also pr",
    "link": "http://arxiv.org/abs/2304.07030",
    "context": "Title: FairRec: Fairness Testing for Deep Recommender Systems. (arXiv:2304.07030v1 [cs.AI])\nAbstract: Deep learning-based recommender systems (DRSs) are increasingly and widely deployed in the industry, which brings significant convenience to people's daily life in different ways. However, recommender systems are also shown to suffer from multiple issues,e.g., the echo chamber and the Matthew effect, of which the notation of \"fairness\" plays a core role.While many fairness notations and corresponding fairness testing approaches have been developed for traditional deep classification models, they are essentially hardly applicable to DRSs. One major difficulty is that there still lacks a systematic understanding and mapping between the existing fairness notations and the diverse testing requirements for deep recommender systems, not to mention further testing or debugging activities. To address the gap, we propose FairRec, a unified framework that supports fairness testing of DRSs from multiple customized perspectives, e.g., model utility, item diversity, item popularity, etc. We also pr",
    "path": "papers/23/04/2304.07030.json",
    "total_tokens": 1064,
    "translated_title": "FairRec：用于深度推荐系统的公平性测试。",
    "translated_abstract": "基于深度学习的推荐系统（DRS）在工业界的部署越来越广泛，为人们的日常生活带来了显著的便利，但同时也存在多重问题，例如“回声室”和“马修效应”，其中“公平性”的概念起着核心作用。然而，尽管已经为传统的深度分类模型开发了许多公平性概念和相应的公平性测试方法，但它们对于DRS来说几乎无法应用。主要困难在于目前仍缺乏对现有公平性概念与深度推荐系统的多元化测试要求之间的系统理解和映射，更不用说进一步的测试或调试活动。为了解决这个问题，我们提出了FairRec，一个统一的框架，支持从多个自定义角度对DRS进行公平性测试，例如模型效用、项目多样性、项目受欢迎程度等。我们还提供了一组新的公平性概念，针对DRS具体特征，可以有效地发现推荐系统独特的公平性问题。在真实世界数据集上的实验表明，我们的方法在检测和减轻DRS中各种类型的公平性问题方面具有有效性和效率。",
    "tldr": "本文提出了一种名为FairRec的统一框架，支持对深度推荐系统进行公平性测试。同时，提供了一组新的公平性概念针对推荐系统的特征，可以有效地发现DRS中独特的公平性问题。",
    "en_tdlr": "FairRec is a unified framework proposed in this paper that supports fairness testing of deep recommender systems (DRSs) from multiple customized perspectives. The authors also provide a new set of fairness notations specific to DRSs and demonstrate the effectiveness and efficiency of their approach in detecting and mitigating various types of fairness issues in DRSs through experiments on real-world datasets."
}