{
    "title": "LINGO : Visually Debiasing Natural Language Instructions to Support Task Diversity. (arXiv:2304.06184v1 [cs.HC])",
    "abstract": "Cross-task generalization is a significant outcome that defines mastery in natural language understanding. Humans show a remarkable aptitude for this, and can solve many different types of tasks, given definitions in the form of textual instructions and a small set of examples. Recent work with pre-trained language models mimics this learning style: users can define and exemplify a task for the model to attempt as a series of natural language prompts or instructions. While prompting approaches have led to higher cross-task generalization compared to traditional supervised learning, analyzing 'bias' in the task instructions given to the model is a difficult problem, and has thus been relatively unexplored. For instance, are we truly modeling a task, or are we modeling a user's instructions? To help investigate this, we develop LINGO, a novel visual analytics interface that supports an effective, task-driven workflow to (1) help identify bias in natural language task instructions, (2) al",
    "link": "http://arxiv.org/abs/2304.06184",
    "context": "Title: LINGO : Visually Debiasing Natural Language Instructions to Support Task Diversity. (arXiv:2304.06184v1 [cs.HC])\nAbstract: Cross-task generalization is a significant outcome that defines mastery in natural language understanding. Humans show a remarkable aptitude for this, and can solve many different types of tasks, given definitions in the form of textual instructions and a small set of examples. Recent work with pre-trained language models mimics this learning style: users can define and exemplify a task for the model to attempt as a series of natural language prompts or instructions. While prompting approaches have led to higher cross-task generalization compared to traditional supervised learning, analyzing 'bias' in the task instructions given to the model is a difficult problem, and has thus been relatively unexplored. For instance, are we truly modeling a task, or are we modeling a user's instructions? To help investigate this, we develop LINGO, a novel visual analytics interface that supports an effective, task-driven workflow to (1) help identify bias in natural language task instructions, (2) al",
    "path": "papers/23/04/2304.06184.json",
    "total_tokens": 796,
    "translated_title": "LINGO：通过视觉去偏见化自然语言指令以支持任务多样性",
    "translated_abstract": "跨任务泛化是自然语言理解中定义精通的重要结果。最近的预训练语言模型通过文本指令和一小组示例来定义和举例说明任务，从而模仿了人类的这种学习方式。但分析模型接收到的任务指令中的“偏见”是一个困难的问题，并且尚未得到充分探索。为了帮助我们了解这个问题，研究人员开发了一种新的视觉分析界面LINGO来支持有效的任务驱动工作流程，以(1)帮助识别自然语言任务指令中的偏见，(2)通过对接收到的文本进行视觉分析来支持用户思考和纠正该类偏见。",
    "tldr": "本论文介绍了针对自然语言任务指令中的偏见进行分析的新工具LINGO，展示了如何通过视觉分析来支持用户纠正偏见。",
    "en_tdlr": "This paper presents a new tool, LINGO, for analyzing bias in natural language task instructions and demonstrates how to use visual analytics to support users in correcting this bias."
}