{
    "title": "Contactless Human Activity Recognition using Deep Learning with Flexible and Scalable Software Define Radio. (arXiv:2304.09756v1 [cs.LG])",
    "abstract": "Ambient computing is gaining popularity as a major technological advancement for the future. The modern era has witnessed a surge in the advancement in healthcare systems, with viable radio frequency solutions proposed for remote and unobtrusive human activity recognition (HAR). Specifically, this study investigates the use of Wi-Fi channel state information (CSI) as a novel method of ambient sensing that can be employed as a contactless means of recognizing human activity in indoor environments. These methods avoid additional costly hardware required for vision-based systems, which are privacy-intrusive, by (re)using Wi-Fi CSI for various safety and security applications. During an experiment utilizing universal software-defined radio (USRP) to collect CSI samples, it was observed that a subject engaged in six distinct activities, which included no activity, standing, sitting, and leaning forward, across different areas of the room. Additionally, more CSI samples were collected when t",
    "link": "http://arxiv.org/abs/2304.09756",
    "context": "Title: Contactless Human Activity Recognition using Deep Learning with Flexible and Scalable Software Define Radio. (arXiv:2304.09756v1 [cs.LG])\nAbstract: Ambient computing is gaining popularity as a major technological advancement for the future. The modern era has witnessed a surge in the advancement in healthcare systems, with viable radio frequency solutions proposed for remote and unobtrusive human activity recognition (HAR). Specifically, this study investigates the use of Wi-Fi channel state information (CSI) as a novel method of ambient sensing that can be employed as a contactless means of recognizing human activity in indoor environments. These methods avoid additional costly hardware required for vision-based systems, which are privacy-intrusive, by (re)using Wi-Fi CSI for various safety and security applications. During an experiment utilizing universal software-defined radio (USRP) to collect CSI samples, it was observed that a subject engaged in six distinct activities, which included no activity, standing, sitting, and leaning forward, across different areas of the room. Additionally, more CSI samples were collected when t",
    "path": "papers/23/04/2304.09756.json",
    "total_tokens": 837,
    "translated_abstract": "环境计算作为未来的一个重要技术进步日益受到重视。如何利用射频技术实现非接触式人类活动识别已成为一个热点问题。本研究使用Wi-Fi信道状态信息（CSI）作为一种新型环境感知方法，用于室内非接触式人类活动识别。这些方法无需额外的昂贵硬件，并且可以用于各种安全和保障应用。通过使用通用软件定义无线电（USRP）进行实验，观察到被试在房间的不同区域进行了六种不同的活动，包括无活动、站立、坐着和向前倾斜。此外，当促进测试时，收集了更多的CSI样本。",
    "tldr": "本研究提出了一种利用 Wi-Fi 信号进行室内非接触式人类活动识别的新方法，避免了使用基于视觉的系统所需的昂贵硬件，并可以用于各种安全和保障应用。"
}