{
    "title": "MasonNLP+ at SemEval-2023 Task 8: Extracting Medical Questions, Experiences and Claims from Social Media using Knowledge-Augmented Pre-trained Language Models. (arXiv:2304.13875v1 [cs.CL])",
    "abstract": "In online forums like Reddit, users share their experiences with medical conditions and treatments, including making claims, asking questions, and discussing the effects of treatments on their health. Building systems to understand this information can effectively monitor the spread of misinformation and verify user claims. The Task-8 of the 2023 International Workshop on Semantic Evaluation focused on medical applications, specifically extracting patient experience- and medical condition-related entities from user posts on social media. The Reddit Health Online Talk (RedHot) corpus contains posts from medical condition-related subreddits with annotations characterizing the patient experience and medical conditions. In Subtask-1, patient experience is characterized by personal experience, questions, and claims. In Subtask-2, medical conditions are characterized by population, intervention, and outcome. For the automatic extraction of patient experiences and medical condition informatio",
    "link": "http://arxiv.org/abs/2304.13875",
    "context": "Title: MasonNLP+ at SemEval-2023 Task 8: Extracting Medical Questions, Experiences and Claims from Social Media using Knowledge-Augmented Pre-trained Language Models. (arXiv:2304.13875v1 [cs.CL])\nAbstract: In online forums like Reddit, users share their experiences with medical conditions and treatments, including making claims, asking questions, and discussing the effects of treatments on their health. Building systems to understand this information can effectively monitor the spread of misinformation and verify user claims. The Task-8 of the 2023 International Workshop on Semantic Evaluation focused on medical applications, specifically extracting patient experience- and medical condition-related entities from user posts on social media. The Reddit Health Online Talk (RedHot) corpus contains posts from medical condition-related subreddits with annotations characterizing the patient experience and medical conditions. In Subtask-1, patient experience is characterized by personal experience, questions, and claims. In Subtask-2, medical conditions are characterized by population, intervention, and outcome. For the automatic extraction of patient experiences and medical condition informatio",
    "path": "papers/23/04/2304.13875.json",
    "total_tokens": 1078,
    "translated_title": "SemEval-2023第8项任务中的MasonNLP+：使用知识增强的预训练语言模型从社交媒体中提取医疗问题、经验和声明",
    "translated_abstract": "在在线论坛中，用户分享他们的医疗状况和治疗经验，包括提出声明、提问以及讨论治疗对他们的健康状况的影响。构建可理解这些信息的系统可以有效地监测错误信息的传播并验证用户的声明。 SemEval-2023的第8项任务专注于医学应用，具体包括从社交媒体用户帖子中提取与患者经验和医疗状况相关的实体。 Reddit健康在线交流（RedHot）语料库包含来自与医疗状况相关的subreddit的帖子，带有表征患者经验和医疗状况的注释。在子任务1中，患者经验通过个人经验、问题和声明来描述。在子任务2中，医疗状况通过人群、干预和结果来描述。为自动提取患者经验和医疗状况信息，我们提出了一种知识增强的预训练语言模型MasonNLP+，将领域特定的知识融入预训练过程以提高语言理解能力。我们的方法在SemEval-2023第8项任务的两个子任务中均取得了最先进的性能。",
    "tldr": "本研究提出了一种知识增强的预训练语言模型MasonNLP+，能够从社交媒体中提取医疗问题、经验和声明，并在SemEval-2023任务8的两个子任务中取得了最先进的性能。",
    "en_tdlr": "This paper proposes a knowledge-augmented pre-trained language model, MasonNLP+, which is capable of extracting medical questions, experiences and claims from social media, achieving state-of-the-art performance in both subtasks of SemEval-2023 Task 8."
}