{
    "title": "Restoring Original Signal From Pile-up Signal using Deep Learning. (arXiv:2304.14496v1 [physics.ins-det])",
    "abstract": "Pile-up signals are frequently produced in experimental physics. They create inaccurate physics data with high uncertainty and cause various problems. Therefore, the correction to pile-up signals is crucially required. In this study, we implemented a deep learning method to restore the original signals from the pile-up signals. We showed that a deep learning model could accurately reconstruct the original signal waveforms from the pile-up waveforms. By substituting the pile-up signals with the original signals predicted by the model, the energy and timing resolutions of the data are notably enhanced. The model implementation significantly improved the quality of the particle identification plot and particle tracks. This method is applicable to similar problems, such as separating multiple signals or correcting pile-up signals with other types of noises and backgrounds.",
    "link": "http://arxiv.org/abs/2304.14496",
    "context": "Title: Restoring Original Signal From Pile-up Signal using Deep Learning. (arXiv:2304.14496v1 [physics.ins-det])\nAbstract: Pile-up signals are frequently produced in experimental physics. They create inaccurate physics data with high uncertainty and cause various problems. Therefore, the correction to pile-up signals is crucially required. In this study, we implemented a deep learning method to restore the original signals from the pile-up signals. We showed that a deep learning model could accurately reconstruct the original signal waveforms from the pile-up waveforms. By substituting the pile-up signals with the original signals predicted by the model, the energy and timing resolutions of the data are notably enhanced. The model implementation significantly improved the quality of the particle identification plot and particle tracks. This method is applicable to similar problems, such as separating multiple signals or correcting pile-up signals with other types of noises and backgrounds.",
    "path": "papers/23/04/2304.14496.json",
    "total_tokens": 806,
    "translated_title": "使用深度学习技术还原叠加信号的原始信号",
    "translated_abstract": "在实验物理学领域，叠加信号经常被产生，导致物理数据不准确，带有高不确定性并引起各种问题。因此，必须关键地矫正叠加信号。在本研究中，我们采用深度学习方法来还原叠加信号的原始信号。我们展示了深度学习模型可以准确地重建叠加波形中的原始信号波形。通过用模型预测的原始信号替换叠加信号，数据的能量和时间分辨率得到显着提高。该模型实现显著提高了粒子识别图和粒子轨迹的质量。该方法适用于类似问题，例如分离多个信号或纠正不同类型的噪声和背景下的叠加信号。",
    "tldr": "本研究采用深度学习方法还原叠加信号的原始信号，提高了物理数据的能量和时间分辨率，适用于类似问题的解决。",
    "en_tdlr": "In this study, a deep learning method was used to restore the original signals from the pile-up signals, significantly improving the energy and timing resolutions of the data. The method is applicable to similar problems, such as separating multiple signals or correcting pile-up signals with other types of noises and backgrounds."
}