{
    "title": "Adversarially Robust Neural Architecture Search for Graph Neural Networks. (arXiv:2304.04168v1 [cs.LG])",
    "abstract": "Graph Neural Networks (GNNs) obtain tremendous success in modeling relational data. Still, they are prone to adversarial attacks, which are massive threats to applying GNNs to risk-sensitive domains. Existing defensive methods neither guarantee performance facing new data/tasks or adversarial attacks nor provide insights to understand GNN robustness from an architectural perspective. Neural Architecture Search (NAS) has the potential to solve this problem by automating GNN architecture designs. Nevertheless, current graph NAS approaches lack robust design and are vulnerable to adversarial attacks. To tackle these challenges, we propose a novel Robust Neural Architecture search framework for GNNs (G-RNA). Specifically, we design a robust search space for the message-passing mechanism by adding graph structure mask operations into the search space, which comprises various defensive operation candidates and allows us to search for defensive GNNs. Furthermore, we define a robustness metric",
    "link": "http://arxiv.org/abs/2304.04168",
    "context": "Title: Adversarially Robust Neural Architecture Search for Graph Neural Networks. (arXiv:2304.04168v1 [cs.LG])\nAbstract: Graph Neural Networks (GNNs) obtain tremendous success in modeling relational data. Still, they are prone to adversarial attacks, which are massive threats to applying GNNs to risk-sensitive domains. Existing defensive methods neither guarantee performance facing new data/tasks or adversarial attacks nor provide insights to understand GNN robustness from an architectural perspective. Neural Architecture Search (NAS) has the potential to solve this problem by automating GNN architecture designs. Nevertheless, current graph NAS approaches lack robust design and are vulnerable to adversarial attacks. To tackle these challenges, we propose a novel Robust Neural Architecture search framework for GNNs (G-RNA). Specifically, we design a robust search space for the message-passing mechanism by adding graph structure mask operations into the search space, which comprises various defensive operation candidates and allows us to search for defensive GNNs. Furthermore, we define a robustness metric",
    "path": "papers/23/04/2304.04168.json",
    "total_tokens": 920,
    "translated_title": "面向图神经网络的对抗鲁棒神经结构搜索",
    "translated_abstract": "图神经网络（GNN）在建模关系数据方面取得了巨大成功。然而，它们容易受到对抗攻击，这对将GNN应用于风险敏感领域构成了巨大威胁。现有的防御方法既不能保证面对新数据/任务或对抗攻击时的性能，也不能从架构角度提供理解GNN鲁棒性的见解。神经结构搜索（NAS）通过自动化GNN架构设计具有解决这个问题的潜力。然而，当前的图形NAS方法缺乏鲁棒的设计，易受对抗攻击。为了应对这些挑战，我们提出了一个面向GNNs的新型Robust神经结构搜索框架（G-RNA）。具体来说，我们通过在搜索空间中添加图结构掩码操作来设计信息传递机制的一个鲁棒搜索空间，其中包括各种防御操作候选人，并允许我们搜索防御性GNNs。此外，我们定义了一个鲁棒性指标。",
    "tldr": "本文提出了G-RNA，一个面向图神经网络的对抗鲁棒神经结构搜索框架，通过添加图结构掩码操作来设计信息传递机制的一个鲁棒搜索空间，从而允许我们搜索防御性GNNs。",
    "en_tdlr": "This paper proposes G-RNA, a robust neural architecture search framework for graph neural networks, which designs a robust search space for the message-passing mechanism by adding graph structure mask operations, allowing us to search for defensive GNNs."
}