{
    "title": "D-SVM over Networked Systems with Non-Ideal Linking Conditions. (arXiv:2304.06667v1 [eess.SY])",
    "abstract": "This paper considers distributed optimization algorithms, with application in binary classification via distributed support-vector-machines (D-SVM) over multi-agent networks subject to some link nonlinearities. The agents solve a consensus-constraint distributed optimization cooperatively via continuous-time dynamics, while the links are subject to strongly sign-preserving odd nonlinear conditions. Logarithmic quantization and clipping (saturation) are two examples of such nonlinearities. In contrast to existing literature that mostly considers ideal links and perfect information exchange over linear channels, we show how general sector-bounded models affect the convergence to the optimizer (i.e., the SVM classifier) over dynamic balanced directed networks. In general, any odd sector-bounded nonlinear mapping can be applied to our dynamics. The main challenge is to show that the proposed system dynamics always have one zero eigenvalue (associated with the consensus) and the other eigen",
    "link": "http://arxiv.org/abs/2304.06667",
    "context": "Title: D-SVM over Networked Systems with Non-Ideal Linking Conditions. (arXiv:2304.06667v1 [eess.SY])\nAbstract: This paper considers distributed optimization algorithms, with application in binary classification via distributed support-vector-machines (D-SVM) over multi-agent networks subject to some link nonlinearities. The agents solve a consensus-constraint distributed optimization cooperatively via continuous-time dynamics, while the links are subject to strongly sign-preserving odd nonlinear conditions. Logarithmic quantization and clipping (saturation) are two examples of such nonlinearities. In contrast to existing literature that mostly considers ideal links and perfect information exchange over linear channels, we show how general sector-bounded models affect the convergence to the optimizer (i.e., the SVM classifier) over dynamic balanced directed networks. In general, any odd sector-bounded nonlinear mapping can be applied to our dynamics. The main challenge is to show that the proposed system dynamics always have one zero eigenvalue (associated with the consensus) and the other eigen",
    "path": "papers/23/04/2304.06667.json",
    "total_tokens": 878,
    "translated_title": "具有非理想链接的网络系统中的D-SVM",
    "translated_abstract": "本论文考虑了一种分布式优化算法，应用于通过分布式支持向量机（D-SVM）进行二元分类的多智能体网络，其具有一些链接的非线性特征。代理通过连续时间动力学协同解决共识约束分布式优化，而链接则受到强烈的符号保持奇异非线性条件的影响。对数量化和截取（饱和）是这样的非线性例子。与现有文献主要考虑理想链接和通过线性通道进行完美信息交换相比，我们展示了一般的扇区限制模型如何影响到在动态平衡的有向网络上收敛到优化器（即SVM分类器）。一般而言，任何奇数扇区限制非线性映射都可以应用于我们的动力学。主要挑战在于证明所提出的系统动力学始终具有一个零特征值（与共识相关）和其他特征值都是负实数的性质。",
    "tldr": "本论文讨论了具有非线性链接条件的多智能体网络的分布式支持向量机，提出了解决目标优化约束的一种动态平衡有向网络的奇数扇区限制非线性映射方法。"
}