{
    "title": "Quantitative Trading using Deep Q Learning. (arXiv:2304.06037v1 [q-fin.TR])",
    "abstract": "Reinforcement learning (RL) is a branch of machine learning that has been used in a variety of applications such as robotics, game playing, and autonomous systems. In recent years, there has been growing interest in applying RL to quantitative trading, where the goal is to make profitable trades in financial markets. This paper explores the use of RL in quantitative trading and presents a case study of a RL-based trading algorithm. The results show that RL can be a powerful tool for quantitative trading, and that it has the potential to outperform traditional trading algorithms. The use of reinforcement learning in quantitative trading represents a promising area of research that can potentially lead to the development of more sophisticated and effective trading systems. Future work could explore the use of alternative reinforcement learning algorithms, incorporate additional data sources, and test the system on different asset classes. Overall, our research demonstrates the potential ",
    "link": "http://arxiv.org/abs/2304.06037",
    "context": "Title: Quantitative Trading using Deep Q Learning. (arXiv:2304.06037v1 [q-fin.TR])\nAbstract: Reinforcement learning (RL) is a branch of machine learning that has been used in a variety of applications such as robotics, game playing, and autonomous systems. In recent years, there has been growing interest in applying RL to quantitative trading, where the goal is to make profitable trades in financial markets. This paper explores the use of RL in quantitative trading and presents a case study of a RL-based trading algorithm. The results show that RL can be a powerful tool for quantitative trading, and that it has the potential to outperform traditional trading algorithms. The use of reinforcement learning in quantitative trading represents a promising area of research that can potentially lead to the development of more sophisticated and effective trading systems. Future work could explore the use of alternative reinforcement learning algorithms, incorporate additional data sources, and test the system on different asset classes. Overall, our research demonstrates the potential ",
    "path": "papers/23/04/2304.06037.json",
    "total_tokens": 923,
    "translated_title": "使用深度 Q 学习进行量化交易。",
    "translated_abstract": "强化学习是机器学习的一个分支，已被用于机器人技术、游戏玩法和自主系统等多种应用。近年来，人们越来越关注强化学习在量化交易领域的应用，旨在在金融市场上进行盈利交易。本论文探讨了 RL 在量化交易中的使用，并提供了一个基于 RL 的交易算法的案例研究。结果显示，RL 可以成为量化交易的强有力工具，并且它有潜力优于传统的交易算法。在量化交易中使用强化学习代表着一个有希望的研究领域，可以潜在地引导更为复杂和有效的交易系统的开发。未来的工作可以探索使用替代的强化学习算法，整合其他数据来源，并在不同的资产类别上测试该系统。总体而言，我们的研究证明了它的潜力。",
    "tldr": "本文探讨了强化学习在量化交易中的运用，揭示了基于 RL 的交易算法的案例研究结果表明，它有潜力优于传统的交易算法。这一研究代表了一个有希望的研究领域，可以潜在地引导更为复杂和有效的交易系统的开发。"
}