{
    "title": "Spritz-PS: Validation of Synthetic Face Images Using a Large Dataset of Printed Documents. (arXiv:2304.02982v1 [cs.CV])",
    "abstract": "The capability of doing effective forensic analysis on printed and scanned (PS) images is essential in many applications. PS documents may be used to conceal the artifacts of images which is due to the synthetic nature of images since these artifacts are typically present in manipulated images and the main artifacts in the synthetic images can be removed after the PS. Due to the appeal of Generative Adversarial Networks (GANs), synthetic face images generated with GANs models are difficult to differentiate from genuine human faces and may be used to create counterfeit identities. Additionally, since GANs models do not account for physiological constraints for generating human faces and their impact on human IRISes, distinguishing genuine from synthetic IRISes in the PS scenario becomes extremely difficult. As a result of the lack of large-scale reference IRIS datasets in the PS scenario, we aim at developing a novel dataset to become a standard for Multimedia Forensics (MFs) investigat",
    "link": "http://arxiv.org/abs/2304.02982",
    "context": "Title: Spritz-PS: Validation of Synthetic Face Images Using a Large Dataset of Printed Documents. (arXiv:2304.02982v1 [cs.CV])\nAbstract: The capability of doing effective forensic analysis on printed and scanned (PS) images is essential in many applications. PS documents may be used to conceal the artifacts of images which is due to the synthetic nature of images since these artifacts are typically present in manipulated images and the main artifacts in the synthetic images can be removed after the PS. Due to the appeal of Generative Adversarial Networks (GANs), synthetic face images generated with GANs models are difficult to differentiate from genuine human faces and may be used to create counterfeit identities. Additionally, since GANs models do not account for physiological constraints for generating human faces and their impact on human IRISes, distinguishing genuine from synthetic IRISes in the PS scenario becomes extremely difficult. As a result of the lack of large-scale reference IRIS datasets in the PS scenario, we aim at developing a novel dataset to become a standard for Multimedia Forensics (MFs) investigat",
    "path": "papers/23/04/2304.02982.json",
    "total_tokens": 864,
    "translated_title": "突破性论文: Spritz-PS-利用大规模印刷文件数据集对合成面部图像进行验证",
    "translated_abstract": "在许多应用中，对印刷和扫描（PS）图像进行有效的取证分析能力至关重要。PS文档可以用于隐藏图像的伪造痕迹，因为这些痕迹通常存在于处理过的图像中，并且合成图像中的主要痕迹可以在PS之后去除。由于生成对抗网络(GANs)的吸引力，使用GANs模型生成的合成面部图像难以与真正的人类面部区分开来，可能用于创建伪造身份。此外，由于GAN模型未考虑在生成人类面部时的生理约束以及这些约束对人类虹膜的影响，在PS情况下区分真实和合成虹膜变得极为困难。由于缺乏大规模参考虹膜数据集，我们旨在开发一个新的数据集，成为多媒体取证(MFs)调查的标准。",
    "tldr": "该论文开发了一个新的数据集，以成为多媒体取证调查的标准，通过验证合成面部图像来探究印刷和扫描图像的有效取证分析能力。",
    "en_tdlr": "The paper developed a new dataset to become a standard for multimedia forensics investigations and explored the effective forensic analysis capability of printed and scanned images by validating synthetic face images."
}