{
    "title": "A Certified Radius-Guided Attack Framework to Image Segmentation Models. (arXiv:2304.02693v1 [cs.CV])",
    "abstract": "Image segmentation is an important problem in many safety-critical applications. Recent studies show that modern image segmentation models are vulnerable to adversarial perturbations, while existing attack methods mainly follow the idea of attacking image classification models. We argue that image segmentation and classification have inherent differences, and design an attack framework specially for image segmentation models. Our attack framework is inspired by certified radius, which was originally used by defenders to defend against adversarial perturbations to classification models. We are the first, from the attacker perspective, to leverage the properties of certified radius and propose a certified radius guided attack framework against image segmentation models. Specifically, we first adapt randomized smoothing, the state-of-the-art certification method for classification models, to derive the pixel's certified radius. We then focus more on disrupting pixels with relatively small",
    "link": "http://arxiv.org/abs/2304.02693",
    "context": "Title: A Certified Radius-Guided Attack Framework to Image Segmentation Models. (arXiv:2304.02693v1 [cs.CV])\nAbstract: Image segmentation is an important problem in many safety-critical applications. Recent studies show that modern image segmentation models are vulnerable to adversarial perturbations, while existing attack methods mainly follow the idea of attacking image classification models. We argue that image segmentation and classification have inherent differences, and design an attack framework specially for image segmentation models. Our attack framework is inspired by certified radius, which was originally used by defenders to defend against adversarial perturbations to classification models. We are the first, from the attacker perspective, to leverage the properties of certified radius and propose a certified radius guided attack framework against image segmentation models. Specifically, we first adapt randomized smoothing, the state-of-the-art certification method for classification models, to derive the pixel's certified radius. We then focus more on disrupting pixels with relatively small",
    "path": "papers/23/04/2304.02693.json",
    "total_tokens": 1025,
    "translated_title": "一种基于认证半径的攻击框架用于图像分割模型",
    "translated_abstract": "图像分割是许多安全关键应用中的重要问题。最近的研究表明，现代图像分割模型易受对抗扰动的影响，而现有的攻击方法主要是攻击图像分类模型。我们认为图像分割和分类有本质区别，并为图像分割模型设计了一种攻击框架。我们的攻击框架受认证半径启发，该方法最初是由防御者用来防御分类模型的对抗扰动。我们是第一个从攻击者的角度出发，利用认证半径的性质提出了一种针对图像分割模型的攻击框架。具体而言，我们首先将针对分类模型的最先进的认证方法随机平滑法进行调整，以导出像素的认证半径。然后，我们更加关注具有相对较小认证半径的像素的破坏，并提出了一种引导搜索方法，能够在给定距离限制下高效地找到最大化攻击成功率的强健扰动。多个基准数据集上的实验证明了我们的攻击框架对多种最先进的图像分割模型的有效性。",
    "tldr": "本文提出了一种基于认证半径的攻击框架用于图像分割模型，该攻击框架主要通过引导搜索具有相对较小认证半径的像素来实现对图像分割模型的攻击。",
    "en_tdlr": "This paper proposes a certified radius guided attack framework for image segmentation models, which mainly disrupts pixels with relatively small certified radius through a guided search method. This framework is the first to leverage the properties of certified radius from the attacker perspective, and has been demonstrated to be effective against various state-of-the-art image segmentation models on multiple benchmark datasets."
}