{
    "title": "MisRoB{\\AE}RTa: Transformers versus Misinformation. (arXiv:2304.07759v1 [cs.CL])",
    "abstract": "Misinformation is considered a threat to our democratic values and principles. The spread of such content on social media polarizes society and undermines public discourse by distorting public perceptions and generating social unrest while lacking the rigor of traditional journalism. Transformers and transfer learning proved to be state-of-the-art methods for multiple well-known natural language processing tasks. In this paper, we propose MisRoB{\\AE}RTa, a novel transformer-based deep neural ensemble architecture for misinformation detection. MisRoB{\\AE}RTa takes advantage of two transformers (BART \\& RoBERTa) to improve the classification performance. We also benchmarked and evaluated the performances of multiple transformers on the task of misinformation detection. For training and testing, we used a large real-world news articles dataset labeled with 10 classes, addressing two shortcomings in the current research: increasing the size of the dataset from small to large, and moving th",
    "link": "http://arxiv.org/abs/2304.07759",
    "context": "Title: MisRoB{\\AE}RTa: Transformers versus Misinformation. (arXiv:2304.07759v1 [cs.CL])\nAbstract: Misinformation is considered a threat to our democratic values and principles. The spread of such content on social media polarizes society and undermines public discourse by distorting public perceptions and generating social unrest while lacking the rigor of traditional journalism. Transformers and transfer learning proved to be state-of-the-art methods for multiple well-known natural language processing tasks. In this paper, we propose MisRoB{\\AE}RTa, a novel transformer-based deep neural ensemble architecture for misinformation detection. MisRoB{\\AE}RTa takes advantage of two transformers (BART \\& RoBERTa) to improve the classification performance. We also benchmarked and evaluated the performances of multiple transformers on the task of misinformation detection. For training and testing, we used a large real-world news articles dataset labeled with 10 classes, addressing two shortcomings in the current research: increasing the size of the dataset from small to large, and moving th",
    "path": "papers/23/04/2304.07759.json",
    "total_tokens": 915,
    "translated_title": "MisRoB{\\AE}RTa：变形金刚对抗不实信息",
    "translated_abstract": "不实信息被认为是我们民主的价值观和原则的威胁。这种内容在社交媒体上的传播会使社会极端化，并通过扭曲公众的看法并引发社会动荡而破坏公共话语，同时缺乏传统新闻的严谨性。在多个具有知名度的自然语言处理任务中，Transformer和迁移学习被证明是最先进的方法。在本文中，我们提出了MisRoB{\\AE}RTa，这是一种新颖的基于Transformer的深度神经网络集成体系结构，用于不实信息检测。MisRoB{\\AE}RTa利用了两个Transformer（BART和RoBERTa）来提高分类性能。我们还对多个Transformer在不实信息检测任务上的性能进行了基准测试和评估。对于训练和测试，我们使用了一个带有10个类别标签的大型现实世界新闻文章数据集，解决了当前研究中的两个缺点：将数据集的规模从小到大，并将焦点从社交媒体移动到新闻领域。",
    "tldr": "本文提出了一种新型基于Transformer的深度神经网络集成体系结构MisRoB{\\AE}RTa，用于不实信息检测，并在大型现实世界新闻文章数据集上进行了测试和评估。",
    "en_tdlr": "This paper proposes a novel transformer-based deep neural ensemble architecture, MisRoB{\\AE}RTa, for detecting misinformation, which utilizes two transformers to improve classification performance and is benchmarked on a large real-world news articles dataset labeled with 10 classes."
}