{
    "title": "Philosophical Foundations of GeoAI: Exploring Sustainability, Diversity, and Bias in GeoAI and Spatial Data Science. (arXiv:2304.06508v1 [cs.CY])",
    "abstract": "This chapter presents some of the fundamental assumptions and principles that could form the philosophical foundation of GeoAI and spatial data science. Instead of reviewing the well-established characteristics of spatial data (analysis), including interaction, neighborhoods, and autocorrelation, the chapter highlights themes such as sustainability, bias in training data, diversity in schema knowledge, and the (potential lack of) neutrality of GeoAI systems from a unifying ethical perspective. Reflecting on our profession's ethical implications will assist us in conducting potentially disruptive research more responsibly, identifying pitfalls in designing, training, and deploying GeoAI-based systems, and developing a shared understanding of the benefits but also potential dangers of artificial intelligence and machine learning research across academic fields, all while sharing our unique (geo)spatial perspective with others.",
    "link": "http://arxiv.org/abs/2304.06508",
    "context": "Title: Philosophical Foundations of GeoAI: Exploring Sustainability, Diversity, and Bias in GeoAI and Spatial Data Science. (arXiv:2304.06508v1 [cs.CY])\nAbstract: This chapter presents some of the fundamental assumptions and principles that could form the philosophical foundation of GeoAI and spatial data science. Instead of reviewing the well-established characteristics of spatial data (analysis), including interaction, neighborhoods, and autocorrelation, the chapter highlights themes such as sustainability, bias in training data, diversity in schema knowledge, and the (potential lack of) neutrality of GeoAI systems from a unifying ethical perspective. Reflecting on our profession's ethical implications will assist us in conducting potentially disruptive research more responsibly, identifying pitfalls in designing, training, and deploying GeoAI-based systems, and developing a shared understanding of the benefits but also potential dangers of artificial intelligence and machine learning research across academic fields, all while sharing our unique (geo)spatial perspective with others.",
    "path": "papers/23/04/2304.06508.json",
    "total_tokens": 936,
    "translated_title": "GeoAI的哲学基础：探索GeoAI和空间数据科学中的可持续性、多样性和偏见",
    "translated_abstract": "本章介绍了可能构成GeoAI和空间数据科学哲学基础的一些基本假设和原则。文章强调了可持续性、训练数据中的偏差、模式知识的多样性以及来自统一伦理视角的GeoAI系统中（潜在的）中立性缺失等主题，而非审查空间数据（分析）的成熟特征，如交互、邻域和自相关性。反思我们职业道德的影响将有助于我们更负责地进行潜在的研究，识别设计、培训和部署基于GeoAI的系统中的陷阱，并在跨学科领域中共同开发人工智能和机器学习研究的利益和潜在危险的共同理解，同时与他人分享我们独特的（地理）空间视角。",
    "tldr": "本文介绍了GeoAI和空间数据科学的哲学基础，分别从可持续性、训练数据中的偏差、模式知识的多样性和系统中的中立性缺失等角度出发，为我们设计、培训和部署基于GeoAI的系统提供了帮助，也为我们理解人工智能和机器学习研究的利益和潜在危险提供了共同理解。",
    "en_tdlr": "This chapter presents the philosophical foundations of GeoAI and spatial data science which includes sustainability, bias in training data, diversity in schema knowledge and neutrality of GeoAI systems from an ethical perspective. It reflects on the ethical implications of conducting potentially disruptive research and developing a shared understanding of the benefits and potential dangers of AI and machine learning research across academic fields."
}