{
    "title": "Artificial neural networks and time series of counts: A class of nonlinear INGARCH models. (arXiv:2304.01025v1 [stat.ME])",
    "abstract": "Time series of counts are frequently analyzed using generalized integer-valued autoregressive models with conditional heteroskedasticity (INGARCH). These models employ response functions to map a vector of past observations and past conditional expectations to the conditional expectation of the present observation. In this paper, it is shown how INGARCH models can be combined with artificial neural network (ANN) response functions to obtain a class of nonlinear INGARCH models. The ANN framework allows for the interpretation of many existing INGARCH models as a degenerate version of a corresponding neural model. Details on maximum likelihood estimation, marginal effects and confidence intervals are given. The empirical analysis of time series of bounded and unbounded counts reveals that the neural INGARCH models are able to outperform reasonable degenerate competitor models in terms of the information loss.",
    "link": "http://arxiv.org/abs/2304.01025",
    "context": "Title: Artificial neural networks and time series of counts: A class of nonlinear INGARCH models. (arXiv:2304.01025v1 [stat.ME])\nAbstract: Time series of counts are frequently analyzed using generalized integer-valued autoregressive models with conditional heteroskedasticity (INGARCH). These models employ response functions to map a vector of past observations and past conditional expectations to the conditional expectation of the present observation. In this paper, it is shown how INGARCH models can be combined with artificial neural network (ANN) response functions to obtain a class of nonlinear INGARCH models. The ANN framework allows for the interpretation of many existing INGARCH models as a degenerate version of a corresponding neural model. Details on maximum likelihood estimation, marginal effects and confidence intervals are given. The empirical analysis of time series of bounded and unbounded counts reveals that the neural INGARCH models are able to outperform reasonable degenerate competitor models in terms of the information loss.",
    "path": "papers/23/04/2304.01025.json",
    "total_tokens": 776,
    "translated_title": "人工神经网络与计数时间序列：一类非线性INGARCH模型",
    "translated_abstract": "计数时间序列经常使用具有条件异方差性（INGARCH）的广义整数值自回归模型进行分析。这些模型使用响应函数将过去观测向量和过去条件期望映射到现在观测的条件期望。本文展示了如何将INGARCH模型与人工神经网络（ANN）响应函数相结合，以获得一类非线性INGARCH模型。ANN框架允许将许多现有的INGARCH模型解释为相应神经模型的退化版本。给出了最大似然估计、边际效应和置信区间的详细信息。计数时间序列的实证分析表明，神经INGARCH模型能够在信息损失方面胜过合理的退化竞争模型。",
    "tldr": "本论文提出了一类基于人工神经网络响应函数的非线性INGARCH模型，能够更好地分析计数时间序列，并在实证分析中得到验证。",
    "en_tdlr": "This paper proposed a class of nonlinear INGARCH models based on artificial neural network response functions, which can better analyze time series of counts and have been validated in empirical analysis."
}