{
    "title": "From Explicit Communication to Tacit Cooperation:A Novel Paradigm for Cooperative MARL. (arXiv:2304.14656v1 [cs.MA])",
    "abstract": "Centralized training with decentralized execution (CTDE) is a widely-used learning paradigm that has achieved significant success in complex tasks. However, partial observability issues and the absence of effectively shared signals between agents often limit its effectiveness in fostering cooperation. While communication can address this challenge, it simultaneously reduces the algorithm's practicality. Drawing inspiration from human team cooperative learning, we propose a novel paradigm that facilitates a gradual shift from explicit communication to tacit cooperation. In the initial training stage, we promote cooperation by sharing relevant information among agents and concurrently reconstructing this information using each agent's local trajectory. We then combine the explicitly communicated information with the reconstructed information to obtain mixed information. Throughout the training process, we progressively reduce the proportion of explicitly communicated information, facilit",
    "link": "http://arxiv.org/abs/2304.14656",
    "context": "Title: From Explicit Communication to Tacit Cooperation:A Novel Paradigm for Cooperative MARL. (arXiv:2304.14656v1 [cs.MA])\nAbstract: Centralized training with decentralized execution (CTDE) is a widely-used learning paradigm that has achieved significant success in complex tasks. However, partial observability issues and the absence of effectively shared signals between agents often limit its effectiveness in fostering cooperation. While communication can address this challenge, it simultaneously reduces the algorithm's practicality. Drawing inspiration from human team cooperative learning, we propose a novel paradigm that facilitates a gradual shift from explicit communication to tacit cooperation. In the initial training stage, we promote cooperation by sharing relevant information among agents and concurrently reconstructing this information using each agent's local trajectory. We then combine the explicitly communicated information with the reconstructed information to obtain mixed information. Throughout the training process, we progressively reduce the proportion of explicitly communicated information, facilit",
    "path": "papers/23/04/2304.14656.json",
    "total_tokens": 956,
    "translated_title": "从显性沟通到隐性合作：一种新的协作多智能体学习范式",
    "translated_abstract": "集中培训与分散执行（CTDE）是一种广泛使用的学习范式，在复杂任务方面取得了显着成功。然而，局部可观察性问题和代理之间缺乏有效共享信号的存在经常限制了它在促进协作方面的有效性。虽然通信可以解决这一挑战，但同时也降低了算法的实用性。受人类团队合作学习的启发，我们提出了一种新的范式，以促进从显性通信到隐性合作的逐渐转变。在初始训练阶段，我们通过在代理之间分享相关信息和同时使用每个代理的本地轨迹重建该信息来促进协作。然后，我们将显式传达的信息与重建的信息相结合，得到混合信息。在整个训练过程中，我们通过学习到的隐含合作逐渐减少显式传达信息的比例。",
    "tldr": "该论文提出了一种从显性沟通到隐性合作的新协作多智能体学习范式，通过在代理之间分享信息和使用本地轨迹重建信息来促进协作，并逐渐减少显式传达信息的比例。实验结果表明，这种范式在具有挑战性的情景下比传统的 CTDE 范式表现更好。",
    "en_tdlr": "This paper proposes a new paradigm for cooperative multi-agent learning that facilitates a gradual shift from explicit communication to tacit cooperation, achieved by sharing information among agents and using local trajectory to reconstruct information, while progressively reducing the proportion of explicitly communicated information, which outperforms traditional CTDE paradigm in challenging scenarios according to experimental results."
}