{
    "title": "Label Dependencies-aware Set Prediction Networks for Multi-label Text Classification. (arXiv:2304.07022v1 [cs.CL])",
    "abstract": "Multi-label text classification aims to extract all the related labels from a sentence, which can be viewed as a sequence generation problem. However, the labels in training dataset are unordered. We propose to treat it as a direct set prediction problem and don't need to consider the order of labels. Besides, in order to model the correlation between labels, the adjacency matrix is constructed through the statistical relations between labels and GCN is employed to learn the label information. Based on the learned label information, the set prediction networks can both utilize the sentence information and label information for multi-label text classification simultaneously. Furthermore, the Bhattacharyya distance is imposed on the output probability distributions of the set prediction networks to increase the recall ability. Experimental results on four multi-label datasets show the effectiveness of the proposed method and it outperforms previous method a substantial margin.",
    "link": "http://arxiv.org/abs/2304.07022",
    "context": "Title: Label Dependencies-aware Set Prediction Networks for Multi-label Text Classification. (arXiv:2304.07022v1 [cs.CL])\nAbstract: Multi-label text classification aims to extract all the related labels from a sentence, which can be viewed as a sequence generation problem. However, the labels in training dataset are unordered. We propose to treat it as a direct set prediction problem and don't need to consider the order of labels. Besides, in order to model the correlation between labels, the adjacency matrix is constructed through the statistical relations between labels and GCN is employed to learn the label information. Based on the learned label information, the set prediction networks can both utilize the sentence information and label information for multi-label text classification simultaneously. Furthermore, the Bhattacharyya distance is imposed on the output probability distributions of the set prediction networks to increase the recall ability. Experimental results on four multi-label datasets show the effectiveness of the proposed method and it outperforms previous method a substantial margin.",
    "path": "papers/23/04/2304.07022.json",
    "total_tokens": 873,
    "translated_title": "多标签文本分类的标签相依感知集合预测网络",
    "translated_abstract": "多标签文本分类旨在从句子中提取所有相关标签，可视为序列生成问题。然而，训练集中的标签是无序的。我们建议将其视为直接集合预测问题，而不需要考虑标签的顺序。此外，为了建模标签之间的关联，通过标签之间的统计关系构建关联矩阵，并使用GCN来学习标签信息。基于所学的标签信息，集合预测网络可以同时利用句子信息和标签信息进行多标签文本分类。此外，还对集合预测网络的输出概率分布施加广义巴氏距离，以提高其召回率。在四个多标签数据集上的实验结果表明了所提出方法的有效性，并且其性能大大优于以前的方法。",
    "tldr": "本论文提出了一种标签相依感知集合预测网络用于解决多标签文本分类问题。该方法将多标签分类视为直接集合预测问题，通过标签之间的统计关系构建关联矩阵并结合GCN学习标签信息，同时利用句子信息和标签信息，最终结果表明其性能优于以前的方法。",
    "en_tdlr": "This paper proposes a Label Dependencies-aware Set Prediction Networks for solving multi-label text classification problem. The method treats multi-label classification as a direct set prediction problem, constructs an adjacency matrix through the statistical relations between labels and employs GCN to learn label information while utilizing both sentence information and label information, the experimental results show that it outperforms previous method with a substantial margin."
}