{
    "title": "Expert-Independent Generalization of Well and Seismic Data Using Machine Learning Methods for Complex Reservoirs Predicting During Early-Stage Geological Exploration. (arXiv:2304.03048v1 [physics.geo-ph])",
    "abstract": "The aim of this study is to develop and apply an autonomous approach for predicting the probability of hydrocarbon reservoirs spreading in the studied area. Autonomy means that after preparing and inputting geological-geophysical information, the influence of an expert on the algorithms is minimized. The study was made based on the 3D seismic survey data and well information on the early exploration stage of the studied field. As a result, a forecast of the probability of spatial distribution of reservoirs was made for two sets of input data: the base set and the set after reverse-calibration, and three-dimensional cubes of calibrated probabilities of belonging of the studied space to the identified classes were obtained. The approach presented in the paper allows for expert-independent generalization of geological and geophysical data, and to use this generalization for hypothesis testing and creating geological models based on a probabilistic representation of the reservoir. The qual",
    "link": "http://arxiv.org/abs/2304.03048",
    "context": "Title: Expert-Independent Generalization of Well and Seismic Data Using Machine Learning Methods for Complex Reservoirs Predicting During Early-Stage Geological Exploration. (arXiv:2304.03048v1 [physics.geo-ph])\nAbstract: The aim of this study is to develop and apply an autonomous approach for predicting the probability of hydrocarbon reservoirs spreading in the studied area. Autonomy means that after preparing and inputting geological-geophysical information, the influence of an expert on the algorithms is minimized. The study was made based on the 3D seismic survey data and well information on the early exploration stage of the studied field. As a result, a forecast of the probability of spatial distribution of reservoirs was made for two sets of input data: the base set and the set after reverse-calibration, and three-dimensional cubes of calibrated probabilities of belonging of the studied space to the identified classes were obtained. The approach presented in the paper allows for expert-independent generalization of geological and geophysical data, and to use this generalization for hypothesis testing and creating geological models based on a probabilistic representation of the reservoir. The qual",
    "path": "papers/23/04/2304.03048.json",
    "total_tokens": 927,
    "translated_title": "机器学习方法在复杂油藏早期地质勘探中，利用井和地震数据进行专家无关的概化预测",
    "translated_abstract": "本研究旨在开发和应用一种自主方法，用于预测在研究区域内油藏传播的概率。自主性意味着在准备和输入地质地球物理信息之后，专家对算法的影响被最小化。该研究以研究区域早期勘探阶段的3D地震勘探数据和井信息为基础进行了研究。结果，为两组输入数据：基础组和反演校准后的组，预测了油藏空间分布的概率，并得到了标定后的概率立方体。本文所提出的方法可以对地质和地球物理数据进行专家无关的概化，并利用该概化进行假设检验和基于油藏概率表示的地质模型创建。算法的合格表现表明，在复杂油藏早期地质勘探中具有潜在的广泛应用。",
    "tldr": "该研究利用自主方法预测了复杂油藏的空间分布概率，可以进行专家无关的概化预测和地质模型创建。",
    "en_tdlr": "This study presents an autonomous approach using machine learning methods to predict the probability of hydrocarbon reservoirs spreading in a studied area with expert-independent generalization of geological and geophysical data, which has the potential to be widely applied in early-stage geological exploration for complex reservoirs."
}