{
    "title": "Convexity Not Required: Estimation of Smooth Moment Condition Models. (arXiv:2304.14386v1 [econ.EM])",
    "abstract": "Generalized and Simulated Method of Moments are often used to estimate structural Economic models. Yet, it is commonly reported that optimization is challenging because the corresponding objective function is non-convex. For smooth problems, this paper shows that convexity is not required: under a global rank condition involving the Jacobian of the sample moments, certain algorithms are globally convergent. These include a gradient-descent and a Gauss-Newton algorithm with appropriate choice of tuning parameters. The results are robust to 1) non-convexity, 2) one-to-one non-linear reparameterizations, and 3) moderate misspecification. In contrast, Newton-Raphson and quasi-Newton methods can fail to converge for the same estimation because of non-convexity. A simple example illustrates a non-convex GMM estimation problem that satisfies the aforementioned rank condition. Empirical applications to random coefficient demand estimation and impulse response matching further illustrate the re",
    "link": "http://arxiv.org/abs/2304.14386",
    "context": "Title: Convexity Not Required: Estimation of Smooth Moment Condition Models. (arXiv:2304.14386v1 [econ.EM])\nAbstract: Generalized and Simulated Method of Moments are often used to estimate structural Economic models. Yet, it is commonly reported that optimization is challenging because the corresponding objective function is non-convex. For smooth problems, this paper shows that convexity is not required: under a global rank condition involving the Jacobian of the sample moments, certain algorithms are globally convergent. These include a gradient-descent and a Gauss-Newton algorithm with appropriate choice of tuning parameters. The results are robust to 1) non-convexity, 2) one-to-one non-linear reparameterizations, and 3) moderate misspecification. In contrast, Newton-Raphson and quasi-Newton methods can fail to converge for the same estimation because of non-convexity. A simple example illustrates a non-convex GMM estimation problem that satisfies the aforementioned rank condition. Empirical applications to random coefficient demand estimation and impulse response matching further illustrate the re",
    "path": "papers/23/04/2304.14386.json",
    "total_tokens": 886,
    "translated_title": "无需凸性：平滑时刻条件模型的估计方法",
    "translated_abstract": "广义矩及模拟矩法常用于估计结构性经济模型。然而，由于相应的目标函数非凸，优化往往具有挑战性。本文针对平滑问题，证明了不需要凸性：在涉及样本矩阵雅可比的全局秩条件下，某些算法是全局收敛的。这些算法包括梯度下降和高斯牛顿算法及需要适当选择调整参数。该结果具有鲁棒性，对非凸性、单一非线性再参数化以及适度的错误建模具有鲁棒性。相比之下，由于非凸性，牛顿-拉夫森和拟牛顿方法可能无法收敛。简单的例子说明了一个满足前述秩条件的非凸 GMM 估计问题。对随机系数需求估计和脉冲响应匹配的实证应用进一步说明了本文的研究方法。",
    "tldr": "本文针对平滑问题，使用全局秩条件下的特定算法证明了非凸结构下的通用矩估计和模拟矩估计是全局收敛的。",
    "en_tdlr": "This paper shows that non-convex Generalized and Simulated Method of Moments estimation can be globally convergent for smooth problems under a global rank condition, using specific algorithms such as gradient descent and Gauss-Newton method, without requiring convexity."
}