{
    "title": "Light-weight Deep Extreme Multilabel Classification. (arXiv:2304.11045v1 [cs.LG])",
    "abstract": "Extreme multi-label (XML) classification refers to the task of supervised multi-label learning that involves a large number of labels. Hence, scalability of the classifier with increasing label dimension is an important consideration. In this paper, we develop a method called LightDXML which modifies the recently developed deep learning based XML framework by using label embeddings instead of feature embedding for negative sampling and iterating cyclically through three major phases: (1) proxy training of label embeddings (2) shortlisting of labels for negative sampling and (3) final classifier training using the negative samples. Consequently, LightDXML also removes the requirement of a re-ranker module, thereby, leading to further savings on time and memory requirements. The proposed method achieves the best of both worlds: while the training time, model size and prediction times are on par or better compared to the tree-based methods, it attains much better prediction accuracy that ",
    "link": "http://arxiv.org/abs/2304.11045",
    "context": "Title: Light-weight Deep Extreme Multilabel Classification. (arXiv:2304.11045v1 [cs.LG])\nAbstract: Extreme multi-label (XML) classification refers to the task of supervised multi-label learning that involves a large number of labels. Hence, scalability of the classifier with increasing label dimension is an important consideration. In this paper, we develop a method called LightDXML which modifies the recently developed deep learning based XML framework by using label embeddings instead of feature embedding for negative sampling and iterating cyclically through three major phases: (1) proxy training of label embeddings (2) shortlisting of labels for negative sampling and (3) final classifier training using the negative samples. Consequently, LightDXML also removes the requirement of a re-ranker module, thereby, leading to further savings on time and memory requirements. The proposed method achieves the best of both worlds: while the training time, model size and prediction times are on par or better compared to the tree-based methods, it attains much better prediction accuracy that ",
    "path": "papers/23/04/2304.11045.json",
    "total_tokens": 883,
    "tldr": "本文提出了一种名为LightDXML的方法来解决多标签分类任务中分类器可扩展性的问题。该方法采用标签嵌入而非特征嵌入进行负采样，并通过三个主要阶段进行循环迭代，从而实现了更好的预测精度，同时还节省了时间和内存要求。",
    "en_tdlr": "This paper proposes a method called LightDXML to address the scalability problem of classifiers in multi-label classification tasks. The method uses label embeddings for negative sampling and iterates cyclically through three main phases to achieve better prediction accuracy while saving time and memory requirements."
}