{
    "title": "Physics-informed neural networks for predicting gas flow dynamics and unknown parameters in diesel engines. (arXiv:2304.13799v1 [cs.LG])",
    "abstract": "This paper presents a physics-informed neural network (PINN) approach for monitoring the health of diesel engines. The aim is to evaluate the engine dynamics, identify unknown parameters in a \"mean value\" model, and anticipate maintenance requirements. The PINN model is applied to diesel engines with a variable-geometry turbocharger and exhaust gas recirculation, using measurement data of selected state variables. The results demonstrate the ability of the PINN model to predict simultaneously both unknown parameters and dynamics accurately with both clean and noisy data, and the importance of the self-adaptive weight in the loss function for faster convergence. The input data for these simulations are derived from actual engine running conditions, while the outputs are simulated data, making this a practical case study of PINN's ability to predict real-world dynamical systems. The mean value model of the diesel engine incorporates empirical formulae to represent certain states, but the",
    "link": "http://arxiv.org/abs/2304.13799",
    "context": "Title: Physics-informed neural networks for predicting gas flow dynamics and unknown parameters in diesel engines. (arXiv:2304.13799v1 [cs.LG])\nAbstract: This paper presents a physics-informed neural network (PINN) approach for monitoring the health of diesel engines. The aim is to evaluate the engine dynamics, identify unknown parameters in a \"mean value\" model, and anticipate maintenance requirements. The PINN model is applied to diesel engines with a variable-geometry turbocharger and exhaust gas recirculation, using measurement data of selected state variables. The results demonstrate the ability of the PINN model to predict simultaneously both unknown parameters and dynamics accurately with both clean and noisy data, and the importance of the self-adaptive weight in the loss function for faster convergence. The input data for these simulations are derived from actual engine running conditions, while the outputs are simulated data, making this a practical case study of PINN's ability to predict real-world dynamical systems. The mean value model of the diesel engine incorporates empirical formulae to represent certain states, but the",
    "path": "papers/23/04/2304.13799.json",
    "total_tokens": 951,
    "translated_title": "物理信息神经网络用于预测柴油机气体流动动力学和未知参数",
    "translated_abstract": "本文介绍了一种应用于柴油机健康监测的物理信息神经网络(PINN)方法。该方法旨在评估发动机动力学，识别“平均值”模型中的未知参数，并预测维护需求。PINN模型应用于具有可变几何涡轮增压器和废气再循环的柴油机，使用选定状态变量的测量数据。实验结果表明，在干净和嘈杂的数据下，PINN模型能够同时准确地预测未知参数和动态，自适应权重在损失函数中的重要性，可加速收敛。这些模拟的输入数据来自实际发动机运行条件，而输出数据是模拟数据，使这成为PINN预测真实动态系统能力的实际案例研究。柴油机的平均值模型包括经验公式来表示某些状态，但本文提出的PINN方法可以更准确、更高效地预测动态并识别未知参数。",
    "tldr": "本论文提出了一种物理信息神经网络（PINN）方法，能够同时准确预测柴油机未知参数和动态，以及识别“平均值”模型中的未知参数，为实际案例研究提供了可能性。",
    "en_tdlr": "This paper presents a physics-informed neural network (PINN) approach for monitoring the health of diesel engines, and demonstrates its ability to accurately predict unknown parameters and dynamics, as well as identify unknown parameters in a \"mean value\" model, making it a practical case study for predicting real-world dynamical systems."
}