{
    "title": "The role of object-centric representations, guided attention, and external memory on generalizing visual relations. (arXiv:2304.07091v1 [cs.CV])",
    "abstract": "Visual reasoning is a long-term goal of vision research. In the last decade, several works have attempted to apply deep neural networks (DNNs) to the task of learning visual relations from images, with modest results in terms of the generalization of the relations learned. In recent years, several innovations in DNNs have been developed in order to enable learning abstract relation from images. In this work, we systematically evaluate a series of DNNs that integrate mechanism such as slot attention, recurrently guided attention, and external memory, in the simplest possible visual reasoning task: deciding whether two objects are the same or different. We found that, although some models performed better than others in generalizing the same-different relation to specific types of images, no model was able to generalize this relation across the board. We conclude that abstract visual reasoning remains largely an unresolved challenge for DNNs.",
    "link": "http://arxiv.org/abs/2304.07091",
    "context": "Title: The role of object-centric representations, guided attention, and external memory on generalizing visual relations. (arXiv:2304.07091v1 [cs.CV])\nAbstract: Visual reasoning is a long-term goal of vision research. In the last decade, several works have attempted to apply deep neural networks (DNNs) to the task of learning visual relations from images, with modest results in terms of the generalization of the relations learned. In recent years, several innovations in DNNs have been developed in order to enable learning abstract relation from images. In this work, we systematically evaluate a series of DNNs that integrate mechanism such as slot attention, recurrently guided attention, and external memory, in the simplest possible visual reasoning task: deciding whether two objects are the same or different. We found that, although some models performed better than others in generalizing the same-different relation to specific types of images, no model was able to generalize this relation across the board. We conclude that abstract visual reasoning remains largely an unresolved challenge for DNNs.",
    "path": "papers/23/04/2304.07091.json",
    "total_tokens": 894,
    "translated_title": "物体为中心的表征、引导注意力和外部记忆对于推广视觉关系的作用。",
    "translated_abstract": "视觉推理是视觉研究的长期目标。在过去的十年中，有几项工作试图将深度神经网络（DNNs）应用于从图像学习视觉关系的任务，但在学习关系的推广方面效果不佳。最近，为了使DNN能够从图像中学习抽象的关系，出现了几种创新的DNN机制。在本文中，我们系统地评估了一系列DNN，其中包括诸如插槽注意力、循环引导注意力和外部记忆等机制，用于最简单的视觉推理任务：决定两个物体是否相同或不同。我们发现，尽管某些模型在将相同-不同关系推广到特定类型的图像方面表现更好，但没有模型能够在全面范围内推广此关系。我们得出结论，抽象的视觉推理仍然是DNN的一个尚未解决的挑战。",
    "tldr": "研究对几种DNN进行了系统评估，发现DNN尚无法很好地在特定类型的图像中推广抽象的视觉关系，因此抽象的视觉推理仍然是DNN无法解决的挑战。",
    "en_tdlr": "The study systematically evaluated several DNNs and found that they are not able to effectively generalize abstract visual relations in specific types of images, making abstract visual reasoning still an unsolved challenge for DNNs."
}