{
    "title": "Approach Intelligent Writing Assistants Usability with Seven Stages of Action. (arXiv:2304.02822v1 [cs.HC] CROSS LISTED)",
    "abstract": "Despite the potential of Large Language Models (LLMs) as writing assistants, they are plagued by issues like coherence and fluency of the model output, trustworthiness, ownership of the generated content, and predictability of model performance, thereby limiting their usability. In this position paper, we propose to adopt Norman's seven stages of action as a framework to approach the interaction design of intelligent writing assistants. We illustrate the framework's applicability to writing tasks by providing an example of software tutorial authoring. The paper also discusses the framework as a tool to synthesize research on the interaction design of LLM-based tools and presents examples of tools that support the stages of action. Finally, we briefly outline the potential of a framework for human-LLM interaction research.",
    "link": "http://arxiv.org/abs/2304.02822",
    "context": "Title: Approach Intelligent Writing Assistants Usability with Seven Stages of Action. (arXiv:2304.02822v1 [cs.HC] CROSS LISTED)\nAbstract: Despite the potential of Large Language Models (LLMs) as writing assistants, they are plagued by issues like coherence and fluency of the model output, trustworthiness, ownership of the generated content, and predictability of model performance, thereby limiting their usability. In this position paper, we propose to adopt Norman's seven stages of action as a framework to approach the interaction design of intelligent writing assistants. We illustrate the framework's applicability to writing tasks by providing an example of software tutorial authoring. The paper also discusses the framework as a tool to synthesize research on the interaction design of LLM-based tools and presents examples of tools that support the stages of action. Finally, we briefly outline the potential of a framework for human-LLM interaction research.",
    "path": "papers/23/04/2304.02822.json",
    "total_tokens": 839,
    "translated_title": "以七个动作阶段的方式设计智能写作助手的可用性",
    "translated_abstract": "尽管大型语言模型( LLMS )具备成为写作助手的潜力，但它们仍然存在一些问题，例如模型输出的连贯性和流畅性、可信度、生成内容的所有权以及模型性能的可预测性，从而限制了它们的可用性。在本文中，我们提出采用诺曼的七个动作阶段作为智能写作助手交互设计的框架。我们通过提供软件教程创作的示例，说明该框架适用于写作任务。本文还讨论了该框架作为综合基于LLMS工具的交互设计研究的工具，并提供了支持这些动作阶段的工具的示例。最后，我们简要概述了人-LLMS交互研究框架的潜力。",
    "tldr": "本文提出采用诺曼的七个动作阶段作为智能写作助手交互设计的框架，并提供支持这些动作阶段的工具的示例。该框架有潜力成为人-LLM交互研究的重要工具。",
    "en_tdlr": "This paper proposes to adopt Norman's seven stages of action as a framework to approach the interaction design of intelligent writing assistants, and provides examples of tools that support these stages. The framework has the potential to become an important tool for human-LLM interaction research."
}