{
    "title": "Metric Temporal Equilibrium Logic over Timed Traces. (arXiv:2304.14778v1 [cs.AI])",
    "abstract": "In temporal extensions of Answer Set Programming (ASP) based on linear-time, the behavior of dynamic systems is captured by sequences of states. While this representation reflects their relative order, it abstracts away the specific times associated with each state. However, timing constraints are important in many applications like, for instance, when planning and scheduling go hand in hand. We address this by developing a metric extension of linear-time temporal equilibrium logic, in which temporal operators are constrained by intervals over natural numbers. The resulting Metric Equilibrium Logic provides the foundation of an ASP-based approach for specifying qualitative and quantitative dynamic constraints. To this end, we define a translation of metric formulas into monadic first-order formulas and give a correspondence between their models in Metric Equilibrium Logic and Monadic Quantified Equilibrium Logic, respectively. Interestingly, our translation provides a blue print for im",
    "link": "http://arxiv.org/abs/2304.14778",
    "context": "Title: Metric Temporal Equilibrium Logic over Timed Traces. (arXiv:2304.14778v1 [cs.AI])\nAbstract: In temporal extensions of Answer Set Programming (ASP) based on linear-time, the behavior of dynamic systems is captured by sequences of states. While this representation reflects their relative order, it abstracts away the specific times associated with each state. However, timing constraints are important in many applications like, for instance, when planning and scheduling go hand in hand. We address this by developing a metric extension of linear-time temporal equilibrium logic, in which temporal operators are constrained by intervals over natural numbers. The resulting Metric Equilibrium Logic provides the foundation of an ASP-based approach for specifying qualitative and quantitative dynamic constraints. To this end, we define a translation of metric formulas into monadic first-order formulas and give a correspondence between their models in Metric Equilibrium Logic and Monadic Quantified Equilibrium Logic, respectively. Interestingly, our translation provides a blue print for im",
    "path": "papers/23/04/2304.14778.json",
    "total_tokens": 834,
    "translated_title": "基于时间轨迹的度量时间平衡逻辑",
    "translated_abstract": "在基于线性时间的Answer Set Programming (ASP)的时间扩展中，动态系统的行为通过状态序列来捕获。虽然此表示反映了它们的相对顺序，但它抽象掉了与每个状态关联的具体时间。然而，时间约束在许多应用中是重要的，比如当计划和调度相互配合时。我们通过开发基于度量的线性时间平衡逻辑来解决这个问题，其中时间运算符受自然数区间的约束。由此得到的度量平衡逻辑为指定定性和定量动态约束的基于ASP的方法提供了基础。为此，我们将度量公式转化为单调一阶公式，并分别给出在Metric Equilibrium Logic和Monadic Quantified Equilibrium Logic中的模型之间的对应关系。有趣的是，我们的翻译提供了Metric Equilibrium Logic的实现模型检查的蓝图。",
    "tldr": "提出了基于度量的线性时间平衡逻辑来处理涉及时间约束的动态系统问题，并给出了通过将度量公式转化为单一一阶公式实现模型检查的方法。",
    "en_tdlr": "This paper proposes a metric extension of linear-time temporal equilibrium logic to capture the timing constraints in dynamic systems, and provides a translation from metric formulas to monadic first-order formulas to achieve implemented model checking of Metric Equilibrium Logic."
}