{
    "title": "FedBlockHealth: A Synergistic Approach to Privacy and Security in IoT-Enabled Healthcare through Federated Learning and Blockchain. (arXiv:2304.07668v1 [cs.CR])",
    "abstract": "The rapid adoption of Internet of Things (IoT) devices in healthcare has introduced new challenges in preserving data privacy, security and patient safety. Traditional approaches need to ensure security and privacy while maintaining computational efficiency, particularly for resource-constrained IoT devices. This paper proposes a novel hybrid approach combining federated learning and blockchain technology to provide a secure and privacy-preserved solution for IoT-enabled healthcare applications. Our approach leverages a public-key cryptosystem that provides semantic security for local model updates, while blockchain technology ensures the integrity of these updates and enforces access control and accountability. The federated learning process enables a secure model aggregation without sharing sensitive patient data. We implement and evaluate our proposed framework using EMNIST datasets, demonstrating its effectiveness in preserving data privacy and security while maintaining computatio",
    "link": "http://arxiv.org/abs/2304.07668",
    "context": "Title: FedBlockHealth: A Synergistic Approach to Privacy and Security in IoT-Enabled Healthcare through Federated Learning and Blockchain. (arXiv:2304.07668v1 [cs.CR])\nAbstract: The rapid adoption of Internet of Things (IoT) devices in healthcare has introduced new challenges in preserving data privacy, security and patient safety. Traditional approaches need to ensure security and privacy while maintaining computational efficiency, particularly for resource-constrained IoT devices. This paper proposes a novel hybrid approach combining federated learning and blockchain technology to provide a secure and privacy-preserved solution for IoT-enabled healthcare applications. Our approach leverages a public-key cryptosystem that provides semantic security for local model updates, while blockchain technology ensures the integrity of these updates and enforces access control and accountability. The federated learning process enables a secure model aggregation without sharing sensitive patient data. We implement and evaluate our proposed framework using EMNIST datasets, demonstrating its effectiveness in preserving data privacy and security while maintaining computatio",
    "path": "papers/23/04/2304.07668.json",
    "total_tokens": 888,
    "translated_title": "FedBlockHealth：基于联邦学习和区块链的IoT医疗保健隐私和安全协同方法",
    "translated_abstract": "在医疗保健领域，物联网设备的广泛应用给数据隐私、安全和患者安全带来新的挑战。传统的方法需要保证安全和隐私，同时保持计算效率，特别是对于资源受限的物联网设备。本文提出了一种创新的混合方法，结合了联邦学习和区块链技术，为IoT医疗保健应用提供安全和隐私保护的解决方案。我们的方法利用公钥加密系统为本地模型更新提供语义安全，而区块链技术确保这些更新的完整性并强制访问控制和问责制。联邦学习过程实现了安全的模型聚合，同时不共享敏感患者数据。我们使用EMNIST数据集实现和评估了我们提出的框架，证明了在保持计算效率的同时，有效地保护了数据隐私和安全。",
    "tldr": "本文提出了一种基于联邦学习和区块链技术的创新方法，为IoT医疗保健应用提供安全和隐私保护的解决方案，实现了安全的模型聚合，同时不共享敏感患者数据。",
    "en_tdlr": "This paper proposes a novel approach combining federated learning and blockchain technology to provide a secure and privacy-preserved solution for IoT-enabled healthcare applications, achieving secure model aggregation without sharing sensitive patient data."
}