{
    "title": "RexUIE: A Recursive Method with Explicit Schema Instructor for Universal Information Extraction. (arXiv:2304.14770v1 [cs.CL])",
    "abstract": "Universal Information Extraction (UIE) is an area of interest due to the challenges posed by varying targets, heterogeneous structures, and demand-specific schemas. However, previous works have only achieved limited success by unifying a few tasks, such as Named Entity Recognition (NER) and Relation Extraction (RE), which fall short of being authentic UIE models particularly when extracting other general schemas such as quadruples and quintuples. Additionally, these models used an implicit structural schema instructor, which could lead to incorrect links between types, hindering the model's generalization and performance in low-resource scenarios. In this paper, we redefine the authentic UIE with a formal formulation that encompasses almost all extraction schemas. To the best of our knowledge, we are the first to introduce UIE for any kind of schemas. In addition, we propose RexUIE, which is a Recursive Method with Explicit Schema Instructor for UIE. To avoid interference between diffe",
    "link": "http://arxiv.org/abs/2304.14770",
    "context": "Title: RexUIE: A Recursive Method with Explicit Schema Instructor for Universal Information Extraction. (arXiv:2304.14770v1 [cs.CL])\nAbstract: Universal Information Extraction (UIE) is an area of interest due to the challenges posed by varying targets, heterogeneous structures, and demand-specific schemas. However, previous works have only achieved limited success by unifying a few tasks, such as Named Entity Recognition (NER) and Relation Extraction (RE), which fall short of being authentic UIE models particularly when extracting other general schemas such as quadruples and quintuples. Additionally, these models used an implicit structural schema instructor, which could lead to incorrect links between types, hindering the model's generalization and performance in low-resource scenarios. In this paper, we redefine the authentic UIE with a formal formulation that encompasses almost all extraction schemas. To the best of our knowledge, we are the first to introduce UIE for any kind of schemas. In addition, we propose RexUIE, which is a Recursive Method with Explicit Schema Instructor for UIE. To avoid interference between diffe",
    "path": "papers/23/04/2304.14770.json",
    "total_tokens": 1060,
    "translated_title": "RexUIE: 一种带显式模式说明的递归方法，用于通用信息提取",
    "translated_abstract": "通用信息提取(UIE)因其具有不同目标、异构结构和需求特定模式而备受关注。然而，以前的研究仅通过统一一些任务(如命名实体识别和关系提取)取得了有限的成功，不能真正称之为UIE模型，特别是当提取其他常见模式（如四元组和五元组）时。此外，这些模型采用了一个隐式结构模式说明符，在类型之间建立错误的链接，使模型的泛化和在低资源情况下的性能受到影响。本文重新定义了正式的UIE公式，涵盖了几乎所有提取模式。我们是首次为任何类型的模式引入UIE。此外，我们提出了RexUIE，它是一种带显式模式说明的递归方法，用于 UIE。为了避免不同模式之间的干扰，RexUIE通过递归机制统一提取过程，适应多种提取场景。此外，我们引入了显式模式说明器，指导模型学习给定场景的结构模式，提高了在低资源设置中的泛化和性能。",
    "tldr": "本文提出了一种名为RexUIE的方法，采用递归机制和显式模式说明，实现通用信息提取(UIE)。与以往的模型相比，RexUIE在提取不同模式时不会出现冲突，并且显式模式说明器有助于提高模型的泛化能力和性能，特别是在低资源情况下。",
    "en_tdlr": "This paper proposes a method called RexUIE to achieve Universal Information Extraction (UIE) using recursive mechanism and explicit schema instructor. Compared with previous models, RexUIE avoids conflicts when extracting different schemas and the explicit schema instructor improves the model's generalization ability and performance, especially in low-resource scenarios."
}