{
    "title": "Neural Implicit Shape Editing using Boundary Sensitivity. (arXiv:2304.12951v1 [cs.CV])",
    "abstract": "Neural fields are receiving increased attention as a geometric representation due to their ability to compactly store detailed and smooth shapes and easily undergo topological changes. Compared to classic geometry representations, however, neural representations do not allow the user to exert intuitive control over the shape. Motivated by this, we leverage boundary sensitivity to express how perturbations in parameters move the shape boundary. This allows to interpret the effect of each learnable parameter and study achievable deformations. With this, we perform geometric editing: finding a parameter update that best approximates a globally prescribed deformation. Prescribing the deformation only locally allows the rest of the shape to change according to some prior, such as semantics or deformation rigidity. Our method is agnostic to the model its training and updates the NN in-place. Furthermore, we show how boundary sensitivity helps to optimize and constrain objectives (such as sur",
    "link": "http://arxiv.org/abs/2304.12951",
    "context": "Title: Neural Implicit Shape Editing using Boundary Sensitivity. (arXiv:2304.12951v1 [cs.CV])\nAbstract: Neural fields are receiving increased attention as a geometric representation due to their ability to compactly store detailed and smooth shapes and easily undergo topological changes. Compared to classic geometry representations, however, neural representations do not allow the user to exert intuitive control over the shape. Motivated by this, we leverage boundary sensitivity to express how perturbations in parameters move the shape boundary. This allows to interpret the effect of each learnable parameter and study achievable deformations. With this, we perform geometric editing: finding a parameter update that best approximates a globally prescribed deformation. Prescribing the deformation only locally allows the rest of the shape to change according to some prior, such as semantics or deformation rigidity. Our method is agnostic to the model its training and updates the NN in-place. Furthermore, we show how boundary sensitivity helps to optimize and constrain objectives (such as sur",
    "path": "papers/23/04/2304.12951.json",
    "total_tokens": 902,
    "translated_title": "利用边界敏感度的神经隐式形状编辑",
    "translated_abstract": "由于其能够紧凑保存详细和平滑的形状并轻松地进行拓扑变化，神经场作为一种几何表示正受到越来越多的关注。然而，与传统的几何表示相比，神经表示不允许用户对形状进行直观的控制。为了解决这个问题，我们利用边界敏感性来表达参数扰动如何移动形状边界。这样可以解释每个可学习参数的影响，并研究可实现的变形。利用这一点，我们执行几何编辑：找到最佳近似全局预设变形的参数更新。仅在局部指定变形允许形状的其余部分根据一些先验，例如语义或变形刚性而发生变化。我们的方法不受其训练模型的限制，并且可以就地更新神经网络。此外，我们展示了边界敏感度如何帮助优化和约束目标（如表面重建和去噪）。",
    "tldr": "本文提出了一种基于边界敏感性的神经隐式形状编辑方法，该方法可以通过对参数进行扰动来实现指定的全局形状变形，并根据先验对其余部分进行调整。方法不受模型限制，并可优化和约束目标。"
}