{
    "title": "SRCNet: Seminal Representation Collaborative Network for Marine Oil Spill Segmentation. (arXiv:2304.14500v1 [cs.CV])",
    "abstract": "Effective oil spill segmentation in Synthetic Aperture Radar (SAR) images is critical for marine oil pollution cleanup, and proper image representation is helpful for accurate image segmentation. In this paper, we propose an effective oil spill image segmentation network named SRCNet by leveraging SAR image representation and the training for oil spill segmentation simultaneously. Specifically, our proposed segmentation network is constructed with a pair of deep neural nets with the collaboration of the seminal representation that describes SAR images, where one deep neural net is the generative net which strives to produce oil spill segmentation maps, and the other is the discriminative net which trys its best to distinguish between the produced and the true segmentations, and they thus built a two-player game. Particularly, the seminal representation exploited in our proposed SRCNet originates from SAR imagery, modelling with the internal characteristics of SAR images. Thus, in the t",
    "link": "http://arxiv.org/abs/2304.14500",
    "context": "Title: SRCNet: Seminal Representation Collaborative Network for Marine Oil Spill Segmentation. (arXiv:2304.14500v1 [cs.CV])\nAbstract: Effective oil spill segmentation in Synthetic Aperture Radar (SAR) images is critical for marine oil pollution cleanup, and proper image representation is helpful for accurate image segmentation. In this paper, we propose an effective oil spill image segmentation network named SRCNet by leveraging SAR image representation and the training for oil spill segmentation simultaneously. Specifically, our proposed segmentation network is constructed with a pair of deep neural nets with the collaboration of the seminal representation that describes SAR images, where one deep neural net is the generative net which strives to produce oil spill segmentation maps, and the other is the discriminative net which trys its best to distinguish between the produced and the true segmentations, and they thus built a two-player game. Particularly, the seminal representation exploited in our proposed SRCNet originates from SAR imagery, modelling with the internal characteristics of SAR images. Thus, in the t",
    "path": "papers/23/04/2304.14500.json",
    "total_tokens": 901,
    "translated_abstract": "在合成孔径雷达(SAR)图像中，有效的溢油区域分割对于海洋污染清理至关重要，而适当的图像表示可以帮助实现精确的图像分割。本文提出了一种有效的油污图像分割网络SRCNet，通过利用SAR图像表示同时进行油污区域分割训练。具体来说，我们的分割网络是由一对神经网络构成的，并且协同使用描述SAR图像的语义表示训练油污区域分割。其中一个深度神经网络是生成网络，它旨在产生油污分割图，而另一个则是辨别网络，它尽最大努力区分产生的分割图和真实的分割图，并且二者相互博弈。尤其是，在我们提出的SRCNet中，利用了源自SAR影像的语义表示，模拟了SAR影像的内在特征。",
    "tldr": "本文提出了一种名为SRCNet的有效油污图像分割网络，通过使用SAR图像表示和训练，同时协同使用描述SAR图像的语义表示实现了精确的油污区域分割。"
}