{
    "title": "Adaptable and Interpretable Framework for Novelty Detection in Real-Time IoT Systems. (arXiv:2304.02947v1 [cs.LG])",
    "abstract": "This paper presents the Real-time Adaptive and Interpretable Detection (RAID) algorithm. The novel approach addresses the limitations of state-of-the-art anomaly detection methods for multivariate dynamic processes, which are restricted to detecting anomalies within the scope of the model training conditions. The RAID algorithm adapts to non-stationary effects such as data drift and change points that may not be accounted for during model development, resulting in prolonged service life. A dynamic model based on joint probability distribution handles anomalous behavior detection in a system and the root cause isolation based on adaptive process limits. RAID algorithm does not require changes to existing process automation infrastructures, making it highly deployable across different domains. Two case studies involving real dynamic system data demonstrate the benefits of the RAID algorithm, including change point adaptation, root cause isolation, and improved detection accuracy.",
    "link": "http://arxiv.org/abs/2304.02947",
    "context": "Title: Adaptable and Interpretable Framework for Novelty Detection in Real-Time IoT Systems. (arXiv:2304.02947v1 [cs.LG])\nAbstract: This paper presents the Real-time Adaptive and Interpretable Detection (RAID) algorithm. The novel approach addresses the limitations of state-of-the-art anomaly detection methods for multivariate dynamic processes, which are restricted to detecting anomalies within the scope of the model training conditions. The RAID algorithm adapts to non-stationary effects such as data drift and change points that may not be accounted for during model development, resulting in prolonged service life. A dynamic model based on joint probability distribution handles anomalous behavior detection in a system and the root cause isolation based on adaptive process limits. RAID algorithm does not require changes to existing process automation infrastructures, making it highly deployable across different domains. Two case studies involving real dynamic system data demonstrate the benefits of the RAID algorithm, including change point adaptation, root cause isolation, and improved detection accuracy.",
    "path": "papers/23/04/2304.02947.json",
    "total_tokens": 904,
    "translated_title": "实时物联网系统中新颖性检测的可适应和可解释框架",
    "translated_abstract": "本文介绍了一种名为Real-time Adaptive and Interpretable Detection (RAID)算法的新颖方法，它解决了多元动态过程异常检测方法的局限性，这些方法仅限于在模型训练条件范围内检测异常。RAID算法适应了非平稳效应，如数据漂移和变化点，在模型开发期间可能没有进行账务，从而延长了服务寿命。基于联合概率分布的动态模型处理系统中的异常行为检测和基于自适应过程限制的根本原因隔离。RAID算法不需要更改现有的过程自动化基础设施，因此可在不同领域高度部署。两个涉及实际动态系统数据的案例研究证明了RAID算法的好处，包括变更点适应性、根本原因隔离和改进的检测准确性。",
    "tldr": "介绍了一种RAID算法，能够在多元动态过程中检测异常行为，具有适应非平稳效应、不需改变现有过程自动化基础设施等特点，可在不同领域高度部署，并通过实际数据案例研究证明其改进的检测准确性。",
    "en_tdlr": "This paper introduces a novel RAID algorithm for detecting anomalous behavior in multivariate dynamic processes, which can adapt to non-stationary effects and does not require changes to existing process automation infrastructures. The algorithm is highly deployable across different domains and improves detection accuracy, as demonstrated by two case studies involving real dynamic system data."
}