{
    "title": "Improving Items and Contexts Understanding with Descriptive Graph for Conversational Recommendation. (arXiv:2304.09093v1 [cs.IR])",
    "abstract": "State-of-the-art methods on conversational recommender systems (CRS) leverage external knowledge to enhance both items' and contextual words' representations to achieve high quality recommendations and responses generation. However, the representations of the items and words are usually modeled in two separated semantic spaces, which leads to misalignment issue between them. Consequently, this will cause the CRS to only achieve a sub-optimal ranking performance, especially when there is a lack of sufficient information from the user's input. To address limitations of previous works, we propose a new CRS framework KLEVER, which jointly models items and their associated contextual words in the same semantic space. Particularly, we construct an item descriptive graph from the rich items' textual features, such as item description and categories. Based on the constructed descriptive graph, KLEVER jointly learns the embeddings of the words and items, towards enhancing both recommender and d",
    "link": "http://arxiv.org/abs/2304.09093",
    "context": "Title: Improving Items and Contexts Understanding with Descriptive Graph for Conversational Recommendation. (arXiv:2304.09093v1 [cs.IR])\nAbstract: State-of-the-art methods on conversational recommender systems (CRS) leverage external knowledge to enhance both items' and contextual words' representations to achieve high quality recommendations and responses generation. However, the representations of the items and words are usually modeled in two separated semantic spaces, which leads to misalignment issue between them. Consequently, this will cause the CRS to only achieve a sub-optimal ranking performance, especially when there is a lack of sufficient information from the user's input. To address limitations of previous works, we propose a new CRS framework KLEVER, which jointly models items and their associated contextual words in the same semantic space. Particularly, we construct an item descriptive graph from the rich items' textual features, such as item description and categories. Based on the constructed descriptive graph, KLEVER jointly learns the embeddings of the words and items, towards enhancing both recommender and d",
    "path": "papers/23/04/2304.09093.json",
    "total_tokens": 860,
    "translated_title": "基于描述性图的对话式推荐系统中的物品和上下文理解改进",
    "translated_abstract": "对话式推荐系统（CRS）在利用外部知识提高物品和上下文单词表示方面处于最前沿水平，以实现高质量的推荐和响应生成。然而，物品和单词的表示通常在两个独立的语义空间中建模，这会导致它们之间的不对齐问题。因此，当用户输入信息不足时，这将导致CRS仅实现次优排名表现。为了解决以前工作的局限性，我们提出了一个新的CRS框架KLEVER，它可以联合建模在相同语义空间中的物品和它们相关的上下文单词。特别是，我们从丰富的物品文本特征（如物品描述和类别）中构建一个物品描述性图。基于构建的描述性图，KLEVER共同学习单词和物品的嵌入，以增强推荐和对话生成的互动。",
    "tldr": "KLEVER是一个新的CRS框架，可以将物品和它们相关的上下文单词联合建模在同一语义空间中，解决了以前工作中的物品和单词语义空间不对齐的问题。"
}