{
    "title": "Opening the random forest black box by the analysis of the mutual impact of features. (arXiv:2304.02490v1 [cs.LG])",
    "abstract": "Random forest is a popular machine learning approach for the analysis of high-dimensional data because it is flexible and provides variable importance measures for the selection of relevant features. However, the complex relationships between the features are usually not considered for the selection and thus also neglected for the characterization of the analysed samples. Here we propose two novel approaches that focus on the mutual impact of features in random forests. Mutual forest impact (MFI) is a relation parameter that evaluates the mutual association of the featurs to the outcome and, hence, goes beyond the analysis of correlation coefficients. Mutual impurity reduction (MIR) is an importance measure that combines this relation parameter with the importance of the individual features. MIR and MFI are implemented together with testing procedures that generate p-values for the selection of related and important features. Applications to various simulated data sets and the comparis",
    "link": "http://arxiv.org/abs/2304.02490",
    "context": "Title: Opening the random forest black box by the analysis of the mutual impact of features. (arXiv:2304.02490v1 [cs.LG])\nAbstract: Random forest is a popular machine learning approach for the analysis of high-dimensional data because it is flexible and provides variable importance measures for the selection of relevant features. However, the complex relationships between the features are usually not considered for the selection and thus also neglected for the characterization of the analysed samples. Here we propose two novel approaches that focus on the mutual impact of features in random forests. Mutual forest impact (MFI) is a relation parameter that evaluates the mutual association of the featurs to the outcome and, hence, goes beyond the analysis of correlation coefficients. Mutual impurity reduction (MIR) is an importance measure that combines this relation parameter with the importance of the individual features. MIR and MFI are implemented together with testing procedures that generate p-values for the selection of related and important features. Applications to various simulated data sets and the comparis",
    "path": "papers/23/04/2304.02490.json",
    "total_tokens": 834,
    "translated_title": "分析特征相互作用揭开随机森林的黑匣子",
    "translated_abstract": "随机森林是一种流行的高维数据分析的机器学习方法，因为其灵活性并可提供变量重要性度量以选择相关特征。但是，特征之间的复杂关系通常不考虑选择，因此也被忽略了对分析样本的表征。本文提出了两种新方法，专注于随机森林中特征的相互影响。 Mutual forest impact（MFI）是一个关系参数，评估特征与结果之间的相互关联性，因此超越了相关系数分析。 Mutual impurity reduction（MIR）是一种重要性度量，它将这种关系参数与各个特征的重要性相结合。 MIR和MFI与测试程序一起实现，生成p值以选择相关和重要的特征。将其应用于各种模拟数据集，并进行比较。",
    "tldr": "本文提出了两种新方法， MIR和MFI，这些方法基于特征之间的相互影响，超越了传统的变量重要性度量方法，并可生成p值选择相关和重要的特征。",
    "en_tdlr": "This paper proposes two novel methods, MIR and MFI, which focus on the mutual impact of features in random forests and go beyond traditional variable importance measures by considering the complex relationships between features. These methods generate p-values for selecting related and important features."
}