{
    "title": "LitCQD: Multi-Hop Reasoning in Incomplete Knowledge Graphs with Numeric Literals. (arXiv:2304.14742v1 [cs.AI])",
    "abstract": "Most real-world knowledge graphs, including Wikidata, DBpedia, and Yago are incomplete. Answering queries on such incomplete graphs is an important, but challenging problem. Recently, a number of approaches, including complex query decomposition (CQD), have been proposed to answer complex, multi-hop queries with conjunctions and disjunctions on such graphs. However, all state-of-the-art approaches only consider graphs consisting of entities and relations, neglecting literal values. In this paper, we propose LitCQD -- an approach to answer complex, multi-hop queries where both the query and the knowledge graph can contain numeric literal values: LitCQD can answer queries having numerical answers or having entity answers satisfying numerical constraints. For example, it allows to query (1)~persons living in New York having a certain age, and (2)~the average age of persons living in New York. We evaluate LitCQD on query types with and without literal values. To evaluate LitCQD, we generat",
    "link": "http://arxiv.org/abs/2304.14742",
    "context": "Title: LitCQD: Multi-Hop Reasoning in Incomplete Knowledge Graphs with Numeric Literals. (arXiv:2304.14742v1 [cs.AI])\nAbstract: Most real-world knowledge graphs, including Wikidata, DBpedia, and Yago are incomplete. Answering queries on such incomplete graphs is an important, but challenging problem. Recently, a number of approaches, including complex query decomposition (CQD), have been proposed to answer complex, multi-hop queries with conjunctions and disjunctions on such graphs. However, all state-of-the-art approaches only consider graphs consisting of entities and relations, neglecting literal values. In this paper, we propose LitCQD -- an approach to answer complex, multi-hop queries where both the query and the knowledge graph can contain numeric literal values: LitCQD can answer queries having numerical answers or having entity answers satisfying numerical constraints. For example, it allows to query (1)~persons living in New York having a certain age, and (2)~the average age of persons living in New York. We evaluate LitCQD on query types with and without literal values. To evaluate LitCQD, we generat",
    "path": "papers/23/04/2304.14742.json",
    "total_tokens": 1013,
    "translated_title": "LitCQD：带有数值字面量的不完整知识图中的多跳推理",
    "translated_abstract": "大多数现实世界中的知识图，包括Wikidata，DBpedia和Yago在内，都是不完整的。针对这些不完整的知识图回答查询是一个重要但具有挑战性的问题。最近，提出了一些方法，包括复杂的查询分解（CQD），以回答带有合取和析取的复杂多跳查询。然而，所有最先进的方法都只考虑由实体和关系组成的图，而忽略了字面量值。在本文中，我们提出了LitCQD，一种用于回答包含数字字面量的复杂多跳查询的方法：LitCQD能够回答具有数字答案或满足数字约束的实体答案的查询。例如，它允许查询（1）住在纽约并且年龄在某个范围内的人，以及（2）住在纽约的人的平均年龄。我们在具有和不具有字面量值的查询类型上评估了LitCQD。我们生成了一个包含数字字面量的多跳查询的新数据集，针对Wikidata的一个子集对LitCQD进行评估。实验结果表明，LitCQD在此类查询上显著优于现有最先进的方法。",
    "tldr": "本文提出LitCQD算法，用于在不完整知识图中回答带有数字字面量的复杂多跳查询，并在包含数字字面量的多跳查询数据集上表现更好。",
    "en_tdlr": "This paper proposes LitCQD algorithm to answer complex multi-hop queries with numeric literals in incomplete knowledge graphs, and shows significant improvement on a new dataset containing such queries."
}