{
    "title": "Learning and Adapting Agile Locomotion Skills by Transferring Experience. (arXiv:2304.09834v1 [cs.RO])",
    "abstract": "Legged robots have enormous potential in their range of capabilities, from navigating unstructured terrains to high-speed running. However, designing robust controllers for highly agile dynamic motions remains a substantial challenge for roboticists. Reinforcement learning (RL) offers a promising data-driven approach for automatically training such controllers. However, exploration in these high-dimensional, underactuated systems remains a significant hurdle for enabling legged robots to learn performant, naturalistic, and versatile agility skills. We propose a framework for training complex robotic skills by transferring experience from existing controllers to jumpstart learning new tasks. To leverage controllers we can acquire in practice, we design this framework to be flexible in terms of their source -that is, the controllers may have been optimized for a different objective under different dynamics, or may require different knowledge of the surroundings -- and thus may be highl",
    "link": "http://arxiv.org/abs/2304.09834",
    "context": "Title: Learning and Adapting Agile Locomotion Skills by Transferring Experience. (arXiv:2304.09834v1 [cs.RO])\nAbstract: Legged robots have enormous potential in their range of capabilities, from navigating unstructured terrains to high-speed running. However, designing robust controllers for highly agile dynamic motions remains a substantial challenge for roboticists. Reinforcement learning (RL) offers a promising data-driven approach for automatically training such controllers. However, exploration in these high-dimensional, underactuated systems remains a significant hurdle for enabling legged robots to learn performant, naturalistic, and versatile agility skills. We propose a framework for training complex robotic skills by transferring experience from existing controllers to jumpstart learning new tasks. To leverage controllers we can acquire in practice, we design this framework to be flexible in terms of their source -that is, the controllers may have been optimized for a different objective under different dynamics, or may require different knowledge of the surroundings -- and thus may be highl",
    "path": "papers/23/04/2304.09834.json",
    "total_tokens": 908,
    "translated_title": "学习和适应敏捷运动技能的方法：经验迁移",
    "translated_abstract": "从在不平整地形中导航到高速奔跑，有腿机器人的能力潜力巨大。然而，为高度敏捷的动态运动设计稳健的控制器仍然是机器人技术人员面临的重大挑战。强化学习（RL）提供了一种有前途的数据驱动方法，可以自动训练这种控制器。然而，在这些高维度、欠驱动系统中进行探索仍然是使有腿机器人学习表现良好、自然而多才多艺的敏捷技能的重要障碍。我们提出了一个框架，通过从现有的控制器中转移经验来训练复杂的机器人技能，从而启动学习新任务。为了利用我们在实践中可以获得的控制器，我们设计了这个框架，使其在源上具有灵活性--也就是说，这些控制器可能已针对不同的动态而针对不同的目标进行了优化，或者可能需要更多的环境知识--因此可能非常高。",
    "tldr": "通过经验迁移和强化学习，该论文提出一种训练复杂机器人运动技能的框架，并克服了在高度欠驱动系统中进行探索的障碍。",
    "en_tdlr": "This paper proposes a framework for training complex robotic agility skills by transferring experience and using reinforcement learning. The framework overcomes the challenge of exploration in highly underactuated systems, resulting in performant and versatile legged robots."
}