{
    "title": "ChatABL: Abductive Learning via Natural Language Interaction with ChatGPT. (arXiv:2304.11107v1 [cs.CL])",
    "abstract": "Large language models (LLMs) such as ChatGPT have recently demonstrated significant potential in mathematical abilities, providing valuable reasoning paradigm consistent with human natural language. However, LLMs currently have difficulty in bridging perception, language understanding and reasoning capabilities due to incompatibility of the underlying information flow among them, making it challenging to accomplish tasks autonomously. On the other hand, abductive learning (ABL) frameworks for integrating the two abilities of perception and reasoning has seen significant success in inverse decipherment of incomplete facts, but it is limited by the lack of semantic understanding of logical reasoning rules and the dependence on complicated domain knowledge representation. This paper presents a novel method (ChatABL) for integrating LLMs into the ABL framework, aiming at unifying the three abilities in a more user-friendly and understandable manner. The proposed method uses the strengths o",
    "link": "http://arxiv.org/abs/2304.11107",
    "context": "Title: ChatABL: Abductive Learning via Natural Language Interaction with ChatGPT. (arXiv:2304.11107v1 [cs.CL])\nAbstract: Large language models (LLMs) such as ChatGPT have recently demonstrated significant potential in mathematical abilities, providing valuable reasoning paradigm consistent with human natural language. However, LLMs currently have difficulty in bridging perception, language understanding and reasoning capabilities due to incompatibility of the underlying information flow among them, making it challenging to accomplish tasks autonomously. On the other hand, abductive learning (ABL) frameworks for integrating the two abilities of perception and reasoning has seen significant success in inverse decipherment of incomplete facts, but it is limited by the lack of semantic understanding of logical reasoning rules and the dependence on complicated domain knowledge representation. This paper presents a novel method (ChatABL) for integrating LLMs into the ABL framework, aiming at unifying the three abilities in a more user-friendly and understandable manner. The proposed method uses the strengths o",
    "path": "papers/23/04/2304.11107.json",
    "total_tokens": 1139,
    "translated_title": "ChatABL：通过与ChatGPT的自然语言交互实现归纳学习",
    "translated_abstract": "最近，像ChatGPT这样的大型语言模型(LLM)已经展示出在数学能力方面的重大潜力，并提供了一种与人类自然语言一致的有价值的推理范式。然而，由于它们之间底层信息流的不兼容性，LLM目前难以在感知、语言理解和推理能力之间建立桥梁，使得实现自主任务变得具有挑战性。另一方面，用于将感知和推理两种能力整合的归纳学习(ABL)框架在不完整事实的逆向解密方面取得了重大成功，但它受到逻辑推理规则的语义理解不足以及依赖于复杂的领域知识表示的限制。本文提出了一种新方法(ChatABL)，将LLM整合到ABL框架中，旨在以更加用户友好和易理解的方式统一这三种能力。所提出的方法利用LLM的优势通过自然语言交流进行交互式学习，实现归纳推理。ChatABL框架旨在使LLM在感知和推理能力之间建立桥梁，结合深度学习和符号推理的自然语言处理能力。实验结果表明，与现有的ABL模型相比，ChatABL可以更有效和高效地学习解决归纳推理问题。",
    "tldr": "本研究提出了一种新方法ChatABL，将大型语言模型LLM整合到归纳学习ABL框架中，通过自然语言对话实现交互式学习，旨在以更加用户友好和易理解的方式统一感知、语言理解和推理能力。实验结果显示，ChatABL可以更有效和高效地学习解决归纳推理问题。",
    "en_tdlr": "This paper proposes a novel method called ChatABL, which integrates large language models (LLMs) into abductive learning (ABL) framework through natural language conversation for interactive learning. The goal is to unify perception, language understanding and reasoning capabilities in a more user-friendly and understandable way. Experimental results show that ChatABL can effectively and efficiently solve abductive reasoning problems."
}