{
    "title": "Hierarchically Fusing Long and Short-Term User Interests for Click-Through Rate Prediction in Product Search. (arXiv:2304.02089v1 [cs.IR])",
    "abstract": "Estimating Click-Through Rate (CTR) is a vital yet challenging task in personalized product search. However, existing CTR methods still struggle in the product search settings due to the following three challenges including how to more effectively extract users' short-term interests with respect to multiple aspects, how to extract and fuse users' long-term interest with short-term interests, how to address the entangling characteristic of long and short-term interests. To resolve these challenges, in this paper, we propose a new approach named Hierarchical Interests Fusing Network (HIFN), which consists of four basic modules namely Short-term Interests Extractor (SIE), Long-term Interests Extractor (LIE), Interests Fusion Module (IFM) and Interests Disentanglement Module (IDM). Specifically, SIE is proposed to extract user's short-term interests by integrating three fundamental interests encoders within it namely query-dependent, target-dependent and causal-dependent interest encoder, ",
    "link": "http://arxiv.org/abs/2304.02089",
    "context": "Title: Hierarchically Fusing Long and Short-Term User Interests for Click-Through Rate Prediction in Product Search. (arXiv:2304.02089v1 [cs.IR])\nAbstract: Estimating Click-Through Rate (CTR) is a vital yet challenging task in personalized product search. However, existing CTR methods still struggle in the product search settings due to the following three challenges including how to more effectively extract users' short-term interests with respect to multiple aspects, how to extract and fuse users' long-term interest with short-term interests, how to address the entangling characteristic of long and short-term interests. To resolve these challenges, in this paper, we propose a new approach named Hierarchical Interests Fusing Network (HIFN), which consists of four basic modules namely Short-term Interests Extractor (SIE), Long-term Interests Extractor (LIE), Interests Fusion Module (IFM) and Interests Disentanglement Module (IDM). Specifically, SIE is proposed to extract user's short-term interests by integrating three fundamental interests encoders within it namely query-dependent, target-dependent and causal-dependent interest encoder, ",
    "path": "papers/23/04/2304.02089.json",
    "total_tokens": 1032,
    "tldr": "本文提出了一种名为HIFN的新方法，通过层次化融合长期和短期兴趣，从而提高个性化商品搜索中的点击率。"
}