{
    "title": "$\\textit{e-Uber}$: A Crowdsourcing Platform for Electric Vehicle-based Ride- and Energy-sharing. (arXiv:2304.04753v1 [cs.AI])",
    "abstract": "The sharing-economy-based business model has recently seen success in the transportation and accommodation sectors with companies like Uber and Airbnb. There is growing interest in applying this model to energy systems, with modalities like peer-to-peer (P2P) Energy Trading, Electric Vehicles (EV)-based Vehicle-to-Grid (V2G), Vehicle-to-Home (V2H), Vehicle-to-Vehicle (V2V), and Battery Swapping Technology (BST). In this work, we exploit the increasing diffusion of EVs to realize a crowdsourcing platform called e-Uber that jointly enables ride-sharing and energy-sharing through V2G and BST. e-Uber exploits spatial crowdsourcing, reinforcement learning, and reverse auction theory. Specifically, the platform uses reinforcement learning to understand the drivers' preferences towards different ride-sharing and energy-sharing tasks. Based on these preferences, a personalized list is recommended to each driver through CMAB-based Algorithm for task Recommendation System (CARS). Drivers bid on ",
    "link": "http://arxiv.org/abs/2304.04753",
    "context": "Title: $\\textit{e-Uber}$: A Crowdsourcing Platform for Electric Vehicle-based Ride- and Energy-sharing. (arXiv:2304.04753v1 [cs.AI])\nAbstract: The sharing-economy-based business model has recently seen success in the transportation and accommodation sectors with companies like Uber and Airbnb. There is growing interest in applying this model to energy systems, with modalities like peer-to-peer (P2P) Energy Trading, Electric Vehicles (EV)-based Vehicle-to-Grid (V2G), Vehicle-to-Home (V2H), Vehicle-to-Vehicle (V2V), and Battery Swapping Technology (BST). In this work, we exploit the increasing diffusion of EVs to realize a crowdsourcing platform called e-Uber that jointly enables ride-sharing and energy-sharing through V2G and BST. e-Uber exploits spatial crowdsourcing, reinforcement learning, and reverse auction theory. Specifically, the platform uses reinforcement learning to understand the drivers' preferences towards different ride-sharing and energy-sharing tasks. Based on these preferences, a personalized list is recommended to each driver through CMAB-based Algorithm for task Recommendation System (CARS). Drivers bid on ",
    "path": "papers/23/04/2304.04753.json",
    "total_tokens": 1083,
    "translated_title": "$\\textit{e-Uber}$：一个基于共享经济的平台，实现基于电动汽车的拼车和能量共享",
    "translated_abstract": "最近，基于共享经济的商业模式在交通和住宿领域取得了成功，如Uber和Airbnb。人们越来越有兴趣将此模式应用于能源系统，包括点对点（P2P）能源交易和基于电动汽车（EV）的车对网（V2G）、车对家（V2H）、车对车（V2V）以及电池更换技术(BST)等方式。本文利用电动汽车的日益普及，实现了一个名为e-Uber的众包平台，通过V2G和BST共同实现拼车和能量共享。e-Uber利用空间众包、强化学习和反向拍卖理论实现。具体而言，本平台利用强化学习了解司机对不同拼车和能量共享任务的偏好。基于这些偏好，通过基于CMAB的算法进行任务推荐系统(CARS)的个性化推荐。司机在愿意执行的任务上进行竞标，而反向拍卖机制则选择最优出价。计算实验表明，所提出的系统在匹配效率、时间效率和用户满意度方面具有优越性。",
    "tldr": "本论文提出了一个名为e-Uber的众包平台，该平台利用电动汽车的日益普及，通过V2G和BST共同实现拼车和能量共享。平台利用强化学习，基于CMAB算法实现个性化任务推荐系统(CARS)，并利用反向拍卖机制选择最优出价。",
    "en_tdlr": "This paper proposes a crowdsourcing platform called e-Uber that utilizes the increasing diffusion of electric vehicles to enable ride-sharing and energy-sharing through V2G and BST. The platform uses reinforcement learning to understand driver preferences and a personalized task recommendation system (CARS) based on CMAB algorithm. A reverse auction mechanism is used to select optimal bids. Computational experiments show superior performance in matching efficiency, time efficiency, and user satisfaction."
}