{
    "title": "Semantic Frame Induction with Deep Metric Learning. (arXiv:2304.14286v1 [cs.CL])",
    "abstract": "Recent studies have demonstrated the usefulness of contextualized word embeddings in unsupervised semantic frame induction. However, they have also revealed that generic contextualized embeddings are not always consistent with human intuitions about semantic frames, which causes unsatisfactory performance for frame induction based on contextualized embeddings. In this paper, we address supervised semantic frame induction, which assumes the existence of frame-annotated data for a subset of predicates in a corpus and aims to build a frame induction model that leverages the annotated data. We propose a model that uses deep metric learning to fine-tune a contextualized embedding model, and we apply the fine-tuned contextualized embeddings to perform semantic frame induction. Our experiments on FrameNet show that fine-tuning with deep metric learning considerably improves the clustering evaluation scores, namely, the B-cubed F-score and Purity F-score, by about 8 points or more. We also dem",
    "link": "http://arxiv.org/abs/2304.14286",
    "context": "Title: Semantic Frame Induction with Deep Metric Learning. (arXiv:2304.14286v1 [cs.CL])\nAbstract: Recent studies have demonstrated the usefulness of contextualized word embeddings in unsupervised semantic frame induction. However, they have also revealed that generic contextualized embeddings are not always consistent with human intuitions about semantic frames, which causes unsatisfactory performance for frame induction based on contextualized embeddings. In this paper, we address supervised semantic frame induction, which assumes the existence of frame-annotated data for a subset of predicates in a corpus and aims to build a frame induction model that leverages the annotated data. We propose a model that uses deep metric learning to fine-tune a contextualized embedding model, and we apply the fine-tuned contextualized embeddings to perform semantic frame induction. Our experiments on FrameNet show that fine-tuning with deep metric learning considerably improves the clustering evaluation scores, namely, the B-cubed F-score and Purity F-score, by about 8 points or more. We also dem",
    "path": "papers/23/04/2304.14286.json",
    "total_tokens": 906,
    "translated_title": "深度度量学习下的语义框架感知",
    "translated_abstract": "最近的研究表明，上下文化词嵌入在无监督语义框架感知中是有用的。然而，它们也揭示了通用上下文化嵌入并不总是符合人类对语义框架的直觉，这导致基于上下文化嵌入的语义框架感知性能不佳。本文提出了一种深度度量学习模型，它使用语义帧标注数据对上下文化嵌入模型进行微调，并将微调后的上下文化嵌入应用于语义框架感知。在FrameNet上的实验表明，深度度量学习的微调显著提高了聚类评估分数，即B-cubed F分数和Purity F分数，提高了8个点以上。我们还证明了我们的模型优于包括使用上下文化嵌入的无监督方法在内的几种最先进的语义框架感知方法。",
    "tldr": "本文提出了一种深度度量学习的模型，通过对上下文嵌入模型进行微调，并应用于语义框架感知，实现语义框架感知，并在FrameNet上的实验表明效果优于其他最先进的方法。",
    "en_tdlr": "This paper proposes a deep metric learning-based model, which fine-tunes a contextualized embedding model with frame-annotated data and applies it to semantic frame induction, achieving better performance than other state-of-the-art methods according to experiments on FrameNet."
}