{
    "title": "Contingent Fees in Order Flow Auctions. (arXiv:2304.04981v1 [econ.TH])",
    "abstract": "Many early order flow auction designs handle the payment for orders when they execute on the chain rather than when they are won in the auction. Payments in these auctions only take place when the orders are executed, creating a free option for whoever wins the order. Bids in these auctions set the strike price of this option rather than the option premium. This paper develops a simple model of an order flow auction and compares contingent fees with upfront payments as well as mixtures of the two. Results suggest that auctions with a greater share of the payment contingent on execution have lower execution probability, lower revenue, and increased effective spreads in equilibrium. A Reputation system can act as a negative contingent fee, partially mitigating the downsides; however, unless the system is calibrated perfectly, some of the undesirable qualities of the contingent fees remain. Results suggest that designers of order flow auctions should avoid contingent fees whenever possibl",
    "link": "http://arxiv.org/abs/2304.04981",
    "context": "Title: Contingent Fees in Order Flow Auctions. (arXiv:2304.04981v1 [econ.TH])\nAbstract: Many early order flow auction designs handle the payment for orders when they execute on the chain rather than when they are won in the auction. Payments in these auctions only take place when the orders are executed, creating a free option for whoever wins the order. Bids in these auctions set the strike price of this option rather than the option premium. This paper develops a simple model of an order flow auction and compares contingent fees with upfront payments as well as mixtures of the two. Results suggest that auctions with a greater share of the payment contingent on execution have lower execution probability, lower revenue, and increased effective spreads in equilibrium. A Reputation system can act as a negative contingent fee, partially mitigating the downsides; however, unless the system is calibrated perfectly, some of the undesirable qualities of the contingent fees remain. Results suggest that designers of order flow auctions should avoid contingent fees whenever possibl",
    "path": "papers/23/04/2304.04981.json",
    "total_tokens": 929,
    "translated_title": "订单流拍卖中的报酬率",
    "translated_abstract": "许多早期的订单流拍卖设计处理订单的付款是在它们在链上执行时而不是在拍卖中获胜时进行的。",
    "tldr": "本文研究拍卖中的有条件的费用，将其与预付费和两种费用的混合进行比较。",
    "en_tdlr": "This paper studies contingent fees in order flow auctions and compares them with upfront payments and mixtures of the two. Results suggest that auctions with a greater share of the payment contingent on execution have lower execution probability, lower revenue, and increased effective spreads in equilibrium, and designers should avoid using contingent fees whenever possible."
}