{
    "title": "Artificial intelligence based prediction on lung cancer risk factors using deep learning. (arXiv:2304.05065v1 [eess.IV])",
    "abstract": "In this proposed work, we identified the significant research issues on lung cancer risk factors. Capturing and defining symptoms at an early stage is one of the most difficult phases for patients. Based on the history of patients records, we reviewed a number of current research studies on lung cancer and its various stages. We identified that lung cancer is one of the significant research issues in predicting the early stages of cancer disease. This research aimed to develop a model that can detect lung cancer with a remarkably high level of accuracy using the deep learning approach (convolution neural network). This method considers and resolves significant gaps in previous studies. We compare the accuracy levels and loss values of our model with VGG16, InceptionV3, and Resnet50. We found that our model achieved an accuracy of 94% and a minimum loss of 0.1%. Hence physicians can use our convolution neural network models for predicting lung cancer risk factors in the real world. More",
    "link": "http://arxiv.org/abs/2304.05065",
    "context": "Title: Artificial intelligence based prediction on lung cancer risk factors using deep learning. (arXiv:2304.05065v1 [eess.IV])\nAbstract: In this proposed work, we identified the significant research issues on lung cancer risk factors. Capturing and defining symptoms at an early stage is one of the most difficult phases for patients. Based on the history of patients records, we reviewed a number of current research studies on lung cancer and its various stages. We identified that lung cancer is one of the significant research issues in predicting the early stages of cancer disease. This research aimed to develop a model that can detect lung cancer with a remarkably high level of accuracy using the deep learning approach (convolution neural network). This method considers and resolves significant gaps in previous studies. We compare the accuracy levels and loss values of our model with VGG16, InceptionV3, and Resnet50. We found that our model achieved an accuracy of 94% and a minimum loss of 0.1%. Hence physicians can use our convolution neural network models for predicting lung cancer risk factors in the real world. More",
    "path": "papers/23/04/2304.05065.json",
    "total_tokens": 815,
    "translated_title": "基于深度学习的肺癌风险因素人工智能预测",
    "translated_abstract": "本研究旨在利用深度学习方法（卷积神经网络）开发出一种能够准确检测肺癌的模型，通过分析患者记录的历史数据，本研究确定肺癌是预测肿瘤早期阶段的一个重要研究问题。与VGG16、InceptionV3和Resnet50等现有模型相比，本研究的模型实现了94％的准确率和0.1％的最小损失，可以在现实世界中预测肺癌风险因素，为医生提供更准确的肺癌检测手段。",
    "tldr": "本研究利用深度学习开发出一种高精度的肺癌检测模型，可用于预测肺癌风险因素。",
    "en_tdlr": "This paper proposes a deep learning approach (convolution neural network) for accurately detecting lung cancer at an early stage. The developed model achieved an accuracy of 94% and a minimum loss of 0.1%, outperforming existing models like VGG16, InceptionV3, and Resnet50. The model can be used in the real world to predict lung cancer risk factors."
}