{
    "title": "Hierarchical Diffusion Autoencoders and Disentangled Image Manipulation. (arXiv:2304.11829v2 [cs.CV] UPDATED)",
    "abstract": "Diffusion models have attained impressive visual quality for image synthesis. However, how to interpret and manipulate the latent space of diffusion models has not been extensively explored. Prior work diffusion autoencoders encode the semantic representations into a semantic latent code, which fails to reflect the rich information of details and the intrinsic feature hierarchy. To mitigate those limitations, we propose Hierarchical Diffusion Autoencoders (HDAE) that exploit the fine-grained-to-abstract and lowlevel-to-high-level feature hierarchy for the latent space of diffusion models. The hierarchical latent space of HDAE inherently encodes different abstract levels of semantics and provides more comprehensive semantic representations. In addition, we propose a truncated-feature-based approach for disentangled image manipulation. We demonstrate the effectiveness of our proposed approach with extensive experiments and applications on image reconstruction, style mixing, controllable ",
    "link": "http://arxiv.org/abs/2304.11829",
    "context": "Title: Hierarchical Diffusion Autoencoders and Disentangled Image Manipulation. (arXiv:2304.11829v2 [cs.CV] UPDATED)\nAbstract: Diffusion models have attained impressive visual quality for image synthesis. However, how to interpret and manipulate the latent space of diffusion models has not been extensively explored. Prior work diffusion autoencoders encode the semantic representations into a semantic latent code, which fails to reflect the rich information of details and the intrinsic feature hierarchy. To mitigate those limitations, we propose Hierarchical Diffusion Autoencoders (HDAE) that exploit the fine-grained-to-abstract and lowlevel-to-high-level feature hierarchy for the latent space of diffusion models. The hierarchical latent space of HDAE inherently encodes different abstract levels of semantics and provides more comprehensive semantic representations. In addition, we propose a truncated-feature-based approach for disentangled image manipulation. We demonstrate the effectiveness of our proposed approach with extensive experiments and applications on image reconstruction, style mixing, controllable ",
    "path": "papers/23/04/2304.11829.json",
    "total_tokens": 954,
    "translated_title": "分级扩散自编码器和分解图像操作",
    "translated_abstract": "扩散模型在图像合成方面已经取得了令人印象深刻的视觉质量。然而，如何解释和操作扩散模型的潜在空间并没有被广泛探索。之前的工作中，扩散自编码器将语义表示编码到一个语义潜在代码中，但不能反映细节和内在特征层次的丰富信息。为了缓解这些限制，我们提出了分级扩散自编码器 (HDAE)，利用细粒度到抽象和低级到高级的特征层次结构来构建扩散模型的潜在空间。 HDAE 的分层潜在空间固有地编码了不同抽象层次的语义，并提供了更全面的语义表示。此外，我们提出了一种基于截断特征的分解图像操作方法。通过大量实验和应用，我们证明了我们提出的方法的有效性，包括图片重建、风格混合、可控生成和图像编辑等。",
    "tldr": "本文提出了一种分级扩散自编码器 (HDAE) ，利用细粒度到抽象和低级到高级的特征层次结构来构建扩散模型的分层潜在空间。该方法更全面地编码了不同抽象层次的语义，并提供了一种基于截断特征的分解图像操作方法。",
    "en_tdlr": "This paper proposes a Hierarchical Diffusion Autoencoder (HDAE) that constructs a hierarchical latent space for diffusion models by exploiting the fine-grained-to-abstract and low-level-to-high-level feature hierarchy. The proposed approach provides more comprehensive semantic representations by encoding different abstract levels of semantics and introduces a truncated-feature-based approach for disentangled image manipulation."
}