{
    "title": "Time-dependent Iterative Imputation for Multivariate Longitudinal Clinical Data. (arXiv:2304.07821v1 [cs.LG])",
    "abstract": "Missing data is a major challenge in clinical research. In electronic medical records, often a large fraction of the values in laboratory tests and vital signs are missing. The missingness can lead to biased estimates and limit our ability to draw conclusions from the data. Additionally, many machine learning algorithms can only be applied to complete datasets. A common solution is data imputation, the process of filling-in the missing values. However, some of the popular imputation approaches perform poorly on clinical data. We developed a simple new approach, Time-Dependent Iterative imputation (TDI), which offers a practical solution for imputing time-series data. It addresses both multivariate and longitudinal data, by integrating forward-filling and Iterative Imputer. The integration employs a patient, variable, and observation-specific dynamic weighting strategy, based on the clinical patterns of the data, including missing rates and measurement frequency. We tested TDI on random",
    "link": "http://arxiv.org/abs/2304.07821",
    "context": "Title: Time-dependent Iterative Imputation for Multivariate Longitudinal Clinical Data. (arXiv:2304.07821v1 [cs.LG])\nAbstract: Missing data is a major challenge in clinical research. In electronic medical records, often a large fraction of the values in laboratory tests and vital signs are missing. The missingness can lead to biased estimates and limit our ability to draw conclusions from the data. Additionally, many machine learning algorithms can only be applied to complete datasets. A common solution is data imputation, the process of filling-in the missing values. However, some of the popular imputation approaches perform poorly on clinical data. We developed a simple new approach, Time-Dependent Iterative imputation (TDI), which offers a practical solution for imputing time-series data. It addresses both multivariate and longitudinal data, by integrating forward-filling and Iterative Imputer. The integration employs a patient, variable, and observation-specific dynamic weighting strategy, based on the clinical patterns of the data, including missing rates and measurement frequency. We tested TDI on random",
    "path": "papers/23/04/2304.07821.json",
    "total_tokens": 941,
    "translated_title": "多元纵向临床数据的时变迭代插补方法",
    "translated_abstract": "缺失数据是临床研究中的一个主要挑战。在电子病历中，常常有大量的实验室检查和生命体征数值缺失。缺失数据可能导致偏倚估计并限制我们从数据中得出结论的能力。此外，许多机器学习算法只能应用于完整的数据集。一种常见的解决方案是数据补充，即填补缺失值的过程。然而，一些流行的补充方法在临床数据中表现不佳。我们开发了一种简单的新方法，称为时间依赖迭代插补 (TDI)，为填补时间序列数据提供了实用的解决方案。它通过集成前向填充和迭代插值器来处理多元和纵向数据。该集成采用基于临床数据模式的患者、变量和观测特定的动态加权策略，包括缺失率和测量频率。我们将TDI应用于随机生成的数据集和真实的临床数据集，并将其与几种广泛使用的方法进行比较。",
    "tldr": "提出一种新的TDI方法解决临床数据中的缺失值问题，通过集成前向填充和迭代插值器解决多元和纵向数据问题，采用动态加权策略处理缺失率和测量频率。",
    "en_tdlr": "A new TDI approach is proposed to address missing values in clinical data by integrating forward-filling and iterative imputer, employing a dynamic weighting strategy based on clinical patterns of the data, including missing rates and measurement frequency, to handle multivariate and longitudinal data."
}