{
    "title": "Interpretable machine learning-accelerated seed treatment by nanomaterials for environmental stress alleviation. (arXiv:2304.03928v1 [cs.LG])",
    "abstract": "Crops are constantly challenged by different environmental conditions. Seed treatment by nanomaterials is a cost-effective and environmentally-friendly solution for environmental stress mitigation in crop plants. Here, 56 seed nanopriming treatments are used to alleviate environmental stresses in maize. Seven selected nanopriming treatments significantly increase the stress resistance index (SRI) by 13.9% and 12.6% under salinity stress and combined heat-drought stress, respectively. Metabolomics data reveals that ZnO nanopriming treatment, with the highest SRI value, mainly regulates the pathways of amino acid metabolism, secondary metabolite synthesis, carbohydrate metabolism, and translation. Understanding the mechanism of seed nanopriming is still difficult due to the variety of nanomaterials and the complexity of interactions between nanomaterials and plants. Using the nanopriming data, we present an interpretable structure-activity relationship (ISAR) approach based on interpreta",
    "link": "http://arxiv.org/abs/2304.03928",
    "context": "Title: Interpretable machine learning-accelerated seed treatment by nanomaterials for environmental stress alleviation. (arXiv:2304.03928v1 [cs.LG])\nAbstract: Crops are constantly challenged by different environmental conditions. Seed treatment by nanomaterials is a cost-effective and environmentally-friendly solution for environmental stress mitigation in crop plants. Here, 56 seed nanopriming treatments are used to alleviate environmental stresses in maize. Seven selected nanopriming treatments significantly increase the stress resistance index (SRI) by 13.9% and 12.6% under salinity stress and combined heat-drought stress, respectively. Metabolomics data reveals that ZnO nanopriming treatment, with the highest SRI value, mainly regulates the pathways of amino acid metabolism, secondary metabolite synthesis, carbohydrate metabolism, and translation. Understanding the mechanism of seed nanopriming is still difficult due to the variety of nanomaterials and the complexity of interactions between nanomaterials and plants. Using the nanopriming data, we present an interpretable structure-activity relationship (ISAR) approach based on interpreta",
    "path": "papers/23/04/2304.03928.json",
    "total_tokens": 989,
    "translated_abstract": "农作物不断受到不同环境条件的挑战。纳米材料的种子处理是一种成本效益高、环境友好的解决方案，可缓解作物植株的环境胁迫。本文利用56种种子纳米预处理方法缓解玉米的环境胁迫。其中7种选择性纳米预处理方法显著提高了盐胁迫和热干旱胁迫下的胁迫抗性指数（SRI），分别提高了13.9%和12.6%。代谢组学数据显示，具有最高SRI值的ZnO纳米预处理方法主要调节氨基酸代谢、次生代谢物合成、碳水化合物代谢和翻译等通路。由于纳米材料的多样性和与植物之间交互的复杂性，种子纳米预处理机制的理解仍然很困难。利用纳米预处理数据，我们提出了一种基于可解释的结构活性关系（ISAR）方法来解释这种机制。",
    "tldr": "研究发现，种子预处理纳米材料是一种成本效益高、环境友好的解决方案，可显著提高玉米的胁迫抗性，最高的ZnO处理方法主要调节了氨基酸代谢、次生代谢物合成和碳水化合物代谢等通路。",
    "en_tdlr": "Seed treatment by nanomaterials is a cost-effective and environmentally-friendly solution for alleviating environmental stresses in crop plants. The study found that the ZnO nanopriming treatment significantly increases stress resistance index and mainly regulates the pathways of amino acid metabolism, secondary metabolite synthesis, and carbohydrate metabolism."
}