{
    "title": "Certified Adversarial Robustness Within Multiple Perturbation Bounds. (arXiv:2304.10446v1 [cs.LG])",
    "abstract": "Randomized smoothing (RS) is a well known certified defense against adversarial attacks, which creates a smoothed classifier by predicting the most likely class under random noise perturbations of inputs during inference. While initial work focused on robustness to $\\ell_2$ norm perturbations using noise sampled from a Gaussian distribution, subsequent works have shown that different noise distributions can result in robustness to other $\\ell_p$ norm bounds as well. In general, a specific noise distribution is optimal for defending against a given $\\ell_p$ norm based attack. In this work, we aim to improve the certified adversarial robustness against multiple perturbation bounds simultaneously. Towards this, we firstly present a novel \\textit{certification scheme}, that effectively combines the certificates obtained using different noise distributions to obtain optimal results against multiple perturbation bounds. We further propose a novel \\textit{training noise distribution} along wi",
    "link": "http://arxiv.org/abs/2304.10446",
    "context": "Title: Certified Adversarial Robustness Within Multiple Perturbation Bounds. (arXiv:2304.10446v1 [cs.LG])\nAbstract: Randomized smoothing (RS) is a well known certified defense against adversarial attacks, which creates a smoothed classifier by predicting the most likely class under random noise perturbations of inputs during inference. While initial work focused on robustness to $\\ell_2$ norm perturbations using noise sampled from a Gaussian distribution, subsequent works have shown that different noise distributions can result in robustness to other $\\ell_p$ norm bounds as well. In general, a specific noise distribution is optimal for defending against a given $\\ell_p$ norm based attack. In this work, we aim to improve the certified adversarial robustness against multiple perturbation bounds simultaneously. Towards this, we firstly present a novel \\textit{certification scheme}, that effectively combines the certificates obtained using different noise distributions to obtain optimal results against multiple perturbation bounds. We further propose a novel \\textit{training noise distribution} along wi",
    "path": "papers/23/04/2304.10446.json",
    "total_tokens": 1046,
    "translated_title": "在多个扰动约束中证明对抗鲁棒性",
    "translated_abstract": "随机平滑（RS）是一种众所周知的对抗性攻击抵御方法，它在推理过程中通过预测在输入上的随机噪声扰动下最可能的分类来创建平滑的分类器。虽然最初的工作集中在对$\\ell_2$范数扰动的鲁棒性，使用从高斯分布中采样的噪声，但随后的工作表明，不同的噪声分布也可以导致对其他$\\ell_p$范数边界的鲁棒性。一般来说，特定的噪声分布是防御给定$\\ell_p$范数攻击的最佳选择。本文旨在提高多个扰动界限的认证性对抗性鲁棒性。为此，我们首先提出了一种新的\\textit{认证方案}，有效地结合了使用不同噪声分布获得的证书，以在多个扰动界限下获得最佳结果。我们进一步提出了一种新的\\textit{训练噪声分布}，以及一个新的\\textit{可证明的边界}用于RS，该方法针对同时实现多个扰动界限的鲁棒性进行了优化。我们对各种基准测试进行的实验表明，在使用单个平滑的分类器的情况下，我们实现了最先进的多个扰动界限下的认证鲁棒性。",
    "tldr": "本论文提出了一种新的认证方法，可以在多个扰动边界下获得最佳结果，同时针对RS方法进行了优化，实现了最先进的认证性鲁棒性。"
}