{
    "title": "Importance is Important: A Guide to Informed Importance Tempering Methods. (arXiv:2304.06251v1 [stat.CO])",
    "abstract": "Informed importance tempering (IIT) is an easy-to-implement MCMC algorithm that can be seen as an extension of the familiar Metropolis-Hastings algorithm with the special feature that informed proposals are always accepted, and which was shown in Zhou and Smith (2022) to converge much more quickly in some common circumstances. This work develops a new, comprehensive guide to the use of IIT in many situations. First, we propose two IIT schemes that run faster than existing informed MCMC methods on discrete spaces by not requiring the posterior evaluation of all neighboring states. Second, we integrate IIT with other MCMC techniques, including simulated tempering, pseudo-marginal and multiple-try methods (on general state spaces), which have been conventionally implemented as Metropolis-Hastings schemes and can suffer from low acceptance rates. The use of IIT allows us to always accept proposals and brings about new opportunities for optimizing the sampler which are not possible under th",
    "link": "http://arxiv.org/abs/2304.06251",
    "context": "Title: Importance is Important: A Guide to Informed Importance Tempering Methods. (arXiv:2304.06251v1 [stat.CO])\nAbstract: Informed importance tempering (IIT) is an easy-to-implement MCMC algorithm that can be seen as an extension of the familiar Metropolis-Hastings algorithm with the special feature that informed proposals are always accepted, and which was shown in Zhou and Smith (2022) to converge much more quickly in some common circumstances. This work develops a new, comprehensive guide to the use of IIT in many situations. First, we propose two IIT schemes that run faster than existing informed MCMC methods on discrete spaces by not requiring the posterior evaluation of all neighboring states. Second, we integrate IIT with other MCMC techniques, including simulated tempering, pseudo-marginal and multiple-try methods (on general state spaces), which have been conventionally implemented as Metropolis-Hastings schemes and can suffer from low acceptance rates. The use of IIT allows us to always accept proposals and brings about new opportunities for optimizing the sampler which are not possible under th",
    "path": "papers/23/04/2304.06251.json",
    "total_tokens": 1027,
    "translated_title": "实用指南：关于知情重要性调节方法的详细介绍",
    "translated_abstract": "知情重要性调节 (IIT) 是一种易于实施的MCMC算法，可视为通常的Metropolis-Hastings算法的扩展，具有始终接受有信息的提议的特殊功能，在Zhou和Smith（2022年）的研究中表明在一些常见情况下收敛更快。本文开发了一个新的、全面的指南，介绍了IIT在许多情况下的应用。首先，我们提出了两种IIT方案，这些方案在离散空间上的运行速度比现有的知情MCMC方法更快，因为它们不需要计算所有相邻状态的后验概率。其次，我们将IIT与其他MCMC技术（包括模拟回火、伪边缘和多重尝试方法，在一般状态空间上实施为Metropolis-Hastings方案，可能遭受低接受率的问题）进行了整合。使用IIT使我们能够始终接受提议，并带来了优化抽样器的新机会，这是在Metropolis-Hastings算法下不可能的。最后，我们提供了一个实用的指南，以选择IIT方案和调整算法参数。对各种模型的实验结果证明了我们所提出的方法的有效性。",
    "tldr": "本论文详细介绍了一种易于实施的MCMC算法IIT及其在许多情况下的应用。该算法始终接受有信息的提议，可与其他MCMC技术相结合，并带来新的优化抽样器的机会。",
    "en_tdlr": "This paper provides a comprehensive guide to the easy-to-implement IIT MCMC algorithm, which always accepts informed proposals and can be integrated with other MCMC techniques. It offers new opportunities for optimizing the sampler and demonstrates effectiveness in various models."
}