{
    "title": "Killing Two Birds with One Stone: Quantization Achieves Privacy in Distributed Learning. (arXiv:2304.13545v1 [cs.LG])",
    "abstract": "Communication efficiency and privacy protection are two critical issues in distributed machine learning. Existing methods tackle these two issues separately and may have a high implementation complexity that constrains their application in a resource-limited environment. We propose a comprehensive quantization-based solution that could simultaneously achieve communication efficiency and privacy protection, providing new insights into the correlated nature of communication and privacy. Specifically, we demonstrate the effectiveness of our proposed solutions in the distributed stochastic gradient descent (SGD) framework by adding binomial noise to the uniformly quantized gradients to reach the desired differential privacy level but with a minor sacrifice in communication efficiency. We theoretically capture the new trade-offs between communication, privacy, and learning performance.",
    "link": "http://arxiv.org/abs/2304.13545",
    "context": "Title: Killing Two Birds with One Stone: Quantization Achieves Privacy in Distributed Learning. (arXiv:2304.13545v1 [cs.LG])\nAbstract: Communication efficiency and privacy protection are two critical issues in distributed machine learning. Existing methods tackle these two issues separately and may have a high implementation complexity that constrains their application in a resource-limited environment. We propose a comprehensive quantization-based solution that could simultaneously achieve communication efficiency and privacy protection, providing new insights into the correlated nature of communication and privacy. Specifically, we demonstrate the effectiveness of our proposed solutions in the distributed stochastic gradient descent (SGD) framework by adding binomial noise to the uniformly quantized gradients to reach the desired differential privacy level but with a minor sacrifice in communication efficiency. We theoretically capture the new trade-offs between communication, privacy, and learning performance.",
    "path": "papers/23/04/2304.13545.json",
    "total_tokens": 811,
    "translated_title": "一箭双雕：量化在分布式学习中实现隐私保护与通讯效率",
    "translated_abstract": "分布式机器学习中的通讯效率和隐私保护是两个关键问题。现有的方法分开解决这两个问题，可能在资源有限的环境下应用上受到限制。本文提出了一种基于量化的综合解决方案，能够同时实现通讯效率和隐私保护，并提供了与通讯和隐私相关性质的新见解。具体而言，我们向均匀量化的梯度添加二项噪声以达到所需的差分隐私级别，从而在稍微牺牲通讯效率的情况下证明了所提出的解决方案在分布式随机梯度下降 (SGD) 框架中的有效性。我们理论上捕捉了通讯、隐私和学习性能之间的新权衡。",
    "tldr": "本文提出了一种分布式学习中的综合解决方案，基于量化同时实现通讯效率和隐私保护，并且向均匀量化的梯度添加二项噪声以达到所需的差分隐私级别。",
    "en_tdlr": "This paper proposes a comprehensive solution for communication efficiency and privacy protection in distributed machine learning, based on quantization with added binomial noise to achieve differential privacy level, thus providing new insights into the related nature of communication and privacy."
}