{
    "title": "Knowledge Relation Rank Enhanced Heterogeneous Learning Interaction Modeling for Neural Graph Forgetting Knowledge Tracing. (arXiv:2304.03945v1 [cs.LG])",
    "abstract": "Recently, knowledge tracing models have been applied in educational data mining such as the Self-attention knowledge tracing model(SAKT), which models the relationship between exercises and Knowledge concepts(Kcs). However, relation modeling in traditional Knowledge tracing models only considers the static question-knowledge relationship and knowledge-knowledge relationship and treats these relationships with equal importance. This kind of relation modeling is difficult to avoid the influence of subjective labeling and considers the relationship between exercises and KCs, or KCs and KCs separately. In this work, a novel knowledge tracing model, named Knowledge Relation Rank Enhanced Heterogeneous Learning Interaction Modeling for Neural Graph Forgetting Knowledge Tracing(NGFKT), is proposed to reduce the impact of the subjective labeling by calibrating the skill relation matrix and the Q-matrix and apply the Graph Convolutional Network(GCN) to model the heterogeneous interactions betwe",
    "link": "http://arxiv.org/abs/2304.03945",
    "context": "Title: Knowledge Relation Rank Enhanced Heterogeneous Learning Interaction Modeling for Neural Graph Forgetting Knowledge Tracing. (arXiv:2304.03945v1 [cs.LG])\nAbstract: Recently, knowledge tracing models have been applied in educational data mining such as the Self-attention knowledge tracing model(SAKT), which models the relationship between exercises and Knowledge concepts(Kcs). However, relation modeling in traditional Knowledge tracing models only considers the static question-knowledge relationship and knowledge-knowledge relationship and treats these relationships with equal importance. This kind of relation modeling is difficult to avoid the influence of subjective labeling and considers the relationship between exercises and KCs, or KCs and KCs separately. In this work, a novel knowledge tracing model, named Knowledge Relation Rank Enhanced Heterogeneous Learning Interaction Modeling for Neural Graph Forgetting Knowledge Tracing(NGFKT), is proposed to reduce the impact of the subjective labeling by calibrating the skill relation matrix and the Q-matrix and apply the Graph Convolutional Network(GCN) to model the heterogeneous interactions betwe",
    "path": "papers/23/04/2304.03945.json",
    "total_tokens": 1186,
    "translated_title": "知识关系排序增强异构学习交互模型用于神经图遗忘知识追踪",
    "translated_abstract": "近年来，知识追踪模型已经应用于教育数据挖掘中，例如自注意力知识追踪模型（SAKT），它建模了练习和知识概念之间的关系。然而，传统知识追踪模型中的关系建模只考虑静态的问题-知识关系和知识-知识关系，并将这些关系同等重视。这种关系建模难以避免主观标记的影响，并单独考虑练习和KCs之间，或KCs和KCs之间的关系。本文提出了一种新颖的知识追踪模型，命名为知识关系排序增强异构学习交互模型用于神经图遗忘知识追踪（NGFKT），通过校准技能关系矩阵和Q矩阵降低主观标记的影响，并应用图卷积网络（GCN）来建模不同类型节点之间的异构交互，即练习，Kcs和学生。NGFKT模型引入了知识关系排序机制来模拟不同关系的重要性，从而增强了复杂、动态的知识追踪过程的建模。在三个公共数据集上的实验结果表明，所提出的NGFKT模型在预测准确性和AUC方面的性能优于现有方法。",
    "tldr": "提出了一种新的知识追踪模型NGFKT，通过校准技能关系矩阵和Q矩阵降低主观标记的影响，并引入知识关系排序机制来模拟不同关系的重要性，应用图卷积网络建模不同类型节点之间的异构交互，能够更好地进行复杂、动态的知识追踪。",
    "en_tdlr": "A new knowledge tracing model NGFKT is proposed to reduce the impact of subjective labeling by calibrating the skill relation matrix and Q-matrix, and introduce a knowledge relation rank mechanism to model different relationship importance, applying Graph Convolutional Network to model heterogeneous interactions between different types of nodes and better perform complex, dynamic knowledge tracing."
}