{
    "title": "Learning with augmented target information: An alternative theory of Feedback Alignment. (arXiv:2304.01406v1 [q-bio.NC])",
    "abstract": "While error backpropagation (BP) has dominated the training of nearly all modern neural networks for a long time, it suffers from several biological plausibility issues such as the symmetric weight requirement and synchronous updates. Feedback Alignment (FA) was proposed as an alternative to BP to address those dilemmas and has been demonstrated to be effective on various tasks and network architectures. Despite its simplicity and effectiveness, a satisfying explanation of how FA works across different architectures is still lacking. Here we propose a novel, architecture-agnostic theory of how FA works through the lens of information theory: Instead of approximating gradients calculated by BP with the same parameter, FA learns effective representations by embedding target information into neural networks to be trained. We show this through the analysis of FA dynamics in idealized settings and then via a series of experiments. Based on the implications of this theory, we designed three ",
    "link": "http://arxiv.org/abs/2304.01406",
    "context": "Title: Learning with augmented target information: An alternative theory of Feedback Alignment. (arXiv:2304.01406v1 [q-bio.NC])\nAbstract: While error backpropagation (BP) has dominated the training of nearly all modern neural networks for a long time, it suffers from several biological plausibility issues such as the symmetric weight requirement and synchronous updates. Feedback Alignment (FA) was proposed as an alternative to BP to address those dilemmas and has been demonstrated to be effective on various tasks and network architectures. Despite its simplicity and effectiveness, a satisfying explanation of how FA works across different architectures is still lacking. Here we propose a novel, architecture-agnostic theory of how FA works through the lens of information theory: Instead of approximating gradients calculated by BP with the same parameter, FA learns effective representations by embedding target information into neural networks to be trained. We show this through the analysis of FA dynamics in idealized settings and then via a series of experiments. Based on the implications of this theory, we designed three ",
    "path": "papers/23/04/2304.01406.json",
    "total_tokens": 960,
    "translated_title": "学习增强目标信息：反馈对齐的替代理论",
    "translated_abstract": "错误反向传播（BP）长期以来一直占据着几乎所有现代神经网络的训练主导地位，但它存在着许多生物合理性问题，如对称权重要求和同步更新。反馈对齐（FA）被提出作为BP的替代方案以解决这些困境，并已被证明在各种任务和网络体系结构上都具有有效性。尽管它简单而有效，但还缺乏一个令人满意的解释，解释FA如何在不同的体系结构中发挥作用。在这里，我们提出了一种新的、架构不可知的FA工作理论，通过信息理论的视角，将目标信息嵌入到被训练的神经网络中，从而学习有效的表征，而不是用相同的参数来近似BP计算出的梯度。我们通过对理想情况下的FA动态进行分析来展示这一点，然后通过一系列实验来验证。基于这一理论的意义，我们设计了三种实现FA的方法，并测试了它们的有效性和可扩展性。",
    "tldr": "本文提出了一种新的、架构不可知的反馈对齐工作理论，通过将目标信息嵌入到神经网络中学习有效的表征，而不是像BP一样用同样的参数来近似梯度。并基于这一理论设计了三种实现FA的方法。",
    "en_tdlr": "This paper proposes a novel, architecture-agnostic theory of Feedback Alignment (FA) through the lens of information theory. It embeds target information into neural networks to learn effective representations, rather than approximating gradients calculated by BP with the same parameter. Based on this theory, three methods of implementing FA are designed and tested for their effectiveness and scalability."
}