{
    "title": "Soft Dynamic Time Warping for Multi-Pitch Estimation and Beyond. (arXiv:2304.05032v1 [cs.SD])",
    "abstract": "Many tasks in music information retrieval (MIR) involve weakly aligned data, where exact temporal correspondences are unknown. The connectionist temporal classification (CTC) loss is a standard technique to learn feature representations based on weakly aligned training data. However, CTC is limited to discrete-valued target sequences and can be difficult to extend to multi-label problems. In this article, we show how soft dynamic time warping (SoftDTW), a differentiable variant of classical DTW, can be used as an alternative to CTC. Using multi-pitch estimation as an example scenario, we show that SoftDTW yields results on par with a state-of-the-art multi-label extension of CTC. In addition to being more elegant in terms of its algorithmic formulation, SoftDTW naturally extends to real-valued target sequences.",
    "link": "http://arxiv.org/abs/2304.05032",
    "context": "Title: Soft Dynamic Time Warping for Multi-Pitch Estimation and Beyond. (arXiv:2304.05032v1 [cs.SD])\nAbstract: Many tasks in music information retrieval (MIR) involve weakly aligned data, where exact temporal correspondences are unknown. The connectionist temporal classification (CTC) loss is a standard technique to learn feature representations based on weakly aligned training data. However, CTC is limited to discrete-valued target sequences and can be difficult to extend to multi-label problems. In this article, we show how soft dynamic time warping (SoftDTW), a differentiable variant of classical DTW, can be used as an alternative to CTC. Using multi-pitch estimation as an example scenario, we show that SoftDTW yields results on par with a state-of-the-art multi-label extension of CTC. In addition to being more elegant in terms of its algorithmic formulation, SoftDTW naturally extends to real-valued target sequences.",
    "path": "papers/23/04/2304.05032.json",
    "total_tokens": 807,
    "translated_title": "多音高估计及其他任务的软动态时间规整方法",
    "translated_abstract": "音乐信息检索(MIR)中许多任务涉及到弱对齐数据，其中确切的时间对应关系未知。连续时间分类（CTC）损失是一种基于弱对齐训练数据学习特征表示的标准技术。然而，CTC仅限于离散值目标序列，并且在扩展到多标签问题时可能很难。在本文中，我们展示了如何使用软动态时间规整（SoftDTW），一种经典DTW的可微变体，作为CTC的替代方案。通过多音高估计作为示例场景，我们展示了SoftDTW与最先进的CTC多标签扩展获得了相当的结果。除了在算法上更加优雅，SoftDTW自然地扩展到实值目标序列。",
    "tldr": "本文介绍了软动态时间规整（SoftDTW）作为连续时间分类（CTC）的一种优秀替代方案，可以更有效地解决弱对齐数据的特征表示，特别适用于多标签问题和实值目标序列。",
    "en_tdlr": "This article introduces SoftDTW as an excellent alternative to CTC for feature representation of weakly aligned data in music information retrieval tasks, especially for multi-label problems and real-valued target sequences."
}