{
    "title": "Adjust factor with volatility model using MAXFLAT low-pass filter and construct portfolio in China A share market. (arXiv:2304.04676v1 [q-fin.RM])",
    "abstract": "In the field of quantitative finance, volatility models, such as ARCH, GARCH, FIGARCH, SV, EWMA, play the key role in risk and portfolio management. Meanwhile, factor investing is more and more famous since mid of 20 century. CAPM, Fama French three factor model, Fama French five-factor model, MSCI Barra factor model are mentioned and developed during this period. In this paper, we will show why we need adjust group of factors by our MAXFLAT low-pass volatility model. All of our experiments are under China's CSI 300 and CSI 500 universe which represent China's large cap stocks and mid-small cap stocks. Our result shows adjust factors by MAXFLAT volatility model have better performance in both large cap and small cap universe than original factors or other risk adjust factors in China A share. Also the portfolio constructed by MAXFLAT risk adjust factors have continuous excess return and lower beta compare with benchmark index.",
    "link": "http://arxiv.org/abs/2304.04676",
    "context": "Title: Adjust factor with volatility model using MAXFLAT low-pass filter and construct portfolio in China A share market. (arXiv:2304.04676v1 [q-fin.RM])\nAbstract: In the field of quantitative finance, volatility models, such as ARCH, GARCH, FIGARCH, SV, EWMA, play the key role in risk and portfolio management. Meanwhile, factor investing is more and more famous since mid of 20 century. CAPM, Fama French three factor model, Fama French five-factor model, MSCI Barra factor model are mentioned and developed during this period. In this paper, we will show why we need adjust group of factors by our MAXFLAT low-pass volatility model. All of our experiments are under China's CSI 300 and CSI 500 universe which represent China's large cap stocks and mid-small cap stocks. Our result shows adjust factors by MAXFLAT volatility model have better performance in both large cap and small cap universe than original factors or other risk adjust factors in China A share. Also the portfolio constructed by MAXFLAT risk adjust factors have continuous excess return and lower beta compare with benchmark index.",
    "path": "papers/23/04/2304.04676.json",
    "total_tokens": 943,
    "translated_title": "使用MAXFLAT低通滤波器基于波动率模型调整因子并在中国A股市场构建投资组合",
    "translated_abstract": "在量化金融领域，波动率模型（如ARCH、GARCH、FIGARCH、SV、EWMA等）在风险和投资组合管理中扮演着关键角色。与此同时，自20世纪中期起，因子投资越来越受到关注和发展。CAPM、Fama French三因子模型、Fama French五因子模型、MSCI Barra因子模型等都在这一期间提出和发展。本文将展示为什么我们需要通过我们的MAXFLAT低通波动率模型调整因子组。我们的所有实验都是在中国的CSI 300和CSI 500股票池下进行的，这代表了中国的大型股票和中小型股票。我们的结果表明，通过MAXFLAT波动率模型调整因子在中国A股市场的大盘和小盘股中均表现出更好的业绩。此外，由MAXFLAT风险调整因子构建的投资组合在超额回报方面具有连续性，与基准指数相比具有更低的贝塔值。",
    "tldr": "本研究基于MAXFLAT低通波动率模型调整因子，并在中国A股市场构建投资组合，在大盘和小盘股中均表现优异，具有连续性超额回报和低贝塔值。",
    "en_tdlr": "This study adjusts factors based on the MAXFLAT low-pass volatility model and constructs a portfolio in the China A-share market, showing superior performance in both large and small cap stocks, with continuous excess returns and low beta values compared to benchmark indexes."
}