{
    "title": "Learning battery model parameter dynamics from data with recursive Gaussian process regression. (arXiv:2304.13666v1 [eess.SY])",
    "abstract": "Estimating state of health is a critical function of a battery management system but remains challenging due to the variability of operating conditions and usage requirements of real applications. As a result, techniques based on fitting equivalent circuit models may exhibit inaccuracy at extremes of performance and over long-term ageing, or instability of parameter estimates. Pure data-driven techniques, on the other hand, suffer from lack of generality beyond their training dataset. In this paper, we propose a hybrid approach combining data- and model-driven techniques for battery health estimation. Specifically, we demonstrate a Bayesian data-driven method, Gaussian process regression, to estimate model parameters as functions of states, operating conditions, and lifetime. Computational efficiency is ensured through a recursive approach yielding a unified joint state-parameter estimator that learns parameter dynamics from data and is robust to gaps and varying operating conditions. ",
    "link": "http://arxiv.org/abs/2304.13666",
    "context": "Title: Learning battery model parameter dynamics from data with recursive Gaussian process regression. (arXiv:2304.13666v1 [eess.SY])\nAbstract: Estimating state of health is a critical function of a battery management system but remains challenging due to the variability of operating conditions and usage requirements of real applications. As a result, techniques based on fitting equivalent circuit models may exhibit inaccuracy at extremes of performance and over long-term ageing, or instability of parameter estimates. Pure data-driven techniques, on the other hand, suffer from lack of generality beyond their training dataset. In this paper, we propose a hybrid approach combining data- and model-driven techniques for battery health estimation. Specifically, we demonstrate a Bayesian data-driven method, Gaussian process regression, to estimate model parameters as functions of states, operating conditions, and lifetime. Computational efficiency is ensured through a recursive approach yielding a unified joint state-parameter estimator that learns parameter dynamics from data and is robust to gaps and varying operating conditions. ",
    "path": "papers/23/04/2304.13666.json",
    "total_tokens": 868,
    "translated_title": "从数据学习电池模型参数动态的递归高斯过程回归",
    "translated_abstract": "电池管理系统中估计健康状态是一个关键的功能，但由于实际应用的操作条件和使用要求的变化性，仍然具有挑战性。因此，基于等效电路模型的技术在性能极端和长期老化时可能出现不准确性或参数估计不稳定。另一方面，完全数据驱动的技术受限于其训练数据集之外的泛化性。本文提出了一种结合数据和模型驱动技术的混合方法来估计电池健康状况。具体而言，我们演示了一种贝叶斯数据驱动方法，高斯过程回归，将模型参数估计为状态、操作条件和寿命的函数。通过一种递归方法确保计算效率，得到一个统一的联合状态-参数估计器，从数据中学习参数动态，并且对间隙和变化的操作条件具有鲁棒性。",
    "tldr": "本文提出了一种结合数据和模型驱动技术的混合方法来估计电池健康状况。通过递归高斯过程回归学习参数动态，并且对间隙和变化的操作条件具有鲁棒性。",
    "en_tdlr": "This paper proposes a hybrid approach combining data- and model-driven techniques for battery health estimation. The parameter dynamics are learned from data using recursive Gaussian process regression, which ensures robustness to gaps and varying operating conditions."
}