{
    "title": "How Well Does the Metropolis Algorithm Cope With Local Optima?. (arXiv:2304.10848v1 [cs.NE])",
    "abstract": "The Metropolis algorithm (MA) is a classic stochastic local search heuristic. It avoids getting stuck in local optima by occasionally accepting inferior solutions. To better and in a rigorous manner understand this ability, we conduct a mathematical runtime analysis of the MA on the CLIFF benchmark. Apart from one local optimum, cliff functions are monotonically increasing towards the global optimum. Consequently, to optimize a cliff function, the MA only once needs to accept an inferior solution. Despite seemingly being an ideal benchmark for the MA to profit from its main working principle, our mathematical runtime analysis shows that this hope does not come true. Even with the optimal temperature (the only parameter of the MA), the MA optimizes most cliff functions less efficiently than simple elitist evolutionary algorithms (EAs), which can only leave the local optimum by generating a superior solution possibly far away. This result suggests that our understanding of why the MA is ",
    "link": "http://arxiv.org/abs/2304.10848",
    "context": "Title: How Well Does the Metropolis Algorithm Cope With Local Optima?. (arXiv:2304.10848v1 [cs.NE])\nAbstract: The Metropolis algorithm (MA) is a classic stochastic local search heuristic. It avoids getting stuck in local optima by occasionally accepting inferior solutions. To better and in a rigorous manner understand this ability, we conduct a mathematical runtime analysis of the MA on the CLIFF benchmark. Apart from one local optimum, cliff functions are monotonically increasing towards the global optimum. Consequently, to optimize a cliff function, the MA only once needs to accept an inferior solution. Despite seemingly being an ideal benchmark for the MA to profit from its main working principle, our mathematical runtime analysis shows that this hope does not come true. Even with the optimal temperature (the only parameter of the MA), the MA optimizes most cliff functions less efficiently than simple elitist evolutionary algorithms (EAs), which can only leave the local optimum by generating a superior solution possibly far away. This result suggests that our understanding of why the MA is ",
    "path": "papers/23/04/2304.10848.json",
    "total_tokens": 822,
    "translated_title": "Metropolis算法在处理局部最优时的效果如何？",
    "translated_abstract": "Metropolis算法（MA）是一种经典的随机局部搜索启发式算法。它通过偶尔接受次优解避免陷入局部最优。为了更好地并以严格的方式理解这种能力，我们对CLIFF基准测试中的MA进行了数学运行时间分析。除了一个局部最优解外，cliff函数向全局最优解单调递增。因此，为了优化cliff函数，MA只需要一次接受一个劣质解。尽管看起来这是MA从其主要工作原理中获利的理想基准测试，但我们的数学运行时间分析表明这一希望并没有实现。即使在最优温度下（MA的唯一参数），MA优化大多数cliff函数的效率也不如简单的精英进化算法（EAs），后者只能通过生成可能相距很远的优秀解来离开局部最优解。这个结果表明，我们对MA为什么有效的理解需要进一步完善。",
    "tldr": "Metropolis算法的局部搜索策略并不总是优于进化算法，还需要进一步改进和完善。"
}