{
    "title": "A new transformation for embedded convolutional neural network approach toward real-time servo motor overload fault-detection. (arXiv:2304.04005v1 [cs.LG])",
    "abstract": "Overloading in DC servo motors is a major concern in industries, as many companies face the problem of finding expert operators, and also human monitoring may not be an effective solution. Therefore, this paper proposed an embedded Artificial intelligence (AI) approach using a Convolutional Neural Network (CNN) using a new transformation to extract faults from real-time input signals without human interference. Our main purpose is to extract as many as possible features from the input signal to achieve a relaxed dataset that results in an effective but compact network to provide real-time fault detection even in a low-memory microcontroller. Besides, fault detection method a synchronous dual-motor system is also proposed to take action in faulty events. To fulfill this intention, a one-dimensional input signal from the output current of each DC servo motor is monitored and transformed into a 3d stack of data and then the CNN is implemented into the processor to detect any fault corresp",
    "link": "http://arxiv.org/abs/2304.04005",
    "context": "Title: A new transformation for embedded convolutional neural network approach toward real-time servo motor overload fault-detection. (arXiv:2304.04005v1 [cs.LG])\nAbstract: Overloading in DC servo motors is a major concern in industries, as many companies face the problem of finding expert operators, and also human monitoring may not be an effective solution. Therefore, this paper proposed an embedded Artificial intelligence (AI) approach using a Convolutional Neural Network (CNN) using a new transformation to extract faults from real-time input signals without human interference. Our main purpose is to extract as many as possible features from the input signal to achieve a relaxed dataset that results in an effective but compact network to provide real-time fault detection even in a low-memory microcontroller. Besides, fault detection method a synchronous dual-motor system is also proposed to take action in faulty events. To fulfill this intention, a one-dimensional input signal from the output current of each DC servo motor is monitored and transformed into a 3d stack of data and then the CNN is implemented into the processor to detect any fault corresp",
    "path": "papers/23/04/2304.04005.json",
    "total_tokens": 948,
    "translated_title": "一种用于实时伺服电机过载故障检测的嵌入式卷积神经网络方法的新转换",
    "translated_abstract": "直流伺服电机的超载是工业中的一个主要问题，许多公司面临着找到专业操作员的问题，而人工监测可能不是一个有效的解决方案。因此，本文提出了一种采用新的转换的嵌入式人工智能（AI）方法，利用卷积神经网络（CNN）从实时输入信号中提取故障，而无需人为干预。我们的主要目的是从输入信号中提取尽可能多的特征，以实现一个放松的数据集，从而得到一个有效但紧凑的网络，提供实时故障检测，甚至在低内存微控制器中也可以实现。此外，还提出了一种故障检测方法，即同步双电机系统，以在故障事件中采取行动。为了实现这个目的，对每个直流伺服电机的输出电流进行一维输入信号的监测和转换成为一个3D数据堆栈，然后将CNN实施到处理器中以检测与输入信号相对应的任何故障。",
    "tldr": "本论文提出了一种新的嵌入式卷积神经网络方法，用于实时检测直流伺服电机的过载故障，该方法可以提取尽可能多的特征并在低内存微控制器中实现有效的检测。",
    "en_tdlr": "This paper proposes a new embedded Convolutional Neural Network approach for real-time detection of overload faults in DC servo motors, which can extract as many features as possible and achieve effective detection in low-memory microcontrollers."
}