{
    "title": "Model-Agnostic Decentralized Collaborative Learning for On-Device POI Recommendation. (arXiv:2304.03947v1 [cs.IR])",
    "abstract": "As an indispensable personalized service in Location-based Social Networks (LBSNs), the next Point-of-Interest (POI) recommendation aims to help people discover attractive and interesting places. Currently, most POI recommenders are based on the conventional centralized paradigm that heavily relies on the cloud to train the recommendation models with large volumes of collected users' sensitive check-in data. Although a few recent works have explored on-device frameworks for resilient and privacy-preserving POI recommendations, they invariably hold the assumption of model homogeneity for parameters/gradients aggregation and collaboration. However, users' mobile devices in the real world have various hardware configurations (e.g., compute resources), leading to heterogeneous on-device models with different architectures and sizes. In light of this, We propose a novel on-device POI recommendation framework, namely Model-Agnostic Collaborative learning for on-device POI recommendation (MAC",
    "link": "http://arxiv.org/abs/2304.03947",
    "context": "Title: Model-Agnostic Decentralized Collaborative Learning for On-Device POI Recommendation. (arXiv:2304.03947v1 [cs.IR])\nAbstract: As an indispensable personalized service in Location-based Social Networks (LBSNs), the next Point-of-Interest (POI) recommendation aims to help people discover attractive and interesting places. Currently, most POI recommenders are based on the conventional centralized paradigm that heavily relies on the cloud to train the recommendation models with large volumes of collected users' sensitive check-in data. Although a few recent works have explored on-device frameworks for resilient and privacy-preserving POI recommendations, they invariably hold the assumption of model homogeneity for parameters/gradients aggregation and collaboration. However, users' mobile devices in the real world have various hardware configurations (e.g., compute resources), leading to heterogeneous on-device models with different architectures and sizes. In light of this, We propose a novel on-device POI recommendation framework, namely Model-Agnostic Collaborative learning for on-device POI recommendation (MAC",
    "path": "papers/23/04/2304.03947.json",
    "total_tokens": 1256,
    "translated_title": "基于模型无关的去中心化协作学习的设备端POI推荐",
    "translated_abstract": "作为基于位置的社交网络中不可或缺的个性化服务，下一个兴趣点（POI）的推荐旨在帮助人们发现有吸引力和有趣的地方。目前，大多数POI推荐系统基于传统的集中式范式，严重依赖云端使用大量收集的用户敏感签到数据来训练推荐模型。尽管最近一些工作探索了设备上的弹性和隐私保护POI推荐框架，但它们无一例外地假设了模型在参数/梯度聚合和协作方面的同质性。然而，实际情况下用户的移动设备具有各种不同的硬件配置（例如计算资源），导致不同架构和大小的异构设备端模型。基于此，我们提出了一种新的设备端POI推荐框架，即基于模型无关的去中心化协作学习的设备端POI推荐（MACDL-POI），通过共同设计两个轻量级算法实现了设备端协作学习，即模型无关去中心化协作优化和结构感知协同剪枝。通过集成这两个算法，MACDL-POI能够以去中心化的方式高效地训练设备端的个性化POI推荐器，而不泄露用户的敏感数据并保持推荐质量。对真实世界LBSN数据集的广泛实验表明，我们提出的MACDL-POI在推荐精度和隐私保护方面优于现有的集中式和去中心化方法。",
    "tldr": "提出了一种基于设备端的、模型无关的去中心化协作学习的POI推荐框架，通过结构感知协同剪枝和模型无关去中心化协同优化两种轻量级算法，保证了在去中心化环境中高效地训练个性化POI推荐器，同时不泄露用户的敏感数据并保持推荐质量。",
    "en_tdlr": "This paper proposes a device-based, model-agnostic decentralized collaborative learning framework for Point-of-Interest (POI) recommendation, which efficiently trains personalized POI recommenders in a decentralized manner through two lightweight algorithms, i.e., architecture-aware collaborative pruning and model-agnostic decentralized collaborative optimization, while ensuring privacy protection and recommendation quality."
}