{
    "title": "Equivalence of inequality indices: Three dimensions of impact revisited. (arXiv:2304.07479v1 [physics.soc-ph])",
    "abstract": "Inequality is an inherent part of our lives: we see it in the distribution of incomes, talents, resources, and citations, amongst many others. Its intensity varies across different environments: from relatively evenly distributed ones, to where a small group of stakeholders controls the majority of the available resources. We would like to understand why inequality naturally arises as a consequence of the natural evolution of any system. Studying simple mathematical models governed by intuitive assumptions can bring many insights into this problem. In particular, we recently observed (Siudem et al., PNAS 117:13896-13900, 2020) that impact distribution might be modelled accurately by a time-dependent agent-based model involving a mixture of the rich-get-richer and sheer chance components. Here we point out its relationship to an iterative process that generates rank distributions of any length and a predefined level of inequality, as measured by the Gini index.  Many indices quantifying",
    "link": "http://arxiv.org/abs/2304.07479",
    "context": "Title: Equivalence of inequality indices: Three dimensions of impact revisited. (arXiv:2304.07479v1 [physics.soc-ph])\nAbstract: Inequality is an inherent part of our lives: we see it in the distribution of incomes, talents, resources, and citations, amongst many others. Its intensity varies across different environments: from relatively evenly distributed ones, to where a small group of stakeholders controls the majority of the available resources. We would like to understand why inequality naturally arises as a consequence of the natural evolution of any system. Studying simple mathematical models governed by intuitive assumptions can bring many insights into this problem. In particular, we recently observed (Siudem et al., PNAS 117:13896-13900, 2020) that impact distribution might be modelled accurately by a time-dependent agent-based model involving a mixture of the rich-get-richer and sheer chance components. Here we point out its relationship to an iterative process that generates rank distributions of any length and a predefined level of inequality, as measured by the Gini index.  Many indices quantifying",
    "path": "papers/23/04/2304.07479.json",
    "total_tokens": 898,
    "translated_title": "不等式指数的等效性：重审三维影响",
    "translated_abstract": "不平等是我们生活中固有的一部分：我们可以在收入、才能、资源和引用等方面看到它。不平等的强度因不同的环境而异：从相对均匀分布的环境，到少数利益相关者控制大部分可用资源的环境。我们想了解为什么不平等会自然地成为任何系统发展的结果。研究受直觉假设支配的简单数学模型可以为解决这个问题带来很多见解。特别是，我们最近观察到（Siudem et al.，PNAS 117:13896-13900, 2020），冲击分布可以通过涉及富者越富和纯粹偶然成分的时间依赖性代理模型来准确建模。在这里，我们指出这种模型与生成任意长度和Gini指数预定义的不平等水平的等级分布的迭代过程之间的关系。许多指数 quantifying",
    "tldr": "本文探讨了不平等是自然演化的结果和通过数学模型和迭代过程来量化不平等的方法。其中，冲击分布可以通过时间依赖性代理模型来准确建模并结合富者越富和纯粹偶然成分。",
    "en_tdlr": "This article explores the natural evolution of inequality and the methods for quantifying it through mathematical models and iterative processes. Among them, the impact distribution can be accurately modeled by a time-dependent agent-based model combined with the rich-get-richer and sheer chance components."
}