{
    "title": "End-to-End Models for Chemical-Protein Interaction Extraction: Better Tokenization and Span-Based Pipeline Strategies. (arXiv:2304.01344v1 [cs.CL])",
    "abstract": "End-to-end relation extraction (E2ERE) is an important task in information extraction, more so for biomedicine as scientific literature continues to grow exponentially. E2ERE typically involves identifying entities (or named entity recognition (NER)) and associated relations, while most RE tasks simply assume that the entities are provided upfront and end up performing relation classification. E2ERE is inherently more difficult than RE alone given the potential snowball effect of errors from NER leading to more errors in RE. A complex dataset in biomedical E2ERE is the ChemProt dataset (BioCreative VI, 2017) that identifies relations between chemical compounds and genes/proteins in scientific literature. ChemProt is included in all recent biomedical natural language processing benchmarks including BLUE, BLURB, and BigBio. However, its treatment in these benchmarks and in other separate efforts is typically not end-to-end, with few exceptions. In this effort, we employ a span-based pipe",
    "link": "http://arxiv.org/abs/2304.01344",
    "context": "Title: End-to-End Models for Chemical-Protein Interaction Extraction: Better Tokenization and Span-Based Pipeline Strategies. (arXiv:2304.01344v1 [cs.CL])\nAbstract: End-to-end relation extraction (E2ERE) is an important task in information extraction, more so for biomedicine as scientific literature continues to grow exponentially. E2ERE typically involves identifying entities (or named entity recognition (NER)) and associated relations, while most RE tasks simply assume that the entities are provided upfront and end up performing relation classification. E2ERE is inherently more difficult than RE alone given the potential snowball effect of errors from NER leading to more errors in RE. A complex dataset in biomedical E2ERE is the ChemProt dataset (BioCreative VI, 2017) that identifies relations between chemical compounds and genes/proteins in scientific literature. ChemProt is included in all recent biomedical natural language processing benchmarks including BLUE, BLURB, and BigBio. However, its treatment in these benchmarks and in other separate efforts is typically not end-to-end, with few exceptions. In this effort, we employ a span-based pipe",
    "path": "papers/23/04/2304.01344.json",
    "total_tokens": 1028,
    "translated_title": "化学物质-蛋白质相互作用提取的端到端模型：更好的标记化和基于跨度的管道策略",
    "translated_abstract": "端到端关系提取(E2ERE)是信息提取中的重要任务，在生物医学领域尤其如此，因为科学文献数量继续呈指数级增长。E2ERE通常涉及识别实体(或命名实体识别(NER))和关联关系，而大多数E2ERE任务只是假定实体已经提供，并最终执行关系分类。由于NER中的错误可能导致RE中的更多错误，E2ERE本质上比仅RE更难。生物医学E2ERE中的一个复杂数据集是ChemProt数据集(BioCreative VI,2017)，该数据集在科学文献中识别化学化合物和基因/蛋白质之间的关系。ChemProt被包括在所有最新的生物医学自然语言处理基准测试中，包括BLUE、BLURB和BigBio。然而，这些基准测试和其他单独的努力通常没有端到端的处理ChemProt。在这个工作中，我们采用基于跨度的管道策略和更好的标记化方法来进行E2ERE，为ChemProt数据集提供更好的性能。我们的提议模型在多个指标上优于现有最先进模型，证明了我们方法的有效性。",
    "tldr": "本论文提出了一种基于跨度的管道策略和更好的标记化方法来提高化学物质-蛋白质相互作用提取的性能，并在多个指标上优于现有最先进模型。",
    "en_tdlr": "This paper proposes a span-based pipeline strategy and a better tokenization approach to improve the performance of chemical-protein interaction extraction, and demonstrates better results than existing state-of-the-art models on multiple metrics."
}