{
    "title": "The Impact of Industrial Zone:Evidence from China's National High-tech Zone Policy. (arXiv:2304.09775v1 [econ.EM])",
    "abstract": "Based on the statistical yearbook data and related patent data of 287 cities in China from 2000 to 2020, this study regards the policy of establishing the national high-tech zones as a quasi-natural experiment. Using this experiment, this study firstly estimated the treatment effect of the policy and checked the robustness of the estimation. Then the study examined the heterogeneity in different geographic demarcation of China and in different city level of China. After that, this study explored the possible influence mechanism of the policy. It shows that the possible mechanism of the policy is financial support, industrial agglomeration of secondary industry and the spillovers. In the end, this study examined the spillovers deeply and showed the distribution of spillover effect.",
    "link": "http://arxiv.org/abs/2304.09775",
    "context": "Title: The Impact of Industrial Zone:Evidence from China's National High-tech Zone Policy. (arXiv:2304.09775v1 [econ.EM])\nAbstract: Based on the statistical yearbook data and related patent data of 287 cities in China from 2000 to 2020, this study regards the policy of establishing the national high-tech zones as a quasi-natural experiment. Using this experiment, this study firstly estimated the treatment effect of the policy and checked the robustness of the estimation. Then the study examined the heterogeneity in different geographic demarcation of China and in different city level of China. After that, this study explored the possible influence mechanism of the policy. It shows that the possible mechanism of the policy is financial support, industrial agglomeration of secondary industry and the spillovers. In the end, this study examined the spillovers deeply and showed the distribution of spillover effect.",
    "path": "papers/23/04/2304.09775.json",
    "total_tokens": 809,
    "translated_title": "工业区对经济的影响：基于中国国家高新区政策的证据",
    "translated_abstract": "本研究基于中国287个城市从2000年至2020年的统计年鉴数据和相关专利数据，将建立国家高新区政策视为准自然实验。首先通过该实验估计了政策的治疗效应并检验了估计的稳健性。然后本研究考察了中国不同地理划分和不同城市层级之间的异质性。之后，本研究探讨了该政策的可能影响机制，结果表明可能机制有财务支持、二级产业的产业集聚以及溢出效应。最后，研究对溢出效应进行了深入探究，并展示了溢出效应的分布情况。",
    "tldr": "本研究基于中国国家高新区政策视为准自然实验，探究了该政策对经济的影响机制，包括财务支持、产业集聚和溢出效应，并展示了溢出效应的分布情况。",
    "en_tdlr": "This study explores the impact mechanism of China's national high-tech zone policy on the economy, including financial support, industrial agglomeration, and spillover effects, and shows the distribution of spillover effects based on the policy regarded as a quasi-natural experiment."
}