{
    "title": "AIRIVA: A Deep Generative Model of Adaptive Immune Repertoires. (arXiv:2304.13737v1 [q-bio.QM])",
    "abstract": "Recent advances in immunomics have shown that T-cell receptor (TCR) signatures can accurately predict active or recent infection by leveraging the high specificity of TCR binding to disease antigens. However, the extreme diversity of the adaptive immune repertoire presents challenges in reliably identifying disease-specific TCRs. Population genetics and sequencing depth can also have strong systematic effects on repertoires, which requires careful consideration when developing diagnostic models. We present an Adaptive Immune Repertoire-Invariant Variational Autoencoder (AIRIVA), a generative model that learns a low-dimensional, interpretable, and compositional representation of TCR repertoires to disentangle such systematic effects in repertoires. We apply AIRIVA to two infectious disease case-studies: COVID-19 (natural infection and vaccination) and the Herpes Simplex Virus (HSV-1 and HSV-2), and empirically show that we can disentangle the individual disease signals. We further demon",
    "link": "http://arxiv.org/abs/2304.13737",
    "context": "Title: AIRIVA: A Deep Generative Model of Adaptive Immune Repertoires. (arXiv:2304.13737v1 [q-bio.QM])\nAbstract: Recent advances in immunomics have shown that T-cell receptor (TCR) signatures can accurately predict active or recent infection by leveraging the high specificity of TCR binding to disease antigens. However, the extreme diversity of the adaptive immune repertoire presents challenges in reliably identifying disease-specific TCRs. Population genetics and sequencing depth can also have strong systematic effects on repertoires, which requires careful consideration when developing diagnostic models. We present an Adaptive Immune Repertoire-Invariant Variational Autoencoder (AIRIVA), a generative model that learns a low-dimensional, interpretable, and compositional representation of TCR repertoires to disentangle such systematic effects in repertoires. We apply AIRIVA to two infectious disease case-studies: COVID-19 (natural infection and vaccination) and the Herpes Simplex Virus (HSV-1 and HSV-2), and empirically show that we can disentangle the individual disease signals. We further demon",
    "path": "papers/23/04/2304.13737.json",
    "total_tokens": 1071,
    "translated_title": "AIRIVA：自适应免疫库存的深度生成模型",
    "translated_abstract": "免疫基因组学的最新进展表明，T细胞受体（TCR）标记可以利用TCR与疾病抗原结合的高特异性准确预测活动或最近的感染。然而，适应性免疫库存的极端多样性在可靠地识别疾病特异性TCR方面存在着挑战。种群遗传学和测序深度还可以对库存产生强烈的系统影响，在开发诊断模型时需要进行仔细考虑。本文提出了一种自适应免疫库显不变变分自编码器（AIRIVA），它是一种生成模型，学习TCR库存的低维，可解释和组成性表示，以解开这种库存中的系统效应。我们将AIRIVA应用于两个传染病案例研究：COVID-19（自然感染和接种）和单纯疱疹病毒（HSV-1和HSV-2），并经验证明我们可以解开个体疾病的信号。我们进一步证明，通过将其应用于黑色素瘤数据集，可以使用AIRIVA来识别与癌症相关的TCR。我们的结果表明，AIRIVA是理解传染病免疫应答以及开发癌症免疫疗法生物标志物的有前景的工具。",
    "tldr": "AIRIVA是一种生成模型，学习TCR库存的低维、可解释和组成性表示，以解开系统效应，能够识别与不同传染病和癌症相关的TCR。",
    "en_tdlr": "AIRIVA is a generative model that learns a low-dimensional, interpretable, and compositional representation of TCR repertoires to disentangle systematic effects, and is capable of identifying TCRs associated with various infectious diseases and cancers."
}