{
    "title": "The Study of Highway for Lifelong Multi-Agent Path Finding. (arXiv:2304.04217v1 [cs.AI])",
    "abstract": "In modern fulfillment warehouses, agents traverse the map to complete endless tasks that arrive on the fly, which is formulated as a lifelong Multi-Agent Path Finding (lifelong MAPF) problem. The goal of tackling this challenging problem is to find the path for each agent in a finite runtime while maximizing the throughput. However, existing methods encounter exponential growth of runtime and undesirable phenomena of deadlocks and rerouting as the map size or agent density grows. To address these challenges in lifelong MAPF, we explore the idea of highways mainly studied for one-shot MAPF (i.e., finding paths at once beforehand), which reduces the complexity of the problem by encouraging agents to move in the same direction. We utilize two methods to incorporate the highway idea into the lifelong MAPF framework and discuss the properties that minimize the existing problems of deadlocks and rerouting. The experimental results demonstrate that the runtime is considerably reduced and the ",
    "link": "http://arxiv.org/abs/2304.04217",
    "context": "Title: The Study of Highway for Lifelong Multi-Agent Path Finding. (arXiv:2304.04217v1 [cs.AI])\nAbstract: In modern fulfillment warehouses, agents traverse the map to complete endless tasks that arrive on the fly, which is formulated as a lifelong Multi-Agent Path Finding (lifelong MAPF) problem. The goal of tackling this challenging problem is to find the path for each agent in a finite runtime while maximizing the throughput. However, existing methods encounter exponential growth of runtime and undesirable phenomena of deadlocks and rerouting as the map size or agent density grows. To address these challenges in lifelong MAPF, we explore the idea of highways mainly studied for one-shot MAPF (i.e., finding paths at once beforehand), which reduces the complexity of the problem by encouraging agents to move in the same direction. We utilize two methods to incorporate the highway idea into the lifelong MAPF framework and discuss the properties that minimize the existing problems of deadlocks and rerouting. The experimental results demonstrate that the runtime is considerably reduced and the ",
    "path": "papers/23/04/2304.04217.json",
    "total_tokens": 973,
    "translated_title": "面向终身多智能体路径规划的高速公路研究",
    "translated_abstract": "在现代的配送仓库中，智能体在地图上穿行完成源源不断的任务，这被定义为终身多智能体路径规划问题。解决这一挑战性问题的目标是在有限的时间内找到每个智能体的路径，同时最大化吞吐量。然而，现有的方法在地图大小或智能体密度增长时会遇到运行时间的指数增长和死锁以及重新路由等不良现象。为了解决面向终身多智能体路径规划的这些挑战，我们探索了高速公路的概念，该概念主要用于一次性路径规划，通过鼓励智能体朝着同一方向移动，减少了问题的复杂度。我们使用两种方法将高速公路思想纳入终身多智能体路径规划框架，并讨论了最小化死锁和重新路由问题的特性。实验结果表明，运行时间显著缩短，吞吐量得到提高。",
    "tldr": "本研究旨在解决终身多智能体路径规划问题中出现的运行时间指数增长和死锁、重新路由等不良现象。我们将高速公路的概念纳入终身多智能体路径规划框架中，并通过两种方法实现，成功减少了问题的复杂度，缩短了运行时间并提高了吞吐量。"
}