{
    "title": "Physics-aware Roughness Optimization for Diffractive Optical Neural Networks. (arXiv:2304.01500v1 [cs.LG])",
    "abstract": "As a representative next-generation device/circuit technology beyond CMOS, diffractive optical neural networks (DONNs) have shown promising advantages over conventional deep neural networks due to extreme fast computation speed (light speed) and low energy consumption. However, there is a mismatch, i.e., significant prediction accuracy loss, between the DONN numerical modelling and physical optical device deployment, because of the interpixel interaction within the diffractive layers. In this work, we propose a physics-aware diffractive optical neural network training framework to reduce the performance difference between numerical modeling and practical deployment. Specifically, we propose the roughness modeling regularization in the training process and integrate the physics-aware sparsification method to introduce sparsity to the phase masks to reduce sharp phase changes between adjacent pixels in diffractive layers. We further develop $2\\pi$ periodic optimization to reduce the roug",
    "link": "http://arxiv.org/abs/2304.01500",
    "context": "Title: Physics-aware Roughness Optimization for Diffractive Optical Neural Networks. (arXiv:2304.01500v1 [cs.LG])\nAbstract: As a representative next-generation device/circuit technology beyond CMOS, diffractive optical neural networks (DONNs) have shown promising advantages over conventional deep neural networks due to extreme fast computation speed (light speed) and low energy consumption. However, there is a mismatch, i.e., significant prediction accuracy loss, between the DONN numerical modelling and physical optical device deployment, because of the interpixel interaction within the diffractive layers. In this work, we propose a physics-aware diffractive optical neural network training framework to reduce the performance difference between numerical modeling and practical deployment. Specifically, we propose the roughness modeling regularization in the training process and integrate the physics-aware sparsification method to introduce sparsity to the phase masks to reduce sharp phase changes between adjacent pixels in diffractive layers. We further develop $2\\pi$ periodic optimization to reduce the roug",
    "path": "papers/23/04/2304.01500.json",
    "total_tokens": 1021,
    "translated_title": "物理感知的粗糙度优化用于衍射光学神经网络",
    "translated_abstract": "衍射光学神经网络（DONN）作为一种下一代设备/电路技术已显示出比传统深度神经网络更快的计算速度（光速）和低能耗的优势。然而，由于衍射层内的像素间相互作用，在DONN的数值建模和物理光学器件部署之间存在显著的预测准确性损失。本文提出了一种物理感知的衍射光学神经网络训练框架，以减少数值模拟和实际部署之间的性能差异。具体而言，我们在训练过程中提出了粗糙度建模正则化，并集成了物理感知的稀疏化方法，以引入稀疏性到相位掩模中，以减少衍射层中相邻像素之间的尖锐相位变化。我们进一步开发了$2\\pi$周期性优化方法，以考虑物理衍射过程并降低相位掩膜的粗糙度。所提出的方法有效地提高了DONN的预测精度，并为DONN的实际部署提供了可行的解决方案。",
    "tldr": "本研究提出了一种物理感知的衍射光学神经网络训练框架，在训练过程中引入粗糙度建模正则化和物理感知的稀疏化方法，以提高DONN的预测精度并提供实际部署的可行解决方案。",
    "en_tdlr": "This paper proposes a physics-aware diffractive optical neural network training framework to reduce the performance difference between numerical modeling and practical deployment. The proposed method effectively improves the DONN's prediction accuracy and provides a feasible solution for the practical deployment of DONN."
}