{
    "title": "Machine learning for structure-property relationships: Scalability and limitations. (arXiv:2304.05502v1 [cond-mat.stat-mech])",
    "abstract": "We present a scalable machine learning (ML) framework for predicting intensive properties and particularly classifying phases of many-body systems. Scalability and transferability are central to the unprecedented computational efficiency of ML methods. In general, linear-scaling computation can be achieved through the divide and conquer approach, and the locality of physical properties is key to partitioning the system into sub-domains that can be solved separately. Based on the locality assumption, ML model is developed for the prediction of intensive properties of a finite-size block. Predictions of large-scale systems can then be obtained by averaging results of the ML model from randomly sampled blocks of the system. We show that the applicability of this approach depends on whether the block-size of the ML model is greater than the characteristic length scale of the system. In particular, in the case of phase identification across a critical point, the accuracy of the ML predictio",
    "link": "http://arxiv.org/abs/2304.05502",
    "context": "Title: Machine learning for structure-property relationships: Scalability and limitations. (arXiv:2304.05502v1 [cond-mat.stat-mech])\nAbstract: We present a scalable machine learning (ML) framework for predicting intensive properties and particularly classifying phases of many-body systems. Scalability and transferability are central to the unprecedented computational efficiency of ML methods. In general, linear-scaling computation can be achieved through the divide and conquer approach, and the locality of physical properties is key to partitioning the system into sub-domains that can be solved separately. Based on the locality assumption, ML model is developed for the prediction of intensive properties of a finite-size block. Predictions of large-scale systems can then be obtained by averaging results of the ML model from randomly sampled blocks of the system. We show that the applicability of this approach depends on whether the block-size of the ML model is greater than the characteristic length scale of the system. In particular, in the case of phase identification across a critical point, the accuracy of the ML predictio",
    "path": "papers/23/04/2304.05502.json",
    "total_tokens": 949,
    "translated_title": "用于结构-性质关系的机器学习：可扩展性和限制",
    "translated_abstract": "我们提出了一种可扩展的机器学习（ML）框架，用于预测多体系统的密集性质，特别是分类相。可扩展性和可转移性是ML方法无前例的计算效率的核心。一般来说，通过分而治之方法可以实现线性规模的计算，物理性质的局部性是将系统划分为可以分别解决的子域的关键。基于局部性假设，开发了ML模型，用于预测有限尺寸块的密集性质。可以通过对系统随机采样块的ML模型结果进行平均得出大规模系统的预测。我们表明，该方法的适用性取决于ML模型的块大小是否大于系统的特征长度尺度。特别是在跨越临界点的相位识别的情况下，ML预测的精度取决于块大小以及在临界点附近训练ML模型的块数。",
    "tldr": "该论文提出了一种可扩展的机器学习框架，通过分而治之方法实现线性规模计算，利用局部性假设将系统划分为可以分别解决的子域，从而用于预测多体系统的密集性质和分类相。模型适用性由块大小和在临界点附近训练ML模型的块数决定。",
    "en_tdlr": "The paper presents a scalable machine learning framework based on divide and conquer approach for predicting intensive properties and classifying phases of many-body systems. The framework uses locality assumption to partition the system into sub-domains and predict intensive properties of a finite-size block. The accuracy of the predictions depends on the block size and the number of blocks used in training the ML model."
}