{
    "title": "Concept-Monitor: Understanding DNN training through individual neurons. (arXiv:2304.13346v1 [cs.LG])",
    "abstract": "In this work, we propose a general framework called Concept-Monitor to help demystify the black-box DNN training processes automatically using a novel unified embedding space and concept diversity metric. Concept-Monitor enables human-interpretable visualization and indicators of the DNN training processes and facilitates transparency as well as deeper understanding on how DNNs develop along the during training. Inspired by these findings, we also propose a new training regularizer that incentivizes hidden neurons to learn diverse concepts, which we show to improve training performance. Finally, we apply Concept-Monitor to conduct several case studies on different training paradigms including adversarial training, fine-tuning and network pruning via the Lottery Ticket Hypothesis",
    "link": "http://arxiv.org/abs/2304.13346",
    "context": "Title: Concept-Monitor: Understanding DNN training through individual neurons. (arXiv:2304.13346v1 [cs.LG])\nAbstract: In this work, we propose a general framework called Concept-Monitor to help demystify the black-box DNN training processes automatically using a novel unified embedding space and concept diversity metric. Concept-Monitor enables human-interpretable visualization and indicators of the DNN training processes and facilitates transparency as well as deeper understanding on how DNNs develop along the during training. Inspired by these findings, we also propose a new training regularizer that incentivizes hidden neurons to learn diverse concepts, which we show to improve training performance. Finally, we apply Concept-Monitor to conduct several case studies on different training paradigms including adversarial training, fine-tuning and network pruning via the Lottery Ticket Hypothesis",
    "path": "papers/23/04/2304.13346.json",
    "total_tokens": 926,
    "translated_title": "Concept-Monitor: 通过个别神经元理解 DNN 训练",
    "translated_abstract": "在这项工作中，我们提出了一个称为 Concept-Monitor 的通用框架，使用新颖的统一嵌入空间和概念多样性度量来帮助自动化地解密黑匣子 DNN 训练过程。Concept-Monitor 可以呈现人类可解释的可视化和指标，促进透明度和深入了解 DNN 在训练期间如何发展。受这些发现启发，我们还提出了一种新的训练正则化器，激励隐藏神经元学习多样的概念，我们发现这种正则化可以提高训练性能。最后，我们运用 Concept-Monitor 来对不同训练范式进行多个案例研究，包括对抗性训练、微调和通过“中奖彩票假设”进行网络修剪。",
    "tldr": "通过 Concept-Monitor，我们提出了一种通用框架来自动解密黑匣子 DNN 训练过程，它可以帮助人们理解 DNN 在训练期间如何发展，同时我们提出了一种新的正则化器来激励隐藏神经元学习多样的概念，这可以提高训练性能。我们还运用 Concept-Monitor 对不同训练范式进行了多个案例研究，包括对抗性训练、微调和网络修剪。",
    "en_tdlr": "We propose a general framework called Concept-Monitor to help demystify the black-box DNN training processes automatically and enable human-interpretable visualization and indicators of the DNN training processes. We also propose a new training regularizer that incentivizes hidden neurons to learn diverse concepts, which improves training performance. Concept-Monitor is used in case studies on different training paradigms including adversarial training, fine-tuning, and network pruning via the Lottery Ticket Hypothesis."
}