{
    "title": "Origin Tracing and Detecting of LLMs. (arXiv:2304.14072v1 [cs.CL])",
    "abstract": "The extraordinary performance of large language models (LLMs) heightens the importance of detecting whether the context is generated by an AI system. More importantly, while more and more companies and institutions release their LLMs, the origin can be hard to trace. Since LLMs are heading towards the time of AGI, similar to the origin tracing in anthropology, it is of great importance to trace the origin of LLMs. In this paper, we first raise the concern of the origin tracing of LLMs and propose an effective method to trace and detect AI-generated contexts. We introduce a novel algorithm that leverages the contrastive features between LLMs and extracts model-wise features to trace the text origins. Our proposed method works under both white-box and black-box settings therefore can be widely generalized to detect various LLMs.(e.g. can be generalized to detect GPT-3 models without the GPT-3 models). Also, our proposed method requires only limited data compared with the supervised learn",
    "link": "http://arxiv.org/abs/2304.14072",
    "context": "Title: Origin Tracing and Detecting of LLMs. (arXiv:2304.14072v1 [cs.CL])\nAbstract: The extraordinary performance of large language models (LLMs) heightens the importance of detecting whether the context is generated by an AI system. More importantly, while more and more companies and institutions release their LLMs, the origin can be hard to trace. Since LLMs are heading towards the time of AGI, similar to the origin tracing in anthropology, it is of great importance to trace the origin of LLMs. In this paper, we first raise the concern of the origin tracing of LLMs and propose an effective method to trace and detect AI-generated contexts. We introduce a novel algorithm that leverages the contrastive features between LLMs and extracts model-wise features to trace the text origins. Our proposed method works under both white-box and black-box settings therefore can be widely generalized to detect various LLMs.(e.g. can be generalized to detect GPT-3 models without the GPT-3 models). Also, our proposed method requires only limited data compared with the supervised learn",
    "path": "papers/23/04/2304.14072.json",
    "total_tokens": 933,
    "translated_title": "LLM的来源跟踪和检测（arXiv:2304.14072v1 [cs.CL]）",
    "translated_abstract": "大型语言模型（LLMs）具有出色的性能，因此检测上下文是否由AI系统生成变得更为重要。更重要的是，随着越来越多的公司和机构发布自己的LLMs，其来源可能难以追踪。由于LLMs正在朝向AGI的时代前进，类似于人类学中的源追踪，追踪LLMs的来源非常重要。在本文中，我们首先提出了LLMs的来源追踪问题，并提出了一种有效的追踪和检测AI生成内容的方法。我们引入了一种新的算法，利用LLMs之间的对比特征并提取模型特征以追踪文本来源。我们提出的方法在白盒和黑盒设置下均可工作，因此可广泛推广到检测各种LLMs（例如，可以推广到不带GPT-3模型的GPT-3模型）。此外，我们提出的方法与监督学习相比仅需要有限的数据量。",
    "tldr": "本文提出了一种有效的方法来跟踪和检测语言模型（LLMs）生成的AI文本，使其来源可以被容易追踪。这种方法可以在各种LLMs上广泛推广，且仅需要有限的数据量。",
    "en_tdlr": "This paper proposes an effective method to trace and detect AI-generated contexts, making it easy to track the source of language models (LLMs). This method can be widely generalized to various LLMs with limited data, ensuring the traceability of LLMs' origin."
}