{
    "title": "Experimentation Platforms Meet Reinforcement Learning: Bayesian Sequential Decision-Making for Continuous Monitoring. (arXiv:2304.00420v1 [cs.LG])",
    "abstract": "With the growing needs of online A/B testing to support the innovation in industry, the opportunity cost of running an experiment becomes non-negligible. Therefore, there is an increasing demand for an efficient continuous monitoring service that allows early stopping when appropriate. Classic statistical methods focus on hypothesis testing and are mostly developed for traditional high-stake problems such as clinical trials, while experiments at online service companies typically have very different features and focuses. Motivated by the real needs, in this paper, we introduce a novel framework that we developed in Amazon to maximize customer experience and control opportunity cost. We formulate the problem as a Bayesian optimal sequential decision making problem that has a unified utility function. We discuss extensively practical design choices and considerations. We further introduce how to solve the optimal decision rule via Reinforcement Learning and scale the solution. We show th",
    "link": "http://arxiv.org/abs/2304.00420",
    "context": "Title: Experimentation Platforms Meet Reinforcement Learning: Bayesian Sequential Decision-Making for Continuous Monitoring. (arXiv:2304.00420v1 [cs.LG])\nAbstract: With the growing needs of online A/B testing to support the innovation in industry, the opportunity cost of running an experiment becomes non-negligible. Therefore, there is an increasing demand for an efficient continuous monitoring service that allows early stopping when appropriate. Classic statistical methods focus on hypothesis testing and are mostly developed for traditional high-stake problems such as clinical trials, while experiments at online service companies typically have very different features and focuses. Motivated by the real needs, in this paper, we introduce a novel framework that we developed in Amazon to maximize customer experience and control opportunity cost. We formulate the problem as a Bayesian optimal sequential decision making problem that has a unified utility function. We discuss extensively practical design choices and considerations. We further introduce how to solve the optimal decision rule via Reinforcement Learning and scale the solution. We show th",
    "path": "papers/23/04/2304.00420.json",
    "total_tokens": 895,
    "translated_title": "实验平台应用强化学习：贝叶斯序贯决策在连续监测中的应用",
    "translated_abstract": "随着在线A/B测试支持工业创新的需求增长，实验运行的机会成本变得不可忽略。因此，需要一种有效的连续监测服务，以在适当时候进行早期停止。经典的统计方法着重于假设检验，主要是针对传统的高风险问题，如临床试验，而在线服务公司的实验通常具有非常不同的特征和关注点。在实际需要的驱动下，本文介绍了亚马逊开发的一种新的框架，以最大限度地提高客户体验和控制机会成本。我们将问题制定为具有统一效用函数的贝叶斯最优序贯决策问题。我们广泛讨论了实际设计选择和考虑因素。我们进一步介绍了如何通过强化学习解决最优决策规则，并扩展了该解决方案。",
    "tldr": "本文介绍了一个新的框架，将实验监测问题制定为具有统一效用函数的贝叶斯序贯决策问题，并采用强化学习来解决最优决策规则。这一方法能够有效提高客户体验并控制机会成本。",
    "en_tdlr": "This paper presents a novel framework that formulates the experiment monitoring problem as a Bayesian optimal sequential decision-making problem with a unified utility function and uses reinforcement learning to solve the optimal decision rule. This approach can improve customer experience and control opportunity cost effectively."
}