{
    "title": "Icospherical Chemical Objects (ICOs) allow for chemical data augmentation and maintain rotational, translation and permutation invariance. (arXiv:2304.07558v1 [cs.LG])",
    "abstract": "Dataset augmentation is a common way to deal with small datasets; Chemistry datasets are often small. Spherical convolutional neural networks (SphNNs) and Icosahedral neural networks (IcoNNs) are a type of geometric machine learning algorithm that maintains rotational symmetry. Molecular structure has rotational invariance and is inherently 3-D, and thus we need 3-D encoding methods to input molecular structure into machine learning. In this paper I present Icospherical Chemical Objects (ICOs) that enable the encoding of 3-D data in a rotationally invariant way which works with spherical or icosahedral neural networks and allows for dataset augmentation. I demonstrate the ICO featurisation method on the following tasks: predicting general molecular properties, predicting solubility of drug like molecules and the protein binding problem and find that ICO and SphNNs perform well on all problems.",
    "link": "http://arxiv.org/abs/2304.07558",
    "context": "Title: Icospherical Chemical Objects (ICOs) allow for chemical data augmentation and maintain rotational, translation and permutation invariance. (arXiv:2304.07558v1 [cs.LG])\nAbstract: Dataset augmentation is a common way to deal with small datasets; Chemistry datasets are often small. Spherical convolutional neural networks (SphNNs) and Icosahedral neural networks (IcoNNs) are a type of geometric machine learning algorithm that maintains rotational symmetry. Molecular structure has rotational invariance and is inherently 3-D, and thus we need 3-D encoding methods to input molecular structure into machine learning. In this paper I present Icospherical Chemical Objects (ICOs) that enable the encoding of 3-D data in a rotationally invariant way which works with spherical or icosahedral neural networks and allows for dataset augmentation. I demonstrate the ICO featurisation method on the following tasks: predicting general molecular properties, predicting solubility of drug like molecules and the protein binding problem and find that ICO and SphNNs perform well on all problems.",
    "path": "papers/23/04/2304.07558.json",
    "total_tokens": 876,
    "translated_title": "Icospherical Chemical Objects（ICOs）允许对化学数据进行扩充并保持旋转、平移和置换不变性。",
    "translated_abstract": "数据集增强是处理小型数据集的常用方法；但化学数据集通常很小。球形卷积神经网络（SphNNs）和二十面体神经网络（IcoNNs）是一种保持旋转对称性的几何机器学习算法。分子结构具有旋转不变性和天然的3D属性，因此需要3D编码方法将分子结构输入机器学习进行分析。本文介绍了Icospherical Chemical Objects（ICOs），以一种旋转不变的方式对3D数据进行编码，可适用于球形或二十面体神经网络，并允许进行数据集增强。我在预测普通分子性质、预测药物类分子的溶解度和蛋白质结合问题等任务中演示了ICO特征提取方法，并发现ICO和SphNN在所有问题上都表现良好。",
    "tldr": "本文介绍了一种叫做ICOs的方法，可以旋转不变的方式对3D化学数据进行编码，适用于球形或二十面体神经网络，并能够进行数据集扩展和提高化学预测任务的效果。"
}