{
    "title": "Exoskeleton for the Mind: Exploring Strategies Against Misinformation with a Metacognitive Agent. (arXiv:2304.08759v1 [cs.HC])",
    "abstract": "Misinformation is a global problem in modern social media platforms with few solutions known to be effective. Social media platforms have offered tools to raise awareness of information, but these are closed systems that have not been empirically evaluated. Others have developed novel tools and strategies, but most have been studied out of context using static stimuli, researcher prompts, or low fidelity prototypes. We offer a new anti-misinformation agent grounded in theories of metacognition that was evaluated within Twitter. We report on a pilot study (n=17) and multi-part experimental study (n=57, n=49) where participants experienced three versions of the agent, each deploying a different strategy. We found that no single strategy was superior over the control. We also confirmed the necessity of transparency and clarity about the agent's underlying logic, as well as concerns about repeated exposure to misinformation and lack of user engagement.",
    "link": "http://arxiv.org/abs/2304.08759",
    "context": "Title: Exoskeleton for the Mind: Exploring Strategies Against Misinformation with a Metacognitive Agent. (arXiv:2304.08759v1 [cs.HC])\nAbstract: Misinformation is a global problem in modern social media platforms with few solutions known to be effective. Social media platforms have offered tools to raise awareness of information, but these are closed systems that have not been empirically evaluated. Others have developed novel tools and strategies, but most have been studied out of context using static stimuli, researcher prompts, or low fidelity prototypes. We offer a new anti-misinformation agent grounded in theories of metacognition that was evaluated within Twitter. We report on a pilot study (n=17) and multi-part experimental study (n=57, n=49) where participants experienced three versions of the agent, each deploying a different strategy. We found that no single strategy was superior over the control. We also confirmed the necessity of transparency and clarity about the agent's underlying logic, as well as concerns about repeated exposure to misinformation and lack of user engagement.",
    "path": "papers/23/04/2304.08759.json",
    "total_tokens": 908,
    "translated_title": "智能外骨骼：基于元认知代理的打击信息误导策略探索",
    "translated_abstract": "在现代社交媒体平台上，信息误导是一个全球性问题，很少有已知有效的解决方案。社交媒体平台提供了提高信息意识的工具，但这些都是封闭的系统，尚未经过实证评估。其他人开发了新颖的工具和策略，但大多数是在静态刺激、研究员提示或低保真原型的背景下研究的。我们提供了一种基于元认知理论评估于Twitter内部的反信息误导代理。我们报告了一项试点研究（n=17）和一项多部分实验研究（n=57，n=49），其中参与者体验了三个版本的代理，每个版本都应用了不同的策略。我们发现，没有一种单一的策略优于对照组。我们还确认了透明度和清晰度在代理的底层逻辑上的必要性，以及对于反复接触误导信息和缺乏用户参与的担忧。",
    "tldr": "本研究基于元认知理论提出了一种反信息误导代理，在Twitter环境中进行了试点和实验研究，发现单一策略无法完全解决问题，并提出了对透明度和用户参与的重视。",
    "en_tdlr": "This study proposes an anti-misinformation agent based on metacognition theory, which is evaluated on Twitter. No single strategy is superior in solving misinformation, and transparency and user engagement are necessary."
}