{
    "title": "Swarm Reinforcement Learning For Adaptive Mesh Refinement. (arXiv:2304.00818v2 [cs.MA] UPDATED)",
    "abstract": "The Finite Element Method, an important technique in engineering, is aided by Adaptive Mesh Refinement (AMR), which dynamically refines mesh regions to allow for a favorable trade-off between computational speed and simulation accuracy. Classical methods for AMR depend on task-specific heuristics or expensive error estimators, hindering their use for complex simulations. Recent learned AMR methods tackle these problems, but so far scale only to simple toy examples. We formulate AMR as a novel Adaptive Swarm Markov Decision Process in which a mesh is modeled as a system of simple collaborating agents that may split into multiple new agents. This framework allows for a spatial reward formulation that simplifies the credit assignment problem, which we combine with Message Passing Networks to propagate information between neighboring mesh elements. We experimentally validate the effectiveness of our approach, Adaptive Swarm Mesh Refinement (ASMR), showing that it learns reliable, scalable,",
    "link": "http://arxiv.org/abs/2304.00818",
    "context": "Title: Swarm Reinforcement Learning For Adaptive Mesh Refinement. (arXiv:2304.00818v2 [cs.MA] UPDATED)\nAbstract: The Finite Element Method, an important technique in engineering, is aided by Adaptive Mesh Refinement (AMR), which dynamically refines mesh regions to allow for a favorable trade-off between computational speed and simulation accuracy. Classical methods for AMR depend on task-specific heuristics or expensive error estimators, hindering their use for complex simulations. Recent learned AMR methods tackle these problems, but so far scale only to simple toy examples. We formulate AMR as a novel Adaptive Swarm Markov Decision Process in which a mesh is modeled as a system of simple collaborating agents that may split into multiple new agents. This framework allows for a spatial reward formulation that simplifies the credit assignment problem, which we combine with Message Passing Networks to propagate information between neighboring mesh elements. We experimentally validate the effectiveness of our approach, Adaptive Swarm Mesh Refinement (ASMR), showing that it learns reliable, scalable,",
    "path": "papers/23/04/2304.00818.json",
    "total_tokens": 949,
    "translated_title": "适应网格细化的群体强化学习",
    "translated_abstract": "有限元方法是工程学中一种重要的技术，自适应网格细化（AMR）通过动态细化网格区域，在计算速度和模拟精度之间取得有利的平衡。传统的AMR方法依赖于特定任务的启发式规则或昂贵的误差估计器，限制了其在复杂模拟中的应用。最近的学习型AMR方法试图解决这些问题，但目前只能应用于简单的示例。我们将AMR表述为一种新颖的自适应群体马尔可夫决策过程，其中网格被建模为一组简单协作的代理，可以分裂为多个新代理。这个框架可以使用空间奖励公式化简分配问题，并结合消息传递网络在相邻网格元素之间传播信息。我们通过实验证明了我们的方法——自适应群体网格细化（ASMR）的有效性，显示它可以学习可靠、可扩展的网格细化策略。",
    "tldr": "这项研究提出了一种适应网格细化的群体强化学习方法，通过将网格建模为一组简单协作的代理，并利用消息传递网络在相邻网格元素之间传播信息，以解决传统方法在复杂模拟中的应用限制。该方法被证实可以学习可靠、可扩展的网格细化策略。"
}