{
    "title": "Can We Revitalize Interventional Healthcare with AI-XR Surgical Metaverses?. (arXiv:2304.00007v1 [cs.AI])",
    "abstract": "Recent advancements in technology, particularly in machine learning (ML), deep learning (DL), and the metaverse, offer great potential for revolutionizing surgical science. The combination of artificial intelligence and extended reality (AI-XR) technologies has the potential to create a surgical metaverse, a virtual environment where surgeries can be planned and performed. This paper aims to provide insight into the various potential applications of an AI-XR surgical metaverse and the challenges that must be addressed to bring its full potential to fruition. It is important for the community to focus on these challenges to fully realize the potential of the AI-XR surgical metaverses. Furthermore, to emphasize the need for secure and robust AI-XR surgical metaverses and to demonstrate the real-world implications of security threats to the AI-XR surgical metaverses, we present a case study in which the ``an immersive surgical attack'' on incision point localization is performed in the co",
    "link": "http://arxiv.org/abs/2304.00007",
    "context": "Title: Can We Revitalize Interventional Healthcare with AI-XR Surgical Metaverses?. (arXiv:2304.00007v1 [cs.AI])\nAbstract: Recent advancements in technology, particularly in machine learning (ML), deep learning (DL), and the metaverse, offer great potential for revolutionizing surgical science. The combination of artificial intelligence and extended reality (AI-XR) technologies has the potential to create a surgical metaverse, a virtual environment where surgeries can be planned and performed. This paper aims to provide insight into the various potential applications of an AI-XR surgical metaverse and the challenges that must be addressed to bring its full potential to fruition. It is important for the community to focus on these challenges to fully realize the potential of the AI-XR surgical metaverses. Furthermore, to emphasize the need for secure and robust AI-XR surgical metaverses and to demonstrate the real-world implications of security threats to the AI-XR surgical metaverses, we present a case study in which the ``an immersive surgical attack'' on incision point localization is performed in the co",
    "path": "papers/23/04/2304.00007.json",
    "total_tokens": 915,
    "translated_title": "能否借助AI-XR手术元宇宙重振介入式医疗？",
    "translated_abstract": "近年来，技术特别是机器学习（ML）、深度学习（DL）和元宇宙的进步为革新外科科学提供了巨大的潜力。人工智能和增强现实（AI-XR）技术的结合有可能创建一个手术元宇宙，即手术可以在虚拟环境中规划和执行。本文旨在提供关于AI-XR手术元宇宙各种潜在应用和必须应对的挑战的深入了解。对这些挑战的关注对于充分实现AI-XR手术元宇宙的潜力至关重要。此外，为强调需要安全和强大的AI-XR手术元宇宙的需求并展示安全威胁对AI-XR手术元宇宙的实际影响，我们提出了一个案例研究，其中展示了“沉浸式手术攻击”对切口点定位的影响。",
    "tldr": "本论文讨论了AI-XR手术元宇宙的潜在应用和挑战，并强调了实现其潜力所需解决的问题，同时提出了案例研究，展示了安全威胁对AI-XR手术元宇宙的影响。",
    "en_tdlr": "This paper discusses the potential applications and challenges of the AI-XR surgical metaverse, emphasizes the need to address its challenges, and presents a case study demonstrating the impact of security threats on the AI-XR surgical metaverse."
}