{
    "title": "Machine Learning Research Trends in Africa: A 30 Years Overview with Bibliometric Analysis Review. (arXiv:2304.07542v1 [cs.DL])",
    "abstract": "In this paper, a critical bibliometric analysis study is conducted, coupled with an extensive literature survey on recent developments and associated applications in machine learning research with a perspective on Africa. The presented bibliometric analysis study consists of 2761 machine learning-related documents, of which 98% were articles with at least 482 citations published in 903 journals during the past 30 decades. Furthermore, the collated documents were retrieved from the Science Citation Index EXPANDED, comprising research publications from 54 African countries between 1993 and 2021. The bibliometric study shows the visualization of the current landscape and future trends in machine learning research and its application to facilitate future collaborative research and knowledge exchange among authors from different research institutions scattered across the African continent.",
    "link": "http://arxiv.org/abs/2304.07542",
    "context": "Title: Machine Learning Research Trends in Africa: A 30 Years Overview with Bibliometric Analysis Review. (arXiv:2304.07542v1 [cs.DL])\nAbstract: In this paper, a critical bibliometric analysis study is conducted, coupled with an extensive literature survey on recent developments and associated applications in machine learning research with a perspective on Africa. The presented bibliometric analysis study consists of 2761 machine learning-related documents, of which 98% were articles with at least 482 citations published in 903 journals during the past 30 decades. Furthermore, the collated documents were retrieved from the Science Citation Index EXPANDED, comprising research publications from 54 African countries between 1993 and 2021. The bibliometric study shows the visualization of the current landscape and future trends in machine learning research and its application to facilitate future collaborative research and knowledge exchange among authors from different research institutions scattered across the African continent.",
    "path": "papers/23/04/2304.07542.json",
    "total_tokens": 879,
    "translated_title": "非洲机器学习研究趋势：30年文献计量分析综述",
    "translated_abstract": "本文针对非洲地区机器学习的最新发展和相关应用进行了广泛的文献调查，并进行了关键的文献计量分析研究。该文献计量分析研究共收集了2761篇机器学习相关的文献，其中98％是发表在903个期刊上至少有482次引用的文章，时间跨度为过去的30年。另外，这些文献是从Science Citation Index EXPANDED检索中来自于1993年至2021年之间54个非洲国家的研究出版物。文献计量研究显示了机器学习研究和应用的当前现状和未来趋势的可视化，以促进非洲大陆分布在不同研究机构的作者之间进行未来的合作研究和知识交流。",
    "tldr": "本文对非洲地区机器学习的最新发展和相关应用进行了广泛的文献调查及关键的文献计量分析，结果显示了机器学习研究和应用的当前现状及未来趋势，以促进未来的合作研究和知识交流。",
    "en_tdlr": "This paper conducted an extensive literature survey and a critical bibliometric analysis study on recent developments and associated applications in machine learning research within the African context, which displays the current landscape and future trends of machine learning research and its application, aiming to facilitate future collaborative research and knowledge exchange among authors from different research institutions scattered across the African continent."
}