{
    "title": "Data-driven multinomial random forest. (arXiv:2304.04240v1 [stat.ML])",
    "abstract": "In this article, we strengthen the proof methods of some previously weakly consistent variants of random forests into strongly consistent proof methods, and improve the data utilization of these variants, in order to obtain better theoretical properties and experimental performance. In addition, based on the multinomial random forest (MRF) and Bernoulli random forest (BRF), we propose a data-driven multinomial random forest (DMRF) algorithm, which has lower complexity than MRF and higher complexity than BRF while satisfying strong consistency. It has better performance in classification and regression problems than previous RF variants that only satisfy weak consistency, and in most cases even surpasses standard random forest. To the best of our knowledge, DMRF is currently the most excellent strongly consistent RF variant with low algorithm complexity",
    "link": "http://arxiv.org/abs/2304.04240",
    "context": "Title: Data-driven multinomial random forest. (arXiv:2304.04240v1 [stat.ML])\nAbstract: In this article, we strengthen the proof methods of some previously weakly consistent variants of random forests into strongly consistent proof methods, and improve the data utilization of these variants, in order to obtain better theoretical properties and experimental performance. In addition, based on the multinomial random forest (MRF) and Bernoulli random forest (BRF), we propose a data-driven multinomial random forest (DMRF) algorithm, which has lower complexity than MRF and higher complexity than BRF while satisfying strong consistency. It has better performance in classification and regression problems than previous RF variants that only satisfy weak consistency, and in most cases even surpasses standard random forest. To the best of our knowledge, DMRF is currently the most excellent strongly consistent RF variant with low algorithm complexity",
    "path": "papers/23/04/2304.04240.json",
    "total_tokens": 871,
    "translated_title": "数据驱动的多项式随机森林",
    "translated_abstract": "本文加强了一些先前弱一些的随机森林变体的证明方法，使其成为强一致性的证明方法，并提高了这些变体的数据利用率，以获得更好的理论性能和实验性能。此外，基于多项式随机森林（MRF）和伯努利随机森林（BRF），提出了一种数据驱动的多项式随机森林（DMRF）算法，其比MRF的复杂度更低，比BRF的复杂度更高，同时满足强一致性。在分类和回归问题上，它比之前只满足弱一致性的RF变体表现更好，甚至超过了标准随机森林。据我们所知，DMRF是目前最出色的低算法复杂性的强随机森林变体。",
    "tldr": "本文加强了一些先前弱一些的随机森林变体的证明方法并提高了这些变体的数据利用率以获得更好的理论性能和实验性能，提出了一种数据驱动的多项式随机森林算法，其复杂度低且满足强一致性，在分类和回归问题上表现更好，并超过了标准随机森林。",
    "en_tdlr": "This paper strengthens the proof methods of previously weakly consistent variants of random forests and improves their data utilization for better theoretical and experimental performance. A data-driven multinomial random forest algorithm is proposed, with lower complexity and strong consistency, outperforming standard random forest in classification and regression."
}