{
    "title": "To Wake-up or Not to Wake-up: Reducing Keyword False Alarm by Successive Refinement. (arXiv:2304.03416v1 [eess.SP])",
    "abstract": "Keyword spotting systems continuously process audio streams to detect keywords. One of the most challenging tasks in designing such systems is to reduce False Alarm (FA) which happens when the system falsely registers a keyword despite the keyword not being uttered. In this paper, we propose a simple yet elegant solution to this problem that follows from the law of total probability. We show that existing deep keyword spotting mechanisms can be improved by Successive Refinement, where the system first classifies whether the input audio is speech or not, followed by whether the input is keyword-like or not, and finally classifies which keyword was uttered. We show across multiple models with size ranging from 13K parameters to 2.41M parameters, the successive refinement technique reduces FA by up to a factor of 8 on in-domain held-out FA data, and up to a factor of 7 on out-of-domain (OOD) FA data. Further, our proposed approach is \"plug-and-play\" and can be applied to any deep keyword ",
    "link": "http://arxiv.org/abs/2304.03416",
    "context": "Title: To Wake-up or Not to Wake-up: Reducing Keyword False Alarm by Successive Refinement. (arXiv:2304.03416v1 [eess.SP])\nAbstract: Keyword spotting systems continuously process audio streams to detect keywords. One of the most challenging tasks in designing such systems is to reduce False Alarm (FA) which happens when the system falsely registers a keyword despite the keyword not being uttered. In this paper, we propose a simple yet elegant solution to this problem that follows from the law of total probability. We show that existing deep keyword spotting mechanisms can be improved by Successive Refinement, where the system first classifies whether the input audio is speech or not, followed by whether the input is keyword-like or not, and finally classifies which keyword was uttered. We show across multiple models with size ranging from 13K parameters to 2.41M parameters, the successive refinement technique reduces FA by up to a factor of 8 on in-domain held-out FA data, and up to a factor of 7 on out-of-domain (OOD) FA data. Further, our proposed approach is \"plug-and-play\" and can be applied to any deep keyword ",
    "path": "papers/23/04/2304.03416.json",
    "total_tokens": 902,
    "translated_title": "该文题目为：\"叫醒还是不叫醒：通过连续细化来减少关键词误报\"",
    "translated_abstract": "关键词监测系统持续处理音频流以检测关键词。设计这种系统最具挑战性的任务之一是降低假警报（FA），即系统虽然未被唤醒但误注册关键词。在本文中，我们提出了一个简单而优雅的解决方案，该方案遵循全概率法则。我们展示现有的深度关键词监测机制可以通过连续细化得到改进，其中系统首先分类输入音频是否为语音，然后分类输入是否类似于关键词，最后分类口头发出的关键词是哪个。我们表明，跨多个模型，其参数范围从13K到2.41M不等，连续细化技术在域内留存FA数据上将FA减少了高达8倍，在域外（OOD）FA数据上则将其减少了高达7倍。此外，我们提出的方法是“即插即用”的，可应用于任何深度关键词监测系统。",
    "tldr": "本文提出了通过连续细化来减少关键词误报的方法，并展示其在多个模型上的有效性，可应用于任何深度关键词监测系统。",
    "en_tdlr": "The paper proposes a solution to reduce false alarms in keyword spotting systems by successive refinement, and shows its effectiveness across multiple models. This method can be applied to any deep keyword spotting system."
}