{
    "title": "Scaling the leading accuracy of deep equivariant models to biomolecular simulations of realistic size. (arXiv:2304.10061v1 [physics.comp-ph])",
    "abstract": "This work brings the leading accuracy, sample efficiency, and robustness of deep equivariant neural networks to the extreme computational scale. This is achieved through a combination of innovative model architecture, massive parallelization, and models and implementations optimized for efficient GPU utilization. The resulting Allegro architecture bridges the accuracy-speed tradeoff of atomistic simulations and enables description of dynamics in structures of unprecedented complexity at quantum fidelity. To illustrate the scalability of Allegro, we perform nanoseconds-long stable simulations of protein dynamics and scale up to a 44-million atom structure of a complete, all-atom, explicitly solvated HIV capsid on the Perlmutter supercomputer. We demonstrate excellent strong scaling up to 100 million atoms and 70% weak scaling to 5120 A100 GPUs.",
    "link": "http://arxiv.org/abs/2304.10061",
    "context": "Title: Scaling the leading accuracy of deep equivariant models to biomolecular simulations of realistic size. (arXiv:2304.10061v1 [physics.comp-ph])\nAbstract: This work brings the leading accuracy, sample efficiency, and robustness of deep equivariant neural networks to the extreme computational scale. This is achieved through a combination of innovative model architecture, massive parallelization, and models and implementations optimized for efficient GPU utilization. The resulting Allegro architecture bridges the accuracy-speed tradeoff of atomistic simulations and enables description of dynamics in structures of unprecedented complexity at quantum fidelity. To illustrate the scalability of Allegro, we perform nanoseconds-long stable simulations of protein dynamics and scale up to a 44-million atom structure of a complete, all-atom, explicitly solvated HIV capsid on the Perlmutter supercomputer. We demonstrate excellent strong scaling up to 100 million atoms and 70% weak scaling to 5120 A100 GPUs.",
    "path": "papers/23/04/2304.10061.json",
    "total_tokens": 888,
    "translated_title": "将深度等变模型的领先精度扩展到真实尺寸生物分子模拟",
    "translated_abstract": "本研究通过创新的模型架构、大规模并行化以及针对高效GPU利用率进行优化的模型和实现，将深度等变神经网络的领先精度、样本效率和鲁棒性发挥到极致计算规模。Allegro架构成功解决了原子模拟的精度-速度权衡问题，实现了空前复杂结构的量子保真动力学描述。我们演示了Allegro的可扩展性，进行了纳秒级蛋白动力学稳定模拟，并在Perlmutter超级计算机上扩展到了一个完整的、所有原子明确溶剂化的4400万原子结构的HIV外壳。我们展示了100万原子的优异强扩展性和5120个A100 GPU的70%弱扩展性。",
    "tldr": "本研究开发出Allegro架构，通过创新的模型架构和GPU并行化实现了对极大分子的高精度模拟，能够对空前复杂的结构进行量子保真动力学描述，并成功进行了对4400万原子的HIV外壳的模拟。",
    "en_tdlr": "This work introduces the Allegro architecture, which achieves high-accuracy simulation of extremely large biomolecules through innovative model architecture and efficient GPU parallelization, enabling quantum-fidelity dynamics description of unprecedentedly complex structures. The research demonstrates excellent strong scaling up to 100 million atoms and 70% weak scaling to 5120 A100 GPUs, and successfully simulated a complete, all-atom, explicitly solvated HIV capsid with 44 million atoms."
}