{
    "title": "Faulty Branch Identification in Passive Optical Networks using Machine Learning. (arXiv:2304.01376v1 [cs.LG])",
    "abstract": "Passive optical networks (PONs) have become a promising broadband access network solution. To ensure a reliable transmission, and to meet service level agreements, PON systems have to be monitored constantly in order to quickly identify and localize networks faults. Typically, a service disruption in a PON system is mainly due to fiber cuts and optical network unit (ONU) transmitter/receiver failures. When the ONUs are located at different distances from the optical line terminal (OLT), the faulty ONU or branch can be identified by analyzing the recorded optical time domain reflectometry (OTDR) traces. However, faulty branch isolation becomes very challenging when the reflections originating from two or more branches with similar length overlap, which makes it very hard to discriminate the faulty branches given the global backscattered signal. Recently, machine learning (ML) based approaches have shown great potential for managing optical faults in PON systems. Such techniques perform ",
    "link": "http://arxiv.org/abs/2304.01376",
    "context": "Title: Faulty Branch Identification in Passive Optical Networks using Machine Learning. (arXiv:2304.01376v1 [cs.LG])\nAbstract: Passive optical networks (PONs) have become a promising broadband access network solution. To ensure a reliable transmission, and to meet service level agreements, PON systems have to be monitored constantly in order to quickly identify and localize networks faults. Typically, a service disruption in a PON system is mainly due to fiber cuts and optical network unit (ONU) transmitter/receiver failures. When the ONUs are located at different distances from the optical line terminal (OLT), the faulty ONU or branch can be identified by analyzing the recorded optical time domain reflectometry (OTDR) traces. However, faulty branch isolation becomes very challenging when the reflections originating from two or more branches with similar length overlap, which makes it very hard to discriminate the faulty branches given the global backscattered signal. Recently, machine learning (ML) based approaches have shown great potential for managing optical faults in PON systems. Such techniques perform ",
    "path": "papers/23/04/2304.01376.json",
    "total_tokens": 803,
    "translated_title": "《使用机器学习识别被动式光网络中的错误分支》",
    "translated_abstract": "被动式光网络已成为一种有前途的宽带接入网络解决方案。为确保可靠传输并满足服务水平协议，PON系统必须不断监测，以快速识别和定位网络故障。针对PON系统中可能出现的故障分支，可以通过分析记录的光时域反射（OTDR）跟踪信息来进行识别。然而，当两个或更多长度相似的分支产生的反射重叠时，故障分支的隔离变得非常具有挑战性。最近，基于机器学习的方法在管理PON系统中的光学故障方面展示了巨大的潜力。",
    "tldr": "该论文介绍了针对PON系统中可能出现的故障分支，使用机器学习进行错误分支识别的方法。同时探讨了在多个长度相似的分支产生反射重叠的情况下如何进行隔离。",
    "en_tdlr": "This paper presents a machine learning approach for identifying faulty branches in PON systems, addressing the challenges posed by reflections from multiple similar-length branches overlapping in the recorded OTDR traces."
}