{
    "title": "Multi-Task Learning Regression via Convex Clustering. (arXiv:2304.13342v1 [stat.ME])",
    "abstract": "Multi-task learning (MTL) is a methodology that aims to improve the general performance of estimation and prediction by sharing common information among related tasks. In the MTL, there are several assumptions for the relationships and methods to incorporate them. One of the natural assumptions in the practical situation is that tasks are classified into some clusters with their characteristics. For this assumption, the group fused regularization approach performs clustering of the tasks by shrinking the difference among tasks. This enables us to transfer common information within the same cluster. However, this approach also transfers the information between different clusters, which worsens the estimation and prediction. To overcome this problem, we propose an MTL method with a centroid parameter representing a cluster center of the task. Because this model separates parameters into the parameters for regression and the parameters for clustering, we can improve estimation and predict",
    "link": "http://arxiv.org/abs/2304.13342",
    "context": "Title: Multi-Task Learning Regression via Convex Clustering. (arXiv:2304.13342v1 [stat.ME])\nAbstract: Multi-task learning (MTL) is a methodology that aims to improve the general performance of estimation and prediction by sharing common information among related tasks. In the MTL, there are several assumptions for the relationships and methods to incorporate them. One of the natural assumptions in the practical situation is that tasks are classified into some clusters with their characteristics. For this assumption, the group fused regularization approach performs clustering of the tasks by shrinking the difference among tasks. This enables us to transfer common information within the same cluster. However, this approach also transfers the information between different clusters, which worsens the estimation and prediction. To overcome this problem, we propose an MTL method with a centroid parameter representing a cluster center of the task. Because this model separates parameters into the parameters for regression and the parameters for clustering, we can improve estimation and predict",
    "path": "papers/23/04/2304.13342.json",
    "total_tokens": 833,
    "translated_title": "基于凸聚类的多任务回归学习",
    "translated_abstract": "多任务学习(MTL)是一种旨在通过共享相关任务的公共信息来提高估计和预测的性能的方法。在MTL中，有几个关于关系和方法的假设用于结合任务。在实际情况下，其中一个自然假设是将任务分类为具有特征的一些聚类。针对这种假设，群组融合正则化方法通过缩小任务之间的差异来执行任务聚类。这使我们能够转移同一聚类中的公共信息。然而，该方法也会在不同聚类之间转移信息，从而加剧估计和预测的错误。为了解决这个问题，我们提出了一种MTL方法，该方法具有代表任务聚类中心的中心点参数。由于该模型将参数分为回归参数和聚类参数，因此我们可以改善估计和预测。",
    "tldr": "本研究提出了一种基于凸聚类的多任务回归学习方法，该方法使用群组融合正则化方法对任务进行聚类，并使用聚类中心点参数代表任务聚类中心，从而避免了不同聚类之间信息的干扰。",
    "en_tdlr": "This paper proposes a multi-task learning regression method based on convex clustering, which clusters tasks using group fused regularization and uses centroid parameters to represent task clusters, thus avoiding interference between different clusters."
}