{
    "title": "Artificial Collective Intelligence Engineering: a Survey of Concepts and Perspectives. (arXiv:2304.05147v1 [cs.AI])",
    "abstract": "Collectiveness is an important property of many systems--both natural and artificial. By exploiting a large number of individuals, it is often possible to produce effects that go far beyond the capabilities of the smartest individuals, or even to produce intelligent collective behaviour out of not-so-intelligent individuals. Indeed, collective intelligence, namely the capability of a group to act collectively in a seemingly intelligent way, is increasingly often a design goal of engineered computational systems--motivated by recent techno-scientific trends like the Internet of Things, swarm robotics, and crowd computing, just to name a few. For several years, the collective intelligence observed in natural and artificial systems has served as a source of inspiration for engineering ideas, models, and mechanisms. Today, artificial and computational collective intelligence are recognised research topics, spanning various techniques, kinds of target systems, and application domains. Howev",
    "link": "http://arxiv.org/abs/2304.05147",
    "context": "Title: Artificial Collective Intelligence Engineering: a Survey of Concepts and Perspectives. (arXiv:2304.05147v1 [cs.AI])\nAbstract: Collectiveness is an important property of many systems--both natural and artificial. By exploiting a large number of individuals, it is often possible to produce effects that go far beyond the capabilities of the smartest individuals, or even to produce intelligent collective behaviour out of not-so-intelligent individuals. Indeed, collective intelligence, namely the capability of a group to act collectively in a seemingly intelligent way, is increasingly often a design goal of engineered computational systems--motivated by recent techno-scientific trends like the Internet of Things, swarm robotics, and crowd computing, just to name a few. For several years, the collective intelligence observed in natural and artificial systems has served as a source of inspiration for engineering ideas, models, and mechanisms. Today, artificial and computational collective intelligence are recognised research topics, spanning various techniques, kinds of target systems, and application domains. Howev",
    "path": "papers/23/04/2304.05147.json",
    "total_tokens": 1074,
    "translated_title": "人工集体智能工程：概念和视角概述",
    "translated_abstract": "集体性是许多系统（包括自然和人工系统）的重要属性。利用大量的个体，往往可以产生超越最聪明个体能力的效应，甚至能在不那么聪明的个体中产生智能的集体行为。事实上，集体智能（即一群人以看似聪明的方式集中行动的能力）越来越成为计算系统的设计目标，这是受到物联网、群体机器人和众包计算等近期技术科学趋势的推动。多年来，自然和人工系统中观察到的集体智能一直是工程思想、模型和机制的灵感来源。如今，人工和计算集体智能成为认可的研究主题，涵盖各种技术、目标系统和应用领域。然而，该领域的文献往往缺乏对这种模式、其主要技术要素以及与其实际利用相关的挑战的系统概述。本文旨在提供这样的综述，通过讨论人工集体智能工程的角色、概念和挑战，并强调它对计算系统工程和设计的相关性和潜在影响。",
    "tldr": "人工集体智能工程旨在利用大量个体产生超越个体能力的效应和集体智能行为，成为计算系统设计目标。本文综述了人工集体智能工程的角色、概念和挑战，强调其对计算系统工程和设计的相关性和潜在影响。",
    "en_tdlr": "Artificial collective intelligence engineering aims to utilize a large number of individuals to produce effects beyond individual capabilities and collective intelligent behavior, and has become a design goal for computational systems. This survey provides an overview of the role, concepts, and challenges of artificial collective intelligence engineering, emphasizing its relevance and potential impact for computational systems engineering and design."
}