{
    "title": "Roll-Drop: accounting for observation noise with a single parameter. (arXiv:2304.13150v1 [cs.RO])",
    "abstract": "This paper proposes a simple strategy for sim-to-real in Deep-Reinforcement Learning (DRL) -- called Roll-Drop -- that uses dropout during simulation to account for observation noise during deployment without explicitly modelling its distribution for each state. DRL is a promising approach to control robots for highly dynamic and feedback-based manoeuvres, and accurate simulators are crucial to providing cheap and abundant data to learn the desired behaviour. Nevertheless, the simulated data are noiseless and generally show a distributional shift that challenges the deployment on real machines where sensor readings are affected by noise. The standard solution is modelling the latter and injecting it during training; while this requires a thorough system identification, Roll-Drop enhances the robustness to sensor noise by tuning only a single parameter. We demonstrate an 80% success rate when up to 25% noise is injected in the observations, with twice higher robustness than the baseline",
    "link": "http://arxiv.org/abs/2304.13150",
    "context": "Title: Roll-Drop: accounting for observation noise with a single parameter. (arXiv:2304.13150v1 [cs.RO])\nAbstract: This paper proposes a simple strategy for sim-to-real in Deep-Reinforcement Learning (DRL) -- called Roll-Drop -- that uses dropout during simulation to account for observation noise during deployment without explicitly modelling its distribution for each state. DRL is a promising approach to control robots for highly dynamic and feedback-based manoeuvres, and accurate simulators are crucial to providing cheap and abundant data to learn the desired behaviour. Nevertheless, the simulated data are noiseless and generally show a distributional shift that challenges the deployment on real machines where sensor readings are affected by noise. The standard solution is modelling the latter and injecting it during training; while this requires a thorough system identification, Roll-Drop enhances the robustness to sensor noise by tuning only a single parameter. We demonstrate an 80% success rate when up to 25% noise is injected in the observations, with twice higher robustness than the baseline",
    "path": "papers/23/04/2304.13150.json",
    "total_tokens": 751,
    "translated_title": "Roll-Drop：使用单一参数考虑观测噪声的方法在深度强化学习中的应用",
    "translated_abstract": "本文提出了一种称为Roll-Drop的简单策略，它在模拟中使用dropout来考虑部署期间观测噪声而不需要显式地模拟每个状态下的噪声分布，从而提升了深度强化学习中模拟到真实环境的转移能力。实验表明，在注入了高达25%的观测噪声时，该方法的成功率高达80%，鲁棒性比基线方法高出两倍。",
    "tldr": "本文提出了一种单一参数的策略Roll-Drop，在深度强化学习中使用dropout来考虑观测噪声，而不需要显式建模噪声分布，从而提升了模拟到真实环境的转移能力。",
    "en_tdlr": "This paper proposes a single-parameter strategy called Roll-Drop that uses dropout to consider observation noise in deep reinforcement learning, enhancing the ability to transfer from simulation to real environment without explicitly modelling the noise distribution for each state."
}