{
    "title": "TIGTEC : Token Importance Guided TExt Counterfactuals. (arXiv:2304.12425v1 [cs.LG])",
    "abstract": "Counterfactual examples explain a prediction by highlighting changes of instance that flip the outcome of a classifier. This paper proposes TIGTEC, an efficient and modular method for generating sparse, plausible and diverse counterfactual explanations for textual data. TIGTEC is a text editing heuristic that targets and modifies words with high contribution using local feature importance. A new attention-based local feature importance is proposed. Counterfactual candidates are generated and assessed with a cost function integrating semantic distance, while the solution space is efficiently explored in a beam search fashion. The conducted experiments show the relevance of TIGTEC in terms of success rate, sparsity, diversity and plausibility. This method can be used in both model-specific or model-agnostic way, which makes it very convenient for generating counterfactual explanations.",
    "link": "http://arxiv.org/abs/2304.12425",
    "context": "Title: TIGTEC : Token Importance Guided TExt Counterfactuals. (arXiv:2304.12425v1 [cs.LG])\nAbstract: Counterfactual examples explain a prediction by highlighting changes of instance that flip the outcome of a classifier. This paper proposes TIGTEC, an efficient and modular method for generating sparse, plausible and diverse counterfactual explanations for textual data. TIGTEC is a text editing heuristic that targets and modifies words with high contribution using local feature importance. A new attention-based local feature importance is proposed. Counterfactual candidates are generated and assessed with a cost function integrating semantic distance, while the solution space is efficiently explored in a beam search fashion. The conducted experiments show the relevance of TIGTEC in terms of success rate, sparsity, diversity and plausibility. This method can be used in both model-specific or model-agnostic way, which makes it very convenient for generating counterfactual explanations.",
    "path": "papers/23/04/2304.12425.json",
    "total_tokens": 909,
    "translated_title": "TIGTEC：基于标记重要性的文本对抗事例生成方法",
    "translated_abstract": "对抗事例是一种通过改变实例来翻转分类器输出以解释模型预测的方法。本文提出了TIGTEC，一种用于生成稀疏、可信和多样性的对抗性解释的高效模块方法。TIGTEC是一种文本编辑启发式方法，使用本地特征重要性针对和修改对分类结果影响最大的单词。提出了一种基于注意力机制的本地特征重要性，并通过一个集成语义距离的代价函数对生成的对抗性解释进行评估。该方法采用波束搜索算法进行高效的解空间搜索。实验结果表明，TIGTEC在成功率、稀疏性、多样性和可信度方面具有很高的实用性。该方法既可以是特定于模型的，也可以是无关模型的，非常方便用于生成对抗性解释。",
    "tldr": "TIGTEC是一个高效的文本对抗事例生成方法，使用本地特征重要性针对和修改对分类结果影响最大的单词，并在代价函数中使用语义距离评估对抗性解释。该方法具有很高的成功率、稀疏性、多样性和可信度，并且既可以是特定于模型的，也可以是无关模型的，非常方便用于生成对抗性解释。",
    "en_tdlr": "TIGTEC proposes an efficient method for generating textual counterfactual explanations using local feature importance, and assessing counterfactual candidates with a cost function integrating semantic distance. The method shows high success rate, sparsity, diversity, and plausibility, and can be used both in model-specific or model-agnostic way."
}