{
    "title": "Adapting model-based deep learning to multiple acquisition conditions: Ada-MoDL. (arXiv:2304.11238v1 [eess.IV])",
    "abstract": "Purpose: The aim of this work is to introduce a single model-based deep network that can provide high-quality reconstructions from undersampled parallel MRI data acquired with multiple sequences, acquisition settings and field strengths.  Methods: A single unrolled architecture, which offers good reconstructions for multiple acquisition settings, is introduced. The proposed scheme adapts the model to each setting by scaling the CNN features and the regularization parameter with appropriate weights. The scaling weights and regularization parameter are derived using a multi-layer perceptron model from conditional vectors, which represents the specific acquisition setting. The perceptron parameters and the CNN weights are jointly trained using data from multiple acquisition settings, including differences in field strengths, acceleration, and contrasts. The conditional network is validated using datasets acquired with different acquisition settings.  Results: The comparison of the adaptiv",
    "link": "http://arxiv.org/abs/2304.11238",
    "context": "Title: Adapting model-based deep learning to multiple acquisition conditions: Ada-MoDL. (arXiv:2304.11238v1 [eess.IV])\nAbstract: Purpose: The aim of this work is to introduce a single model-based deep network that can provide high-quality reconstructions from undersampled parallel MRI data acquired with multiple sequences, acquisition settings and field strengths.  Methods: A single unrolled architecture, which offers good reconstructions for multiple acquisition settings, is introduced. The proposed scheme adapts the model to each setting by scaling the CNN features and the regularization parameter with appropriate weights. The scaling weights and regularization parameter are derived using a multi-layer perceptron model from conditional vectors, which represents the specific acquisition setting. The perceptron parameters and the CNN weights are jointly trained using data from multiple acquisition settings, including differences in field strengths, acceleration, and contrasts. The conditional network is validated using datasets acquired with different acquisition settings.  Results: The comparison of the adaptiv",
    "path": "papers/23/04/2304.11238.json",
    "total_tokens": 906,
    "translated_title": "适应多种采集条件的基于模型的深度学习：Ada-MoDL",
    "translated_abstract": "目的：本文旨在引入一种单一的基于模型的深度网络，可从使用多种序列、采集设置和磁场强度获取的欠采样平行MRI数据中提供高质量重建。方法：提出了一个单一的展开架构，可为多种采集设置提供良好的重建结果。该方案通过使用适当的权重对CNN特征和正则化参数进行缩放，从而使模型适应每个设置。通过使用条件向量从多层感知机模型派生缩放权重和正则化参数，该条件向量代表特定的采集设置。同时使用来自多种采集设置的数据进行多层感知机参数和CNN权重的联合训练。使用不同采集设置采集的数据集验证了条件网络。结果：适应能力好的多模态黄金标准评估显示，提出的方法相对于现有技术具有更好的重建质量和更高的稳健性。",
    "tldr": "本研究提出了一种适应多种采集条件的基于模型的深度学习方法，可从欠采样平行MRI数据中提供高质量重建，通过使用适当的权重对CNN特征和正则化参数进行缩放，使模型适应每个设置。",
    "en_tdlr": "This study proposes a model-based deep learning method for adapting to multiple acquisition conditions, which can provide high-quality reconstructions from undersampled parallel MRI data. It adapts the model to each setting by scaling the CNN features and the regularization parameter with appropriate weights. The method shows better reconstruction quality and higher robustness than existing techniques according to the multi-modal gold-standard evaluation."
}