{
    "title": "SGDP: A Stream-Graph Neural Network Based Data Prefetcher. (arXiv:2304.03864v1 [cs.OS])",
    "abstract": "Data prefetching is important for storage system optimization and access performance improvement. Traditional prefetchers work well for mining access patterns of sequential logical block address (LBA) but cannot handle complex non-sequential patterns that commonly exist in real-world applications. The state-of-the-art (SOTA) learning-based prefetchers cover more LBA accesses. However, they do not adequately consider the spatial interdependencies between LBA deltas, which leads to limited performance and robustness. This paper proposes a novel Stream-Graph neural network-based Data Prefetcher (SGDP). Specifically, SGDP models LBA delta streams using a weighted directed graph structure to represent interactive relations among LBA deltas and further extracts hybrid features by graph neural networks for data prefetching. We conduct extensive experiments on eight real-world datasets. Empirical results verify that SGDP outperforms the SOTA methods in terms of the hit ratio by 6.21%, the effe",
    "link": "http://arxiv.org/abs/2304.03864",
    "context": "Title: SGDP: A Stream-Graph Neural Network Based Data Prefetcher. (arXiv:2304.03864v1 [cs.OS])\nAbstract: Data prefetching is important for storage system optimization and access performance improvement. Traditional prefetchers work well for mining access patterns of sequential logical block address (LBA) but cannot handle complex non-sequential patterns that commonly exist in real-world applications. The state-of-the-art (SOTA) learning-based prefetchers cover more LBA accesses. However, they do not adequately consider the spatial interdependencies between LBA deltas, which leads to limited performance and robustness. This paper proposes a novel Stream-Graph neural network-based Data Prefetcher (SGDP). Specifically, SGDP models LBA delta streams using a weighted directed graph structure to represent interactive relations among LBA deltas and further extracts hybrid features by graph neural networks for data prefetching. We conduct extensive experiments on eight real-world datasets. Empirical results verify that SGDP outperforms the SOTA methods in terms of the hit ratio by 6.21%, the effe",
    "path": "papers/23/04/2304.03864.json",
    "total_tokens": 888,
    "translated_title": "SGDP: 一种基于流图神经网络的数据预取器",
    "translated_abstract": "数据预取对于存储系统优化和访问性能提升非常重要。传统的预取器适用于挖掘顺序逻辑块地址（LBA）的访问模式，但是无法处理现实世界中普遍存在的复杂非顺序模式。最先进的基于学习的预取器覆盖了更多的LBA访问，但是它们不足以充分考虑LBA增量之间的空间依赖关系，导致性能和鲁棒性有限。本文提出了一种新型的基于流图神经网络的数据预取器（SGDP）。具体来说，SGDP使用加权有向图结构来建模LBA增量流以表示LBA增量之间的交互关系，并通过图神经网络进一步提取混合特征进行数据预取。我们对八个真实世界的数据集进行了广泛的实验。实证结果验证了SGDP在命中率方面优于SOTA方法6.21％，效果也优于其他方法。",
    "tldr": "SGDP是一种新型基于流图神经网络的数据预取器，通过建模LBA增量流并使用图神经网络提取混合特征来进行数据预取，实验结果表明它优于其他方法。",
    "en_tdlr": "SGDP is a novel data prefetcher based on Stream-Graph neural network, it models LBA delta streams using a weighted directed graph structure and further extracts hybrid features by graph neural networks for data prefetching. Empirical results show that it outperforms other methods."
}