{
    "title": "Machine learning framework for end-to-end implementation of Incident duration prediction. (arXiv:2304.11507v1 [cs.LG])",
    "abstract": "Traffic congestion caused by non-recurring incidents such as vehicle crashes and debris is a key issue for Traffic Management Centers (TMCs). Clearing incidents in a timely manner is essential for improving safety and reducing delays and emissions for the traveling public. However, TMCs and other responders face a challenge in predicting the duration of incidents (until the roadway is clear), making decisions of what resources to deploy difficult. To address this problem, this research developed an analytical framework and end-to-end machine-learning solution for predicting incident duration based on information available as soon as an incident report is received. Quality predictions of incident duration can help TMCs and other responders take a proactive approach in deploying responder services such as tow trucks, maintenance crews or activating alternative routes. The predictions use a combination of classification and regression machine learning modules. The performance of the devel",
    "link": "http://arxiv.org/abs/2304.11507",
    "context": "Title: Machine learning framework for end-to-end implementation of Incident duration prediction. (arXiv:2304.11507v1 [cs.LG])\nAbstract: Traffic congestion caused by non-recurring incidents such as vehicle crashes and debris is a key issue for Traffic Management Centers (TMCs). Clearing incidents in a timely manner is essential for improving safety and reducing delays and emissions for the traveling public. However, TMCs and other responders face a challenge in predicting the duration of incidents (until the roadway is clear), making decisions of what resources to deploy difficult. To address this problem, this research developed an analytical framework and end-to-end machine-learning solution for predicting incident duration based on information available as soon as an incident report is received. Quality predictions of incident duration can help TMCs and other responders take a proactive approach in deploying responder services such as tow trucks, maintenance crews or activating alternative routes. The predictions use a combination of classification and regression machine learning modules. The performance of the devel",
    "path": "papers/23/04/2304.11507.json",
    "total_tokens": 942,
    "translated_title": "用于一体化事件持续时间预测的机器学习框架",
    "translated_abstract": "非经常性事件，如车辆碰撞和障碍物所引起的交通拥堵是交通管理中心(TMCs)的一个关键问题。及时清除事件对于改善安全、减少延误和排放对公众出行的影响至关重要。然而，TMCs和其他应急响应团队往往难以准确地预测事件的持续时间(等到路面得到清理)，使得决策如何部署资源存在挑战。为了解决这个问题，该研究开发了一种分析框架和端到端的机器学习解决方案，根据事件报告后立即可用的信息预测事件持续时间。对事件持续时间的质量预测可以帮助TMCs和其他应急响应团队采取主动措施，部署救援服务，如拖车、维护团队或激活备选路线。预测使用分类和回归机器学习模块的组合。该模型在来自佛罗里达交通部的实际数据中进行了评估，结果很有希望。",
    "tldr": "该研究提出了一个端到端机器学习框架，通过分析交通事故报告中可以获取的信息，预测并优化应急响应团队的资源部署，从而减少事故持续时间，同时提高公众安全。",
    "en_tdlr": "This research proposes an end-to-end machine learning framework that predicts and optimizes the deployment of emergency response resources by analyzing information available in traffic incident reports, thereby reducing incident duration and improving public safety."
}