{
    "title": "Contrastive Energy Prediction for Exact Energy-Guided Diffusion Sampling in Offline Reinforcement Learning. (arXiv:2304.12824v1 [cs.LG])",
    "abstract": "Guided sampling is a vital approach for applying diffusion models in real-world tasks that embeds human-defined guidance during the sampling procedure. This paper considers a general setting where the guidance is defined by an (unnormalized) energy function. The main challenge for this setting is that the intermediate guidance during the diffusion sampling procedure, which is jointly defined by the sampling distribution and the energy function, is unknown and is hard to estimate. To address this challenge, we propose an exact formulation of the intermediate guidance as well as a novel training objective named contrastive energy prediction (CEP) to learn the exact guidance. Our method is guaranteed to converge to the exact guidance under unlimited model capacity and data samples, while previous methods can not. We demonstrate the effectiveness of our method by applying it to offline reinforcement learning (RL). Extensive experiments on D4RL benchmarks demonstrate that our method outperf",
    "link": "http://arxiv.org/abs/2304.12824",
    "context": "Title: Contrastive Energy Prediction for Exact Energy-Guided Diffusion Sampling in Offline Reinforcement Learning. (arXiv:2304.12824v1 [cs.LG])\nAbstract: Guided sampling is a vital approach for applying diffusion models in real-world tasks that embeds human-defined guidance during the sampling procedure. This paper considers a general setting where the guidance is defined by an (unnormalized) energy function. The main challenge for this setting is that the intermediate guidance during the diffusion sampling procedure, which is jointly defined by the sampling distribution and the energy function, is unknown and is hard to estimate. To address this challenge, we propose an exact formulation of the intermediate guidance as well as a novel training objective named contrastive energy prediction (CEP) to learn the exact guidance. Our method is guaranteed to converge to the exact guidance under unlimited model capacity and data samples, while previous methods can not. We demonstrate the effectiveness of our method by applying it to offline reinforcement learning (RL). Extensive experiments on D4RL benchmarks demonstrate that our method outperf",
    "path": "papers/23/04/2304.12824.json",
    "total_tokens": 911,
    "translated_title": "基于对比能量预测的确切能量引导扩散采样在离线强化学习中的应用",
    "translated_abstract": "引导采样是将扩散模型应用于现实任务的重要方法，其在采样过程中嵌入人类定义的指导。本文考虑了一般设置，其中指导是由一个（非标准化）能量函数定义的。这种设置的主要挑战是，在扩散采样过程中的中间指导是由采样分布和能量函数共同定义的，很难估计。为了解决这个挑战，我们提出了一个精确的中间指导配方以及一种名为对比能量预测（CEP）的新型训练目标来学习精确的中间指导。我们的方法在无限制的模型能力和数据样本下保证收敛到精确指导，而之前的方法无法做到。我们将其应用于离线强化学习中，并在D4RL基准测试上进行了广泛的实验，证明了我们的方法优于之前的最先进方法。",
    "tldr": "本文提出了一种基于对比能量预测的确切能量引导扩散采样方法，用于离线强化学习中，可以解决中间引导估计的难题，并在D4RL基准测试上取得了优异的效果。"
}