{
    "title": "Selecting Sustainable Optimal Stock by Using Multi-Criteria Fuzzy Decision-Making Approaches Based on the Development of the Gordon Model: A case study of the Toronto Stock Exchange. (arXiv:2304.13818v1 [econ.GN])",
    "abstract": "Choosing the right stock portfolio with the highest efficiencies has always concerned accurate and legal investors. Investors have always been concerned about the accuracy and legitimacy of choosing the right stock portfolio with high efficiency. Therefore, this paper aims to determine the criteria for selecting an optimal stock portfolio with a high-efficiency ratio in the Toronto Stock Exchange using the integrated evaluation and decision-making trial laboratory (DEMATEL) model and Multi-Criteria Fuzzy decision-making approaches regarding the development of the Gordon model. In the current study, results obtained using combined multi-criteria fuzzy decision-making approaches, the practical factors, the relative weight of dividends, discount rate, and dividend growth rate have been comprehensively illustrated using combined multi-criteria fuzzy decision-making approaches. A group of 10 experts with at least a ten-year of experience in the stock exchange field was formed to review the ",
    "link": "http://arxiv.org/abs/2304.13818",
    "context": "Title: Selecting Sustainable Optimal Stock by Using Multi-Criteria Fuzzy Decision-Making Approaches Based on the Development of the Gordon Model: A case study of the Toronto Stock Exchange. (arXiv:2304.13818v1 [econ.GN])\nAbstract: Choosing the right stock portfolio with the highest efficiencies has always concerned accurate and legal investors. Investors have always been concerned about the accuracy and legitimacy of choosing the right stock portfolio with high efficiency. Therefore, this paper aims to determine the criteria for selecting an optimal stock portfolio with a high-efficiency ratio in the Toronto Stock Exchange using the integrated evaluation and decision-making trial laboratory (DEMATEL) model and Multi-Criteria Fuzzy decision-making approaches regarding the development of the Gordon model. In the current study, results obtained using combined multi-criteria fuzzy decision-making approaches, the practical factors, the relative weight of dividends, discount rate, and dividend growth rate have been comprehensively illustrated using combined multi-criteria fuzzy decision-making approaches. A group of 10 experts with at least a ten-year of experience in the stock exchange field was formed to review the ",
    "path": "papers/23/04/2304.13818.json",
    "total_tokens": 737,
    "translated_title": "基于Gordon模型择优选择可持续股票的多指标模糊决策方法：以多伦多证券交易所为例",
    "translated_abstract": "选择具有最高效率的正确股票组合一直是精准和合法投资者关注的问题。因此，本文旨在利用DEMATEL模型和基于Gordon模型发展的多指标模糊决策方法，确定选取具有高效率率的最佳股票组合的标准，以在多伦多证券交易所展开研究。",
    "tldr": "本文采用基于Gordon模型的综合评估与多指标模糊决策方法，在多伦多证券交易所选取高效率最优股票组合的标准。",
    "en_tdlr": "The paper aims to determine criteria for selecting an optimal stock portfolio with a high-efficiency ratio in the Toronto Stock Exchange by using Multi-Criteria Fuzzy decision-making approaches based on the development of the Gordon model, and the results have been comprehensively illustrated using combined multi-criteria fuzzy decision-making approaches."
}