{
    "title": "Measuring Normative and Descriptive Biases in Language Models Using Census Data. (arXiv:2304.05764v1 [cs.CL])",
    "abstract": "We investigate in this paper how distributions of occupations with respect to gender is reflected in pre-trained language models. Such distributions are not always aligned to normative ideals, nor do they necessarily reflect a descriptive assessment of reality. In this paper, we introduce an approach for measuring to what degree pre-trained language models are aligned to normative and descriptive occupational distributions. To this end, we use official demographic information about gender--occupation distributions provided by the national statistics agencies of France, Norway, United Kingdom, and the United States. We manually generate template-based sentences combining gendered pronouns and nouns with occupations, and subsequently probe a selection of ten language models covering the English, French, and Norwegian languages. The scoring system we introduce in this work is language independent, and can be used on any combination of template-based sentences, occupations, and languages. ",
    "link": "http://arxiv.org/abs/2304.05764",
    "context": "Title: Measuring Normative and Descriptive Biases in Language Models Using Census Data. (arXiv:2304.05764v1 [cs.CL])\nAbstract: We investigate in this paper how distributions of occupations with respect to gender is reflected in pre-trained language models. Such distributions are not always aligned to normative ideals, nor do they necessarily reflect a descriptive assessment of reality. In this paper, we introduce an approach for measuring to what degree pre-trained language models are aligned to normative and descriptive occupational distributions. To this end, we use official demographic information about gender--occupation distributions provided by the national statistics agencies of France, Norway, United Kingdom, and the United States. We manually generate template-based sentences combining gendered pronouns and nouns with occupations, and subsequently probe a selection of ten language models covering the English, French, and Norwegian languages. The scoring system we introduce in this work is language independent, and can be used on any combination of template-based sentences, occupations, and languages. ",
    "path": "papers/23/04/2304.05764.json",
    "total_tokens": 823,
    "translated_title": "使用人口普查数据测量语言模型中的规范和描述性偏差",
    "translated_abstract": "本文研究了预训练语言模型中职业在性别方面的分布如何反映在模型中。这样的分布并不总是符合规范理想，也不一定反映现实中的描述评估。为了衡量预训练语言模型对规范和描述性职业分布的对齐程度，我们使用法国、挪威、英国和美国国家统计机构提供的有关性别-职业分布的官方人口普查信息。我们手动生成结合性别代词和名词以及职业的基于模板的句子，并随后探测英语、法语和挪威语的十种语言模型的选择。我们在本文中引入的评分系统是独立于语言的，可以用于任何基于模板的句子、职业和语言的组合。",
    "tldr": "本文介绍了一种在预训练语言模型中测量规范和描述性职业分布偏差的方法，并通过使用官方的人口普查数据来探测多种语言模型对齐程度。",
    "en_tdlr": "This paper introduces an approach for measuring normative and descriptive occupational distribution biases in pre-trained language models, by using official demographic information and a scoring system that is language independent."
}