{
    "title": "Learning to Tokenize for Generative Retrieval. (arXiv:2304.04171v1 [cs.IR])",
    "abstract": "Conventional document retrieval techniques are mainly based on the index-retrieve paradigm. It is challenging to optimize pipelines based on this paradigm in an end-to-end manner. As an alternative, generative retrieval represents documents as identifiers (docid) and retrieves documents by generating docids, enabling end-to-end modeling of document retrieval tasks. However, it is an open question how one should define the document identifiers. Current approaches to the task of defining document identifiers rely on fixed rule-based docids, such as the title of a document or the result of clustering BERT embeddings, which often fail to capture the complete semantic information of a document. We propose GenRet, a document tokenization learning method to address the challenge of defining document identifiers for generative retrieval. GenRet learns to tokenize documents into short discrete representations (i.e., docids) via a discrete auto-encoding approach. Three components are included in",
    "link": "http://arxiv.org/abs/2304.04171",
    "context": "Title: Learning to Tokenize for Generative Retrieval. (arXiv:2304.04171v1 [cs.IR])\nAbstract: Conventional document retrieval techniques are mainly based on the index-retrieve paradigm. It is challenging to optimize pipelines based on this paradigm in an end-to-end manner. As an alternative, generative retrieval represents documents as identifiers (docid) and retrieves documents by generating docids, enabling end-to-end modeling of document retrieval tasks. However, it is an open question how one should define the document identifiers. Current approaches to the task of defining document identifiers rely on fixed rule-based docids, such as the title of a document or the result of clustering BERT embeddings, which often fail to capture the complete semantic information of a document. We propose GenRet, a document tokenization learning method to address the challenge of defining document identifiers for generative retrieval. GenRet learns to tokenize documents into short discrete representations (i.e., docids) via a discrete auto-encoding approach. Three components are included in",
    "path": "papers/23/04/2304.04171.json",
    "total_tokens": 818,
    "translated_title": "学习生成检索的分词技术",
    "translated_abstract": "传统的文档检索技术主要基于索引检索范式，在端到端的优化流程中具有挑战性。作为替代方案，生成式检索将文档表示为标识符（docid），并通过生成docid来检索文档，实现了文档检索任务的端到端建模。然而，如何定义文档标识符仍是一个开放性问题。当前的方法依赖于基于固定规则的docid生成，如文档标题或聚类BERT嵌入的结果，但这种方法往往无法完整捕捉文档的语义信息。我们提出了一种名为GenRet的文档分词学习方法，以应对为生成检索定义文档标识符的挑战。GenRet通过离散自编码方法学习将文档分词为短离散表示（即docid）。该方法包括三个组成部分：",
    "tldr": "本论文提出了一个名为GenRet的文档分词学习方法，用于生成检索任务中的文档标识符定义，它能够更好地捕捉文档的语义信息。",
    "en_tdlr": "This paper proposes a document tokenization learning method, named GenRet, for defining document identifiers in generative retrieval tasks, which can better capture the semantic information of documents."
}