{
    "title": "Decoding Neural Activity to Assess Individual Latent State in Ecologically Valid Contexts. (arXiv:2304.09050v1 [q-bio.NC])",
    "abstract": "There exist very few ways to isolate cognitive processes, historically defined via highly controlled laboratory studies, in more ecologically valid contexts. Specifically, it remains unclear as to what extent patterns of neural activity observed under such constraints actually manifest outside the laboratory in a manner that can be used to make an accurate inference about the latent state, associated cognitive process, or proximal behavior of the individual. Improving our understanding of when and how specific patterns of neural activity manifest in ecologically valid scenarios would provide validation for laboratory-based approaches that study similar neural phenomena in isolation and meaningful insight into the latent states that occur during complex tasks. We argue that domain generalization methods from the brain-computer interface community have the potential to address this challenge. We previously used such an approach to decode phasic neural responses associated with visual tar",
    "link": "http://arxiv.org/abs/2304.09050",
    "context": "Title: Decoding Neural Activity to Assess Individual Latent State in Ecologically Valid Contexts. (arXiv:2304.09050v1 [q-bio.NC])\nAbstract: There exist very few ways to isolate cognitive processes, historically defined via highly controlled laboratory studies, in more ecologically valid contexts. Specifically, it remains unclear as to what extent patterns of neural activity observed under such constraints actually manifest outside the laboratory in a manner that can be used to make an accurate inference about the latent state, associated cognitive process, or proximal behavior of the individual. Improving our understanding of when and how specific patterns of neural activity manifest in ecologically valid scenarios would provide validation for laboratory-based approaches that study similar neural phenomena in isolation and meaningful insight into the latent states that occur during complex tasks. We argue that domain generalization methods from the brain-computer interface community have the potential to address this challenge. We previously used such an approach to decode phasic neural responses associated with visual tar",
    "path": "papers/23/04/2304.09050.json",
    "total_tokens": 848,
    "translated_title": "解码神经活动以评估个体在生态有效环境中的潜在状态",
    "translated_abstract": "历史上，仅有少量方法可以在更生态有效的情境下分离认知过程。特别地，目前尚不清楚在此类约束条件下观察到的神经活动模式实际上是否以一种可以用于准确推断个体潜在状态、相关认知过程或近端行为的方式在实验室外显现。改善我们对特定神经活动模式何时以及如何在生态有效情境中显现的理解，会验证在隔离环境下研究类似神经现象的实验室方法，并提供关于复杂任务期间发生的潜在状态的有意义洞察。我们认为，来自脑-计算机界面社区的领域通用方法有潜力解决这一挑战。我们以前使用了这样的方法来解码与视觉目标相关的突发神经反应。",
    "tldr": "此研究旨在在更为真实的环境中解码人类神经活动模式，以进一步理解复杂任务期间个体内部潜在状态，该方法能够验证实验室方法并提供有意义的洞察。",
    "en_tdlr": "This study aims to decode human neural activity patterns in more realistic environments in order to further understand the latent states of individuals during complex tasks. The method has the potential to validate laboratory approaches and provide meaningful insights."
}