{
    "title": "EigenFold: Generative Protein Structure Prediction with Diffusion Models. (arXiv:2304.02198v1 [q-bio.BM])",
    "abstract": "Protein structure prediction has reached revolutionary levels of accuracy on single structures, yet distributional modeling paradigms are needed to capture the conformational ensembles and flexibility that underlie biological function. Towards this goal, we develop EigenFold, a diffusion generative modeling framework for sampling a distribution of structures from a given protein sequence. We define a diffusion process that models the structure as a system of harmonic oscillators and which naturally induces a cascading-resolution generative process along the eigenmodes of the system. On recent CAMEO targets, EigenFold achieves a median TMScore of 0.84, while providing a more comprehensive picture of model uncertainty via the ensemble of sampled structures relative to existing methods. We then assess EigenFold's ability to model and predict conformational heterogeneity for fold-switching proteins and ligand-induced conformational change. Code is available at https://github.com/bjing2016/",
    "link": "http://arxiv.org/abs/2304.02198",
    "context": "Title: EigenFold: Generative Protein Structure Prediction with Diffusion Models. (arXiv:2304.02198v1 [q-bio.BM])\nAbstract: Protein structure prediction has reached revolutionary levels of accuracy on single structures, yet distributional modeling paradigms are needed to capture the conformational ensembles and flexibility that underlie biological function. Towards this goal, we develop EigenFold, a diffusion generative modeling framework for sampling a distribution of structures from a given protein sequence. We define a diffusion process that models the structure as a system of harmonic oscillators and which naturally induces a cascading-resolution generative process along the eigenmodes of the system. On recent CAMEO targets, EigenFold achieves a median TMScore of 0.84, while providing a more comprehensive picture of model uncertainty via the ensemble of sampled structures relative to existing methods. We then assess EigenFold's ability to model and predict conformational heterogeneity for fold-switching proteins and ligand-induced conformational change. Code is available at https://github.com/bjing2016/",
    "path": "papers/23/04/2304.02198.json",
    "total_tokens": 919,
    "translated_title": "EigenFold：扩散模型下的生成蛋白质结构预测",
    "translated_abstract": "单个结构的蛋白质结构预测已经达到了革命性的准确度，但需要分布式建模范式以捕捉支配生物功能的构象集合和灵活性。为实现这一目标，我们开发了EigenFold，一种扩散生成建模框架，用于从给定的蛋白质序列中采样结构的分布。我们定义了一个扩散过程，将结构建模为谐振子系统，并自然地沿着系统的本征模式诱导出一种级联分辨率生成过程。在最近的CAMEO目标中，EigenFold达到了0.84的中位TMScore，相对于现有方法，提供了更全面的模型不确定性的结构集合。然后我们评估了EigenFold对于折叠转换蛋白和配体诱导构象变化的建模和预测能力。代码可在https://github.com/bjing2016/获得。",
    "tldr": "EigenFold是一种生成模型，利用扩散模型从蛋白质序列中采样结构分布集合，达到了较高的TMScore并提供了更全面的模型不确定性。它能有效地建模和预测折叠转换蛋白和配体诱导构象变化。",
    "en_tdlr": "EigenFold is a generative model that utilizes diffusion process to sample the distribution of protein structures from a given sequence. It achieves high TMScore and provides a more comprehensive picture of model uncertainty. EigenFold also demonstrates a strong ability to model and predict conformational heterogeneity for fold-switching proteins and ligand-induced conformational changes."
}