{
    "title": "Learning Cellular Coverage from Real Network Configurations using GNNs. (arXiv:2304.10328v1 [cs.NI])",
    "abstract": "Cellular coverage quality estimation has been a critical task for self-organized networks. In real-world scenarios, deep-learning-powered coverage quality estimation methods cannot scale up to large areas due to little ground truth can be provided during network design & optimization. In addition they fall short in produce expressive embeddings to adequately capture the variations of the cells' configurations. To deal with this challenge, we formulate the task in a graph representation and so that we can apply state-of-the-art graph neural networks, that show exemplary performance. We propose a novel training framework that can both produce quality cell configuration embeddings for estimating multiple KPIs, while we show it is capable of generalising to large (area-wide) scenarios given very few labeled cells. We show that our framework yields comparable accuracy with models that have been trained using massively labeled samples.",
    "link": "http://arxiv.org/abs/2304.10328",
    "context": "Title: Learning Cellular Coverage from Real Network Configurations using GNNs. (arXiv:2304.10328v1 [cs.NI])\nAbstract: Cellular coverage quality estimation has been a critical task for self-organized networks. In real-world scenarios, deep-learning-powered coverage quality estimation methods cannot scale up to large areas due to little ground truth can be provided during network design & optimization. In addition they fall short in produce expressive embeddings to adequately capture the variations of the cells' configurations. To deal with this challenge, we formulate the task in a graph representation and so that we can apply state-of-the-art graph neural networks, that show exemplary performance. We propose a novel training framework that can both produce quality cell configuration embeddings for estimating multiple KPIs, while we show it is capable of generalising to large (area-wide) scenarios given very few labeled cells. We show that our framework yields comparable accuracy with models that have been trained using massively labeled samples.",
    "path": "papers/23/04/2304.10328.json",
    "total_tokens": 912,
    "translated_title": "利用图神经网络从实际网络配置中学习蜂窝网络覆盖",
    "translated_abstract": "蜂窝覆盖质量估计是自组织网络中的关键任务。在实际场景中，由于在网络设计和优化期间很少提供确定的基础事实，深度学习支持的覆盖质量估计方法无法扩展到大面积，此外，他们无法生成表达能力强的嵌入以充分捕捉单元格配置的变化。为了应对这一挑战，我们在图形表示中表述该任务，以便我们可以应用表现出色的最新图神经网络。我们提出了一种新颖的训练框架，既可以生成多个KPI的质量单元格配置嵌入，同时我们显示它能够推广到大型（面向区域）场景，给出非常少的标记单元格。我们证明，我们的框架与使用大量标记样本进行训练的模型具有可比较的准确性。",
    "tldr": "本论文提出了一种新颖的训练框架，在图形表示中表述学习蜂窝网络覆盖的任务，应用了最新的图神经网络。该框架既可以生成多个KPI的质量单元格配置嵌入，同时能够推广到大型（面向区域）场景，给出非常少的标记单元格。",
    "en_tdlr": "This paper proposes a novel training framework for learning cellular network coverage, represented in a graph structure and using state-of-the-art graph neural networks. The framework generates quality cell configuration embeddings to estimate multiple KPIs and can generalize to large area-wide scenarios with very few labeled cells while achieving comparable accuracy with models trained using massively labeled samples."
}