{
    "title": "Latent Fingerprint Recognition: Fusion of Local and Global Embeddings. (arXiv:2304.13800v1 [cs.CV])",
    "abstract": "One of the most challenging problems in fingerprint recognition continues to be establishing the identity of a suspect associated with partial and smudgy fingerprints left at a crime scene (i.e., latent prints or fingermarks). Despite the success of fixed-length embeddings for rolled and slap fingerprint recognition, the features learned for latent fingerprint matching have mostly been limited to local minutiae-based embeddings and have not directly leveraged global representations for matching. In this paper, we combine global embeddings with local embeddings for state-of-the-art latent to rolled matching accuracy with high throughput. The combination of both local and global representations leads to improved recognition accuracy across NIST SD 27, NIST SD 302, MSP, MOLF DB1/DB4, and MOLF DB2/DB4 latent fingerprint datasets for both closed-set (84.11%, 54.36%, 84.35%, 70.43%, 62.86% rank-1 retrieval rate, respectively) and open-set (0.50, 0.74, 0.44, 0.60, 0.68 FNIR at FPIR=0.02, resp",
    "link": "http://arxiv.org/abs/2304.13800",
    "context": "Title: Latent Fingerprint Recognition: Fusion of Local and Global Embeddings. (arXiv:2304.13800v1 [cs.CV])\nAbstract: One of the most challenging problems in fingerprint recognition continues to be establishing the identity of a suspect associated with partial and smudgy fingerprints left at a crime scene (i.e., latent prints or fingermarks). Despite the success of fixed-length embeddings for rolled and slap fingerprint recognition, the features learned for latent fingerprint matching have mostly been limited to local minutiae-based embeddings and have not directly leveraged global representations for matching. In this paper, we combine global embeddings with local embeddings for state-of-the-art latent to rolled matching accuracy with high throughput. The combination of both local and global representations leads to improved recognition accuracy across NIST SD 27, NIST SD 302, MSP, MOLF DB1/DB4, and MOLF DB2/DB4 latent fingerprint datasets for both closed-set (84.11%, 54.36%, 84.35%, 70.43%, 62.86% rank-1 retrieval rate, respectively) and open-set (0.50, 0.74, 0.44, 0.60, 0.68 FNIR at FPIR=0.02, resp",
    "path": "papers/23/04/2304.13800.json",
    "total_tokens": 803,
    "translated_title": "潜指纹识别：局部和全局嵌入的融合",
    "translated_abstract": "在指纹识别中，一个最具挑战性的问题是确定与犯罪现场留下的部分和模糊的指纹（即潜指纹或指纹痕迹）相关联的嫌疑人身份。本文将全局嵌入与局部嵌入相结合，为潜在卷积和拍打指纹匹配提供了最先进的准确率和高吞吐量。这种局部和全局表示的组合使识别准确率在NIST SD 27、NIST SD 302、MSP、MOLF DB1/DB4和MOLF DB2/DB4潜指纹数据集上都得到了显着提高。",
    "tldr": "本文采用全局嵌入与局部嵌入相结合的方法，在提高识别准确率的同时，保证了较高的吞吐量和应用性。",
    "en_tdlr": "This paper proposes a fusion of global and local embeddings for latent fingerprint recognition, improving recognition accuracy while maintaining high throughput and applicability."
}