{
    "title": "A Data Fusion Framework for Multi-Domain Morality Learning. (arXiv:2304.02144v1 [cs.CL])",
    "abstract": "Language models can be trained to recognize the moral sentiment of text, creating new opportunities to study the role of morality in human life. As interest in language and morality has grown, several ground truth datasets with moral annotations have been released. However, these datasets vary in the method of data collection, domain, topics, instructions for annotators, etc. Simply aggregating such heterogeneous datasets during training can yield models that fail to generalize well. We describe a data fusion framework for training on multiple heterogeneous datasets that improve performance and generalizability. The model uses domain adversarial training to align the datasets in feature space and a weighted loss function to deal with label shift. We show that the proposed framework achieves state-of-the-art performance in different datasets compared to prior works in morality inference.",
    "link": "http://arxiv.org/abs/2304.02144",
    "context": "Title: A Data Fusion Framework for Multi-Domain Morality Learning. (arXiv:2304.02144v1 [cs.CL])\nAbstract: Language models can be trained to recognize the moral sentiment of text, creating new opportunities to study the role of morality in human life. As interest in language and morality has grown, several ground truth datasets with moral annotations have been released. However, these datasets vary in the method of data collection, domain, topics, instructions for annotators, etc. Simply aggregating such heterogeneous datasets during training can yield models that fail to generalize well. We describe a data fusion framework for training on multiple heterogeneous datasets that improve performance and generalizability. The model uses domain adversarial training to align the datasets in feature space and a weighted loss function to deal with label shift. We show that the proposed framework achieves state-of-the-art performance in different datasets compared to prior works in morality inference.",
    "path": "papers/23/04/2304.02144.json",
    "total_tokens": 838,
    "translated_title": "多领域道德学习的数据融合框架",
    "translated_abstract": "语言模型可以被训练用于识别文本中的道德情感，从而创造了研究道德在人类生活中扮演角色的新机会。然而，这种类型的数据集往往因为数据采集方法、领域、主题、标注者说明等方面的差异而存在异质性。简单地在训练中聚合多个这种异质性的数据集可能导致模型泛化能力不佳。因此，本文提出了一种多个异质性数据集联合训练的数据融合框架，采用领域对抗训练使得数据集在特征空间中对齐，同时用加权损失函数来处理标签偏移。实验结果表明，与先前的研究成果相比，提出的框架在不同数据集上实现了最先进的效果。",
    "tldr": "本文提出了一个用于训练多个异质性数据集的数据融合框架，并在对齐数据集特征空间和处理标签偏移方面做了优化。实验证明，该框架在道德推断方面取得了先进的效果。",
    "en_tdlr": "We propose a data fusion framework for training on multiple heterogeneous datasets, which aligns datasets in feature space and deals with label shift using a weighted loss function. Experimental results demonstrate that the proposed framework achieves state-of-the-art performance in morality inference."
}