{
    "title": "Customized Load Profiles Synthesis for Electricity Customers Based on Conditional Diffusion Models",
    "abstract": "Customers' load profiles are critical resources to support data analytics applications in modern power systems. However, there are usually insufficient historical load profiles for data analysis, due to the collection cost and data privacy issues. To address such data shortage problems, load profiles synthesis is an effective technique that provides synthetic training data for customers to build high-performance data-driven models. Nonetheless, it is still challenging to synthesize high-quality load profiles for each customer using generation models trained by the respective customer's data owing to the high heterogeneity of customer load. In this paper, we propose a novel customized load profiles synthesis method based on conditional diffusion models for heterogeneous customers. Specifically, we first convert the customized synthesis into a conditional data generation issue. We then extend traditional diffusion models to conditional diffusion models to realize conditional data generat",
    "link": "https://arxiv.org/abs/2304.12076",
    "context": "Title: Customized Load Profiles Synthesis for Electricity Customers Based on Conditional Diffusion Models\nAbstract: Customers' load profiles are critical resources to support data analytics applications in modern power systems. However, there are usually insufficient historical load profiles for data analysis, due to the collection cost and data privacy issues. To address such data shortage problems, load profiles synthesis is an effective technique that provides synthetic training data for customers to build high-performance data-driven models. Nonetheless, it is still challenging to synthesize high-quality load profiles for each customer using generation models trained by the respective customer's data owing to the high heterogeneity of customer load. In this paper, we propose a novel customized load profiles synthesis method based on conditional diffusion models for heterogeneous customers. Specifically, we first convert the customized synthesis into a conditional data generation issue. We then extend traditional diffusion models to conditional diffusion models to realize conditional data generat",
    "path": "papers/23/04/2304.12076.json",
    "total_tokens": 820,
    "translated_title": "基于条件扩散模型的电力客户定制负荷曲线合成",
    "translated_abstract": "客户的负荷曲线是支持现代电力系统数据分析应用的关键资源。然而，由于采集成本和数据隐私问题，通常会缺乏足够的历史负荷曲线进行数据分析。为了解决数据短缺问题，负荷曲线合成是一种有效的技术，为客户提供合成的训练数据，以建立高性能的数据驱动模型。然而，由于客户负荷的高异质性，使用基于各自客户数据训练的生成模型合成高质量的负荷曲线仍然具有挑战性。在本文中，我们提出了一种新颖的基于条件扩散模型的定制负荷曲线合成方法，用于异构客户。具体而言，我们首先将定制合成转化为条件数据生成问题。然后，我们扩展传统的扩散模型为条件扩散模型，实现条件数据生成。",
    "tldr": "本文提出了一种基于条件扩散模型的定制负荷曲线合成方法，用于解决电力客户的数据短缺问题，并实现高质量负荷曲线的合成。",
    "en_tdlr": "This paper proposes a method for customized load profiles synthesis based on conditional diffusion models to address the data shortage issue in electricity customers and achieve high-quality load profiles synthesis."
}