{
    "title": "Multilevel CNNs for Parametric PDEs. (arXiv:2304.00388v1 [cs.LG])",
    "abstract": "We combine concepts from multilevel solvers for partial differential equations (PDEs) with neural network based deep learning and propose a new methodology for the efficient numerical solution of high-dimensional parametric PDEs. An in-depth theoretical analysis shows that the proposed architecture is able to approximate multigrid V-cycles to arbitrary precision with the number of weights only depending logarithmically on the resolution of the finest mesh. As a consequence, approximation bounds for the solution of parametric PDEs by neural networks that are independent on the (stochastic) parameter dimension can be derived. The performance of the proposed method is illustrated on high-dimensional parametric linear elliptic PDEs that are common benchmark problems in uncertainty quantification. We find substantial improvements over state-of-the-art deep learning-based solvers. As particularly challenging examples, random conductivity with high-dimensional non-affine Gaussian fields in 10",
    "link": "http://arxiv.org/abs/2304.00388",
    "context": "Title: Multilevel CNNs for Parametric PDEs. (arXiv:2304.00388v1 [cs.LG])\nAbstract: We combine concepts from multilevel solvers for partial differential equations (PDEs) with neural network based deep learning and propose a new methodology for the efficient numerical solution of high-dimensional parametric PDEs. An in-depth theoretical analysis shows that the proposed architecture is able to approximate multigrid V-cycles to arbitrary precision with the number of weights only depending logarithmically on the resolution of the finest mesh. As a consequence, approximation bounds for the solution of parametric PDEs by neural networks that are independent on the (stochastic) parameter dimension can be derived. The performance of the proposed method is illustrated on high-dimensional parametric linear elliptic PDEs that are common benchmark problems in uncertainty quantification. We find substantial improvements over state-of-the-art deep learning-based solvers. As particularly challenging examples, random conductivity with high-dimensional non-affine Gaussian fields in 10",
    "path": "papers/23/04/2304.00388.json",
    "total_tokens": 988,
    "translated_title": "参数化PDE的多级CNN",
    "translated_abstract": "我们将部分微分方程（PDEs）的多级求解器的概念与基于神经网络的深度学习相结合，提出一种新的解决高维参数PDEs的有效数值方法。理论分析表明，该架构能够以任意精度近似多重网格V循环，其权重数量仅与最细网格的分辨率对数有关，这种方法有实质性的改进。",
    "tldr": "该论文提出了一种用于有效数值解决参数化PDEs的多级CNN方法，有实质性的改进并能以任意精度近似多重网格V循环。",
    "en_tdlr": "This paper proposes a multilevel CNN method for efficient numerical solution of parameterized PDEs, with substantial improvements over existing deep learning-based solvers and the ability to approximate multigrid V-cycles with arbitrary precision."
}