{
    "title": "A Forward and Backward Compatible Framework for Few-shot Class-incremental Pill Recognition",
    "abstract": "arXiv:2304.11959v2 Announce Type: replace-cross  Abstract: Automatic Pill Recognition (APR) systems are crucial for enhancing hospital efficiency, assisting visually impaired individuals, and preventing cross-infection. However, most existing deep learning-based pill recognition systems can only perform classification on classes with sufficient training data. In practice, the high cost of data annotation and the continuous increase in new pill classes necessitate the development of a few-shot class-incremental pill recognition system. This paper introduces the first few-shot class-incremental pill recognition framework, named Discriminative and Bidirectional Compatible Few-Shot Class-Incremental Learning (DBC-FSCIL). It encompasses forward-compatible and backward-compatible learning components. In forward-compatible learning, we propose an innovative virtual class synthesis strategy and a Center-Triplet (CT) loss to enhance discriminative feature learning. These virtual classes serve a",
    "link": "https://arxiv.org/abs/2304.11959",
    "context": "Title: A Forward and Backward Compatible Framework for Few-shot Class-incremental Pill Recognition\nAbstract: arXiv:2304.11959v2 Announce Type: replace-cross  Abstract: Automatic Pill Recognition (APR) systems are crucial for enhancing hospital efficiency, assisting visually impaired individuals, and preventing cross-infection. However, most existing deep learning-based pill recognition systems can only perform classification on classes with sufficient training data. In practice, the high cost of data annotation and the continuous increase in new pill classes necessitate the development of a few-shot class-incremental pill recognition system. This paper introduces the first few-shot class-incremental pill recognition framework, named Discriminative and Bidirectional Compatible Few-Shot Class-Incremental Learning (DBC-FSCIL). It encompasses forward-compatible and backward-compatible learning components. In forward-compatible learning, we propose an innovative virtual class synthesis strategy and a Center-Triplet (CT) loss to enhance discriminative feature learning. These virtual classes serve a",
    "path": "papers/23/04/2304.11959.json",
    "total_tokens": 866,
    "translated_title": "一种前向和后向兼容的少样本类增量药丸识别框架",
    "translated_abstract": "自动药丸识别（APR）系统对于提高医院效率、帮助视力受损个体，并预防交叉感染至关重要。然而，大多数现有的基于深度学习的药丸识别系统只能对具有足够训练数据的类别进行分类。在实践中，数据标注的高成本和新药丸类别持续增加的情况需要开发一种少样本类增量药丸识别系统。本文介绍了第一个少样本类增量药丸识别框架，名为具有前向和后向兼容的辨别式少样本类增量学习（DBC-FSCIL）。它包括前向兼容和后向兼容的学习组件。在前向兼容学习中，我们提出了一种创新的虚拟类别合成策略和一个中心三元组（CT）损失来增强辨别特征学习。这些虚拟类别起到了",
    "tldr": "提出了一种前向和后向兼容的少样本类增量药丸识别框架，包括虚拟类别合成策略和中心三元组损失以增强辨别特征学习。",
    "en_tdlr": "Proposed a forward and backward compatible framework for few-shot class-incremental pill recognition, incorporating a virtual class synthesis strategy and Center-Triplet loss to enhance discriminative feature learning."
}