{
    "title": "PAXQA: Generating Cross-lingual Question Answering Examples at Training Scale. (arXiv:2304.12206v2 [cs.CL] UPDATED)",
    "abstract": "Existing question answering (QA) systems owe much of their success to large, high-quality training data. Such annotation efforts are costly, and the difficulty compounds in the cross-lingual setting. Therefore, prior cross-lingual QA work has focused on releasing evaluation datasets, and then applying zero-shot methods as baselines. This work proposes a synthetic data generation method for cross-lingual QA which leverages indirect supervision from existing parallel corpora. Our method termed PAXQA (Projecting annotations for cross-lingual (x) QA) decomposes cross-lingual QA into two stages. First, we apply a question generation (QG) model to the English side. Second, we apply annotation projection to translate both the questions and answers. To better translate questions, we propose a novel use of lexically-constrained machine translation, in which constrained entities are extracted from the parallel bitexts.  We apply PAXQA to generate cross-lingual QA examples in 4 languages (662K ex",
    "link": "http://arxiv.org/abs/2304.12206",
    "context": "Title: PAXQA: Generating Cross-lingual Question Answering Examples at Training Scale. (arXiv:2304.12206v2 [cs.CL] UPDATED)\nAbstract: Existing question answering (QA) systems owe much of their success to large, high-quality training data. Such annotation efforts are costly, and the difficulty compounds in the cross-lingual setting. Therefore, prior cross-lingual QA work has focused on releasing evaluation datasets, and then applying zero-shot methods as baselines. This work proposes a synthetic data generation method for cross-lingual QA which leverages indirect supervision from existing parallel corpora. Our method termed PAXQA (Projecting annotations for cross-lingual (x) QA) decomposes cross-lingual QA into two stages. First, we apply a question generation (QG) model to the English side. Second, we apply annotation projection to translate both the questions and answers. To better translate questions, we propose a novel use of lexically-constrained machine translation, in which constrained entities are extracted from the parallel bitexts.  We apply PAXQA to generate cross-lingual QA examples in 4 languages (662K ex",
    "path": "papers/23/04/2304.12206.json",
    "total_tokens": 954,
    "translated_title": "PAXQA: 在训练规模上生成跨语言问答样例",
    "translated_abstract": "现有的问答系统的成功很大程度上归功于大规模、高质量的训练数据。 这种标注工作成本高，并且在跨语言环境中难度增加。 因此，之前的跨语言问答研究主要集中在发布评估数据集，然后将零-shot方法作为基准应用。 本研究提出了一种用于跨语言问答的合成数据生成方法，该方法利用现有平行语料库中的间接监督。 我们的方法称为PAXQA（跨语言(x) QA的投影注释），将跨语言问答分解为两个阶段。 首先，我们将问题生成（QG）模型应用于英文侧面。 然后，我们应用注释投影来翻译问题和答案。 为了更好地翻译问题，我们提出了一种新的词汇约束机器翻译的用法，其中从平行双文本中提取约束实体。 我们将PAXQA应用于4种语言（662K ex）的跨语言问答样例生成。",
    "tldr": "PAXQA提出了一种使用现有平行语料库生成跨语言问答样例的方法，通过将问题生成模型和注释投影相结合，以更好地进行问题翻译和回答翻译。该方法在4种语言中生成了662K个例子。"
}