{
    "title": "GPT-4 to GPT-3.5: 'Hold My Scalpel' -- A Look at the Competency of OpenAI's GPT on the Plastic Surgery In-Service Training Exam. (arXiv:2304.01503v1 [cs.AI])",
    "abstract": "The Plastic Surgery In-Service Training Exam (PSITE) is an important indicator of resident proficiency and serves as a useful benchmark for evaluating OpenAI's GPT. Unlike many of the simulated tests or practice questions shown in the GPT-4 Technical Paper, the multiple-choice questions evaluated here are authentic PSITE questions. These questions offer realistic clinical vignettes that a plastic surgeon commonly encounters in practice and scores highly correlate with passing the written boards required to become a Board Certified Plastic Surgeon. Our evaluation shows dramatic improvement of GPT-4 (without vision) over GPT-3.5 with both the 2022 and 2021 exams respectively increasing the score from 8th to 88th percentile and 3rd to 99th percentile. The final results of the 2023 PSITE are set to be released on April 11, 2023, and this is an exciting moment to continue our research with a fresh exam. Our evaluation pipeline is ready for the moment that the exam is released so long as we ",
    "link": "http://arxiv.org/abs/2304.01503",
    "context": "Title: GPT-4 to GPT-3.5: 'Hold My Scalpel' -- A Look at the Competency of OpenAI's GPT on the Plastic Surgery In-Service Training Exam. (arXiv:2304.01503v1 [cs.AI])\nAbstract: The Plastic Surgery In-Service Training Exam (PSITE) is an important indicator of resident proficiency and serves as a useful benchmark for evaluating OpenAI's GPT. Unlike many of the simulated tests or practice questions shown in the GPT-4 Technical Paper, the multiple-choice questions evaluated here are authentic PSITE questions. These questions offer realistic clinical vignettes that a plastic surgeon commonly encounters in practice and scores highly correlate with passing the written boards required to become a Board Certified Plastic Surgeon. Our evaluation shows dramatic improvement of GPT-4 (without vision) over GPT-3.5 with both the 2022 and 2021 exams respectively increasing the score from 8th to 88th percentile and 3rd to 99th percentile. The final results of the 2023 PSITE are set to be released on April 11, 2023, and this is an exciting moment to continue our research with a fresh exam. Our evaluation pipeline is ready for the moment that the exam is released so long as we ",
    "path": "papers/23/04/2304.01503.json",
    "total_tokens": 1085,
    "translated_title": "从 GPT-4 到 GPT-3.5：“拿起我的手术刀”——评估 OpenAI 的 GPT 在整形外科住院医师培训考试中的能力",
    "translated_abstract": "整形外科住院医师培训考试 (PSITE) 是评估住院医师熟练程度的重要指标，也是评估 OpenAI 的 GPT 的有用基准。与 GPT-4 技术文章中展示的许多模拟测试或练习题不同，这里评估的多项选择题是真实的 PSITE 问题。这些问题提供了整形外科医生在实践中经常遇到的现实临床案例，得分高度相关于通过成为获得认证的整形外科医生所需的书面考试。我们的评估显示，GPT-4（没有视觉）相对于 GPT-3.5 有了显著的提高，分别将 2022 年和 2021 年的考试得分从第 8 百分位数提高到第 88 百分位数和第 3 百分位数提高到第 99 百分位数。2023 年的 PSITE 的最终结果将于 2023 年 4 月 11 日公布，这是一个令人兴奋的时刻，我们将继续进行研究并使用新的考试进行评估。我们的评估流程已准备就绪，只要考试发布，我们就可以立刻进行评估。",
    "tldr": "本研究评估了 OpenAI 的 GPT 在整形外科住院医师培训考试上的能力，发现相比于 GPT-3.5，GPT-4 有了显著提高。考试得分与成为获得认证的整形外科医生所需的书面考试高度相关。",
    "en_tdlr": "This study evaluates the competency of OpenAI's GPT on the Plastic Surgery In-Service Training Exam and finds a significant improvement of GPT-4 over GPT-3.5. The exam scores highly correlate with passing the written boards required to become a Board Certified Plastic Surgeon."
}