{
    "title": "Neural Lumped Parameter Differential Equations with Application in Friction-Stir Processing. (arXiv:2304.09047v1 [cs.LG])",
    "abstract": "Lumped parameter methods aim to simplify the evolution of spatially-extended or continuous physical systems to that of a \"lumped\" element representative of the physical scales of the modeled system. For systems where the definition of a lumped element or its associated physics may be unknown, modeling tasks may be restricted to full-fidelity simulations of the physics of a system. In this work, we consider data-driven modeling tasks with limited point-wise measurements of otherwise continuous systems. We build upon the notion of the Universal Differential Equation (UDE) to construct data-driven models for reducing dynamics to that of a lumped parameter and inferring its properties. The flexibility of UDEs allow for composing various known physical priors suitable for application-specific modeling tasks, including lumped parameter methods. The motivating example for this work is the plunge and dwell stages for friction-stir welding; specifically, (i) mapping power input into the tool to",
    "link": "http://arxiv.org/abs/2304.09047",
    "context": "Title: Neural Lumped Parameter Differential Equations with Application in Friction-Stir Processing. (arXiv:2304.09047v1 [cs.LG])\nAbstract: Lumped parameter methods aim to simplify the evolution of spatially-extended or continuous physical systems to that of a \"lumped\" element representative of the physical scales of the modeled system. For systems where the definition of a lumped element or its associated physics may be unknown, modeling tasks may be restricted to full-fidelity simulations of the physics of a system. In this work, we consider data-driven modeling tasks with limited point-wise measurements of otherwise continuous systems. We build upon the notion of the Universal Differential Equation (UDE) to construct data-driven models for reducing dynamics to that of a lumped parameter and inferring its properties. The flexibility of UDEs allow for composing various known physical priors suitable for application-specific modeling tasks, including lumped parameter methods. The motivating example for this work is the plunge and dwell stages for friction-stir welding; specifically, (i) mapping power input into the tool to",
    "path": "papers/23/04/2304.09047.json",
    "total_tokens": 872,
    "translated_title": "应用于摩擦搅拌加工的神经元集参数微分方程",
    "translated_abstract": "集参数方法旨在将空间扩展或连续物理系统的演变简化为代表建模系统的物理尺度的“集中”元素的演变。对于定义集中元素或其关联物理学可能未知的系统，建模任务可能仅限于系统物理的全保真模拟。在本文中，我们考虑具有有限点测量的数据驱动建模任务的连续系统，并建立在通用微分方程（UDE）的概念上，以构建数据驱动模型，将动力学减少到一个集中参数，并推断其性质。UDE的灵活性允许组成适用于特定应用的建模任务的各种已知物理先验，包括集参数方法。这项工作的动机是摩擦搅拌焊接的沉头和停留阶段;具体地，将功率输入映射到工具中，然后推断所使用的集中参数建模。",
    "tldr": "本文提出使用通用微分方程（UDE）构建数据驱动模型以简化系统动力学到一个集中参数。应用于摩擦搅拌焊接中的沉头和停留阶段的建模任务中。",
    "en_tdlr": "This paper proposes using Universal Differential Equations (UDE) to construct data-driven models that simplify the dynamics of a system to a lumped parameter, with a specific application to the plunge and dwell stages of friction-stir welding."
}