{
    "title": "Amplifying Sine Unit: An Oscillatory Activation Function for Deep Neural Networks to Recover Nonlinear Oscillations Efficiently. (arXiv:2304.09759v1 [cs.LG])",
    "abstract": "Many industrial and real life problems exhibit highly nonlinear periodic behaviors and the conventional methods may fall short of finding their analytical or closed form solutions. Such problems demand some cutting edge computational tools with increased functionality and reduced cost. Recently, deep neural networks have gained massive research interest due to their ability to handle large data and universality to learn complex functions. In this work, we put forward a methodology based on deep neural networks with responsive layers structure to deal nonlinear oscillations in microelectromechanical systems. We incorporated some oscillatory and non oscillatory activation functions such as growing cosine unit known as GCU, Sine, Mish and Tanh in our designed network to have a comprehensive analysis on their performance for highly nonlinear and vibrational problems. Integrating oscillatory activation functions with deep neural networks definitely outperform in predicting the periodic patt",
    "link": "http://arxiv.org/abs/2304.09759",
    "context": "Title: Amplifying Sine Unit: An Oscillatory Activation Function for Deep Neural Networks to Recover Nonlinear Oscillations Efficiently. (arXiv:2304.09759v1 [cs.LG])\nAbstract: Many industrial and real life problems exhibit highly nonlinear periodic behaviors and the conventional methods may fall short of finding their analytical or closed form solutions. Such problems demand some cutting edge computational tools with increased functionality and reduced cost. Recently, deep neural networks have gained massive research interest due to their ability to handle large data and universality to learn complex functions. In this work, we put forward a methodology based on deep neural networks with responsive layers structure to deal nonlinear oscillations in microelectromechanical systems. We incorporated some oscillatory and non oscillatory activation functions such as growing cosine unit known as GCU, Sine, Mish and Tanh in our designed network to have a comprehensive analysis on their performance for highly nonlinear and vibrational problems. Integrating oscillatory activation functions with deep neural networks definitely outperform in predicting the periodic patt",
    "path": "papers/23/04/2304.09759.json",
    "total_tokens": 986,
    "translated_title": "增幅正弦单元：一种用于恢复非线性振荡的深度神经网络震荡激活函数",
    "translated_abstract": "许多工业和现实生活中的问题表现出高度非线性的周期行为，传统方法可能无法找到它们的解析或闭合形式解决方案。这些问题需求一些前沿的计算工具，具有增强的功能性和降低成本。近年来，由于其处理大数据和学习复杂函数的普适性，深度神经网络已经引起了大量的研究兴趣。在本文中，我们提出了一种基于响应性层结构的深度神经网络的方法，用于处理微机电系统中的非线性振荡。我们在设计的网络中结合了一些振荡和非振荡激活函数，如Growing Cosine Unit（GCU）、Sine、Mish和Tanh，以对它们在高度非线性和振动问题的性能进行全面分析。将振荡激活函数与深度神经网络集成，可以以高精度和效率预测周期性模式。我们提出的激活函数称为增幅正弦单元（ASU），在各种基准问题上进行测试时，显示出显着的改进。",
    "tldr": "这篇论文介绍了一种能够处理微机电系统中非线性振荡的神经网络方法，使用一种名为增幅正弦单元（ASU）的新型脉冲函数明显优于其他激活函数。",
    "en_tdlr": "This paper presents a neural network technique for handling nonlinear oscillations in microelectromechanical systems, and introduces a new type of activation function called Amplifying Sine Unit (ASU) that outperforms other activation functions in predicting periodic patterns with high accuracy and efficiency."
}