{
    "title": "High-Fidelity Clothed Avatar Reconstruction from a Single Image. (arXiv:2304.03903v1 [cs.CV])",
    "abstract": "This paper presents a framework for efficient 3D clothed avatar reconstruction. By combining the advantages of the high accuracy of optimization-based methods and the efficiency of learning-based methods, we propose a coarse-to-fine way to realize a high-fidelity clothed avatar reconstruction (CAR) from a single image. At the first stage, we use an implicit model to learn the general shape in the canonical space of a person in a learning-based way, and at the second stage, we refine the surface detail by estimating the non-rigid deformation in the posed space in an optimization way. A hyper-network is utilized to generate a good initialization so that the convergence o f the optimization process is greatly accelerated. Extensive experiments on various datasets show that the proposed CAR successfully produces high-fidelity avatars for arbitrarily clothed humans in real scenes.",
    "link": "http://arxiv.org/abs/2304.03903",
    "context": "Title: High-Fidelity Clothed Avatar Reconstruction from a Single Image. (arXiv:2304.03903v1 [cs.CV])\nAbstract: This paper presents a framework for efficient 3D clothed avatar reconstruction. By combining the advantages of the high accuracy of optimization-based methods and the efficiency of learning-based methods, we propose a coarse-to-fine way to realize a high-fidelity clothed avatar reconstruction (CAR) from a single image. At the first stage, we use an implicit model to learn the general shape in the canonical space of a person in a learning-based way, and at the second stage, we refine the surface detail by estimating the non-rigid deformation in the posed space in an optimization way. A hyper-network is utilized to generate a good initialization so that the convergence o f the optimization process is greatly accelerated. Extensive experiments on various datasets show that the proposed CAR successfully produces high-fidelity avatars for arbitrarily clothed humans in real scenes.",
    "path": "papers/23/04/2304.03903.json",
    "total_tokens": 792,
    "translated_title": "一张图像生成高保真度着装人物的三维重建",
    "translated_abstract": "本文提出了一种高效的三维着装人物重建框架。将基于优化的方法的高精度与基于学习的方法的高效率相结合，我们提出了一种从单张图像实现高保真度着装人物重建的粗到精的方法。在第一阶段中，我们利用隐式模型以学习的方式在人物的规范空间中学习一般形状，第二阶段则通过在变形空间中估计非刚性变形来细化表面细节。一个超级网络被用来生成良好的初始化参数，从而大大加快优化过程的收敛速度。在各种数据集上的广泛实验表明，所提出的方法成功地从现实场景中的任意着装人物中生成了高保真度的三维人物。",
    "tldr": "本文提出了一种基于优化和学习相结合的高效三维着装人物重建框架，能够从单张图像中生成高保真度的三维人物。",
    "en_tdlr": "This paper proposes an efficient framework for 3D clothed avatar reconstruction by combining optimization-based and learning-based methods, which can generate high-fidelity 3D avatars from a single image."
}