{
    "title": "Making Video Quality Assessment Models Robust to Bit Depth. (arXiv:2304.13092v1 [eess.IV])",
    "abstract": "We introduce a novel feature set, which we call HDRMAX features, that when included into Video Quality Assessment (VQA) algorithms designed for Standard Dynamic Range (SDR) videos, sensitizes them to distortions of High Dynamic Range (HDR) videos that are inadequately accounted for by these algorithms. While these features are not specific to HDR, and also augment the equality prediction performances of VQA models on SDR content, they are especially effective on HDR. HDRMAX features modify powerful priors drawn from Natural Video Statistics (NVS) models by enhancing their measurability where they visually impact the brightest and darkest local portions of videos, thereby capturing distortions that are often poorly accounted for by existing VQA models. As a demonstration of the efficacy of our approach, we show that, while current state-of-the-art VQA models perform poorly on 10-bit HDR databases, their performances are greatly improved by the inclusion of HDRMAX features when tested on",
    "link": "http://arxiv.org/abs/2304.13092",
    "context": "Title: Making Video Quality Assessment Models Robust to Bit Depth. (arXiv:2304.13092v1 [eess.IV])\nAbstract: We introduce a novel feature set, which we call HDRMAX features, that when included into Video Quality Assessment (VQA) algorithms designed for Standard Dynamic Range (SDR) videos, sensitizes them to distortions of High Dynamic Range (HDR) videos that are inadequately accounted for by these algorithms. While these features are not specific to HDR, and also augment the equality prediction performances of VQA models on SDR content, they are especially effective on HDR. HDRMAX features modify powerful priors drawn from Natural Video Statistics (NVS) models by enhancing their measurability where they visually impact the brightest and darkest local portions of videos, thereby capturing distortions that are often poorly accounted for by existing VQA models. As a demonstration of the efficacy of our approach, we show that, while current state-of-the-art VQA models perform poorly on 10-bit HDR databases, their performances are greatly improved by the inclusion of HDRMAX features when tested on",
    "path": "papers/23/04/2304.13092.json",
    "total_tokens": 877,
    "translated_title": "使视频质量评估模型对位深具有稳健性",
    "translated_abstract": "我们引入了一种新的特征集，称为HDRMAX特征。当将其包含在为标准动态范围（SDR）视频设计的视频质量评估（VQA）算法中时，它们会对高动态范围（HDR）视频的失真进行敏感处理，这些失真未被这些算法充分考虑。虽然这些特征不仅限于HDR，并且还可以增强VQA模型对SDR内容的质量预测性能，但它们在HDR上尤为有效。HDRMAX特征通过增强自然视频统计模型（NVS）中从视觉影响视频的最亮和最暗的局部中提取的强大先验信息的可测性来捕捉通常由现有VQA模型难以考虑的失真。作为我们方法有效性的证明，我们展示了，在10位HDR数据库上，当前最先进的VQA模型的表现很差，但当使用HDRMAX特征时，其性能显著提高。",
    "tldr": "本文提出了HDRMAX特征集，可以提高视频质量评估算法对于不同位深视频的质量预测性能，尤其在HDR视频上表现尤佳。",
    "en_tdlr": "This paper proposes a new feature set, named HDRMAX, that sensitizes video quality assessment algorithms to distortions of high dynamic range videos. The inclusion of these features greatly improves the performance of VQA models, especially on HDR videos."
}