{
    "title": "How to Do Things with Deep Learning Code. (arXiv:2304.09406v1 [cs.CL])",
    "abstract": "The premise of this article is that a basic understanding of the composition and functioning of large language models is critically urgent. To that end, we extract a representational map of OpenAI's GPT-2 with what we articulate as two classes of deep learning code, that which pertains to the model and that which underwrites applications built around the model. We then verify this map through case studies of two popular GPT-2 applications: the text adventure game, AI Dungeon, and the language art project, This Word Does Not Exist. Such an exercise allows us to test the potential of Critical Code Studies when the object of study is deep learning code and to demonstrate the validity of code as an analytical focus for researchers in the subfields of Critical Artificial Intelligence and Critical Machine Learning Studies. More broadly, however, our work draws attention to the means by which ordinary users might interact with, and even direct, the behavior of deep learning systems, and by ex",
    "link": "http://arxiv.org/abs/2304.09406",
    "context": "Title: How to Do Things with Deep Learning Code. (arXiv:2304.09406v1 [cs.CL])\nAbstract: The premise of this article is that a basic understanding of the composition and functioning of large language models is critically urgent. To that end, we extract a representational map of OpenAI's GPT-2 with what we articulate as two classes of deep learning code, that which pertains to the model and that which underwrites applications built around the model. We then verify this map through case studies of two popular GPT-2 applications: the text adventure game, AI Dungeon, and the language art project, This Word Does Not Exist. Such an exercise allows us to test the potential of Critical Code Studies when the object of study is deep learning code and to demonstrate the validity of code as an analytical focus for researchers in the subfields of Critical Artificial Intelligence and Critical Machine Learning Studies. More broadly, however, our work draws attention to the means by which ordinary users might interact with, and even direct, the behavior of deep learning systems, and by ex",
    "path": "papers/23/04/2304.09406.json",
    "total_tokens": 1007,
    "translated_title": "如何处理深度学习代码",
    "translated_abstract": "本文的前提观点是，基本理解大型语言模型的构成和功能至关紧急。为此，我们提取了OpenAI的GPT-2的表示映射，其中包括涉及模型的深度学习代码和构建在模型周围的应用程序的基础代码。然后，我们通过两个受欢迎的GPT-2应用程序（文本冒险游戏AI Dungeon和语言艺术项目This Word Does Not Exist）的案例研究来验证这个映射。这样的练习使我们能够测试对深度学习代码进行关键代码研究的潜力，并证明代码是关键人工智能和关键机器学习研究子领域的研究人员的分析重点的有效性。更广泛地说，我们的工作引起了人们对普通用户如何与深度学习系统交互，甚至指导深度学习系统的行为，并通过表达代理机构，抵制他们发现有害或不公正的系统的开发的注意。",
    "tldr": "本文通过提取GPT-2的表示映射和案例研究，测试了对深度学习代码进行关键代码研究的潜力并证明了代码是关键人工智能和关键机器学习研究子领域的研究人员的分析重点的有效性，同时让人们关注普通用户如何与深度学习系统交互，并指导深度学习系统的行为。",
    "en_tdlr": "This paper tests the potential of critical code studies in deep learning code through the extraction of the representational map of GPT-2 and case studies, and demonstrates the validity of code as an analytical focus in the subfields of critical AI and machine learning studies. It also draws attention to how ordinary users can interact with and guide the behavior of deep learning systems and resist the development of harmful or unjust systems."
}