{
    "title": "EVKG: An Interlinked and Interoperable Electric Vehicle Knowledge Graph for Smart Transportation System. (arXiv:2304.04893v1 [cs.AI])",
    "abstract": "Over the past decade, the electric vehicle industry has experienced unprecedented growth and diversification, resulting in a complex ecosystem. To effectively manage this multifaceted field, we present an EV-centric knowledge graph (EVKG) as a comprehensive, cross-domain, extensible, and open geospatial knowledge management system. The EVKG encapsulates essential EV-related knowledge, including EV adoption, electric vehicle supply equipment, and electricity transmission network, to support decision-making related to EV technology development, infrastructure planning, and policy-making by providing timely and accurate information and analysis. To enrich and contextualize the EVKG, we integrate the developed EV-relevant ontology modules from existing well-known knowledge graphs and ontologies. This integration enables interoperability with other knowledge graphs in the Linked Data Open Cloud, enhancing the EVKG's value as a knowledge hub for EV decision-making. Using six competency quest",
    "link": "http://arxiv.org/abs/2304.04893",
    "context": "Title: EVKG: An Interlinked and Interoperable Electric Vehicle Knowledge Graph for Smart Transportation System. (arXiv:2304.04893v1 [cs.AI])\nAbstract: Over the past decade, the electric vehicle industry has experienced unprecedented growth and diversification, resulting in a complex ecosystem. To effectively manage this multifaceted field, we present an EV-centric knowledge graph (EVKG) as a comprehensive, cross-domain, extensible, and open geospatial knowledge management system. The EVKG encapsulates essential EV-related knowledge, including EV adoption, electric vehicle supply equipment, and electricity transmission network, to support decision-making related to EV technology development, infrastructure planning, and policy-making by providing timely and accurate information and analysis. To enrich and contextualize the EVKG, we integrate the developed EV-relevant ontology modules from existing well-known knowledge graphs and ontologies. This integration enables interoperability with other knowledge graphs in the Linked Data Open Cloud, enhancing the EVKG's value as a knowledge hub for EV decision-making. Using six competency quest",
    "path": "papers/23/04/2304.04893.json",
    "total_tokens": 920,
    "translated_title": "EVKG：一个互联互通的智能交通系统电动汽车知识图谱",
    "translated_abstract": "在过去的十年里，电动汽车行业经历了空前的增长和多样化，形成了复杂的生态系统。为了有效地管理这个多方面的领域，我们提出了一个以电动汽车为中心的知识图谱(EVKG)，作为一个综合的、跨领域的、可扩展的和开放的地理空间知识管理系统。EVKG涵盖了与电动汽车相关的基本知识，包括电动汽车的采用、电动汽车供应设备和电力传输网络，通过提供及时准确的信息和分析来支持与电动汽车技术开发、基础设施规划和政策制定相关的决策。为了丰富和上下文化EVKG，我们将现有的知名知识图谱和本体的开发相关的本体模块集成到EVKG中。这种集成使EVKG与Linked Data Open Cloud中的其他知识图谱具有互操作性，增强了EVKG作为电动汽车决策的知识中心的价值。",
    "tldr": "EVKG是一个综合、跨领域、可扩展、开放的地理空间知识管理系统，涵盖了与电动汽车相关的基本知识。集成其他知名知识图谱和本体模块，增强了EVKG在电动汽车决策中的价值。"
}