{
    "title": "Maximizing Model Generalization for Manufacturing with Self-Supervised Learning and Federated Learning. (arXiv:2304.14398v1 [cs.LG])",
    "abstract": "Deep Learning (DL) can diagnose faults and assess machine health from raw condition monitoring data without manually designed statistical features. However, practical manufacturing applications remain extremely difficult for existing DL methods. Machine data is often unlabeled and from very few health conditions (e.g., only normal operating data). Furthermore, models often encounter shifts in domain as process parameters change and new categories of faults emerge. Traditional supervised learning may struggle to learn compact, discriminative representations that generalize to these unseen target domains since it depends on having plentiful classes to partition the feature space with decision boundaries. Transfer Learning (TL) with domain adaptation attempts to adapt these models to unlabeled target domains but assumes similar underlying structure that may not be present if new faults emerge. This study proposes focusing on maximizing the feature generality on the source domain and apply",
    "link": "http://arxiv.org/abs/2304.14398",
    "context": "Title: Maximizing Model Generalization for Manufacturing with Self-Supervised Learning and Federated Learning. (arXiv:2304.14398v1 [cs.LG])\nAbstract: Deep Learning (DL) can diagnose faults and assess machine health from raw condition monitoring data without manually designed statistical features. However, practical manufacturing applications remain extremely difficult for existing DL methods. Machine data is often unlabeled and from very few health conditions (e.g., only normal operating data). Furthermore, models often encounter shifts in domain as process parameters change and new categories of faults emerge. Traditional supervised learning may struggle to learn compact, discriminative representations that generalize to these unseen target domains since it depends on having plentiful classes to partition the feature space with decision boundaries. Transfer Learning (TL) with domain adaptation attempts to adapt these models to unlabeled target domains but assumes similar underlying structure that may not be present if new faults emerge. This study proposes focusing on maximizing the feature generality on the source domain and apply",
    "path": "papers/23/04/2304.14398.json",
    "total_tokens": 1112,
    "translated_title": "自我监督学习和联邦学习的制造业模型泛化最大化",
    "translated_abstract": "深度学习可以在没有手动设计的统计特征的情况下，从原始的状况监测数据中诊断故障和评估机器健康度。然而，现有的深度学习方法仍然极其困难适用于实际制造应用。机器数据通常是未标记的，只有很少的健康条件（例如，仅有正常操作数据）。此外，由于工艺参数的变化和新的故障类别的出现，模型经常遇到域的移位。传统的监督学习可能难以学习紧凑、有区别力的表示，并且不能推广到这些未见过的目标域，因为它依赖于拥有丰富的类来划分特征空间和决策边界。通过领域自适应进行的迁移学习尝试将这些模型适应到未标记的目标域，但假定了类似的子结构，在新的故障出现时可能不存在。本研究提出了一种专注于最大化源域特征普适性的方法，并应用自我监督学习结合联邦学习来改善实际制造应用中的故障诊断和机器健康评估。所提出的方法解决了未标记和有限状况监测数据以及域移位的问题，同时通过联邦学习实现了高效的计算和隐私保护。",
    "tldr": "本研究提出了一种利用自我监督学习和联邦学习提高制造业模型的泛化能力，在处理未标记的和有限的状况监测数据以及领域移位时具有较好的效果，同时通过联邦学习保护了数据隐私和提高了计算效率。",
    "en_tdlr": "This study proposes a method that utilizes self-supervised learning and federated learning to improve the generalization ability of manufacturing models, effectively handling unlabeled and limited condition monitoring data as well as domain shifts. Through federated learning, data privacy is protected while computation efficiency is improved."
}