{
    "title": "Blockchain-based Access Control for Secure Smart Industry Management Systems. (arXiv:2304.13379v1 [cs.CR])",
    "abstract": "Smart manufacturing systems involve a large number of interconnected devices resulting in massive data generation. Cloud computing technology has recently gained increasing attention in smart manufacturing systems for facilitating cost-effective service provisioning and massive data management. In a cloud-based manufacturing system, ensuring authorized access to the data is crucial. A cloud platform is operated under a single authority. Hence, a cloud platform is prone to a single point of failure and vulnerable to adversaries. An internal or external adversary can easily modify users' access to allow unauthorized users to access the data. This paper proposes a role-based access control to prevent modification attacks by leveraging blockchain and smart contracts in a cloud-based smart manufacturing system. The role-based access control is developed to determine users' roles and rights in smart contracts. The smart contracts are then deployed to the private blockchain network. We evalua",
    "link": "http://arxiv.org/abs/2304.13379",
    "context": "Title: Blockchain-based Access Control for Secure Smart Industry Management Systems. (arXiv:2304.13379v1 [cs.CR])\nAbstract: Smart manufacturing systems involve a large number of interconnected devices resulting in massive data generation. Cloud computing technology has recently gained increasing attention in smart manufacturing systems for facilitating cost-effective service provisioning and massive data management. In a cloud-based manufacturing system, ensuring authorized access to the data is crucial. A cloud platform is operated under a single authority. Hence, a cloud platform is prone to a single point of failure and vulnerable to adversaries. An internal or external adversary can easily modify users' access to allow unauthorized users to access the data. This paper proposes a role-based access control to prevent modification attacks by leveraging blockchain and smart contracts in a cloud-based smart manufacturing system. The role-based access control is developed to determine users' roles and rights in smart contracts. The smart contracts are then deployed to the private blockchain network. We evalua",
    "path": "papers/23/04/2304.13379.json",
    "total_tokens": 846,
    "translated_title": "基于区块链的智能工业管理系统访问控制",
    "translated_abstract": "智能制造系统涉及大量互联设备，导致大量数据生成。云计算技术近年来在智能制造系统中得到越来越多的关注，以促进成本效益服务的提供和大量数据的管理。在基于云的制造系统中，确保对数据的授权访问至关重要。云平台由单一权威运营。因此，云平台容易成为单点故障，并容易受到敌对势力的攻击。内部或外部敌对势力可以轻易修改用户的访问权限，以允许未经授权的用户访问数据。本文提出了一种基于角色的访问控制方法，借助区块链和智能合约在基于云的智能制造系统中防止修改攻击。该基于角色的访问控制被开发出来来确定智能合约中用户的角色和权限。然后将智能合约部署到私有区块链网络中。我们对所提出的方法进行了评估。",
    "tldr": "本文提出了一种基于角色的访问控制方法，通过在区块链和智能合约中实现来保障基于云的智能制造系统数据的安全性。",
    "en_tdlr": "This paper proposes a role-based access control method to ensure the security of data in cloud-based smart manufacturing systems by leveraging blockchain and smart contracts to prevent modification attacks."
}