{
    "title": "Approximate Shielding of Atari Agents for Safe Exploration. (arXiv:2304.11104v1 [cs.AI])",
    "abstract": "Balancing exploration and conservatism in the constrained setting is an important problem if we are to use reinforcement learning for meaningful tasks in the real world. In this paper, we propose a principled algorithm for safe exploration based on the concept of shielding. Previous approaches to shielding assume access to a safety-relevant abstraction of the environment or a high-fidelity simulator. Instead, our work is based on latent shielding another approach that leverages world models to verify policy roll-outs in the latent space of a learned dynamics model. Our novel algorithm builds on this previous work, using safety critics and other additional features to improve the stability and farsightedness of the algorithm. We demonstrate the effectiveness of our approach by running experiments on a small set of Atari games with state dependent safety labels. We present preliminary results that show our approximate shielding algorithm effectively reduces the rate of safety violation",
    "link": "http://arxiv.org/abs/2304.11104",
    "context": "Title: Approximate Shielding of Atari Agents for Safe Exploration. (arXiv:2304.11104v1 [cs.AI])\nAbstract: Balancing exploration and conservatism in the constrained setting is an important problem if we are to use reinforcement learning for meaningful tasks in the real world. In this paper, we propose a principled algorithm for safe exploration based on the concept of shielding. Previous approaches to shielding assume access to a safety-relevant abstraction of the environment or a high-fidelity simulator. Instead, our work is based on latent shielding another approach that leverages world models to verify policy roll-outs in the latent space of a learned dynamics model. Our novel algorithm builds on this previous work, using safety critics and other additional features to improve the stability and farsightedness of the algorithm. We demonstrate the effectiveness of our approach by running experiments on a small set of Atari games with state dependent safety labels. We present preliminary results that show our approximate shielding algorithm effectively reduces the rate of safety violation",
    "path": "papers/23/04/2304.11104.json",
    "total_tokens": 907,
    "translated_title": "Atari智能体的近似屏蔽使得安全探索成为可能",
    "translated_abstract": "在受限制的情况下平衡探索与保守性是使用强化学习在真实世界中完成有意义任务的一个重要问题。本文提出了一种基于屏蔽概念的安全探索的原理性算法。我们的工作基于潜在屏蔽这一想法，利用世界模型在学习的动力学模型的潜在空间中验证策略回滚。与之前的屏蔽方法不同的是，我们的方法不依赖于安全相关抽象或高保真度模拟器。我们的新算法在此基础上使用安全批判和其他附加特性来提高算法的稳定性和远见性。我们在一小组包含状态相关安全标签的Atari游戏上运行实验，展示了我们方法的有效性。初步结果表明，我们的近似屏蔽算法有效降低了安全违规率。",
    "tldr": "本文提出了一种基于屏蔽概念的安全探索的算法，使用世界模型验证策略回滚，不依赖于安全相关抽象或高保真度模拟器。在少量Atari游戏上的实验结果表明，该算法有效性高，减少了安全违规率。",
    "en_tdlr": "This paper proposes a principled algorithm for safe exploration based on the concept of shielding, which uses a world model to verify policy roll-outs and does not rely on safety-relevant abstraction or high-fidelity simulator. Running experiments on a small set of Atari games with state dependent safety labels, the results show that the approximate shielding algorithm effectively reduces the rate of safety violation."
}