{
    "title": "Bridging Nations: Quantifying the Role of Multilinguals in Communication on Social Media. (arXiv:2304.03797v1 [cs.SI])",
    "abstract": "Social media enables the rapid spread of many kinds of information, from memes to social movements. However, little is known about how information crosses linguistic boundaries. We apply causal inference techniques on the European Twitter network to quantify multilingual users' structural role and communication influence in cross-lingual information exchange. Overall, multilinguals play an essential role; posting in multiple languages increases betweenness centrality by 13%, and having a multilingual network neighbor increases monolinguals' odds of sharing domains and hashtags from another language 16-fold and 4-fold, respectively. We further show that multilinguals have a greater impact on diffusing information less accessible to their monolingual compatriots, such as information from far-away countries and content about regional politics, nascent social movements, and job opportunities. By highlighting information exchange across borders, this work sheds light on a crucial component ",
    "link": "http://arxiv.org/abs/2304.03797",
    "context": "Title: Bridging Nations: Quantifying the Role of Multilinguals in Communication on Social Media. (arXiv:2304.03797v1 [cs.SI])\nAbstract: Social media enables the rapid spread of many kinds of information, from memes to social movements. However, little is known about how information crosses linguistic boundaries. We apply causal inference techniques on the European Twitter network to quantify multilingual users' structural role and communication influence in cross-lingual information exchange. Overall, multilinguals play an essential role; posting in multiple languages increases betweenness centrality by 13%, and having a multilingual network neighbor increases monolinguals' odds of sharing domains and hashtags from another language 16-fold and 4-fold, respectively. We further show that multilinguals have a greater impact on diffusing information less accessible to their monolingual compatriots, such as information from far-away countries and content about regional politics, nascent social movements, and job opportunities. By highlighting information exchange across borders, this work sheds light on a crucial component ",
    "path": "papers/23/04/2304.03797.json",
    "total_tokens": 1020,
    "translated_title": "跨国之间的桥梁: 量化多语者在社交媒体上的交流作用",
    "translated_abstract": "社交媒体能快速传播各种信息，从表情包到社会运动。然而，我们对信息如何跨越语言边界知之甚少。我们在欧洲 Twitter 网络上应用因果推断技术，量化多语用户在跨语言信息交流中的结构作用和沟通影响。总的来说，多语者发挥了重要作用；发布多种语言的推文将介数中心度提高了13％，并且如果其网络邻居是多语者，则单语用户分享另一种语言域名和hashtag的可能性分别增加了16倍和4倍。我们进一步展示，多语者对于传播那些单语同胞不易获得的信息具有更大的影响力，例如来自遥远国家的信息、关于区域政治、新兴社会运动和工作机会的内容。通过突出跨境信息交流，这项工作揭示了一个至关重要的组成部分。",
    "tldr": "研究欧洲 Twitter 网络，通过因果推断技术，量化多语用户在跨语言信息交流中的结构作用和沟通影响。多语者的介数中心度比单语用户高13％，且具有多语网络邻居的单语用户分享其他语言域名和hashtag的可能性分别增加了16倍和4倍。多语者对于传播那些单语同胞不易获得的信息具有更大的影响力。",
    "en_tdlr": "This study uses causal inference techniques on the European Twitter network to quantify the structural role and communication influence of multilingual users in cross-lingual information exchange. Multilinguals have a higher betweenness centrality by 13%, and having a multilingual network neighbor increases the odds of monolingual users sharing domains and hashtags from another language 16-fold and 4-fold, respectively. Multilinguals have a greater impact on diffusing information less accessible to monolinguals, such as content about far-away countries, regional politics, social movements, and job opportunities."
}