{
    "title": "Physics-guided generative adversarial network to learn physical models. (arXiv:2304.11488v1 [cs.LG])",
    "abstract": "This short note describes the concept of guided training of deep neural networks (DNNs) to learn physically reasonable solutions. DNNs are being widely used to predict phenomena in physics and mechanics. One of the issues of DNNs is that their output does not always satisfy physical equations. One approach to consider physical equations is adding a residual of equations into the loss function; this is called physics-informed neural network (PINN). One feature of PINNs is that the physical equations and corresponding residual must be implemented as part of a neural network model. In addition, the residual does not always converge to a small value. The proposed model is a physics-guided generative adversarial network (PG-GAN) that uses a GAN architecture in which physical equations are used to judge whether the neural network's output is consistent with physics. The proposed method was applied to a simple problem to assess its potential usability.",
    "link": "http://arxiv.org/abs/2304.11488",
    "context": "Title: Physics-guided generative adversarial network to learn physical models. (arXiv:2304.11488v1 [cs.LG])\nAbstract: This short note describes the concept of guided training of deep neural networks (DNNs) to learn physically reasonable solutions. DNNs are being widely used to predict phenomena in physics and mechanics. One of the issues of DNNs is that their output does not always satisfy physical equations. One approach to consider physical equations is adding a residual of equations into the loss function; this is called physics-informed neural network (PINN). One feature of PINNs is that the physical equations and corresponding residual must be implemented as part of a neural network model. In addition, the residual does not always converge to a small value. The proposed model is a physics-guided generative adversarial network (PG-GAN) that uses a GAN architecture in which physical equations are used to judge whether the neural network's output is consistent with physics. The proposed method was applied to a simple problem to assess its potential usability.",
    "path": "papers/23/04/2304.11488.json",
    "total_tokens": 839,
    "translated_title": "物理引导生成对抗网络学习物理模型",
    "translated_abstract": "本文介绍了一种引导深度神经网络（DNNs）训练的方法，以学习合理的物理解决方案。DNNs广泛用于预测物理和机械现象。其中一个问题是DNNs的输出并不总是满足物理方程。考虑物理方程的一个方法是将方程残差添加到损失函数中，这被称为物理信息神经网络（PINN）。PINN的一个特点是物理方程及其残差必须作为神经网络模型的一部分来实现。此外，残差并不总是收敛到很小的值。所提出的模型是一种物理引导生成对抗网络（PG-GAN），它使用GAN架构，在其中物理方程被用来判断神经网络的输出是否符合物理学。该方法应用于一个简单问题，以评估其潜在的可用性。",
    "tldr": "该论文提出了一种物理引导生成对抗网络（PG-GAN）的模型，以判断神经网络输出是否符合物理规律，解决了DNNs输出不满足物理方程的问题。",
    "en_tdlr": "This paper proposes a physics-guided generative adversarial network (PG-GAN) model to judge whether the neural network's output is consistent with physics, solving the problem of DNNs' output not satisfying physical equations."
}