{
    "title": "Heterogeneous Oblique Double Random Forest. (arXiv:2304.06788v1 [cs.LG])",
    "abstract": "The decision tree ensembles use a single data feature at each node for splitting the data. However, splitting in this manner may fail to capture the geometric properties of the data. Thus, oblique decision trees generate the oblique hyperplane for splitting the data at each non-leaf node. Oblique decision trees capture the geometric properties of the data and hence, show better generalization. The performance of the oblique decision trees depends on the way oblique hyperplanes are generate and the data used for the generation of those hyperplanes. Recently, multiple classifiers have been used in a heterogeneous random forest (RaF) classifier, however, it fails to generate the trees of proper depth. Moreover, double RaF studies highlighted that larger trees can be generated via bootstrapping the data at each non-leaf node and splitting the original data instead of the bootstrapped data recently. The study of heterogeneous RaF lacks the generation of larger trees while as the double RaF ",
    "link": "http://arxiv.org/abs/2304.06788",
    "context": "Title: Heterogeneous Oblique Double Random Forest. (arXiv:2304.06788v1 [cs.LG])\nAbstract: The decision tree ensembles use a single data feature at each node for splitting the data. However, splitting in this manner may fail to capture the geometric properties of the data. Thus, oblique decision trees generate the oblique hyperplane for splitting the data at each non-leaf node. Oblique decision trees capture the geometric properties of the data and hence, show better generalization. The performance of the oblique decision trees depends on the way oblique hyperplanes are generate and the data used for the generation of those hyperplanes. Recently, multiple classifiers have been used in a heterogeneous random forest (RaF) classifier, however, it fails to generate the trees of proper depth. Moreover, double RaF studies highlighted that larger trees can be generated via bootstrapping the data at each non-leaf node and splitting the original data instead of the bootstrapped data recently. The study of heterogeneous RaF lacks the generation of larger trees while as the double RaF ",
    "path": "papers/23/04/2304.06788.json",
    "total_tokens": 859,
    "translated_title": "异构斜率二叉树随机森林",
    "translated_abstract": "决策树集合在每个节点只使用单一特征来拆分数据。然而，这种方式拆分可能无法捕获数据的几何属性。因此，斜率决策树生成斜线超平面来拆分每个非叶节点上的数据。斜率决策树可以捕捉数据的几何属性，从而显示更好的泛化性能。斜率决策树的性能取决于生成斜线超平面的方式以及用于生成这些超平面的数据。最近，多个分类器已经在异构随机森林（RaF）分类器中使用，但是，它无法生成合适深度的树。此外，双RaF研究表明，可以通过在每个非叶节点上对数据进行自举并拆分原始数据而不是自举数据来生成更大的树。异构RaF的研究缺少生成更大的树，而双RaF则强调了该问题。",
    "tldr": "本文提出了一种新方法，称为异构斜率二叉树随机森林，可以生成更大深度的树，并提高决策树集合的泛化性能。"
}