{
    "title": "Hierarchical Agent-based Reinforcement Learning Framework for Automated Quality Assessment of Fetal Ultrasound Video. (arXiv:2304.07036v1 [eess.IV])",
    "abstract": "Ultrasound is the primary modality to examine fetal growth during pregnancy, while the image quality could be affected by various factors. Quality assessment is essential for controlling the quality of ultrasound images to guarantee both the perceptual and diagnostic values. Existing automated approaches often require heavy structural annotations and the predictions may not necessarily be consistent with the assessment results by human experts. Furthermore, the overall quality of a scan and the correlation between the quality of frames should not be overlooked. In this work, we propose a reinforcement learning framework powered by two hierarchical agents that collaboratively learn to perform both frame-level and video-level quality assessments. It is equipped with a specially-designed reward mechanism that considers temporal dependency among frame quality and only requires sparse binary annotations to train. Experimental results on a challenging fetal brain dataset verify that the prop",
    "link": "http://arxiv.org/abs/2304.07036",
    "context": "Title: Hierarchical Agent-based Reinforcement Learning Framework for Automated Quality Assessment of Fetal Ultrasound Video. (arXiv:2304.07036v1 [eess.IV])\nAbstract: Ultrasound is the primary modality to examine fetal growth during pregnancy, while the image quality could be affected by various factors. Quality assessment is essential for controlling the quality of ultrasound images to guarantee both the perceptual and diagnostic values. Existing automated approaches often require heavy structural annotations and the predictions may not necessarily be consistent with the assessment results by human experts. Furthermore, the overall quality of a scan and the correlation between the quality of frames should not be overlooked. In this work, we propose a reinforcement learning framework powered by two hierarchical agents that collaboratively learn to perform both frame-level and video-level quality assessments. It is equipped with a specially-designed reward mechanism that considers temporal dependency among frame quality and only requires sparse binary annotations to train. Experimental results on a challenging fetal brain dataset verify that the prop",
    "path": "papers/23/04/2304.07036.json",
    "total_tokens": 939,
    "translated_title": "基于层次代理的强化学习框架用于自动评估胎儿超声视频质量的研究",
    "translated_abstract": "超声是孕期检查胎儿生长的主要方法，但图像质量可能会受到各种因素的影响。质量评估对于控制超声图像的质量以保证其感知和诊断价值至关重要。现有的自动方法通常需要大量结构性标注，而且其预测结果可能不一定与人类专家的评估结果保持一致。此外，不应忽视扫描的整体质量和帧间质量的相关性。本文提出了一种强化学习框架，由两个层次代理协同学习执行帧级和视频级质量评估。它配备了一种特殊设计的奖励机制，考虑帧质量之间的时间依赖性，只需要稀疏的二进制注释进行训练。在挑战性的胎儿脑数据集上的实验结果验证了所提出的框架在超过现有最先进方法的同时，效果优于人类专家在一致性和效率方面。",
    "tldr": "本研究提出了一个基于强化学习的自动评估胎儿超声视频质量的层次代理框架，具有优化标注量、整体质量评估和人类专家结果一致性等显著优势。",
    "en_tdlr": "This study proposes a hierarchical agent-based reinforcement learning framework for automated quality assessment of fetal ultrasound videos. It has significant advantages in optimizing annotation amount, evaluating overall quality, and achieving consistency with human expert results."
}