{
    "title": "Electricity Demand Forecasting with Hybrid Statistical and Machine Learning Algorithms: Case Study of Ukraine. (arXiv:2304.05174v1 [cs.LG])",
    "abstract": "This article presents a novel hybrid approach using statistics and machine learning to forecast the national demand of electricity. As investment and operation of future energy systems require long-term electricity demand forecasts with hourly resolution, our mathematical model fills a gap in energy forecasting. The proposed methodology was constructed using hourly data from Ukraine's electricity consumption ranging from 2013 to 2020. To this end, we analysed the underlying structure of the hourly, daily and yearly time series of electricity consumption. The long-term yearly trend is evaluated using macroeconomic regression analysis. The mid-term model integrates temperature and calendar regressors to describe the underlying structure, and combines ARIMA and LSTM ``black-box'' pattern-based approaches to describe the error term. The short-term model captures the hourly seasonality through calendar regressors and multiple ARMA models for the residual. Results show that the best forecast",
    "link": "http://arxiv.org/abs/2304.05174",
    "context": "Title: Electricity Demand Forecasting with Hybrid Statistical and Machine Learning Algorithms: Case Study of Ukraine. (arXiv:2304.05174v1 [cs.LG])\nAbstract: This article presents a novel hybrid approach using statistics and machine learning to forecast the national demand of electricity. As investment and operation of future energy systems require long-term electricity demand forecasts with hourly resolution, our mathematical model fills a gap in energy forecasting. The proposed methodology was constructed using hourly data from Ukraine's electricity consumption ranging from 2013 to 2020. To this end, we analysed the underlying structure of the hourly, daily and yearly time series of electricity consumption. The long-term yearly trend is evaluated using macroeconomic regression analysis. The mid-term model integrates temperature and calendar regressors to describe the underlying structure, and combines ARIMA and LSTM ``black-box'' pattern-based approaches to describe the error term. The short-term model captures the hourly seasonality through calendar regressors and multiple ARMA models for the residual. Results show that the best forecast",
    "path": "papers/23/04/2304.05174.json",
    "total_tokens": 950,
    "translated_title": "基于统计和机器学习算法的电力需求预测：以乌克兰为例",
    "translated_abstract": "本文提出了一种新颖的混合方法，利用统计和机器学习来预测国家电力需求。由于未来能源系统的投资和运营需要具有小时分辨率的长期电力需求预测，因此我们的数学模型填补了能源预测中的空白。所提出的方法使用乌克兰从2013年至2020年的电力消耗小时数据进行构建。为此，我们分析了电力消费的小时、日和年的时间序列的基本结构。通过宏观经济回归分析评估了长期年趋势。中期模型结合温度和日历回归变量来描述基本结构，并结合ARIMA和LSTM“黑匣子”模型来描述误差项。短期模型通过日历回归变量和多个ARMA模型来捕捉小时季节性。结果表明，最佳预测可实现",
    "tldr": "本文提出了一种新型的混合方法，使用统计和机器学习的算法结合预测电力需求，并成功地应用于乌克兰的电力消耗数据。方法中包括了宏观经济回归分析、温度和日历回归变量相结合、ARIMA和LSTM“黑匣子”模型等，使得预测能够覆盖长、中、短期不同阶段以及小时季节性。",
    "en_tdlr": "This paper proposes a novel hybrid approach using statistical and machine learning algorithms to forecast electricity demand, and successfully applies it to the electricity consumption data in Ukraine. The proposed methodology includes macroeconomic regression analysis, integration of temperature and calendar regressors, and ARIMA and LSTM \"black-box\" models, covering long, mid, and short-term stages with hourly seasonality."
}