{
    "title": "KubeEdge-Sedna v0.3: Towards Next-Generation Automatically Customized AI Engineering Scheme. (arXiv:2304.05985v1 [cs.DC])",
    "abstract": "The scale of the global edge AI market continues to grow. The current technical challenges that hinder the large-scale replication of edge AI are mainly small samples on the edge and heterogeneity of edge data. In addition, edge AI customers often have requirements for data security compliance and offline autonomy of edge AI services. Based on the lifelong learning method in the academic world, we formally define the problem of edge-cloud collaborative lifelong learning for the first time, and release the industry's first open-source edge-cloud collaborative lifelong learning. Edge-cloud collaborative lifelong learning adapts to data heterogeneity at different edge locations through (1) multi-task transfer learning to achieve accurate prediction of \"thousands of people and thousands of faces\"; (2) incremental processing of unknown tasks, the more systems learn and the smarter systems are with small samples, gradually realize AI engineering and automation; (3) Use the cloud-side knowled",
    "link": "http://arxiv.org/abs/2304.05985",
    "context": "Title: KubeEdge-Sedna v0.3: Towards Next-Generation Automatically Customized AI Engineering Scheme. (arXiv:2304.05985v1 [cs.DC])\nAbstract: The scale of the global edge AI market continues to grow. The current technical challenges that hinder the large-scale replication of edge AI are mainly small samples on the edge and heterogeneity of edge data. In addition, edge AI customers often have requirements for data security compliance and offline autonomy of edge AI services. Based on the lifelong learning method in the academic world, we formally define the problem of edge-cloud collaborative lifelong learning for the first time, and release the industry's first open-source edge-cloud collaborative lifelong learning. Edge-cloud collaborative lifelong learning adapts to data heterogeneity at different edge locations through (1) multi-task transfer learning to achieve accurate prediction of \"thousands of people and thousands of faces\"; (2) incremental processing of unknown tasks, the more systems learn and the smarter systems are with small samples, gradually realize AI engineering and automation; (3) Use the cloud-side knowled",
    "path": "papers/23/04/2304.05985.json",
    "total_tokens": 943,
    "translated_title": "KubeEdge-Sedna v0.3：面向下一代自动定制化AI工程方案",
    "translated_abstract": "全球边缘人工智能市场的规模继续增长。目前阻碍边缘人工智能大规模复制的主要技术挑战是边缘数据的小样本和异构性。此外，边缘人工智能客户经常对数据安全合规性和边缘人工智能服务的离线自主性提出要求。基于学术界中的终身学习方法，我们首次正式定义了边缘-云协作终身学习的问题，并发布了业界首个开源的边缘-云协作终身学习。边缘-云协作终身学习通过（1）多任务迁移学习来适应不同边缘位置的数据异构性，以实现“千人千面”的准确预测；（2）未知任务的增量处理使系统学习更多，样本越小，系统变得越聪明，逐渐实现AI工程和自动化；（3）利用云端知识来提高边缘系统的准确性和性能。",
    "tldr": "KubeEdge-Sedna v0.3提出了边缘-云协作终身学习的问题，并发布了行业首个开源方案，解决了边缘数据异构性和边缘人工智能服务离线自主性的挑战，从而实现了AI工程和自动化。",
    "en_tdlr": "KubeEdge-Sedna v0.3 proposes the problem of collaborative lifelong learning between edge and cloud and releases the industry's first open-source solution, which solves the challenges of edge data heterogeneity and offline autonomy of edge AI services, thus realizing AI engineering and automation."
}