{
    "title": "Solving the Kidney-Exchange Problem via Graph Neural Networks with No Supervision. (arXiv:2304.09975v1 [cs.LG])",
    "abstract": "This paper introduces a new learning-based approach for approximately solving the Kidney-Exchange Problem (KEP), an NP-hard problem on graphs. The problem consists of, given a pool of kidney donors and patients waiting for kidney donations, optimally selecting a set of donations to optimize the quantity and quality of transplants performed while respecting a set of constraints about the arrangement of these donations. The proposed technique consists of two main steps: the first is a Graph Neural Network (GNN) trained without supervision; the second is a deterministic non-learned search heuristic that uses the output of the GNN to find paths and cycles. To allow for comparisons, we also implemented and tested an exact solution method using integer programming, two greedy search heuristics without the machine learning module, and the GNN alone without a heuristic. We analyze and compare the methods and conclude that the learning-based two-stage approach is the best solution quality, outp",
    "link": "http://arxiv.org/abs/2304.09975",
    "context": "Title: Solving the Kidney-Exchange Problem via Graph Neural Networks with No Supervision. (arXiv:2304.09975v1 [cs.LG])\nAbstract: This paper introduces a new learning-based approach for approximately solving the Kidney-Exchange Problem (KEP), an NP-hard problem on graphs. The problem consists of, given a pool of kidney donors and patients waiting for kidney donations, optimally selecting a set of donations to optimize the quantity and quality of transplants performed while respecting a set of constraints about the arrangement of these donations. The proposed technique consists of two main steps: the first is a Graph Neural Network (GNN) trained without supervision; the second is a deterministic non-learned search heuristic that uses the output of the GNN to find paths and cycles. To allow for comparisons, we also implemented and tested an exact solution method using integer programming, two greedy search heuristics without the machine learning module, and the GNN alone without a heuristic. We analyze and compare the methods and conclude that the learning-based two-stage approach is the best solution quality, outp",
    "path": "papers/23/04/2304.09975.json",
    "total_tokens": 851,
    "translated_title": "无监督图神经网络解决肾移植问题",
    "translated_abstract": "本文引入了一种新的基于学习的方法，近似解决了图上的肾移植问题（KEP），这是一个NP难问题。该问题涉及到从一组肾脏供体和等待肾脏捐赠的患者中，选择一组捐赠以最大化移植数量和质量，同时遵守一些有关这些捐赠安排的约束条件。该技术包括两个主要步骤：第一步是无监督训练的图神经网络（GNN）；第二步是确定性的非学习搜索启发式，它利用GNN的输出来查找路径和循环。为了进行比较，我们还实现并测试了一种精确的解决方案方法，使用整数规划、两个贪心搜索启发式，不使用机器学习模块的GNN。我们分析和比较了这些方法，并得出结论，即基于学习的两阶段方法是最佳解决方案。",
    "tldr": "本文提出了一个无监督的图神经网络解决肾移植问题，可以近似解决NP难问题，并且比其他方法更好。",
    "en_tdlr": "This paper proposes an unsupervised Graph Neural Network approach to solve the Kidney-Exchange Problem, which is NP-hard, and achieves better results compared to other methods."
}