{
    "title": "Efficient Quantum Algorithms for Quantum Optimal Control. (arXiv:2304.02613v1 [quant-ph])",
    "abstract": "In this paper, we present efficient quantum algorithms that are exponentially faster than classical algorithms for solving the quantum optimal control problem. This problem involves finding the control variable that maximizes a physical quantity at time $T$, where the system is governed by a time-dependent Schr\\\"odinger equation. This type of control problem also has an intricate relation with machine learning. Our algorithms are based on a time-dependent Hamiltonian simulation method and a fast gradient-estimation algorithm. We also provide a comprehensive error analysis to quantify the total error from various steps, such as the finite-dimensional representation of the control function, the discretization of the Schr\\\"odinger equation, the numerical quadrature, and optimization. Our quantum algorithms require fault-tolerant quantum computers.",
    "link": "http://arxiv.org/abs/2304.02613",
    "context": "Title: Efficient Quantum Algorithms for Quantum Optimal Control. (arXiv:2304.02613v1 [quant-ph])\nAbstract: In this paper, we present efficient quantum algorithms that are exponentially faster than classical algorithms for solving the quantum optimal control problem. This problem involves finding the control variable that maximizes a physical quantity at time $T$, where the system is governed by a time-dependent Schr\\\"odinger equation. This type of control problem also has an intricate relation with machine learning. Our algorithms are based on a time-dependent Hamiltonian simulation method and a fast gradient-estimation algorithm. We also provide a comprehensive error analysis to quantify the total error from various steps, such as the finite-dimensional representation of the control function, the discretization of the Schr\\\"odinger equation, the numerical quadrature, and optimization. Our quantum algorithms require fault-tolerant quantum computers.",
    "path": "papers/23/04/2304.02613.json",
    "total_tokens": 771,
    "translated_title": "量子最优控制的高效量子算法",
    "translated_abstract": "本文提出了一种高效的量子算法，比经典算法解决量子最优控制问题的速度快出指数倍。该问题需要寻找控制变量，以最大化在时间T时受时变薛定谔方程控制的系统的某个物理量。这种控制问题也与机器学习有着复杂的关系。我们的算法基于时变哈密顿模拟方法和快速梯度估计算法。我们还提供了全面的错误分析，以量化来自各个步骤的总误差，如控制函数的有限维表示、薛定谔方程的离散化、数值积分和优化。我们的量子算法需要容错的量子计算机。",
    "tldr": "本文提出了一种高效的量子算法，解决量子最优控制问题，运用容错的量子计算机，具有复杂的机器学习关系。",
    "en_tdlr": "This paper presents an efficient quantum algorithm for solving quantum optimal control problems that are exponentially faster than classical algorithms. They base their approach on time-dependent Hamiltonian simulation and fast gradient-estimation algorithms, and provide a comprehensive error analysis to quantify total error from various steps. Their algorithm requires fault-tolerant quantum computers and has intricate relations with machine learning."
}