{
    "title": "Robot-Enabled Construction Assembly with Automated Sequence Planning based on ChatGPT: RoboGPT. (arXiv:2304.11018v1 [cs.RO])",
    "abstract": "Robot-based assembly in construction has emerged as a promising solution to address numerous challenges such as increasing costs, labor shortages, and the demand for safe and efficient construction processes. One of the main obstacles in realizing the full potential of these robotic systems is the need for effective and efficient sequence planning for construction tasks. Current approaches, including mathematical and heuristic techniques or machine learning methods, face limitations in their adaptability and scalability to dynamic construction environments. To expand the ability of the current robot system in sequential understanding, this paper introduces RoboGPT, a novel system that leverages the advanced reasoning capabilities of ChatGPT, a large language model, for automated sequence planning in robot-based assembly applied to construction tasks. The proposed system adapts ChatGPT for construction sequence planning and demonstrate its feasibility and effectiveness through experimen",
    "link": "http://arxiv.org/abs/2304.11018",
    "context": "Title: Robot-Enabled Construction Assembly with Automated Sequence Planning based on ChatGPT: RoboGPT. (arXiv:2304.11018v1 [cs.RO])\nAbstract: Robot-based assembly in construction has emerged as a promising solution to address numerous challenges such as increasing costs, labor shortages, and the demand for safe and efficient construction processes. One of the main obstacles in realizing the full potential of these robotic systems is the need for effective and efficient sequence planning for construction tasks. Current approaches, including mathematical and heuristic techniques or machine learning methods, face limitations in their adaptability and scalability to dynamic construction environments. To expand the ability of the current robot system in sequential understanding, this paper introduces RoboGPT, a novel system that leverages the advanced reasoning capabilities of ChatGPT, a large language model, for automated sequence planning in robot-based assembly applied to construction tasks. The proposed system adapts ChatGPT for construction sequence planning and demonstrate its feasibility and effectiveness through experimen",
    "path": "papers/23/04/2304.11018.json",
    "total_tokens": 875,
    "translated_title": "机器人辅助施工装配的自动化顺序规划：基于ChatGPT的RoboGPT",
    "translated_abstract": "机器人在施工中的应用已经成为解决诸多挑战的有希望的解决方案，如成本上涨、劳动力短缺以及对安全、高效施工工艺的需求。然而，实现这些机器人系统的全部潜力面临的一个主要障碍是对施工任务进行有效且高效的顺序规划。目前的方法包括数学和启发式技术或机器学习方法，在适应能力和可扩展性方面存在局限性。为了扩展当前机器人系统的顺序理解能力，本文介绍了基于大型语言模型ChatGPT的先进推理能力的RoboGPT，用于机器人辅助施工装配中的自动化顺序规划。该系统采用了ChatGPT构建施工顺序规划，通过实验证明其可行性和有效性。",
    "tldr": "该论文介绍了一种基于大型语言模型ChatGPT的RoboGPT系统，用于机器人辅助施工装配中的自动化顺序规划。该系统可克服其他方法在适应能力和可扩展性方面的局限性。",
    "en_tdlr": "This paper introduces RoboGPT, a novel system that leverages the advanced reasoning capabilities of ChatGPT, a large language model, for automated sequence planning in robot-based assembly applied to construction tasks. The proposed system overcomes the limitations of other methods in adaptability and scalability."
}