{
    "title": "Client Recruitment for Federated Learning in ICU Length of Stay Prediction. (arXiv:2304.14663v1 [cs.LG])",
    "abstract": "Machine and deep learning methods for medical and healthcare applications have shown significant progress and performance improvement in recent years. These methods require vast amounts of training data which are available in the medical sector, albeit decentralized. Medical institutions generate vast amounts of data for which sharing and centralizing remains a challenge as the result of data and privacy regulations. The federated learning technique is well-suited to tackle these challenges. However, federated learning comes with a new set of open problems related to communication overhead, efficient parameter aggregation, client selection strategies and more. In this work, we address the step prior to the initiation of a federated network for model training, client recruitment. By intelligently recruiting clients, communication overhead and overall cost of training can be reduced without sacrificing predictive performance. Client recruitment aims at pre-excluding potential clients fro",
    "link": "http://arxiv.org/abs/2304.14663",
    "context": "Title: Client Recruitment for Federated Learning in ICU Length of Stay Prediction. (arXiv:2304.14663v1 [cs.LG])\nAbstract: Machine and deep learning methods for medical and healthcare applications have shown significant progress and performance improvement in recent years. These methods require vast amounts of training data which are available in the medical sector, albeit decentralized. Medical institutions generate vast amounts of data for which sharing and centralizing remains a challenge as the result of data and privacy regulations. The federated learning technique is well-suited to tackle these challenges. However, federated learning comes with a new set of open problems related to communication overhead, efficient parameter aggregation, client selection strategies and more. In this work, we address the step prior to the initiation of a federated network for model training, client recruitment. By intelligently recruiting clients, communication overhead and overall cost of training can be reduced without sacrificing predictive performance. Client recruitment aims at pre-excluding potential clients fro",
    "path": "papers/23/04/2304.14663.json",
    "total_tokens": 956,
    "translated_title": "基于ICU住院时间预测的联邦学习客户端招募研究",
    "translated_abstract": "近年来，医疗和保健领域的机器学习和深度学习方法取得了显著的进展和改进。这些方法需要大量的训练数据，医疗领域中有大量的这样的数据，但是这些数据是分散的。联邦学习技术非常适合应对这些挑战。本文针对联邦学习中的客户端选择问题，提出了一种新的基于ICU住院时间预测的联邦学习客户端招募策略。我们的策略包括几个阶段：（i）基于准则的客户端预选；（ii）基于相似性的客户端选择；和（iii）客户端聚类。实验结果表明，我们的策略可以降低通信开销和训练成本，同时保持预测性能。",
    "tldr": "本研究提出了一种新的基于ICU住院时间预测的联邦学习客户端招募策略，通过准则、相似性和聚类，可以降低通信开销和训练成本，同时保持预测性能。",
    "en_tdlr": "This study proposes a novel client recruitment strategy for federated learning in the medical domain focusing on ICU length of stay prediction. By pre-selecting clients based on criteria, selecting them based on similarity, and clustering them, the strategy reduces communication overhead and training cost while maintaining prediction performance."
}