{
    "title": "Few-shot Class-incremental Learning for Cross-domain Disease Classification. (arXiv:2304.05734v1 [cs.CV])",
    "abstract": "The ability to incrementally learn new classes from limited samples is crucial to the development of artificial intelligence systems for real clinical application. Although existing incremental learning techniques have attempted to address this issue, they still struggle with only few labeled data, particularly when the samples are from varied domains. In this paper, we explore the cross-domain few-shot incremental learning (CDFSCIL) problem. CDFSCIL requires models to learn new classes from very few labeled samples incrementally, and the new classes may be vastly different from the target space. To counteract this difficulty, we propose a cross-domain enhancement constraint and cross-domain data augmentation method. Experiments on MedMNIST show that the classification performance of this method is better than other similar incremental learning methods.",
    "link": "http://arxiv.org/abs/2304.05734",
    "context": "Title: Few-shot Class-incremental Learning for Cross-domain Disease Classification. (arXiv:2304.05734v1 [cs.CV])\nAbstract: The ability to incrementally learn new classes from limited samples is crucial to the development of artificial intelligence systems for real clinical application. Although existing incremental learning techniques have attempted to address this issue, they still struggle with only few labeled data, particularly when the samples are from varied domains. In this paper, we explore the cross-domain few-shot incremental learning (CDFSCIL) problem. CDFSCIL requires models to learn new classes from very few labeled samples incrementally, and the new classes may be vastly different from the target space. To counteract this difficulty, we propose a cross-domain enhancement constraint and cross-domain data augmentation method. Experiments on MedMNIST show that the classification performance of this method is better than other similar incremental learning methods.",
    "path": "papers/23/04/2304.05734.json",
    "total_tokens": 803,
    "translated_title": "跨领域疾病分类的小样本增量学习",
    "translated_abstract": "从有限的样本中增量学习新类别的能力对于开发用于实际临床应用的人工智能系统至关重要。虽然现有增量学习技术已经尝试解决这个问题，但是当样本来自不同的领域并且样本标记较少时，它们仍然存在困难。在本文中，我们探讨了跨域少样本增量学习问题。跨域少样本增量学习需要模型从极少量标记样本中增量学习新的类别，并且这些新的类别可能与目标空间大不相同。为了解决这个难题，我们提出了一种跨域增强约束和跨域数据增强方法。在MedMNIST实验中，该方法的分类性能优于其他类似的增量学习方法。",
    "tldr": "本研究提出了一种跨域增强约束和跨域数据增强方法，以解决跨领域少样本增量学习问题，该方法在MedMNIST实验中表现出较好的性能。",
    "en_tdlr": "This paper proposes a cross-domain enhancement constraint and cross-domain data augmentation method to solve the cross-domain few-shot incremental learning problem, and the experimental results on MedMNIST show better classification performance compared to other similar incremental learning methods."
}