{
    "title": "Optimizing Deep Learning Models For Raspberry Pi. (arXiv:2304.13039v1 [eess.SY])",
    "abstract": "Deep learning models have become increasingly popular for a wide range of applications, including computer vision, natural language processing, and speech recognition. However, these models typically require large amounts of computational resources, making them challenging to run on low-power devices such as the Raspberry Pi. One approach to addressing this challenge is to use pruning techniques to reduce the size of the deep learning models. Pruning involves removing unimportant weights and connections from the model, resulting in a smaller and more efficient model. Pruning can be done during training or after the model has been trained. Another approach is to optimize the deep learning models specifically for the Raspberry Pi architecture. This can include optimizing the model's architecture and parameters to take advantage of the Raspberry Pi's hardware capabilities, such as its CPU and GPU. Additionally, the model can be optimized for energy efficiency by minimizing the amount of c",
    "link": "http://arxiv.org/abs/2304.13039",
    "context": "Title: Optimizing Deep Learning Models For Raspberry Pi. (arXiv:2304.13039v1 [eess.SY])\nAbstract: Deep learning models have become increasingly popular for a wide range of applications, including computer vision, natural language processing, and speech recognition. However, these models typically require large amounts of computational resources, making them challenging to run on low-power devices such as the Raspberry Pi. One approach to addressing this challenge is to use pruning techniques to reduce the size of the deep learning models. Pruning involves removing unimportant weights and connections from the model, resulting in a smaller and more efficient model. Pruning can be done during training or after the model has been trained. Another approach is to optimize the deep learning models specifically for the Raspberry Pi architecture. This can include optimizing the model's architecture and parameters to take advantage of the Raspberry Pi's hardware capabilities, such as its CPU and GPU. Additionally, the model can be optimized for energy efficiency by minimizing the amount of c",
    "path": "papers/23/04/2304.13039.json",
    "total_tokens": 774,
    "translated_title": "针对树莓派优化深度学习模型",
    "translated_abstract": "深度学习模型在计算机视觉、自然语言处理和语音识别等领域越来越受欢迎。但这类模型需要大量的计算资源，使得在低功耗设备上运行（如树莓派）变得具有挑战性。针对这个问题的解决方案包括修剪（pruning）技术和优化模型以适合树莓派等硬件架构。在训练期间或训练后修剪可以减小模型大小，让模型更高效。优化模型则包括调整模型参数和结构适应树莓派硬件特点，例如树莓派的CPU和GPU，并通过最小化计算量以实现能耗的优化等方面。",
    "tldr": "针对树莓派优化深度学习模型包括修剪技术和模型参数结构优化，以适应其硬件特点并提高能效。",
    "en_tdlr": "Optimizing deep learning models for the Raspberry Pi includes pruning techniques and optimizing model parameters and structures to adapt to its hardware capabilities and improve energy efficiency."
}