{
    "title": "Neural Field Conditioning Strategies for 2D Semantic Segmentation. (arXiv:2304.14371v1 [cs.CV])",
    "abstract": "Neural fields are neural networks which map coordinates to a desired signal. When a neural field should jointly model multiple signals, and not memorize only one, it needs to be conditioned on a latent code which describes the signal at hand. Despite being an important aspect, there has been little research on conditioning strategies for neural fields. In this work, we explore the use of neural fields as decoders for 2D semantic segmentation. For this task, we compare three conditioning methods, simple concatenation of the latent code, Feature Wise Linear Modulation (FiLM), and Cross-Attention, in conjunction with latent codes which either describe the full image or only a local region of the image. Our results show a considerable difference in performance between the examined conditioning strategies. Furthermore, we show that conditioning via Cross-Attention achieves the best results and is competitive with a CNN-based decoder for semantic segmentation.",
    "link": "http://arxiv.org/abs/2304.14371",
    "context": "Title: Neural Field Conditioning Strategies for 2D Semantic Segmentation. (arXiv:2304.14371v1 [cs.CV])\nAbstract: Neural fields are neural networks which map coordinates to a desired signal. When a neural field should jointly model multiple signals, and not memorize only one, it needs to be conditioned on a latent code which describes the signal at hand. Despite being an important aspect, there has been little research on conditioning strategies for neural fields. In this work, we explore the use of neural fields as decoders for 2D semantic segmentation. For this task, we compare three conditioning methods, simple concatenation of the latent code, Feature Wise Linear Modulation (FiLM), and Cross-Attention, in conjunction with latent codes which either describe the full image or only a local region of the image. Our results show a considerable difference in performance between the examined conditioning strategies. Furthermore, we show that conditioning via Cross-Attention achieves the best results and is competitive with a CNN-based decoder for semantic segmentation.",
    "path": "papers/23/04/2304.14371.json",
    "total_tokens": 799,
    "translated_title": "二维语义分割神经场调节策略研究",
    "translated_abstract": "神经场是将坐标映射到期望信号的神经网络。如果神经场应该共同模拟多个信号而不是只记忆一个，则需要在描述所处理信号的潜在代码上进行调节。本文探讨了使用神经场作为二维语义分割解码器的方法，并比较了三种不同的调节方法：潜在代码的简单连接，特征逐元素线性调节以及交叉注意力，同时使用描述完整图像或图像局部区域的潜在代码。实验结果表明，不同的调节策略具有显著差异。此外，通过交叉注意力进行调节的结果最佳，与基于CNN的语义分割解码器相当竞争。",
    "tldr": "本文研究了神经场作为二维语义分割解码器，提出了三种调节方法，结果表明通过交叉注意力进行调节的方法最佳，与基于CNN的方法相当竞争。",
    "en_tdlr": "This paper explores the use of neural fields as decoders for 2D semantic segmentation and proposes three conditioning methods. They find that conditioning through Cross-Attention achieves the best results and is competitive with a CNN-based decoder."
}