{
    "title": "Credit Risk and the Financial Performance of Commercial Banks: Evidence from Vietnam. (arXiv:2304.08217v1 [q-fin.RM])",
    "abstract": "Credit risk is a crucial topic in the field of financial stability, especially at this time given the profound impact of the ongoing pandemic on the world economy. This study provides insight into the impact of credit risk on the financial performance of 26 commercial banks in Vietnam for the period from 2006 to 2016. The financial performance of commercial banks is measured by return on assets (ROA), return on equity (ROE), and Net interest margin (NIM); credit risk is measured by the nonperforming loan ratio (NPLR); control variables are measured by bank-specific characteristics, including bank size (SIZE), loan loss provision ratio (LLPR), and capital adequacy ratio (CAR), and macroeconomic factors such as annual gross domestic product (GDP) growth and annual inflation rate (INF). The assumption tests show that models have autocorrelation, non-constant variance, and endogeneity. Hence, a dynamic Difference Generalized Method of Moments (dynamic Difference GMM) approach is employed t",
    "link": "http://arxiv.org/abs/2304.08217",
    "context": "Title: Credit Risk and the Financial Performance of Commercial Banks: Evidence from Vietnam. (arXiv:2304.08217v1 [q-fin.RM])\nAbstract: Credit risk is a crucial topic in the field of financial stability, especially at this time given the profound impact of the ongoing pandemic on the world economy. This study provides insight into the impact of credit risk on the financial performance of 26 commercial banks in Vietnam for the period from 2006 to 2016. The financial performance of commercial banks is measured by return on assets (ROA), return on equity (ROE), and Net interest margin (NIM); credit risk is measured by the nonperforming loan ratio (NPLR); control variables are measured by bank-specific characteristics, including bank size (SIZE), loan loss provision ratio (LLPR), and capital adequacy ratio (CAR), and macroeconomic factors such as annual gross domestic product (GDP) growth and annual inflation rate (INF). The assumption tests show that models have autocorrelation, non-constant variance, and endogeneity. Hence, a dynamic Difference Generalized Method of Moments (dynamic Difference GMM) approach is employed t",
    "path": "papers/23/04/2304.08217.json",
    "total_tokens": 1038,
    "translated_abstract": "信用风险是金融稳定领域的一个关键问题，特别是在当前新冠疫情对世界经济产生深远影响的背景下。本研究提供了有关信用风险对越南26家商业银行2006-2016年间财务业绩的影响的见解。商业银行的财务业绩由资产回报率（ROA）、净资产回报率（ROE）和净利差（NIM）衡量，信用风险由不良贷款比率（NPLR）衡量；控制变量由银行特定特征（包括银行规模（SIZE）、贷款损失准备比率（LLPR）和资本充足率（CAR））以及宏观经济因素（如年度国内生产总值（GDP）增长和年度通货膨胀率（INF））衡量。假设检验结果表明，模型存在自相关、非恒定方差和内生性。因此，采用动态差分广义矩法（dynamic Difference GMM）方法。",
    "tldr": "研究探讨了信用风险对越南商业银行2006-2016年间财务业绩的影响，采用动态差分广义矩法（dynamic Difference GMM）方法分析23家银行的数据得出，资产回报率（ROA）、净资产回报率（ROE）和净利差（NIM）均受信用风险的显著负面影响。",
    "en_tdlr": "This study investigates the impact of credit risk on the financial performance of 26 commercial banks in Vietnam from 2006 to 2016, finding that credit risk has a significant negative impact on return on assets (ROA), return on equity (ROE), and Net interest margin (NIM), using a dynamic Difference Generalized Method of Moments (dynamic Difference GMM) approach."
}