{
    "title": "The State-of-the-Art in Air Pollution Monitoring and Forecasting Systems using IoT, Big Data, and Machine Learning. (arXiv:2304.09574v1 [cs.LG])",
    "abstract": "The quality of air is closely linked with the life quality of humans, plantations, and wildlife. It needs to be monitored and preserved continuously. Transportations, industries, construction sites, generators, fireworks, and waste burning have a major percentage in degrading the air quality. These sources are required to be used in a safe and controlled manner. Using traditional laboratory analysis or installing bulk and expensive models every few miles is no longer efficient. Smart devices are needed for collecting and analyzing air data. The quality of air depends on various factors, including location, traffic, and time. Recent researches are using machine learning algorithms, big data technologies, and the Internet of Things to propose a stable and efficient model for the stated purpose. This review paper focuses on studying and compiling recent research in this field and emphasizes the Data sources, Monitoring, and Forecasting models. The main objective of this paper is to provid",
    "link": "http://arxiv.org/abs/2304.09574",
    "context": "Title: The State-of-the-Art in Air Pollution Monitoring and Forecasting Systems using IoT, Big Data, and Machine Learning. (arXiv:2304.09574v1 [cs.LG])\nAbstract: The quality of air is closely linked with the life quality of humans, plantations, and wildlife. It needs to be monitored and preserved continuously. Transportations, industries, construction sites, generators, fireworks, and waste burning have a major percentage in degrading the air quality. These sources are required to be used in a safe and controlled manner. Using traditional laboratory analysis or installing bulk and expensive models every few miles is no longer efficient. Smart devices are needed for collecting and analyzing air data. The quality of air depends on various factors, including location, traffic, and time. Recent researches are using machine learning algorithms, big data technologies, and the Internet of Things to propose a stable and efficient model for the stated purpose. This review paper focuses on studying and compiling recent research in this field and emphasizes the Data sources, Monitoring, and Forecasting models. The main objective of this paper is to provid",
    "path": "papers/23/04/2304.09574.json",
    "total_tokens": 1004,
    "translated_title": "基于物联网、大数据和机器学习的空气污染监测和预测系统的现状",
    "translated_abstract": "空气质量与人类、植被和野生动物的生活质量密切相关。 因此，需要对其进行持续监测和保护。 交通，工业，建筑工地，发电机，烟花和焚烧废品等来源在降低空气质量方面占有重要比例。 这些来源需要以安全和可控的方式使用。 使用传统的实验室分析或每隔几英里就安装大型昂贵模型已不再高效。 需要智能设备来收集和分析空气数据。 空气质量取决于各种因素，包括位置，交通和时间。 最近的研究正在使用机器学习算法，大数据技术和物联网来提出稳定而有效的模型来实现上述目的。 本文重点研究和编译了该领域的最新研究，并强调数据源，监测和预测模型。 本文的主要目标是概述使用物联网，大数据和机器学习进行空气污染监测和预测的现状。",
    "tldr": "本文综述了基于物联网、大数据和机器学习的空气污染监测和预测系统的现状。最近的研究使用这些技术来提高空气质量数据的收集、分析和预测模型，以实现更高的效率和可靠性。",
    "en_tdlr": "This paper reviews the state-of-the-art in air pollution monitoring and forecasting systems using IoT, big data, and machine learning. Recent researches employ these technologies to improve the collection, analysis, and forecasting models of air quality data for achieving higher efficiency and reliability."
}