{
    "title": "HyperCUT: Video Sequence from a Single Blurry Image using Unsupervised Ordering. (arXiv:2304.01686v1 [cs.CV])",
    "abstract": "We consider the challenging task of training models for image-to-video deblurring, which aims to recover a sequence of sharp images corresponding to a given blurry image input. A critical issue disturbing the training of an image-to-video model is the ambiguity of the frame ordering since both the forward and backward sequences are plausible solutions. This paper proposes an effective self-supervised ordering scheme that allows training high-quality image-to-video deblurring models. Unlike previous methods that rely on order-invariant losses, we assign an explicit order for each video sequence, thus avoiding the order-ambiguity issue. Specifically, we map each video sequence to a vector in a latent high-dimensional space so that there exists a hyperplane such that for every video sequence, the vectors extracted from it and its reversed sequence are on different sides of the hyperplane. The side of the vectors will be used to define the order of the corresponding sequence. Last but not ",
    "link": "http://arxiv.org/abs/2304.01686",
    "context": "Title: HyperCUT: Video Sequence from a Single Blurry Image using Unsupervised Ordering. (arXiv:2304.01686v1 [cs.CV])\nAbstract: We consider the challenging task of training models for image-to-video deblurring, which aims to recover a sequence of sharp images corresponding to a given blurry image input. A critical issue disturbing the training of an image-to-video model is the ambiguity of the frame ordering since both the forward and backward sequences are plausible solutions. This paper proposes an effective self-supervised ordering scheme that allows training high-quality image-to-video deblurring models. Unlike previous methods that rely on order-invariant losses, we assign an explicit order for each video sequence, thus avoiding the order-ambiguity issue. Specifically, we map each video sequence to a vector in a latent high-dimensional space so that there exists a hyperplane such that for every video sequence, the vectors extracted from it and its reversed sequence are on different sides of the hyperplane. The side of the vectors will be used to define the order of the corresponding sequence. Last but not ",
    "path": "papers/23/04/2304.01686.json",
    "total_tokens": 884,
    "translated_title": "无监督排序的单模糊图像到视频序列方法——HyperCUT",
    "translated_abstract": "本文研究了图像到视频去模糊的模型训练中的一个关键问题：由于前向和后向序列都可以作为模糊图像对应的清晰图像序列，因此序列顺序的模糊性极大地干扰了模型的训练效果。为解决这一问题，本文提出了一种有效的自监督排序方法，将每个视频序列映射到一个高维潜在空间中的向量，并利用超平面将其与其反向序列区分开来，显式地分配了每个序列的顺序。最后，我们在合成和真实数据集上验证了我们的方法，并与现有的图像到视频去模糊方法相比取得了最优秀的性能。",
    "tldr": "本文提出了一种新的无监督排序方法来解决单模糊图像到视频序列的重建问题，显式地分配每个序列的顺序，有效提高了去模糊模型的训练质量，并在合成和真实数据集上获得了最好的结果。",
    "en_tdlr": "This paper proposes a novel unsupervised ordering method to solve the problem of image-to-video deblurring from a single blurry image, which assigns explicit orders for each video sequence and effectively improves the training quality of the deblurring model, achieving state-of-the-art performance on both synthetic and real-world datasets."
}