{
    "title": "LoRaWAN-enabled Smart Campus: The Dataset and a People Counter Use Case. (arXiv:2304.13366v1 [cs.LG])",
    "abstract": "IoT has a significant role in the smart campus. This paper presents a detailed description of the Smart Campus dataset based on LoRaWAN. LoRaWAN is an emerging technology that enables serving hundreds of IoT devices. First, we describe the LoRa network that connects the devices to the server. Afterward, we analyze the missing transmissions and propose a k-nearest neighbor solution to handle the missing values. Then, we predict future readings using a long short-term memory (LSTM). Finally, as one example application, we build a deep neural network to predict the number of people inside a room based on the selected sensor's readings. Our results show that our model achieves an accuracy of $95 \\: \\%$ in predicting the number of people. Moreover, the dataset is openly available and described in detail, which is opportunity for exploration of other features and applications.",
    "link": "http://arxiv.org/abs/2304.13366",
    "context": "Title: LoRaWAN-enabled Smart Campus: The Dataset and a People Counter Use Case. (arXiv:2304.13366v1 [cs.LG])\nAbstract: IoT has a significant role in the smart campus. This paper presents a detailed description of the Smart Campus dataset based on LoRaWAN. LoRaWAN is an emerging technology that enables serving hundreds of IoT devices. First, we describe the LoRa network that connects the devices to the server. Afterward, we analyze the missing transmissions and propose a k-nearest neighbor solution to handle the missing values. Then, we predict future readings using a long short-term memory (LSTM). Finally, as one example application, we build a deep neural network to predict the number of people inside a room based on the selected sensor's readings. Our results show that our model achieves an accuracy of $95 \\: \\%$ in predicting the number of people. Moreover, the dataset is openly available and described in detail, which is opportunity for exploration of other features and applications.",
    "path": "papers/23/04/2304.13366.json",
    "total_tokens": 884,
    "translated_title": "基于LoRaWAN的智能校园：数据集和人流计数器案例",
    "translated_abstract": "物联网在智能校园中具有重要作用。本文提供了一个基于LoRaWAN的智能校园数据集的详细描述。LoRaWAN是一种新兴技术，可以为数百个物联网设备提供服务。首先，我们描述了将设备连接到服务器的LoRa网络。然后，我们分析了丢失的传输并提出了k近邻解决方案来处理缺失值。然后，我们使用长短期记忆（LSTM）来预测未来的读数。最后，作为一个示例应用程序，我们构建了一个深度神经网络来基于所选传感器的读数预测房间内人数。我们的结果显示，在预测人数方面，我们的模型达到了95％的准确率。此外，数据集是公开可用的，并且有详细说明，这是探索其他功能和应用的机会。",
    "tldr": "本文介绍一个基于LoRaWAN的智能校园数据集，使用k近邻和LSTM方法处理丢失值和预测未来读数，并构建一个深度神经网络来预测房间内人数，准确率达到95％。",
    "en_tdlr": "This paper presents a LoRaWAN-based smart campus dataset and uses k-nearest neighbor and LSTM methods to handle missing values and predict future readings. It also builds a deep neural network to predict the number of people inside a room, achieving an accuracy of 95%. The dataset is openly available and described in detail, providing an opportunity for exploration of other features and applications."
}