{
    "title": "Directly Optimizing IoU for Bounding Box Localization. (arXiv:2304.07256v1 [cs.CV])",
    "abstract": "Object detection has seen remarkable progress in recent years with the introduction of Convolutional Neural Networks (CNN). Object detection is a multi-task learning problem where both the position of the objects in the images as well as their classes needs to be correctly identified. The idea here is to maximize the overlap between the ground-truth bounding boxes and the predictions i.e. the Intersection over Union (IoU). In the scope of work seen currently in this domain, IoU is approximated by using the Huber loss as a proxy but this indirect method does not leverage the IoU information and treats the bounding box as four independent, unrelated terms of regression. This is not true for a bounding box where the four coordinates are highly correlated and hold a semantic meaning when taken together. The direct optimization of the IoU is not possible due to its non-convex and non-differentiable nature. In this paper, we have formulated a novel loss namely, the Smooth IoU, which directly",
    "link": "http://arxiv.org/abs/2304.07256",
    "context": "Title: Directly Optimizing IoU for Bounding Box Localization. (arXiv:2304.07256v1 [cs.CV])\nAbstract: Object detection has seen remarkable progress in recent years with the introduction of Convolutional Neural Networks (CNN). Object detection is a multi-task learning problem where both the position of the objects in the images as well as their classes needs to be correctly identified. The idea here is to maximize the overlap between the ground-truth bounding boxes and the predictions i.e. the Intersection over Union (IoU). In the scope of work seen currently in this domain, IoU is approximated by using the Huber loss as a proxy but this indirect method does not leverage the IoU information and treats the bounding box as four independent, unrelated terms of regression. This is not true for a bounding box where the four coordinates are highly correlated and hold a semantic meaning when taken together. The direct optimization of the IoU is not possible due to its non-convex and non-differentiable nature. In this paper, we have formulated a novel loss namely, the Smooth IoU, which directly",
    "path": "papers/23/04/2304.07256.json",
    "total_tokens": 829,
    "translated_title": "直接优化IoU用于边界框定位",
    "translated_abstract": "最近几年，采用卷积神经网络（CNN）的引进使得目标检测得到了显著的进步。目标检测是一个多任务学习问题，需要正确地标识图像中的对象位置和类别。本文提出了一种新的损失函数——平滑IoU损失，可以直接最大化ground-truth bounding box和预测bounding box之间的重叠部分，而不需要使用近似方法。",
    "tldr": "本文提出了一种新的损失函数——平滑IoU损失，可以直接最大化ground-truth bounding box和预测bounding box之间的重叠部分，从而提高目标检测的准确率。",
    "en_tdlr": "This paper proposes a novel loss function, Smooth IoU, which directly optimizes the Intersection over Union (IoU) for bounding box localization, improving the accuracy of object detection."
}