{
    "title": "End-to-end codesign of Hessian-aware quantized neural networks for FPGAs and ASICs. (arXiv:2304.06745v1 [cs.LG])",
    "abstract": "We develop an end-to-end workflow for the training and implementation of co-designed neural networks (NNs) for efficient field-programmable gate array (FPGA) and application-specific integrated circuit (ASIC) hardware. Our approach leverages Hessian-aware quantization (HAWQ) of NNs, the Quantized Open Neural Network Exchange (QONNX) intermediate representation, and the hls4ml tool flow for transpiling NNs into FPGA and ASIC firmware. This makes efficient NN implementations in hardware accessible to nonexperts, in a single open-sourced workflow that can be deployed for real-time machine learning applications in a wide range of scientific and industrial settings. We demonstrate the workflow in a particle physics application involving trigger decisions that must operate at the 40 MHz collision rate of the CERN Large Hadron Collider (LHC). Given the high collision rate, all data processing must be implemented on custom ASIC and FPGA hardware within a strict area and latency. Based on these",
    "link": "http://arxiv.org/abs/2304.06745",
    "context": "Title: End-to-end codesign of Hessian-aware quantized neural networks for FPGAs and ASICs. (arXiv:2304.06745v1 [cs.LG])\nAbstract: We develop an end-to-end workflow for the training and implementation of co-designed neural networks (NNs) for efficient field-programmable gate array (FPGA) and application-specific integrated circuit (ASIC) hardware. Our approach leverages Hessian-aware quantization (HAWQ) of NNs, the Quantized Open Neural Network Exchange (QONNX) intermediate representation, and the hls4ml tool flow for transpiling NNs into FPGA and ASIC firmware. This makes efficient NN implementations in hardware accessible to nonexperts, in a single open-sourced workflow that can be deployed for real-time machine learning applications in a wide range of scientific and industrial settings. We demonstrate the workflow in a particle physics application involving trigger decisions that must operate at the 40 MHz collision rate of the CERN Large Hadron Collider (LHC). Given the high collision rate, all data processing must be implemented on custom ASIC and FPGA hardware within a strict area and latency. Based on these",
    "path": "papers/23/04/2304.06745.json",
    "total_tokens": 950,
    "translated_title": "面向 FPGAs 和 ASICs 的 Hessian-aware 量化神经网络的端到端协同设计",
    "translated_abstract": "我们开发了一个端到端的工作流程，用于训练和实现协同设计的神经网络（NNs），以实现高效的现场可编程门阵列（FPGA）和专用集成电路（ASIC）硬件。我们的方法利用基于 Hessian 的量化（HAWQ）NNs，量化开放神经网络交换（QONNX）中间表示和hls4ml工具流，将NNs转换为FPGA和ASIC固件。这使得非专家可以在单个开源工作流中实现高效的NN硬件实现，并且可以在广泛的科学和工业应用中部署用于实时机器学习应用。我们在一个粒子物理应用程序中演示了工作流程，涉及必须在CERN大型强子对撞机（LHC）的40 MHz碰撞率下操作的触发决策。由于高碰撞率，所有数据处理必须在严格的面积和延迟内在定制的ASIC和FPGA硬件上实现。基于这些要求我们展示了本文工作流程。",
    "tldr": "该论文提出了一个端到端的工作流程，用于训练和实现协同设计的神经网络（NNs），以高效地在FPGAs和ASICs上实现NNs，并在粒子物理应用程序中得到了应用。"
}