{
    "title": "Aiding reinforcement learning for set point control. (arXiv:2304.10289v1 [eess.SY])",
    "abstract": "While reinforcement learning has made great improvements, state-of-the-art algorithms can still struggle with seemingly simple set-point feedback control problems. One reason for this is that the learned controller may not be able to excite the system dynamics well enough initially, and therefore it can take a long time to get data that is informative enough to learn for good control. The paper contributes by augmentation of reinforcement learning with a simple guiding feedback controller, for example, a proportional controller. The key advantage in set point control is a much improved excitation that improves the convergence properties of the reinforcement learning controller significantly. This can be very important in real-world control where quick and accurate convergence is needed. The proposed method is evaluated with simulation and on a real-world double tank process with promising results.",
    "link": "http://arxiv.org/abs/2304.10289",
    "context": "Title: Aiding reinforcement learning for set point control. (arXiv:2304.10289v1 [eess.SY])\nAbstract: While reinforcement learning has made great improvements, state-of-the-art algorithms can still struggle with seemingly simple set-point feedback control problems. One reason for this is that the learned controller may not be able to excite the system dynamics well enough initially, and therefore it can take a long time to get data that is informative enough to learn for good control. The paper contributes by augmentation of reinforcement learning with a simple guiding feedback controller, for example, a proportional controller. The key advantage in set point control is a much improved excitation that improves the convergence properties of the reinforcement learning controller significantly. This can be very important in real-world control where quick and accurate convergence is needed. The proposed method is evaluated with simulation and on a real-world double tank process with promising results.",
    "path": "papers/23/04/2304.10289.json",
    "total_tokens": 860,
    "translated_title": "辅助强化学习应用于设定点控制问题",
    "translated_abstract": "尽管强化学习已经在很多领域获得了重要进展，但目前的算法仍然不能很好地解决看似简单的设定点反馈控制问题。其中一个原因是，学得的控制器可能无法在初始阶段充分地激励系统动力学，因此需要很长时间才能获得足够信息用于学习出较好的控制策略。本文的贡献在于将强化学习和简单的引导反馈控制器（例如比例控制器）相结合，从而在设定点控制问题中实现更好的激励，显著提高了强化学习控制器的收敛性能。这在快速准确的实时控制环境中非常重要。所提出的方法经过模拟和实际的双水箱系统测试，取得了良好的结果。",
    "tldr": "本文提出了一种方法，将强化学习与简单的引导反馈控制器相结合，以实现设定点控制问题的更好激励，以提高强化学习控制器的收敛性能，克服了强化学习在实际控制环境中的不足。",
    "en_tdlr": "This paper proposes a method that combines reinforcement learning with a simple guiding feedback controller to achieve better excitation for set-point control problems, which significantly improves the convergence performance of the reinforcement learning controller, overcomes the shortcomings of reinforcement learning in practical control environments."
}