{
    "title": "Towards Efficient MCMC Sampling in Bayesian Neural Networks by Exploiting Symmetry. (arXiv:2304.02902v1 [stat.ML])",
    "abstract": "Bayesian inference in deep neural networks is challenging due to the high-dimensional, strongly multi-modal parameter posterior density landscape. Markov chain Monte Carlo approaches asymptotically recover the true posterior but are considered prohibitively expensive for large modern architectures. Local methods, which have emerged as a popular alternative, focus on specific parameter regions that can be approximated by functions with tractable integrals. While these often yield satisfactory empirical results, they fail, by definition, to account for the multi-modality of the parameter posterior. In this work, we argue that the dilemma between exact-but-unaffordable and cheap-but-inexact approaches can be mitigated by exploiting symmetries in the posterior landscape. Such symmetries, induced by neuron interchangeability and certain activation functions, manifest in different parameter values leading to the same functional output value. We show theoretically that the posterior predictiv",
    "link": "http://arxiv.org/abs/2304.02902",
    "context": "Title: Towards Efficient MCMC Sampling in Bayesian Neural Networks by Exploiting Symmetry. (arXiv:2304.02902v1 [stat.ML])\nAbstract: Bayesian inference in deep neural networks is challenging due to the high-dimensional, strongly multi-modal parameter posterior density landscape. Markov chain Monte Carlo approaches asymptotically recover the true posterior but are considered prohibitively expensive for large modern architectures. Local methods, which have emerged as a popular alternative, focus on specific parameter regions that can be approximated by functions with tractable integrals. While these often yield satisfactory empirical results, they fail, by definition, to account for the multi-modality of the parameter posterior. In this work, we argue that the dilemma between exact-but-unaffordable and cheap-but-inexact approaches can be mitigated by exploiting symmetries in the posterior landscape. Such symmetries, induced by neuron interchangeability and certain activation functions, manifest in different parameter values leading to the same functional output value. We show theoretically that the posterior predictiv",
    "path": "papers/23/04/2304.02902.json",
    "total_tokens": 924,
    "translated_title": "利用对称性在贝叶斯神经网络中实现高效MCMC采样",
    "translated_abstract": "由于高维，强多模态参数后验密度景观，深度神经网络的贝叶斯推断是具有挑战性的。马尔可夫链蒙特卡罗方法可以渐进性地恢复真实后验，但因其在大规模现代架构上被认为是代价高昂而难以应用。而局部方法，作为一种流行的替代方案，聚焦于可通过可积函数近似的特定参数区域。虽然这些方法常常能够产生满意的实证结果，但它们未能考虑参数后验的多模态性。本文认为，可以通过利用后验景观中的对称性来缓解精确但代价昂贵和廉价但不精确方法之间的困境。这种对称性由神经元可互换性和某些激活函数引起，在不同的参数值导致相同的功能输出值。我们理论上证明后验预测可以利用对称性被高效地计算和采样。",
    "tldr": "本文提出了一种利用对称性在贝叶斯神经网络中实现高效MCMC采样的方法，通过利用神经元可互换性和某些激活函数引起的对称性在参数后验的多模态性中找到平衡。",
    "en_tdlr": "This paper proposes a method for efficient MCMC sampling in Bayesian neural networks by exploiting symmetries in the posterior landscape, which can balance the dilemma between exact-but-unaffordable and cheap-but-inexact approaches, by utilizing interchangeability of neurons and certain activation functions to find a balance in the multi-modality of the parameter posterior."
}