{
    "title": "A Comparative Study of Inter-Regional Intra-Industry Disparity. (arXiv:2304.02430v1 [econ.GN])",
    "abstract": "This paper investigates the inter-regional intra-industry disparity within selected Indian manufacturing industries and industrial states. The study uses three measures - the Output-Capital Ratio, the Capital-Labor Ratio, and the Output-Labor Ratio - to critically evaluate the level of disparity in average efficiency of labor and capital, as well as capital intensity. Additionally, the paper compares the rate of disparity of per capita income between six major industrial states. The study finds that underutilization of capacity is driven by an unequal distribution of high-skilled labor supply and upgraded technologies. To address these disparities, the paper suggests that policymakers campaign for labor training and technology promotion schemes throughout all regions of India. By doing so, the study argues, the country can reduce regional inequality and improve economic outcomes for all.",
    "link": "http://arxiv.org/abs/2304.02430",
    "context": "Title: A Comparative Study of Inter-Regional Intra-Industry Disparity. (arXiv:2304.02430v1 [econ.GN])\nAbstract: This paper investigates the inter-regional intra-industry disparity within selected Indian manufacturing industries and industrial states. The study uses three measures - the Output-Capital Ratio, the Capital-Labor Ratio, and the Output-Labor Ratio - to critically evaluate the level of disparity in average efficiency of labor and capital, as well as capital intensity. Additionally, the paper compares the rate of disparity of per capita income between six major industrial states. The study finds that underutilization of capacity is driven by an unequal distribution of high-skilled labor supply and upgraded technologies. To address these disparities, the paper suggests that policymakers campaign for labor training and technology promotion schemes throughout all regions of India. By doing so, the study argues, the country can reduce regional inequality and improve economic outcomes for all.",
    "path": "papers/23/04/2304.02430.json",
    "total_tokens": 881,
    "translated_title": "跨区域内部行业差异比较研究",
    "translated_abstract": "本文研究了选定的印度制造业和工业州内的跨区域内部行业差异。研究使用了三个衡量标准——产出资本比、资本劳动比和输出劳动比——来评估平均效率以及资本密集度的差异水平。此外，本文还比较了六个主要工业州的人均收入差异率。研究发现，低效率是由高技能劳动力供应和升级技术不均匀分布所驱动的。为了解决这些差异，本文建议政策制定者在全印度地区推广劳动力培训和技术促进计划。研究认为，通过这样做，该国可以减少地区不平等并改善所有人的经济成果。",
    "tldr": "本文研究了印度制造业和工业州内的跨区域内部行业差异。研究发现，低效率是由高技能劳动力供应和升级技术不均匀分布所驱动的。为了解决这些差异，本文建议政策制定者在全印度地区推广劳动力培训和技术促进计划。"
}