{
    "title": "Decentralized federated learning methods for reducing communication cost and energy consumption in UAV networks. (arXiv:2304.06551v1 [cs.LG])",
    "abstract": "Unmanned aerial vehicles (UAV) or drones play many roles in a modern smart city such as the delivery of goods, mapping real-time road traffic and monitoring pollution. The ability of drones to perform these functions often requires the support of machine learning technology. However, traditional machine learning models for drones encounter data privacy problems, communication costs and energy limitations. Federated Learning, an emerging distributed machine learning approach, is an excellent solution to address these issues. Federated learning (FL) allows drones to train local models without transmitting raw data. However, existing FL requires a central server to aggregate the trained model parameters of the UAV. A failure of the central server can significantly impact the overall training. In this paper, we propose two aggregation methods: Commutative FL and Alternate FL, based on the existing architecture of decentralised Federated Learning for UAV Networks (DFL-UN) by adding a unique",
    "link": "http://arxiv.org/abs/2304.06551",
    "context": "Title: Decentralized federated learning methods for reducing communication cost and energy consumption in UAV networks. (arXiv:2304.06551v1 [cs.LG])\nAbstract: Unmanned aerial vehicles (UAV) or drones play many roles in a modern smart city such as the delivery of goods, mapping real-time road traffic and monitoring pollution. The ability of drones to perform these functions often requires the support of machine learning technology. However, traditional machine learning models for drones encounter data privacy problems, communication costs and energy limitations. Federated Learning, an emerging distributed machine learning approach, is an excellent solution to address these issues. Federated learning (FL) allows drones to train local models without transmitting raw data. However, existing FL requires a central server to aggregate the trained model parameters of the UAV. A failure of the central server can significantly impact the overall training. In this paper, we propose two aggregation methods: Commutative FL and Alternate FL, based on the existing architecture of decentralised Federated Learning for UAV Networks (DFL-UN) by adding a unique",
    "path": "papers/23/04/2304.06551.json",
    "total_tokens": 948,
    "translated_title": "无人机网络中的去中心化联邦学习方法以减少通信成本和能耗",
    "translated_abstract": "无人机在现代智慧城市中扮演着很多角色，如物品配送、实时道路交通地图制作和污染监测。然而，传统的无人机机器学习模型面临着数据隐私问题、通信成本和能量限制等挑战。联邦学习是一种分布式机器学习方法，能很好地解决这些问题。它可以让无人机在不传输原始数据的情况下进行本地模型训练。然而，现有的联邦学习需要一个中央服务器来聚合无人机的训练模型参数。如果中央服务器发生故障，将会对训练造成重大影响。本文提出了两种聚合方法：交换律联邦学习和轮流联邦学习。这两种方法基于已有的去中心化无人机联邦学习架构，在每个无人机的模型参数中添加一个唯一标识符。所提出的方法旨在减少通信成本和能耗，同时确保数据隐私。",
    "tldr": "本文提出了两种去中心化联邦学习方法：交换律联邦学习和轮流联邦学习。这些方法可以降低通信成本和能耗，同时确保数据隐私。",
    "en_tdlr": "This paper proposes two decentralized federated learning methods, Commutative FL and Alternate FL, to reduce communication cost and energy consumption while ensuring data privacy. These methods add a unique identifier to each drone's model parameters and are based on the existing architecture of decentralized Federated Learning for UAV Networks."
}