{
    "title": "A Meta-Summary of Challenges in Building Products with ML Components -- Collecting Experiences from 4758+ Practitioners. (arXiv:2304.00078v1 [cs.SE])",
    "abstract": "Incorporating machine learning (ML) components into software products raises new software-engineering challenges and exacerbates existing challenges. Many researchers have invested significant effort in understanding the challenges of industry practitioners working on building products with ML components, through interviews and surveys with practitioners. With the intention to aggregate and present their collective findings, we conduct a meta-summary study: We collect 50 relevant papers that together interacted with over 4758 practitioners using guidelines for systematic literature reviews. We then collected, grouped, and organized the over 500 mentions of challenges within those papers. We highlight the most commonly reported challenges and hope this meta-summary will be a useful resource for the research community to prioritize research and education in this field.",
    "link": "http://arxiv.org/abs/2304.00078",
    "context": "Title: A Meta-Summary of Challenges in Building Products with ML Components -- Collecting Experiences from 4758+ Practitioners. (arXiv:2304.00078v1 [cs.SE])\nAbstract: Incorporating machine learning (ML) components into software products raises new software-engineering challenges and exacerbates existing challenges. Many researchers have invested significant effort in understanding the challenges of industry practitioners working on building products with ML components, through interviews and surveys with practitioners. With the intention to aggregate and present their collective findings, we conduct a meta-summary study: We collect 50 relevant papers that together interacted with over 4758 practitioners using guidelines for systematic literature reviews. We then collected, grouped, and organized the over 500 mentions of challenges within those papers. We highlight the most commonly reported challenges and hope this meta-summary will be a useful resource for the research community to prioritize research and education in this field.",
    "path": "papers/23/04/2304.00078.json",
    "total_tokens": 833,
    "translated_title": "建立具有ML组件的产品中的挑战元总结——从4758位实践者那里汇集经验",
    "translated_abstract": "将机器学习（ML）组件纳入软件产品中引发了新的软件工程挑战并加剧了现有挑战。许多研究人员通过采访和调查实践者，投入了大量精力来了解构建具有ML组件的行业从业者面临的挑战。为了汇总和呈现他们的共同发现，我们进行了一项元总结研究：我们收集了50篇相关论文，这些论文通过系统文献综述指南与超过4758位实践者互动。然后我们收集、分组和组织了这些论文中提到的500多个挑战。我们强调了最常报告的挑战，并希望这个元总结能成为研究界在这个领域中优先进行研究和教育的有用资源。",
    "tldr": "该研究汇总了50篇文献对于构建带有机器学习组件的产品所遇到的挑战，并总结了其中最常见的问题，为研究和教育提供了有用的资源。"
}