{
    "title": "Towards Reliable Colorectal Cancer Polyps Classification via Vision Based Tactile Sensing and Confidence-Calibrated Neural Networks. (arXiv:2304.13192v1 [cs.CV])",
    "abstract": "In this study, toward addressing the over-confident outputs of existing artificial intelligence-based colorectal cancer (CRC) polyp classification techniques, we propose a confidence-calibrated residual neural network. Utilizing a novel vision-based tactile sensing (VS-TS) system and unique CRC polyp phantoms, we demonstrate that traditional metrics such as accuracy and precision are not sufficient to encapsulate model performance for handling a sensitive CRC polyp diagnosis. To this end, we develop a residual neural network classifier and address its over-confident outputs for CRC polyps classification via the post-processing method of temperature scaling. To evaluate the proposed method, we introduce noise and blur to the obtained textural images of the VS-TS and test the model's reliability for non-ideal inputs through reliability diagrams and other statistical metrics.",
    "link": "http://arxiv.org/abs/2304.13192",
    "context": "Title: Towards Reliable Colorectal Cancer Polyps Classification via Vision Based Tactile Sensing and Confidence-Calibrated Neural Networks. (arXiv:2304.13192v1 [cs.CV])\nAbstract: In this study, toward addressing the over-confident outputs of existing artificial intelligence-based colorectal cancer (CRC) polyp classification techniques, we propose a confidence-calibrated residual neural network. Utilizing a novel vision-based tactile sensing (VS-TS) system and unique CRC polyp phantoms, we demonstrate that traditional metrics such as accuracy and precision are not sufficient to encapsulate model performance for handling a sensitive CRC polyp diagnosis. To this end, we develop a residual neural network classifier and address its over-confident outputs for CRC polyps classification via the post-processing method of temperature scaling. To evaluate the proposed method, we introduce noise and blur to the obtained textural images of the VS-TS and test the model's reliability for non-ideal inputs through reliability diagrams and other statistical metrics.",
    "path": "papers/23/04/2304.13192.json",
    "total_tokens": 951,
    "translated_title": "基于视觉触觉传感与置信度校准神经网络的可靠结直肠癌息肉诊断",
    "translated_abstract": "本研究针对现有基于人工智能的结直肠癌（CRC）息肉分类技术输出过于自信的问题，提出了一种置信度校准残差神经网络。利用一种新型的视觉触觉传感系统和独特的CRC息肉模拟体，我们证明了传统的准确度和精度等指标不足以全面评估模型在处理敏感CRC息肉诊断方面的性能。为此，我们设计了一个残差神经网络分类器，并通过温度缩放的后处理方法解决其过度自信的输出问题。为评估所提出方法的可靠性，我们通过 reliability diagrams 和其他统计指标，引入了噪声和模糊效果来测试 VS-TS 所获取的纹理图像的非理想输入下的模型可靠性。",
    "tldr": "本研究针对基于人工智能的结直肠癌（CRC）息肉分类技术输出过于自信的问题，提出了一种利用视觉触觉传感系统和独特的CRC息肉模拟体的残差神经网络分类器，并通过温度缩放的后处理方法解决其过度自信的输出问题，从而实现了可靠的CRC息肉诊断。",
    "en_tdlr": "This study proposes a confidence-calibrated residual neural network for reliable colorectal cancer polyp diagnosis, addressing the over-confident outputs of existing artificial intelligence-based classification techniques. By utilizing a novel vision-based tactile sensing system and unique CRC polyp phantoms, the study demonstrates traditional metrics such as accuracy and precision are not sufficient to evaluate performance, and uses temperature scaling to address over-confidence. Reliability is evaluated through noise and blur tests, with the proposed method achieving reliable CRC polyp diagnosis."
}