{
    "title": "\"Can We Detect Substance Use Disorder?\": Knowledge and Time Aware Classification on Social Media from Darkweb. (arXiv:2304.10512v1 [cs.LG])",
    "abstract": "Opioid and substance misuse is rampant in the United States today, with the phenomenon known as the \"opioid crisis\". The relationship between substance use and mental health has been extensively studied, with one possible relationship being: substance misuse causes poor mental health. However, the lack of evidence on the relationship has resulted in opioids being largely inaccessible through legal means. This study analyzes the substance use posts on social media with opioids being sold through crypto market listings. We use the Drug Abuse Ontology, state-of-the-art deep learning, and knowledge-aware BERT-based models to generate sentiment and emotion for the social media posts to understand users' perceptions on social media by investigating questions such as: which synthetic opioids people are optimistic, neutral, or negative about? or what kind of drugs induced fear and sorrow? or what kind of drugs people love or are thankful about? or which drugs people think negatively about? or ",
    "link": "http://arxiv.org/abs/2304.10512",
    "context": "Title: \"Can We Detect Substance Use Disorder?\": Knowledge and Time Aware Classification on Social Media from Darkweb. (arXiv:2304.10512v1 [cs.LG])\nAbstract: Opioid and substance misuse is rampant in the United States today, with the phenomenon known as the \"opioid crisis\". The relationship between substance use and mental health has been extensively studied, with one possible relationship being: substance misuse causes poor mental health. However, the lack of evidence on the relationship has resulted in opioids being largely inaccessible through legal means. This study analyzes the substance use posts on social media with opioids being sold through crypto market listings. We use the Drug Abuse Ontology, state-of-the-art deep learning, and knowledge-aware BERT-based models to generate sentiment and emotion for the social media posts to understand users' perceptions on social media by investigating questions such as: which synthetic opioids people are optimistic, neutral, or negative about? or what kind of drugs induced fear and sorrow? or what kind of drugs people love or are thankful about? or which drugs people think negatively about? or ",
    "path": "papers/23/04/2304.10512.json",
    "total_tokens": 1006,
    "translated_title": "“我们能检测出物质使用障碍吗？”：来自暗网社交媒体上的知识和时间感知分类研究。(arXiv:2304.10512v1[cs.LG])",
    "translated_abstract": "目前，美国的阿片类和物质滥用问题日益严重，这种现象被称为“阿片类危机”。物质使用和心理健康之间的关系已经得到了广泛研究，其中一种可能的关系是：物质滥用导致心理健康状况不佳。然而，由于缺乏证据，导致合法途径购买的阿片类物质很难获得。本研究分析了社交媒体上有关物质使用的帖子，重点关注通过加密市场销售的合成阿片类物质。我们使用了药物滥用本体论，最先进的深度学习和知识感知BERT模型生成社交媒体帖子的情感和情绪，以了解用户对社交媒体的看法，研究问题，例如：人们对哪种合成阿片类物质持乐观态度、中立态度或者消极态度？或者哪些药物引起了恐惧和悲伤？人们喜欢哪些药物，或者对哪些药物感激？哪些药物人们持消极态度？",
    "tldr": "本研究使用知识感知BERT模型，分析社交媒体上发布的与合成阿片类物质相关的帖子，以了解用户对不同合成阿片类物质的情感和情绪，从而帮助预测物质使用障碍。"
}