{
    "title": "Unsupervised Learning of Robust Spectral Shape Matching. (arXiv:2304.14419v1 [cs.CV])",
    "abstract": "We propose a novel learning-based approach for robust 3D shape matching. Our method builds upon deep functional maps and can be trained in a fully unsupervised manner. Previous deep functional map methods mainly focus on predicting optimised functional maps alone, and then rely on off-the-shelf post-processing to obtain accurate point-wise maps during inference. However, this two-stage procedure for obtaining point-wise maps often yields sub-optimal performance. In contrast, building upon recent insights about the relation between functional maps and point-wise maps, we propose a novel unsupervised loss to couple the functional maps and point-wise maps, and thereby directly obtain point-wise maps without any post-processing. Our approach obtains accurate correspondences not only for near-isometric shapes, but also for more challenging non-isometric shapes and partial shapes, as well as shapes with different discretisation or topological noise. Using a total of nine diverse datasets, we",
    "link": "http://arxiv.org/abs/2304.14419",
    "context": "Title: Unsupervised Learning of Robust Spectral Shape Matching. (arXiv:2304.14419v1 [cs.CV])\nAbstract: We propose a novel learning-based approach for robust 3D shape matching. Our method builds upon deep functional maps and can be trained in a fully unsupervised manner. Previous deep functional map methods mainly focus on predicting optimised functional maps alone, and then rely on off-the-shelf post-processing to obtain accurate point-wise maps during inference. However, this two-stage procedure for obtaining point-wise maps often yields sub-optimal performance. In contrast, building upon recent insights about the relation between functional maps and point-wise maps, we propose a novel unsupervised loss to couple the functional maps and point-wise maps, and thereby directly obtain point-wise maps without any post-processing. Our approach obtains accurate correspondences not only for near-isometric shapes, but also for more challenging non-isometric shapes and partial shapes, as well as shapes with different discretisation or topological noise. Using a total of nine diverse datasets, we",
    "path": "papers/23/04/2304.14419.json",
    "total_tokens": 883,
    "translated_title": "无监督学习鲁棒性谱形匹配",
    "translated_abstract": "我们提出了一种新的学习方法来进行鲁棒的三维形状匹配。我们的方法基于深度函数映射，并可以完全无监督地进行训练。之前的深度函数映射方法主要集中在预测最优化函数映射上，然后依靠现成的后期处理来获得在推理过程中准确的点映射。然而，这个两阶段过程通常会产生次优性能。相比之下，我们提出了一种新的无监督损失，利用函数映射和点映射之间关系的最新见解，从而直接获得点映射而无需任何后期处理。我们的方法不仅可以获得近等距形状的准确对应关系，还可以获得更具挑战性的非等距形状和部分形状，以及存在不同离散化或拓扑噪声的形状的准确对应关系。使用总共九个不同的数据集，我们的方法在不同场景下得到了很好的结果。",
    "tldr": "该方法提出了一种新的学习方法，使用无监督方式进行鲁棒的三维形状匹配，可以获得不同场景下的准确对应关系。"
}