{
    "title": "Reduction of Excess Capacity with Response of Capital Intensity. (arXiv:2304.00489v1 [econ.GN])",
    "abstract": "Purpose: The objective of this research was to show the response of the potential reduction of excess capacity in terms of capital intensity to the growth rate of labor productivity in the manufacturing industrial sector. Design/Methodology/Approach: The research was carried out in 2019 in 55 groups of Indian manufacturing industry within six major Indian industrial states. Mainly, the research used the modified VES (Variable Elasticity Substitution) estimation model. The research focused on the value of the additional substitution parameter of capital intensity (mu > 0). Findings: Almost all selected industry groups with in six states need capital-intensive production. The results found additional parameter of capital intensity (mu) is greater than zero for all industry groups. It means that a higher product per man can be obtained by increasing the capital per worker. Practical Implications: Research shows that an increasingly need for capital investment in need for higher labor prod",
    "link": "http://arxiv.org/abs/2304.00489",
    "context": "Title: Reduction of Excess Capacity with Response of Capital Intensity. (arXiv:2304.00489v1 [econ.GN])\nAbstract: Purpose: The objective of this research was to show the response of the potential reduction of excess capacity in terms of capital intensity to the growth rate of labor productivity in the manufacturing industrial sector. Design/Methodology/Approach: The research was carried out in 2019 in 55 groups of Indian manufacturing industry within six major Indian industrial states. Mainly, the research used the modified VES (Variable Elasticity Substitution) estimation model. The research focused on the value of the additional substitution parameter of capital intensity (mu > 0). Findings: Almost all selected industry groups with in six states need capital-intensive production. The results found additional parameter of capital intensity (mu) is greater than zero for all industry groups. It means that a higher product per man can be obtained by increasing the capital per worker. Practical Implications: Research shows that an increasingly need for capital investment in need for higher labor prod",
    "path": "papers/23/04/2304.00489.json",
    "total_tokens": 790,
    "translated_title": "资本密集度对产能过剩的反应减少研究",
    "translated_abstract": "本研究旨在展示在制造业中，劳动生产率增长率对资本密度潜在降低产能过剩的反应。该研究采用了修改后的VES（可变弹性替代）估计模型，并在印度六个主要工业州的55个制造业集团中进行了调查。结果发现，在所有行业组中附加的资本密度参数（mu）均大于零，这意味着通过增加每位工人的资本，可以获得更高的产量。因此，在制造业中，需要进行资本投资以提高劳动生产率，从而优化剩余产能利用，实现更高的生产力。",
    "tldr": "研究结果显示，在制造业中，资本投资可以帮助提高劳动生产率以优化产能利用并减少过剩产能。"
}