{
    "title": "Federated Learning for Predictive Maintenance and Quality Inspection in Industrial Applications. (arXiv:2304.11101v1 [cs.LG])",
    "abstract": "Data-driven machine learning is playing a crucial role in the advancements of Industry 4.0, specifically in enhancing predictive maintenance and quality inspection. Federated learning (FL) enables multiple participants to develop a machine learning model without compromising the privacy and confidentiality of their data. In this paper, we evaluate the performance of different FL aggregation methods and compare them to central and local training approaches. Our study is based on four datasets with varying data distributions. The results indicate that the performance of FL is highly dependent on the data and its distribution among clients. In some scenarios, FL can be an effective alternative to traditional central or local training methods. Additionally, we introduce a new federated learning dataset from a real-world quality inspection setting.",
    "link": "http://arxiv.org/abs/2304.11101",
    "context": "Title: Federated Learning for Predictive Maintenance and Quality Inspection in Industrial Applications. (arXiv:2304.11101v1 [cs.LG])\nAbstract: Data-driven machine learning is playing a crucial role in the advancements of Industry 4.0, specifically in enhancing predictive maintenance and quality inspection. Federated learning (FL) enables multiple participants to develop a machine learning model without compromising the privacy and confidentiality of their data. In this paper, we evaluate the performance of different FL aggregation methods and compare them to central and local training approaches. Our study is based on four datasets with varying data distributions. The results indicate that the performance of FL is highly dependent on the data and its distribution among clients. In some scenarios, FL can be an effective alternative to traditional central or local training methods. Additionally, we introduce a new federated learning dataset from a real-world quality inspection setting.",
    "path": "papers/23/04/2304.11101.json",
    "total_tokens": 874,
    "translated_title": "工业应用中的预测性维护和质量检查的联邦学习",
    "translated_abstract": "数据驱动的机器学习在工业4.0的推动中扮演着至关重要的角色，特别是在增强预测性维护和质量检查方面。联邦学习（FL）使多个参与者能够开发机器学习模型，而不会危及其数据的隐私和机密性。本文评估了不同FL聚合方法的性能，并将其与中心和本地训练方法进行比较。我们的研究基于四个具有不同数据分布的数据集。结果表明，FL的性能高度取决于数据以及其在客户端之间的分布。在某些情况下，FL可以成为传统中心或本地训练方法的有效替代。此外，我们还在真实的质量检查情境中引入了一个新的联邦学习数据集。",
    "tldr": "本文评估了联邦学习在四个具有不同数据分布的数据集上的表现，并将其与中心和本地训练方法进行比较。结果表明，FL的性能高度取决于数据以及其在客户端之间的分布，FL可以成为传统中心或本地训练方法的有效替代。此外，该论文引入了一个真实的质量检查情境中的联邦学习数据集。",
    "en_tdlr": "This paper evaluates the performance of federated learning on four datasets with varying data distributions, compares it to central and local training methods, and suggests that FL can be an effective alternative. Additionally, a new federated learning dataset from a real-world quality inspection setting is introduced."
}