{
    "title": "DRIP: Deep Regularizers for Inverse Problems. (arXiv:2304.00015v1 [cs.LG])",
    "abstract": "Inverse problems are mathematically ill-posed. Thus, given some (noisy) data, there is more than one solution that fits the data. In recent years, deep neural techniques that find the most appropriate solution, in the sense that it contains a-priori information, were developed. However, they suffer from several shortcomings. First, most techniques cannot guarantee that the solution fits the data at inference. Second, while the derivation of the techniques is inspired by the existence of a valid scalar regularization function, such techniques do not in practice rely on such a function, and therefore veer away from classical variational techniques. In this work we introduce a new family of neural regularizers for the solution of inverse problems. These regularizers are based on a variational formulation and are guaranteed to fit the data. We demonstrate their use on a number of highly ill-posed problems, from image deblurring to limited angle tomography.",
    "link": "http://arxiv.org/abs/2304.00015",
    "context": "Title: DRIP: Deep Regularizers for Inverse Problems. (arXiv:2304.00015v1 [cs.LG])\nAbstract: Inverse problems are mathematically ill-posed. Thus, given some (noisy) data, there is more than one solution that fits the data. In recent years, deep neural techniques that find the most appropriate solution, in the sense that it contains a-priori information, were developed. However, they suffer from several shortcomings. First, most techniques cannot guarantee that the solution fits the data at inference. Second, while the derivation of the techniques is inspired by the existence of a valid scalar regularization function, such techniques do not in practice rely on such a function, and therefore veer away from classical variational techniques. In this work we introduce a new family of neural regularizers for the solution of inverse problems. These regularizers are based on a variational formulation and are guaranteed to fit the data. We demonstrate their use on a number of highly ill-posed problems, from image deblurring to limited angle tomography.",
    "path": "papers/23/04/2304.00015.json",
    "total_tokens": 861,
    "translated_title": "DRIP: 逆问题的深度正则化器",
    "translated_abstract": "逆问题在数学上是不良定义的，因此对于一些（带有噪声的）数据，可能会有不止一个与数据匹配的解。近年来，一些能够找到最合适解决方案的深度神经技术得到了发展，但它们存在一些缺点：大多数技术无法保证解决方案能够在推理时匹配数据；虽然这些技术的推导是基于一个有效的标量正则化函数存在的基础之上，但在实际运用中这些技术并没有依赖于这样一个函数，因此与传统的变分技术有所偏离。本文提出了一种新的神经正则化器家族来解决逆问题，这些正则化器基于变分形式，并保证适配数据。我们演示了它们在一些高度ill-posed问题上的使用，包括图像去模糊和小角度层析成像。",
    "tldr": "提出了一种基于变分法的深度神经正则化器家族，保证可以适配数据并解决逆问题。在图像去模糊和小角度层析成像等问题上可行。",
    "en_tdlr": "A family of deep neural regularizers based on variational formulation for solving inverse problems is proposed, which can guarantee the fitting of data. They are demonstrated to be valid in highly ill-posed problems such as image deblurring and limited angle tomography."
}