{
    "title": "ViMQ: A Vietnamese Medical Question Dataset for Healthcare Dialogue System Development. (arXiv:2304.14405v1 [cs.CL])",
    "abstract": "Existing medical text datasets usually take the form of ques- tion and answer pairs that support the task of natural language gener- ation, but lacking the composite annotations of the medical terms. In this study, we publish a Vietnamese dataset of medical questions from patients with sentence-level and entity-level annotations for the Intent Classification and Named Entity Recognition tasks. The tag sets for two tasks are in medical domain and can facilitate the development of task- oriented healthcare chatbots with better comprehension of queries from patients. We train baseline models for the two tasks and propose a simple self-supervised training strategy with span-noise modelling that substan- tially improves the performance. Dataset and code will be published at https://github.com/tadeephuy/ViMQ",
    "link": "http://arxiv.org/abs/2304.14405",
    "context": "Title: ViMQ: A Vietnamese Medical Question Dataset for Healthcare Dialogue System Development. (arXiv:2304.14405v1 [cs.CL])\nAbstract: Existing medical text datasets usually take the form of ques- tion and answer pairs that support the task of natural language gener- ation, but lacking the composite annotations of the medical terms. In this study, we publish a Vietnamese dataset of medical questions from patients with sentence-level and entity-level annotations for the Intent Classification and Named Entity Recognition tasks. The tag sets for two tasks are in medical domain and can facilitate the development of task- oriented healthcare chatbots with better comprehension of queries from patients. We train baseline models for the two tasks and propose a simple self-supervised training strategy with span-noise modelling that substan- tially improves the performance. Dataset and code will be published at https://github.com/tadeephuy/ViMQ",
    "path": "papers/23/04/2304.14405.json",
    "total_tokens": 798,
    "translated_title": "ViMQ：面向医疗对话系统开发的越南医学问题数据集",
    "translated_abstract": "现有的医疗文本数据集通常采用问题和答案对的形式，支持自然语言生成任务，但缺乏医学术语的组合注释。在本研究中，我们发布了一个越南医学问题数据集，具有针对意图分类和命名实体识别任务的句子级和实体级注释。两个任务的标签集均属于医学领域，并能够促进面向任务的医疗聊天机器人从患者查询中更好地理解其含义。我们对两个任务进行了基线模型训练，并提出了一种简单的自监督训练策略，通过跨度噪声建模显着提高了性能。数据集和代码将发布在 https://github.com/tadeephuy/ViMQ。",
    "tldr": "该论文介绍了一个医学问题数据集ViMQ，该数据集涵盖了越南患者的医学问题，并提供了意图分类和命名实体识别任务的标签集，有助于促进医疗聊天机器人的发展。",
    "en_tdlr": "This paper introduces ViMQ, a medical question dataset that covers medical questions from Vietnamese patients and provides tag sets for intent classification and named entity recognition tasks, which can facilitate the development of healthcare chatbots."
}