{
    "title": "EnforceSNN: Enabling Resilient and Energy-Efficient Spiking Neural Network Inference considering Approximate DRAMs for Embedded Systems. (arXiv:2304.04039v1 [cs.NE])",
    "abstract": "Spiking Neural Networks (SNNs) have shown capabilities of achieving high accuracy under unsupervised settings and low operational power/energy due to their bio-plausible computations. Previous studies identified that DRAM-based off-chip memory accesses dominate the energy consumption of SNN processing. However, state-of-the-art works do not optimize the DRAM energy-per-access, thereby hindering the SNN-based systems from achieving further energy efficiency gains. To substantially reduce the DRAM energy-per-access, an effective solution is to decrease the DRAM supply voltage, but it may lead to errors in DRAM cells (i.e., so-called approximate DRAM). Towards this, we propose \\textit{EnforceSNN}, a novel design framework that provides a solution for resilient and energy-efficient SNN inference using reduced-voltage DRAM for embedded systems. The key mechanisms of our EnforceSNN are: (1) employing quantized weights to reduce the DRAM access energy; (2) devising an efficient DRAM mapping p",
    "link": "http://arxiv.org/abs/2304.04039",
    "context": "Title: EnforceSNN: Enabling Resilient and Energy-Efficient Spiking Neural Network Inference considering Approximate DRAMs for Embedded Systems. (arXiv:2304.04039v1 [cs.NE])\nAbstract: Spiking Neural Networks (SNNs) have shown capabilities of achieving high accuracy under unsupervised settings and low operational power/energy due to their bio-plausible computations. Previous studies identified that DRAM-based off-chip memory accesses dominate the energy consumption of SNN processing. However, state-of-the-art works do not optimize the DRAM energy-per-access, thereby hindering the SNN-based systems from achieving further energy efficiency gains. To substantially reduce the DRAM energy-per-access, an effective solution is to decrease the DRAM supply voltage, but it may lead to errors in DRAM cells (i.e., so-called approximate DRAM). Towards this, we propose \\textit{EnforceSNN}, a novel design framework that provides a solution for resilient and energy-efficient SNN inference using reduced-voltage DRAM for embedded systems. The key mechanisms of our EnforceSNN are: (1) employing quantized weights to reduce the DRAM access energy; (2) devising an efficient DRAM mapping p",
    "path": "papers/23/04/2304.04039.json",
    "total_tokens": 942,
    "translated_title": "EnforceSNN: 在嵌入式系统中考虑近似DRAM，实现弹性和节能的脉冲神经网络推理",
    "translated_abstract": "脉冲神经网络（SNN）由于其生物可行计算能力，在无监督设置下具有高精度和低操作功率/能量。先前的研究发现，基于DRAM的 off-chip 内存访问占据了SNN处理的能量消耗。然而，现有的工作并未优化DRAM的每次访问的能量，从而阻碍了基于SNN的系统实现进一步的节能效益。为了大幅度降低DRAM的每次访问的能量，一个有效的解决方案是降低DRAM供电电压，但这可能会导致DRAM单元的错误（即所谓的近似DRAM）。为此，我们提出了EnforceSNN，一种新的设计框架，使用降压DRAM实现弹性和节能的 SNN 推理在嵌入式系统中。我们 EnforceSNN 的关键机制是:(1)采用量化权重降低DRAM的访问能量；(2)设计了一种高效的DRAM映射p",
    "tldr": "EnforceSNN 提出了一个新的设计框架，在嵌入式系统中考虑近似DRAM，使用量化权重降低DRAM的访问能量，实现了弹性和节能的SNN推理。",
    "en_tdlr": "EnforceSNN proposes a novel design framework that enables resilient and energy-efficient Spiking Neural Network inference considering approximate DRAMs for embedded systems. Key mechanisms include using quantized weights to reduce DRAM access energy and devising an efficient DRAM mapping."
}