{
    "title": "SkinGPT: A Dermatology Diagnostic System with Vision Large Language Model. (arXiv:2304.10691v1 [eess.IV])",
    "abstract": "Skin and subcutaneous diseases are among the major causes of the nonfatal disease burden worldwide, affecting a significant proportion of the population. However, there are three major challenges in the field of dermatology diagnosis. Firstly, there is a shortage of dermatologists available to diagnose patients. Secondly, accurately diagnosing dermatological pictures can be challenging. Lastly, providing user-friendly diagnostic reports can be difficult. Recent advancements in the field of large language models (LLMs) have shown potential for clinical applications. However, current LLMs have difficulty processing images, and there are potential privacy concerns associated with using ChatGPT's API for uploading data. In this paper, we propose SkinGPT, which is the first dermatology diagnostic system that utilizes an advanced vision-based large language model. SkinGPT is the first system of its kind, incorporating a fine-tuned version of MiniGPT-4 with a vast collection of in-house skin ",
    "link": "http://arxiv.org/abs/2304.10691",
    "context": "Title: SkinGPT: A Dermatology Diagnostic System with Vision Large Language Model. (arXiv:2304.10691v1 [eess.IV])\nAbstract: Skin and subcutaneous diseases are among the major causes of the nonfatal disease burden worldwide, affecting a significant proportion of the population. However, there are three major challenges in the field of dermatology diagnosis. Firstly, there is a shortage of dermatologists available to diagnose patients. Secondly, accurately diagnosing dermatological pictures can be challenging. Lastly, providing user-friendly diagnostic reports can be difficult. Recent advancements in the field of large language models (LLMs) have shown potential for clinical applications. However, current LLMs have difficulty processing images, and there are potential privacy concerns associated with using ChatGPT's API for uploading data. In this paper, we propose SkinGPT, which is the first dermatology diagnostic system that utilizes an advanced vision-based large language model. SkinGPT is the first system of its kind, incorporating a fine-tuned version of MiniGPT-4 with a vast collection of in-house skin ",
    "path": "papers/23/04/2304.10691.json",
    "total_tokens": 938,
    "translated_title": "SkinGPT: 一种基于视觉大语言模型的皮肤科诊断系统",
    "translated_abstract": "皮肤和皮下疾病是全球非致命疾病负担的主要原因之一，影响了大部分人口。然而，皮肤科诊断领域存在三个主要挑战：皮肤科医生不足、准确诊断皮肤科图片难度大以及提供用户友好的诊断报告困难。最近大型语言模型的进展显示出了在临床应用中的潜力。然而，当前的大型语言模型在处理图像上存在困难，并且使用ChatGPT的API上传数据会存在潜在的隐私问题。在本文中，我们提出了SkinGPT，这是第一个利用高级视觉大语言模型的皮肤科诊断系统。SkinGPT是首个采用内部皮肤图像集合和迷你GPT-4的精细调整版本结合而成的系统。",
    "tldr": "SkinGPT是一个基于迷你GPT-4的精细调整版本和内部皮肤图像集合结合的皮肤科诊断系统，利用高级视觉大语言模型，解决了皮肤科医生不足、准确诊断皮肤科图片难度大，以及提供用户友好的诊断报告困难等三个挑战。"
}