{
    "title": "Robust Market Potential Assessment: Designing optimal policies for low-carbon technology adoption in an increasingly uncertain world. (arXiv:2304.10203v1 [econ.GN])",
    "abstract": "Increasing the adoption of alternative technologies is vital to ensure a successful transition to net-zero emissions in the manufacturing sector. Yet there is no model to analyse technology adoption and the impact of policy interventions in generating sufficient demand to reduce cost. Such a model is vital for assessing policy-instruments for the implementation of future energy scenarios. The design of successful policies for technology uptake becomes increasingly difficult when associated market forces/factors are uncertain, such as energy prices or technology efficiencies. In this paper we formulate a novel robust market potential assessment problem under uncertainty, resulting in policies that are immune to uncertain factors. We demonstrate two case studies: the potential use of carbon capture and storage for iron and steel production across the EU, and the transition to hydrogen from natural gas in steam boilers across the chemicals industry in the UK. Each robust optimisation prob",
    "link": "http://arxiv.org/abs/2304.10203",
    "context": "Title: Robust Market Potential Assessment: Designing optimal policies for low-carbon technology adoption in an increasingly uncertain world. (arXiv:2304.10203v1 [econ.GN])\nAbstract: Increasing the adoption of alternative technologies is vital to ensure a successful transition to net-zero emissions in the manufacturing sector. Yet there is no model to analyse technology adoption and the impact of policy interventions in generating sufficient demand to reduce cost. Such a model is vital for assessing policy-instruments for the implementation of future energy scenarios. The design of successful policies for technology uptake becomes increasingly difficult when associated market forces/factors are uncertain, such as energy prices or technology efficiencies. In this paper we formulate a novel robust market potential assessment problem under uncertainty, resulting in policies that are immune to uncertain factors. We demonstrate two case studies: the potential use of carbon capture and storage for iron and steel production across the EU, and the transition to hydrogen from natural gas in steam boilers across the chemicals industry in the UK. Each robust optimisation prob",
    "path": "papers/23/04/2304.10203.json",
    "total_tokens": 930,
    "tldr": "本论文提出了一个能够在不确定情况下设计健壮政策的新型鲁棒市场潜力评估问题，并通过分析两个案例研究展示出其在促进低碳技术采纳方面的应用价值。",
    "en_tdlr": "This paper presents a novel robust market potential assessment problem that is able to design resilient policies in uncertain situations, and demonstrates its value in promoting the adoption of low-carbon technologies through analyzing two case studies."
}