{
    "title": "Inference for the proportional odds cumulative logit model with monotonicity constraints for ordinal predictors and ordinal response. (arXiv:2107.04946v3 [econ.EM] UPDATED)",
    "abstract": "The proportional odds cumulative logit model (POCLM) is a standard regression model for an ordinal response. Ordinality of predictors can be incorporated by monotonicity constraints for the corresponding parameters. It is shown that estimators defined by optimization, such as maximum likelihood estimators, for an unconstrained model and for parameters in the interior set of the parameter space of a constrained model are asymptotically equivalent. This is used in order to derive asymptotic confidence regions and tests for the constrained model, involving simple modifications for finite samples. The finite sample coverage probability of the confidence regions is investigated by simulation. Tests concern the effect of individual variables, monotonicity, and a specified monotonicity direction. The methodology is applied on real data related to the assessment of school performance.",
    "link": "http://arxiv.org/abs/2107.04946",
    "context": "Title: Inference for the proportional odds cumulative logit model with monotonicity constraints for ordinal predictors and ordinal response. (arXiv:2107.04946v3 [econ.EM] UPDATED)\nAbstract: The proportional odds cumulative logit model (POCLM) is a standard regression model for an ordinal response. Ordinality of predictors can be incorporated by monotonicity constraints for the corresponding parameters. It is shown that estimators defined by optimization, such as maximum likelihood estimators, for an unconstrained model and for parameters in the interior set of the parameter space of a constrained model are asymptotically equivalent. This is used in order to derive asymptotic confidence regions and tests for the constrained model, involving simple modifications for finite samples. The finite sample coverage probability of the confidence regions is investigated by simulation. Tests concern the effect of individual variables, monotonicity, and a specified monotonicity direction. The methodology is applied on real data related to the assessment of school performance.",
    "path": "papers/21/07/2107.04946.json",
    "total_tokens": 840,
    "translated_title": "具有单调性约束的比例几率累积logit模型的推断",
    "translated_abstract": "比例几率累积logit模型（POCLM）是一种用于处理有序响应变量的标准回归模型。对于相应参数的单调性约束可以将预测变量的有序性纳入模型中。本文证明了，针对无约束模型和满足约束模型参数内部集的优化定义的估计量在渐进意义下是等价的。这被用于推导满足约束的渐进置信区间和检验，这涉及到有限样本的简单修改。通过模拟研究置信区间的有限样本覆盖概率。检验涉及到个体变量的影响，单调性以及指定的单调性方向。该方法应用于与学校绩效评估相关的实际数据。",
    "tldr": "本文提出了一种用于处理有序响应变量的比例几率累积logit模型，通过单调性约束将预测变量的有序性纳入模型中。同时，提出了一种可用于该约束模型的置信区间和检验方法，并在实际数据上进行了应用。",
    "en_tdlr": "This paper proposes a proportional odds cumulative logit model for ordinal response variables, which incorporates the ordinality of predictors through monotonicity constraints. The authors also present a method for constructing confidence regions and tests for the constrained model, which are applied to real data on school performance."
}