{
    "title": "Bandit Quickest Changepoint Detection. (arXiv:2107.10492v3 [cs.LG] UPDATED)",
    "abstract": "Many industrial and security applications employ a suite of sensors for detecting abrupt changes in temporal behavior patterns. These abrupt changes typically manifest locally, rendering only a small subset of sensors informative. Continuous monitoring of every sensor can be expensive due to resource constraints, and serves as a motivation for the bandit quickest changepoint detection problem, where sensing actions (or sensors) are sequentially chosen, and only measurements corresponding to chosen actions are observed. We derive an information-theoretic lower bound on the detection delay for a general class of finitely parameterized probability distributions. We then propose a computationally efficient online sensing scheme, which seamlessly balances the need for exploration of different sensing options with exploitation of querying informative actions. We derive expected delay bounds for the proposed scheme and show that these bounds match our information-theoretic lower bounds at low",
    "link": "http://arxiv.org/abs/2107.10492",
    "context": "Title: Bandit Quickest Changepoint Detection. (arXiv:2107.10492v3 [cs.LG] UPDATED)\nAbstract: Many industrial and security applications employ a suite of sensors for detecting abrupt changes in temporal behavior patterns. These abrupt changes typically manifest locally, rendering only a small subset of sensors informative. Continuous monitoring of every sensor can be expensive due to resource constraints, and serves as a motivation for the bandit quickest changepoint detection problem, where sensing actions (or sensors) are sequentially chosen, and only measurements corresponding to chosen actions are observed. We derive an information-theoretic lower bound on the detection delay for a general class of finitely parameterized probability distributions. We then propose a computationally efficient online sensing scheme, which seamlessly balances the need for exploration of different sensing options with exploitation of querying informative actions. We derive expected delay bounds for the proposed scheme and show that these bounds match our information-theoretic lower bounds at low",
    "path": "papers/21/07/2107.10492.json",
    "total_tokens": 795,
    "translated_title": "异常最快变点检测中的赌博机方法",
    "translated_abstract": "许多工业和安全应用程序使用一组传感器来检测时间行为模式中的突变。这些突变通常在局部表现出来，仅使一小部分传感器有信息。由于资源限制，监控每个传感器可能很昂贵，这是进行赌博机最快变点检测问题的动机，其中选择一系列传感动作（或传感器），并且只观察与所选动作对应的测量。我们推导了有限参数概率分布类别的检测延迟的信息理论下界。我们随后提出了一种计算有效的在线感知方案，它无缝平衡了对不同传感选项的探索需求与询问信息动作的利用。我们推导了所提出方案的预期延迟界限，同时证明了这些界限与我们的信息理论下界在低维空间的匹配性。",
    "tldr": "基于赌博机的方法可以有效平衡探索和利用，实现对一组传感器的最快变点检测，从而节省资源和成本。",
    "en_tdlr": "A bandit method can effectively balance exploration and exploitation for the quickest changepoint detection problem, which saves resources and costs in detecting abrupt changes using a suite of sensors."
}