{
    "title": "Parameter selection in Gaussian process interpolation: an empirical study of selection criteria. (arXiv:2107.06006v5 [stat.ME] UPDATED)",
    "abstract": "This article revisits the fundamental problem of parameter selection for Gaussian process interpolation. By choosing the mean and the covariance functions of a Gaussian process within parametric families, the user obtains a family of Bayesian procedures to perform predictions about the unknown function, and must choose a member of the family that will hopefully provide good predictive performances. We base our study on the general concept of scoring rules, which provides an effective framework for building leave-one-out selection and validation criteria, and a notion of extended likelihood criteria based on an idea proposed by Fasshauer and co-authors in 2009, which makes it possible to recover standard selection criteria such as, for instance, the generalized cross-validation criterion. Under this setting, we empirically show on several test problems of the literature that the choice of an appropriate family of models is often more important than the choice of a particular selection c",
    "link": "http://arxiv.org/abs/2107.06006",
    "context": "Title: Parameter selection in Gaussian process interpolation: an empirical study of selection criteria. (arXiv:2107.06006v5 [stat.ME] UPDATED)\nAbstract: This article revisits the fundamental problem of parameter selection for Gaussian process interpolation. By choosing the mean and the covariance functions of a Gaussian process within parametric families, the user obtains a family of Bayesian procedures to perform predictions about the unknown function, and must choose a member of the family that will hopefully provide good predictive performances. We base our study on the general concept of scoring rules, which provides an effective framework for building leave-one-out selection and validation criteria, and a notion of extended likelihood criteria based on an idea proposed by Fasshauer and co-authors in 2009, which makes it possible to recover standard selection criteria such as, for instance, the generalized cross-validation criterion. Under this setting, we empirically show on several test problems of the literature that the choice of an appropriate family of models is often more important than the choice of a particular selection c",
    "path": "papers/21/07/2107.06006.json",
    "total_tokens": 811,
    "translated_title": "高斯过程插值中的参数选择：选择标准的实证研究",
    "translated_abstract": "本文重新考虑了高斯过程插值中的参数选择问题。通过在参数化族中选择高斯过程的均值和协方差函数，用户可以获得一族贝叶斯程序，用于对未知函数进行预测，并且必须选择一个希望能够提供良好预测性能的成员。我们基于评分规则的基本概念进行研究，在建立留一法选择和验证标准以及基于Fasshauer等人在2009年提出的思想的扩展似然标准的有效框架上，恢复了诸如广义交叉验证准则之类的标准选择标准。在这个设定下，我们通过对文献中的几个测试问题进行实证研究，证明了选择适当的模型族往往比选择特定的选择准则更重要。",
    "tldr": "高斯过程插值中的参数选择是一个重要问题，本文通过评分规则和扩展似然标准的框架研究了选择适当的模型族的重要性。",
    "en_tdlr": "Parameter selection in Gaussian process interpolation is crucial, and this study highlights the importance of choosing an appropriate family of models using scoring rules and extended likelihood criteria."
}