{
    "title": "Peace through bribing. (arXiv:2107.11575v3 [econ.TH] UPDATED)",
    "abstract": "We study a model in which before a conflict between two parties escalates into a war (in the form of an all-pay auction), a party can offer a take-it-or-leave-it bribe to the other for a peaceful settlement. In contrast to the received literature, we find that peace security is impossible in our model. We characterize the necessary and sufficient conditions for peace implementability. Furthermore, we find that separating equilibria do not exist and the number of (on-path) bribes in any non-peaceful equilibria is at most two. We also consider a requesting model and characterize the necessary and sufficient conditions for the existence of robust peaceful equilibria, all of which are sustained by the identical (on-path) request. Contrary to the bribing model, peace security is possible in the requesting model.",
    "link": "http://arxiv.org/abs/2107.11575",
    "context": "Title: Peace through bribing. (arXiv:2107.11575v3 [econ.TH] UPDATED)\nAbstract: We study a model in which before a conflict between two parties escalates into a war (in the form of an all-pay auction), a party can offer a take-it-or-leave-it bribe to the other for a peaceful settlement. In contrast to the received literature, we find that peace security is impossible in our model. We characterize the necessary and sufficient conditions for peace implementability. Furthermore, we find that separating equilibria do not exist and the number of (on-path) bribes in any non-peaceful equilibria is at most two. We also consider a requesting model and characterize the necessary and sufficient conditions for the existence of robust peaceful equilibria, all of which are sustained by the identical (on-path) request. Contrary to the bribing model, peace security is possible in the requesting model.",
    "path": "papers/21/07/2107.11575.json",
    "total_tokens": 829,
    "translated_title": "贿赂带来的和平",
    "translated_abstract": "本文研究了一个模型，在这个模型中，冲突双方在升级为“全付出拍卖”之前，一方可以向另一方提供一个“接受或离开”的贿赂，以达成和平解决。与现有文献不同的是，我们发现在我们的模型中和平是不可能的。我们表征了和平实施的必要和充分条件。此外，我们发现分离均衡不存在，在任何非和平均衡中的(路径上的)贿赂数量最多为两个。我们还考虑了一个请求模型，并表征了稳健和平均衡的必要和充分条件，所有这些均由相同的(路径上的)请求维持。与贿赂模型相反，在请求模型中可以实现和平安全。",
    "tldr": "本文研究了一种贿赂带来和平的模型。作者发现在该模型中和平是不可能的，并表征了实现和平的必要和充分条件。作者还考虑了一个请求模型，在该模型中可以实现和平安全。",
    "en_tdlr": "The paper studies a model in which bribes can be offered for peaceful settlement before a conflict escalates into a war. The authors find that peace security is impossible in their model but characterize the necessary and sufficient conditions for peace implementability. They also consider a requesting model where peace security is possible and characterize the necessary and sufficient conditions for robust peaceful equilibria."
}