{
    "title": "Machine learning based iterative learning control for non-repetitive time-varying systems. (arXiv:2107.00421v2 [eess.SY] UPDATED)",
    "abstract": "The repetitive tracking task for time-varying systems (TVSs) with non-repetitive time-varying parameters, which is also called non-repetitive TVSs, is realized in this paper using iterative learning control (ILC). A machine learning (ML) based nominal model update mechanism, which utilizes the linear regression technique to update the nominal model at each ILC trial only using the current trial information, is proposed for non-repetitive TVSs in order to enhance the ILC performance. Given that the ML mechanism forces the model uncertainties to remain within the ILC robust tolerance, an ILC update law is proposed to deal with non-repetitive TVSs. How to tune parameters inside ML and ILC algorithms to achieve the desired aggregate performance is also provided. The robustness and reliability of the proposed method are verified by simulations. Comparison with current state-of-the-art demonstrates its superior control performance in terms of controlling precision. This paper broadens ILC ap",
    "link": "http://arxiv.org/abs/2107.00421",
    "context": "Title: Machine learning based iterative learning control for non-repetitive time-varying systems. (arXiv:2107.00421v2 [eess.SY] UPDATED)\nAbstract: The repetitive tracking task for time-varying systems (TVSs) with non-repetitive time-varying parameters, which is also called non-repetitive TVSs, is realized in this paper using iterative learning control (ILC). A machine learning (ML) based nominal model update mechanism, which utilizes the linear regression technique to update the nominal model at each ILC trial only using the current trial information, is proposed for non-repetitive TVSs in order to enhance the ILC performance. Given that the ML mechanism forces the model uncertainties to remain within the ILC robust tolerance, an ILC update law is proposed to deal with non-repetitive TVSs. How to tune parameters inside ML and ILC algorithms to achieve the desired aggregate performance is also provided. The robustness and reliability of the proposed method are verified by simulations. Comparison with current state-of-the-art demonstrates its superior control performance in terms of controlling precision. This paper broadens ILC ap",
    "path": "papers/21/07/2107.00421.json",
    "total_tokens": 1009,
    "tldr": "本论文提出了一种基于机器学习的名义模型更新机制，用于非重复时变系统的迭代学习控制，以增强迭代学习控制的性能，并且在控制精度方面表现出卓越的控制性能，相比当前最先进的方法，有着优秀的控制性能。"
}