{
    "title": "MCL-GAN: Generative Adversarial Networks with Multiple Specialized Discriminators",
    "abstract": "arXiv:2107.07260v3 Announce Type: replace  Abstract: We propose a framework of generative adversarial networks with multiple discriminators, which collaborate to represent a real dataset more effectively. Our approach facilitates learning a generator consistent with the underlying data distribution based on real images and thus mitigates the chronic mode collapse problem. From the inspiration of multiple choice learning, we guide each discriminator to have expertise in a subset of the entire data and allow the generator to find reasonable correspondences between the latent and real data spaces automatically without extra supervision for training examples. Despite the use of multiple discriminators, the backbone networks are shared across the discriminators and the increase in training cost is marginal. We demonstrate the effectiveness of our algorithm using multiple evaluation metrics in the standard datasets for diverse tasks.",
    "link": "https://arxiv.org/abs/2107.07260",
    "context": "Title: MCL-GAN: Generative Adversarial Networks with Multiple Specialized Discriminators\nAbstract: arXiv:2107.07260v3 Announce Type: replace  Abstract: We propose a framework of generative adversarial networks with multiple discriminators, which collaborate to represent a real dataset more effectively. Our approach facilitates learning a generator consistent with the underlying data distribution based on real images and thus mitigates the chronic mode collapse problem. From the inspiration of multiple choice learning, we guide each discriminator to have expertise in a subset of the entire data and allow the generator to find reasonable correspondences between the latent and real data spaces automatically without extra supervision for training examples. Despite the use of multiple discriminators, the backbone networks are shared across the discriminators and the increase in training cost is marginal. We demonstrate the effectiveness of our algorithm using multiple evaluation metrics in the standard datasets for diverse tasks.",
    "path": "papers/21/07/2107.07260.json",
    "total_tokens": 945,
    "translated_title": "MCL-GAN: 具有多个专业鉴别器的生成对抗网络",
    "translated_abstract": "我们提出了一种具有多个鉴别器的生成对抗网络框架，这些鉴别器共同合作更有效地表示真实数据集。我们的方法有助于学习一个与基于真实图像的基础数据分布一致的生成器，从而缓解了长期的模式崩溃问题。受到多选学习的启发，我们引导每个鉴别器在整个数据的子集中具有专门技能，并允许生成器在无需额外监督训练示例的情况下自动找到潜在数据空间和真实数据空间之间的合理对应关系。尽管使用了多个鉴别器，骨干网络在鉴别器之间是共享的，并且训练成本的增加是微不足道的。我们在标准数据集中使用多个评估指标展示了我们算法的有效性，适用于多样化任务。",
    "tldr": "MCL-GAN提出了一种生成对抗网络框架，利用多个鉴别器共同合作来更有效地表示真实数据集，在解决模式崩溃问题的同时，实现了生成器与基础数据分布的一致性，通过给每个鉴别器专业技能的引导，生成器能够自动找到潜在数据空间和真实数据空间的合理对应关系，同时骨干网络在鉴别器之间是共享的，训练成本增加微不足道，并在标准数据集上证明了算法的有效性。",
    "en_tdlr": "MCL-GAN proposes a framework of generative adversarial networks with multiple discriminators that collaborate effectively to represent real datasets, addressing the mode collapse issue while ensuring consistency with the underlying data distribution through guided expertise allocation and shared backbone networks, resulting in a marginal increase in training cost and demonstrating effectiveness across diverse tasks and evaluation metrics."
}