{
    "title": "Learning Geometric Combinatorial Optimization Problems using Self-attention and Domain Knowledge. (arXiv:2107.01759v2 [cs.CG] UPDATED)",
    "abstract": "Combinatorial optimization problems (COPs) are an important research topic in various fields. In recent times, there have been many attempts to solve COPs using deep learning-based approaches. We propose a novel neural network model that solves COPs involving geometry based on self-attention and a new attention mechanism. The proposed model is designed such that the model efficiently learns point-to-point relationships in COPs involving geometry using self-attention in the encoder. We propose efficient input and output sequence ordering methods that reduce ambiguities such that the model learns the sequences more regularly and effectively. Geometric COPs involve geometric requirements that need to be satisfied. In the decoder, a new masking scheme using domain knowledge is proposed to provide a high penalty when the geometric requirement of the problem is not satisfied. The proposed neural net is a flexible framework that can be applied to various COPs involving geometry. We conduct ex",
    "link": "http://arxiv.org/abs/2107.01759",
    "context": "Title: Learning Geometric Combinatorial Optimization Problems using Self-attention and Domain Knowledge. (arXiv:2107.01759v2 [cs.CG] UPDATED)\nAbstract: Combinatorial optimization problems (COPs) are an important research topic in various fields. In recent times, there have been many attempts to solve COPs using deep learning-based approaches. We propose a novel neural network model that solves COPs involving geometry based on self-attention and a new attention mechanism. The proposed model is designed such that the model efficiently learns point-to-point relationships in COPs involving geometry using self-attention in the encoder. We propose efficient input and output sequence ordering methods that reduce ambiguities such that the model learns the sequences more regularly and effectively. Geometric COPs involve geometric requirements that need to be satisfied. In the decoder, a new masking scheme using domain knowledge is proposed to provide a high penalty when the geometric requirement of the problem is not satisfied. The proposed neural net is a flexible framework that can be applied to various COPs involving geometry. We conduct ex",
    "path": "papers/21/07/2107.01759.json",
    "total_tokens": 993,
    "translated_title": "使用自注意力和领域知识学习几何组合优化问题",
    "translated_abstract": "组合优化问题（COP）是各个领域的重要研究课题。近年来，有许多尝试使用基于深度学习的方法来解决COP。我们提出了一种新颖的神经网络模型，基于自注意力和新的注意机制来解决基于几何的COP。该模型的设计使得其能够高效地使用编码器中的自注意力来学习几何COP中的点对点关系。我们提出了有效的输入和输出序列排序方法，从而减少了歧义，使模型更加规律和有效地学习序列。几何COP涉及需要满足的几何要求。在解码器中，我们提出了一种使用领域知识的新的掩蔽方案，以在问题的几何要求未被满足时提供高代价。所提出的神经网络是一个灵活的框架，可以应用于各种涉及几何的COP。我们在各种几何COP和基准数据集上进行实验，所提出的模型在解决质量和可扩展性方面相比现有模型表现出显著的提高。",
    "tldr": "使用自注意力和领域知识，提出了一种新颖的神经网络模型来解决涉及几何的组合优化问题，可应用于各种涉及几何的COP，并在实验中取得了显著的解决质量和可扩展性方面的提高。"
}