{
    "title": "A Low-Cost Neural ODE with Depthwise Separable Convolution for Edge Domain Adaptation on FPGAs. (arXiv:2107.12824v4 [cs.LG] UPDATED)",
    "abstract": "High-performance deep neural network (DNN)-based systems are in high demand in edge environments. Due to its high computational complexity, it is challenging to deploy DNNs on edge devices with strict limitations on computational resources. In this paper, we derive a compact while highly-accurate DNN model, termed dsODENet, by combining recently-proposed parameter reduction techniques: Neural ODE (Ordinary Differential Equation) and DSC (Depthwise Separable Convolution). Neural ODE exploits a similarity between ResNet and ODE, and shares most of weight parameters among multiple layers, which greatly reduces the memory consumption. We apply dsODENet to a domain adaptation as a practical use case with image classification datasets. We also propose a resource-efficient FPGA-based design for dsODENet, where all the parameters and feature maps except for pre- and post-processing layers can be mapped onto on-chip memories. It is implemented on Xilinx ZCU104 board and evaluated in terms of do",
    "link": "http://arxiv.org/abs/2107.12824",
    "context": "Title: A Low-Cost Neural ODE with Depthwise Separable Convolution for Edge Domain Adaptation on FPGAs. (arXiv:2107.12824v4 [cs.LG] UPDATED)\nAbstract: High-performance deep neural network (DNN)-based systems are in high demand in edge environments. Due to its high computational complexity, it is challenging to deploy DNNs on edge devices with strict limitations on computational resources. In this paper, we derive a compact while highly-accurate DNN model, termed dsODENet, by combining recently-proposed parameter reduction techniques: Neural ODE (Ordinary Differential Equation) and DSC (Depthwise Separable Convolution). Neural ODE exploits a similarity between ResNet and ODE, and shares most of weight parameters among multiple layers, which greatly reduces the memory consumption. We apply dsODENet to a domain adaptation as a practical use case with image classification datasets. We also propose a resource-efficient FPGA-based design for dsODENet, where all the parameters and feature maps except for pre- and post-processing layers can be mapped onto on-chip memories. It is implemented on Xilinx ZCU104 board and evaluated in terms of do",
    "path": "papers/21/07/2107.12824.json",
    "total_tokens": 953,
    "translated_title": "一种基于深度可分卷积神经ODE的低成本FPGA边缘领域适应方法",
    "translated_abstract": "在边缘环境中，高性能的基于深度神经网络（DNN）的系统需求量很高。由于其高计算复杂性，将DNN部署到计算资源有严格限制的边缘设备上具有挑战性。因此，本文通过结合最近提出的参数缩减技术：神经ODE（普通微分方程）和DSC（深度可分卷积），导出了一种紧凑且精度高的DNN模型，称为dsODENet。神经ODE利用ResNet和ODE之间的相似性，并在多个层之间共享大部分权重参数，从而大大减少了内存消耗。本文将dsODENet应用于实际情况下的域自适应，并使用图像分类数据集进行了评估。本文还提出了一种针对dsODENet的资源高效的基于FPGA的设计，其中除了预处理和后处理层的所有参数和特征图均可映射到芯片上的内存中。",
    "tldr": "本文提出了一种低成本的神经ODE和深度可分卷积相结合的DNN模型dsODENet，并将其应用于边缘领域适应。此外，还提出了一种资源高效的FPGA设计，可部署dsODENet。",
    "en_tdlr": "This paper proposes a low-cost DNN model, dsODENet, combining Neural ODE and DSC techniques, and applies it to edge domain adaptation with image classification datasets. The study also introduces a resource-efficient FPGA-based design for dsODENet."
}