{
    "title": "SelfCF: A Simple Framework for Self-supervised Collaborative Filtering. (arXiv:2107.03019v3 [cs.IR] UPDATED)",
    "abstract": "Collaborative filtering (CF) is widely used to learn informative latent representations of users and items from observed interactions. Existing CF-based methods commonly adopt negative sampling to discriminate different items. Training with negative sampling on large datasets is computationally expensive. Further, negative items should be carefully sampled under the defined distribution, in order to avoid selecting an observed positive item in the training dataset. Unavoidably, some negative items sampled from the training dataset could be positive in the test set. In this paper, we propose a self-supervised collaborative filtering framework (SelfCF), that is specially designed for recommender scenario with implicit feedback. The proposed SelfCF framework simplifies the Siamese networks and can be easily applied to existing deep-learning based CF models, which we refer to as backbone networks. The main idea of SelfCF is to augment the output embeddings generated by backbone networks, b",
    "link": "http://arxiv.org/abs/2107.03019",
    "context": "Title: SelfCF: A Simple Framework for Self-supervised Collaborative Filtering. (arXiv:2107.03019v3 [cs.IR] UPDATED)\nAbstract: Collaborative filtering (CF) is widely used to learn informative latent representations of users and items from observed interactions. Existing CF-based methods commonly adopt negative sampling to discriminate different items. Training with negative sampling on large datasets is computationally expensive. Further, negative items should be carefully sampled under the defined distribution, in order to avoid selecting an observed positive item in the training dataset. Unavoidably, some negative items sampled from the training dataset could be positive in the test set. In this paper, we propose a self-supervised collaborative filtering framework (SelfCF), that is specially designed for recommender scenario with implicit feedback. The proposed SelfCF framework simplifies the Siamese networks and can be easily applied to existing deep-learning based CF models, which we refer to as backbone networks. The main idea of SelfCF is to augment the output embeddings generated by backbone networks, b",
    "path": "papers/21/07/2107.03019.json",
    "total_tokens": 887,
    "translated_title": "SelfCF：一种简单的自监督协同过滤框架",
    "translated_abstract": "协同过滤（CF）被广泛用于从观察到的交互中学习有用的用户和项目的潜在表示。现有的基于CF的方法通常采用负采样来区分不同的项目。在大型数据集上使用负采样进行训练计算成本很高。此外，必须根据定义的分布谨慎选择负项，以避免在训练数据集中选择观察到的正项。不可避免地，从训练数据集中采样的一些负项在测试集中可能是正项。我们提出了一种专门用于隐式反馈推荐场景的自监督协同过滤框架（SelfCF）。所提出的SelfCF框架简化了连体网络，并可轻松应用于现有的基于深度学习的CF模型，我们称其为骨干网络。SelfCF的主要思想是增强由骨干网络生成的输出嵌入。",
    "tldr": "SelfCF是一种自监督协同过滤框架，用于推荐场景，通过增强现有的深度学习协同过滤模型中输出的嵌入来简化算法以及避免昂贵的计算和潜在的负样本问题。",
    "en_tdlr": "SelfCF is a self-supervised collaborative filtering framework designed for recommender scenarios with implicit feedback. The framework simplifies existing deep-learning based CF models and avoids expensive computation and potential negative sampling problems by augmenting the output embeddings."
}