{
    "title": "Improving ClusterGAN Using Self-Augmented Information Maximization of Disentangling Latent Spaces. (arXiv:2107.12706v2 [cs.LG] UPDATED)",
    "abstract": "Since their introduction in the last few years, conditional generative models have seen remarkable achievements. However, they often need the use of large amounts of labelled information. By using unsupervised conditional generation in conjunction with a clustering inference network, ClusterGAN has recently been able to achieve impressive clustering results. Since the real conditional distribution of data is ignored, the clustering inference network can only achieve inferior clustering performance by considering only uniform prior based generative samples. However, the true distribution is not necessarily balanced. Consequently, ClusterGAN fails to produce all modes, which results in sub-optimal clustering inference network performance. So, it is important to learn the prior, which tries to match the real distribution in an unsupervised way. In this paper, we propose self-augmentation information maximization improved ClusterGAN (SIMI-ClusterGAN) to learn the distinctive priors from th",
    "link": "http://arxiv.org/abs/2107.12706",
    "context": "Title: Improving ClusterGAN Using Self-Augmented Information Maximization of Disentangling Latent Spaces. (arXiv:2107.12706v2 [cs.LG] UPDATED)\nAbstract: Since their introduction in the last few years, conditional generative models have seen remarkable achievements. However, they often need the use of large amounts of labelled information. By using unsupervised conditional generation in conjunction with a clustering inference network, ClusterGAN has recently been able to achieve impressive clustering results. Since the real conditional distribution of data is ignored, the clustering inference network can only achieve inferior clustering performance by considering only uniform prior based generative samples. However, the true distribution is not necessarily balanced. Consequently, ClusterGAN fails to produce all modes, which results in sub-optimal clustering inference network performance. So, it is important to learn the prior, which tries to match the real distribution in an unsupervised way. In this paper, we propose self-augmentation information maximization improved ClusterGAN (SIMI-ClusterGAN) to learn the distinctive priors from th",
    "path": "papers/21/07/2107.12706.json",
    "total_tokens": 773,
    "translated_title": "通过自我增强的信息最大化改进ClusterGAN的聚类效果",
    "translated_abstract": "过去几年中，条件生成模型在许多任务中取得了显著成果，然而，它们通常需要使用大量有标签的信息。通过使用无监督条件生成与聚类推断网络相结合，ClusterGAN 最近能够实现令人瞩目的聚类结果。然而，由于忽略了数据的真实条件分布，聚类推断网络只能通过考虑基于均匀先验的生成样本来达到较差的聚类性能。在这篇论文中，我们提出了自我增强信息最大化改进的ClusterGAN (SIMI-ClusterGAN)，以无监督的方式学习与真实分布匹配的独特先验。",
    "tldr": "本文提出了一种名为 SIMI－ClusterGAN 的算法，通过自我增强的信息最大化来改进 ClusterGAN 的聚类效果，从而学习独特先验与真实分布匹配。"
}