{
    "title": "Denoising Time Cycle Modeling for Recommendation",
    "abstract": "Recently, modeling temporal patterns of user-item interactions have attracted much attention in recommender systems. We argue that existing methods ignore the variety of temporal patterns of user behaviors. We define the subset of user behaviors that are irrelevant to the target item as noises, which limits the performance of target-related time cycle modeling and affect the recommendation performance. In this paper, we propose Denoising Time Cycle Modeling (DiCycle), a novel approach to denoise user behaviors and select the subset of user behaviors that are highly related to the target item. DiCycle is able to explicitly model diverse time cycle patterns for recommendation. Extensive experiments are conducted on both public benchmarks and a real-world dataset, demonstrating the superior performance of DiCycle over the state-of-the-art recommendation methods.",
    "link": "https://arxiv.org/abs/2402.02718",
    "context": "Title: Denoising Time Cycle Modeling for Recommendation\nAbstract: Recently, modeling temporal patterns of user-item interactions have attracted much attention in recommender systems. We argue that existing methods ignore the variety of temporal patterns of user behaviors. We define the subset of user behaviors that are irrelevant to the target item as noises, which limits the performance of target-related time cycle modeling and affect the recommendation performance. In this paper, we propose Denoising Time Cycle Modeling (DiCycle), a novel approach to denoise user behaviors and select the subset of user behaviors that are highly related to the target item. DiCycle is able to explicitly model diverse time cycle patterns for recommendation. Extensive experiments are conducted on both public benchmarks and a real-world dataset, demonstrating the superior performance of DiCycle over the state-of-the-art recommendation methods.",
    "path": "papers/24/02/2402.02718.json",
    "total_tokens": 789,
    "translated_title": "降噪时间周期建模用于推荐",
    "translated_abstract": "最近，在推荐系统中，建模用户-物品交互的时间模式引起了广泛关注。我们认为现有方法忽略了用户行为的时间模式的多样性。我们将与目标物品无关的用户行为定义为噪声，这限制了与目标相关的时间周期建模的性能，并影响了推荐性能。在本文中，我们提出了一种新颖的方法，称为降噪时间周期建模（DiCycle），用于降噪用户行为并选择与目标物品高度相关的用户行为子集。DiCycle能够明确地建模多样化的时间周期模式以进行推荐。我们在公共基准数据集和真实世界数据集上进行了大量实验，结果表明DiCycle相比最先进的推荐方法具有更好的性能。",
    "tldr": "本文提出了一种新的方法，降噪时间周期建模（DiCycle），用于在推荐系统中建模用户-物品交互的时间模式。通过选择与目标物品高度相关的用户行为子集，DiCycle能够更好地建模时间周期模式，从而提高推荐性能。",
    "en_tdlr": "This paper proposes a novel approach, Denoising Time Cycle Modeling (DiCycle), for modeling temporal patterns of user-item interactions in recommender systems. By selecting the subset of user behaviors that are highly related to the target item, DiCycle is able to better model time cycle patterns and improve recommendation performance."
}