{
    "title": "Two Online Map Matching Algorithms Based on Analytic Hierarchy Process and Fuzzy Logic",
    "abstract": "arXiv:2402.11866v1 Announce Type: cross  Abstract: Our aim of this paper is to develop new map matching algorithms and to improve upon previous work. We address two key approaches: Analytic Hierarchy Process (AHP) map matching and fuzzy logic map matching. AHP is a decision-making method that combines mathematical analysis with human judgment, and fuzzy logic is an approach to computing based on the degree of truth and aims at modeling the imprecise modes of reasoning from 0 to 1 rather than the usual boolean logic. Of these algorithms, the way of our applying AHP to map matching is newly developed in this paper, meanwhile, our application of fuzzy logic to map matching is mostly the same as existing research except for some small changes. Because of the common characteristic that both methods are designed to handle imprecise information and simplicity for implementation, we decided to use these methods.",
    "link": "https://arxiv.org/abs/2402.11866",
    "context": "Title: Two Online Map Matching Algorithms Based on Analytic Hierarchy Process and Fuzzy Logic\nAbstract: arXiv:2402.11866v1 Announce Type: cross  Abstract: Our aim of this paper is to develop new map matching algorithms and to improve upon previous work. We address two key approaches: Analytic Hierarchy Process (AHP) map matching and fuzzy logic map matching. AHP is a decision-making method that combines mathematical analysis with human judgment, and fuzzy logic is an approach to computing based on the degree of truth and aims at modeling the imprecise modes of reasoning from 0 to 1 rather than the usual boolean logic. Of these algorithms, the way of our applying AHP to map matching is newly developed in this paper, meanwhile, our application of fuzzy logic to map matching is mostly the same as existing research except for some small changes. Because of the common characteristic that both methods are designed to handle imprecise information and simplicity for implementation, we decided to use these methods.",
    "path": "papers/24/02/2402.11866.json",
    "total_tokens": 866,
    "translated_title": "基于层次分析法和模糊逻辑的两种在线地图匹配算法",
    "translated_abstract": "我们这篇论文的目的是开发新的地图匹配算法并改进先前的工作。我们介绍了两种关键方法：层次分析法（AHP）地图匹配和模糊逻辑地图匹配。AHP是一种将数学分析与人类判断相结合的决策方法，模糊逻辑是一种基于真实程度的计算方法，旨在建模从0到1的不确定推理方式，而不是通常的布尔逻辑。在这些算法中，我们在本文中新开发了将AHP应用于地图匹配的方式，与此同时，我们将模糊逻辑应用于地图匹配的方法与现有研究大致相同，除了一些细微的改变。由于这两种方法的共同特点是设计用于处理不精确信息并且易于实现，我们决定使用这些方法。",
    "tldr": "本文开发了基于层次分析法和模糊逻辑的两种新的在线地图匹配算法，其中AHP应用于地图匹配的方式是新开发的，同时模糊逻辑被应用于地图匹配与现有研究类似，但进行了一些改变。",
    "en_tdlr": "This paper introduces two new online map matching algorithms based on Analytic Hierarchy Process (AHP) and fuzzy logic, with the novel approach of applying AHP to map matching and some modifications in using fuzzy logic compared to existing research."
}