{
    "title": "Treatment of Epistemic Uncertainty in Conjunction Analysis with Dempster-Shafer Theory",
    "abstract": "The paper presents an approach to the modelling of epistemic uncertainty in Conjunction Data Messages (CDM) and the classification of conjunction events according to the confidence in the probability of collision. The approach proposed in this paper is based on the Dempster-Shafer Theory (DSt) of evidence and starts from the assumption that the observed CDMs are drawn from a family of unknown distributions. The Dvoretzky-Kiefer-Wolfowitz (DKW) inequality is used to construct robust bounds on such a family of unknown distributions starting from a time series of CDMs. A DSt structure is then derived from the probability boxes constructed with DKW inequality. The DSt structure encapsulates the uncertainty in the CDMs at every point along the time series and allows the computation of the belief and plausibility in the realisation of a given probability of collision. The methodology proposed in this paper is tested on a number of real events and compared against existing practices in the Eu",
    "link": "https://arxiv.org/abs/2402.00060",
    "context": "Title: Treatment of Epistemic Uncertainty in Conjunction Analysis with Dempster-Shafer Theory\nAbstract: The paper presents an approach to the modelling of epistemic uncertainty in Conjunction Data Messages (CDM) and the classification of conjunction events according to the confidence in the probability of collision. The approach proposed in this paper is based on the Dempster-Shafer Theory (DSt) of evidence and starts from the assumption that the observed CDMs are drawn from a family of unknown distributions. The Dvoretzky-Kiefer-Wolfowitz (DKW) inequality is used to construct robust bounds on such a family of unknown distributions starting from a time series of CDMs. A DSt structure is then derived from the probability boxes constructed with DKW inequality. The DSt structure encapsulates the uncertainty in the CDMs at every point along the time series and allows the computation of the belief and plausibility in the realisation of a given probability of collision. The methodology proposed in this paper is tested on a number of real events and compared against existing practices in the Eu",
    "path": "papers/24/02/2402.00060.json",
    "total_tokens": 842,
    "translated_title": "在Dempster-Shafer理论中处理共同分析中的认知不确定性",
    "translated_abstract": "本文提出了一种在共同数据信息（CDM）中建模认知不确定性和根据碰撞概率的置信度对共同事件进行分类的方法。本文提出的方法基于Dempster-Shafer论证的理论，假设观察到的CDMs来自一组未知分布的家族。使用Dvoretzky-Kiefer-Wolfowitz不等式从CDMs的时间序列构建鲁棒界限。然后使用DKW不等式构建的概率箱派生DSt结构。该DSt结构封装了时间序列上每个点的CDMs的不确定性，并允许计算特定碰撞概率实现的置信度和可能性。本文提出的方法在一些实际事件上进行了测试，并与欧洲现有的实践进行了比较。",
    "tldr": "本文提出了一种基于Dempster-Shafer理论的方法，用于在共同数据信息中建模认知不确定性和根据置信度对共同事件进行分类。通过构建概率箱和DSt结构，可以计算特定碰撞概率的置信度和可能性。",
    "en_tdlr": "This paper proposes an approach based on Dempster-Shafer theory to model epistemic uncertainty and classify conjunction events based on confidence in probability. The method allows for computing the belief and plausibility of collision probability through the construction of probability boxes and DSt structure."
}