{
    "title": "CityFlowER: An Efficient and Realistic Traffic Simulator with Embedded Machine Learning Models",
    "abstract": "Traffic simulation is an essential tool for transportation infrastructure planning, intelligent traffic control policy learning, and traffic flow analysis. Its effectiveness relies heavily on the realism of the simulators used. Traditional traffic simulators, such as SUMO and CityFlow, are often limited by their reliance on rule-based models with hyperparameters that oversimplify driving behaviors, resulting in unrealistic simulations. To enhance realism, some simulators have provided Application Programming Interfaces (APIs) to interact with Machine Learning (ML) models, which learn from observed data and offer more sophisticated driving behavior models. However, this approach faces challenges in scalability and time efficiency as vehicle numbers increase. Addressing these limitations, we introduce CityFlowER, an advancement over the existing CityFlow simulator, designed for efficient and realistic city-wide traffic simulation. CityFlowER innovatively pre-embeds ML models within the s",
    "link": "https://arxiv.org/abs/2402.06127",
    "context": "Title: CityFlowER: An Efficient and Realistic Traffic Simulator with Embedded Machine Learning Models\nAbstract: Traffic simulation is an essential tool for transportation infrastructure planning, intelligent traffic control policy learning, and traffic flow analysis. Its effectiveness relies heavily on the realism of the simulators used. Traditional traffic simulators, such as SUMO and CityFlow, are often limited by their reliance on rule-based models with hyperparameters that oversimplify driving behaviors, resulting in unrealistic simulations. To enhance realism, some simulators have provided Application Programming Interfaces (APIs) to interact with Machine Learning (ML) models, which learn from observed data and offer more sophisticated driving behavior models. However, this approach faces challenges in scalability and time efficiency as vehicle numbers increase. Addressing these limitations, we introduce CityFlowER, an advancement over the existing CityFlow simulator, designed for efficient and realistic city-wide traffic simulation. CityFlowER innovatively pre-embeds ML models within the s",
    "path": "papers/24/02/2402.06127.json",
    "total_tokens": 843,
    "translated_title": "CityFlowER:一种具有嵌入式机器学习模型的高效真实交通模拟器",
    "translated_abstract": "交通模拟是交通基础设施规划、智能交通控制政策学习和交通流分析的重要工具。其有效性严重依赖所使用模拟器的真实性。传统的交通模拟器（例如SUMO和CityFlow）往往受限于基于规则的模型和过于简化驾驶行为的超参数，导致模拟结果不真实。为了增强真实性，一些模拟器提供了与机器学习模型进行交互的应用程序接口（API），这些模型可以从观测数据中学习并提供更复杂的驾驶行为模型。然而，当车辆数量增加时，这种方法面临可扩展性和时间效率的挑战。为解决这些限制，我们引入了CityFlowER，一种在现有CityFlow模拟器基础上的改进，旨在实现高效真实的城市交通模拟。CityFlowER创新性地将机器学习模型预嵌入到模拟器中，从而提高了模拟的效率和真实性。",
    "tldr": "CityFlowER是一种高效真实的交通模拟器，通过嵌入机器学习模型提高了模拟的真实性和效率。",
    "en_tdlr": "CityFlowER is an efficient and realistic traffic simulator that enhances simulation realism and efficiency by embedding machine learning models."
}