{
    "title": "WinoViz: Probing Visual Properties of Objects Under Different States",
    "abstract": "arXiv:2402.13584v1 Announce Type: new  Abstract: Humans perceive and comprehend different visual properties of an object based on specific contexts. For instance, we know that a banana turns brown ``when it becomes rotten,'' whereas it appears green ``when it is unripe.'' Previous studies on probing visual commonsense knowledge have primarily focused on examining language models' understanding of typical properties (e.g., colors and shapes) of objects. We present WinoViz, a text-only evaluation dataset, consisting of 1,380 examples that probe the reasoning abilities of language models regarding variant visual properties of objects under different contexts or states. Our task is challenging since it requires pragmatic reasoning (finding intended meanings) and visual knowledge reasoning. We also present multi-hop data, a more challenging version of our data, which requires multi-step reasoning chains to solve our task. In our experimental analysis, our findings are: a) Large language mod",
    "link": "https://arxiv.org/abs/2402.13584",
    "context": "Title: WinoViz: Probing Visual Properties of Objects Under Different States\nAbstract: arXiv:2402.13584v1 Announce Type: new  Abstract: Humans perceive and comprehend different visual properties of an object based on specific contexts. For instance, we know that a banana turns brown ``when it becomes rotten,'' whereas it appears green ``when it is unripe.'' Previous studies on probing visual commonsense knowledge have primarily focused on examining language models' understanding of typical properties (e.g., colors and shapes) of objects. We present WinoViz, a text-only evaluation dataset, consisting of 1,380 examples that probe the reasoning abilities of language models regarding variant visual properties of objects under different contexts or states. Our task is challenging since it requires pragmatic reasoning (finding intended meanings) and visual knowledge reasoning. We also present multi-hop data, a more challenging version of our data, which requires multi-step reasoning chains to solve our task. In our experimental analysis, our findings are: a) Large language mod",
    "path": "papers/24/02/2402.13584.json",
    "total_tokens": 859,
    "translated_title": "WinoViz：探究对象在不同状态下的视觉特性",
    "translated_abstract": "人类根据特定语境感知和理解对象的不同视觉属性。以香蕉为例，当变质时我们知道它会变成褐色，而未成熟时它呈现绿色。先前关于探究视觉常识知识的研究主要集中在检验语言模型对对象的典型属性（如颜色和形状）的理解上。我们提出了WinoViz，一个仅包含文本的评估数据集，包含1,380个例子，探究语言模型对对象在不同语境或状态下的变异视觉属性的推理能力。我们的任务具有挑战性，因为它要求实用推理（找到预期意义）和视觉知识推理。我们还提出了多跳数据，这是我们数据的更具挑战性版本，需要多步推理链来解决我们的任务。在我们的实验分析中，我们的发现是：a）大型语言模型",
    "tldr": "该研究提出了WinoViz评估数据集，探究语言模型对对象在不同状态下的视觉属性的推理能力，该任务具有挑战性，要求实用推理和视觉知识推理。",
    "en_tdlr": "The study introduces the WinoViz evaluation dataset to investigate the reasoning abilities of language models regarding the visual properties of objects under different states, which is challenging and requires pragmatic and visual knowledge reasoning."
}