{
    "title": "D-Flow: Differentiating through Flows for Controlled Generation",
    "abstract": "arXiv:2402.14017v1 Announce Type: new  Abstract: Taming the generation outcome of state of the art Diffusion and Flow-Matching (FM) models without having to re-train a task-specific model unlocks a powerful tool for solving inverse problems, conditional generation, and controlled generation in general. In this work we introduce D-Flow, a simple framework for controlling the generation process by differentiating through the flow, optimizing for the source (noise) point. We motivate this framework by our key observation stating that for Diffusion/FM models trained with Gaussian probability paths, differentiating through the generation process projects gradient on the data manifold, implicitly injecting the prior into the optimization process. We validate our framework on linear and non-linear controlled generation problems including: image and audio inverse problems and conditional molecule generation reaching state of the art performance across all.",
    "link": "https://arxiv.org/abs/2402.14017",
    "context": "Title: D-Flow: Differentiating through Flows for Controlled Generation\nAbstract: arXiv:2402.14017v1 Announce Type: new  Abstract: Taming the generation outcome of state of the art Diffusion and Flow-Matching (FM) models without having to re-train a task-specific model unlocks a powerful tool for solving inverse problems, conditional generation, and controlled generation in general. In this work we introduce D-Flow, a simple framework for controlling the generation process by differentiating through the flow, optimizing for the source (noise) point. We motivate this framework by our key observation stating that for Diffusion/FM models trained with Gaussian probability paths, differentiating through the generation process projects gradient on the data manifold, implicitly injecting the prior into the optimization process. We validate our framework on linear and non-linear controlled generation problems including: image and audio inverse problems and conditional molecule generation reaching state of the art performance across all.",
    "path": "papers/24/02/2402.14017.json",
    "total_tokens": 809,
    "translated_title": "D-Flow: 通过流形进行区分生成",
    "translated_abstract": "通过控制当今最先进的扩散和流匹配（FM）模型的生成结果，而无需重新训练特定任务模型，可以解决反问题、条件生成和一般控制生成的强大工具。在这项工作中，我们介绍了D-Flow，一种简单的通过流形控制生成过程的框架，通过优化源（噪声）点进行区分。我们通过我们的关键观察来激发这一框架，该观察指出，对于使用高斯概率路径训练的扩散/FM模型，通过生成过程进行区分会在数据流形上投影梯度，将先验隐式注入到优化过程中。我们在包括图像和音频反问题以及条件分子生成在内的线性和非线性控制生成问题上验证了我们的框架，在所有问题上均达到了最先进的性能。",
    "tldr": "D-Flow框架通过控制生成过程中的流形，优化源点，解决了扩散和流匹配模型中生成结果的控制问题，同时在多个领域取得了最先进的性能表现。",
    "en_tdlr": "The D-Flow framework controls the generation process through flows, optimizing for the source point, addressing the control issue of generation outcomes in diffusion and flow-matching models, and achieving state-of-the-art performance in multiple domains."
}