{
    "title": "On Computational Limits of Modern Hopfield Models: A Fine-Grained Complexity Analysis",
    "abstract": "We investigate the computational limits of the memory retrieval dynamics of modern Hopfield models from the fine-grained complexity analysis. Our key contribution is the characterization of a phase transition behavior in the efficiency of all possible modern Hopfield models based on the norm of patterns. Specifically, we establish an upper bound criterion for the norm of input query patterns and memory patterns. Only below this criterion, sub-quadratic (efficient) variants of the modern Hopfield model exist, assuming the Strong Exponential Time Hypothesis (SETH). To showcase our theory, we provide a formal example of efficient constructions of modern Hopfield models using low-rank approximation when the efficient criterion holds. This includes a derivation of a lower bound on the computational time, scaling linearly with $\\Max\\{$# of stored memory patterns, length of input query sequence$\\}$. In addition, we prove its memory retrieval error bound and exponential memory capacity.",
    "link": "https://arxiv.org/abs/2402.04520",
    "context": "Title: On Computational Limits of Modern Hopfield Models: A Fine-Grained Complexity Analysis\nAbstract: We investigate the computational limits of the memory retrieval dynamics of modern Hopfield models from the fine-grained complexity analysis. Our key contribution is the characterization of a phase transition behavior in the efficiency of all possible modern Hopfield models based on the norm of patterns. Specifically, we establish an upper bound criterion for the norm of input query patterns and memory patterns. Only below this criterion, sub-quadratic (efficient) variants of the modern Hopfield model exist, assuming the Strong Exponential Time Hypothesis (SETH). To showcase our theory, we provide a formal example of efficient constructions of modern Hopfield models using low-rank approximation when the efficient criterion holds. This includes a derivation of a lower bound on the computational time, scaling linearly with $\\Max\\{$# of stored memory patterns, length of input query sequence$\\}$. In addition, we prove its memory retrieval error bound and exponential memory capacity.",
    "path": "papers/24/02/2402.04520.json",
    "total_tokens": 924,
    "translated_title": "关于现代Hopfield模型计算限制的一个细粒度复杂性分析",
    "translated_abstract": "我们从细粒度复杂性分析的角度研究了现代Hopfield模型的记忆检索动力学的计算限制。我们的主要贡献是基于模式的范数对所有可能的现代Hopfield模型的效率进行相变行为的刻画。具体来说，我们建立了对输入查询模式和记忆模式的范数的上界标准。仅在这个标准之下，假设满足Strong Exponential Time Hypothesis (SETH)，存在子二次（高效）变体的现代Hopfield模型。为了展示我们的理论，当有效标准成立时，我们提供了现代Hopfield模型使用低秩逼近的有效构造的正式示例。这包括一个计算时间的下界导出，与$\\Max\\{$存储的记忆模式数量，输入查询序列的长度$\\}$线性缩放。此外，我们证明了记忆检索误差界和指数记忆容量。",
    "tldr": "通过细粒度复杂性分析，我们研究了现代Hopfield模型的记忆检索计算限制，发现了一种基于模式范数的相变行为，并且建立了有效变体的上界条件。使用低秩逼近的方法，我们提供了有效构造的示例，同时证明了计算时间下界、记忆检索误差界和指数记忆容量。",
    "en_tdlr": "Through fine-grained complexity analysis, we investigate the computational limits of memory retrieval dynamics in modern Hopfield models, revealing a phase transition behavior based on pattern norms and establishing upper bounds for efficient variants. We provide formal examples of efficient constructions using low-rank approximation and prove lower bounds on computational time, error bounds in memory retrieval, and exponential memory capacity."
}