{
    "title": "Fully autonomous tuning of a spin qubit",
    "abstract": "Spanning over two decades, the study of qubits in semiconductors for quantum computing has yielded significant breakthroughs. However, the development of large-scale semiconductor quantum circuits is still limited by challenges in efficiently tuning and operating these circuits. Identifying optimal operating conditions for these qubits is complex, involving the exploration of vast parameter spaces. This presents a real 'needle in the haystack' problem, which, until now, has resisted complete automation due to device variability and fabrication imperfections. In this study, we present the first fully autonomous tuning of a semiconductor qubit, from a grounded device to Rabi oscillations, a clear indication of successful qubit operation. We demonstrate this automation, achieved without human intervention, in a Ge/Si core/shell nanowire device. Our approach integrates deep learning, Bayesian optimization, and computer vision techniques. We expect this automation algorithm to apply to a wi",
    "link": "https://arxiv.org/abs/2402.03931",
    "context": "Title: Fully autonomous tuning of a spin qubit\nAbstract: Spanning over two decades, the study of qubits in semiconductors for quantum computing has yielded significant breakthroughs. However, the development of large-scale semiconductor quantum circuits is still limited by challenges in efficiently tuning and operating these circuits. Identifying optimal operating conditions for these qubits is complex, involving the exploration of vast parameter spaces. This presents a real 'needle in the haystack' problem, which, until now, has resisted complete automation due to device variability and fabrication imperfections. In this study, we present the first fully autonomous tuning of a semiconductor qubit, from a grounded device to Rabi oscillations, a clear indication of successful qubit operation. We demonstrate this automation, achieved without human intervention, in a Ge/Si core/shell nanowire device. Our approach integrates deep learning, Bayesian optimization, and computer vision techniques. We expect this automation algorithm to apply to a wi",
    "path": "papers/24/02/2402.03931.json",
    "total_tokens": 902,
    "translated_title": "完全自主调谐自旋量子比特",
    "translated_abstract": "在过去的二十年里，半导体上的量子比特研究为量子计算技术做出了重大突破。然而，大规模半导体量子电路的发展仍受限于有效调谐和操作这些电路的挑战。确定这些比特的最佳操作条件是复杂的，涉及到广泛的参数空间的探索。这提出了一个现实中的“大海捞针”问题，直到现在，由于器件变异性和制造瑕疵，这一问题仍未完全实现自动化。在本研究中，我们首次报道了半导体量子比特的全自动调谐，从接地的器件到拉比振荡，清晰地表示比特操作成功。我们在Ge/Si核/壳纳米线器件中展示了这种无需人工干预实现的自动化。我们的方法将深度学习、贝叶斯优化和计算机视觉技术进行了整合。我们期望这种自动化算法能够适用于更广泛的半导体量子电路。",
    "tldr": "本研究首次实现了半导体量子比特的全自动调谐，通过集成深度学习、贝叶斯优化和计算机视觉技术，在无需人工干预的情况下，成功地实现了从接地器件到拉比振荡的完全自主操作。"
}