{
    "title": "CoLe and LYS at BioASQ MESINESP8 Task: similarity based descriptor assignment in Spanish",
    "abstract": "In this paper, we describe our participation in the MESINESP Task of the BioASQ biomedical semantic indexing challenge. The participating system follows an approach based solely on conventional information retrieval tools. We have evaluated various alternatives for extracting index terms from IBECS/LILACS documents in order to be stored in an Apache Lucene index. Those indexed representations are queried using the contents of the article to be annotated and a ranked list of candidate labels is created from the retrieved documents. We also have evaluated a sort of limited Label Powerset approach which creates meta-labels joining pairs of DeCS labels with high co-occurrence scores, and an alternative method based on label profile matching. Results obtained in official runs seem to confirm the suitability of this approach for languages like Spanish.",
    "link": "https://arxiv.org/abs/2402.01916",
    "context": "Title: CoLe and LYS at BioASQ MESINESP8 Task: similarity based descriptor assignment in Spanish\nAbstract: In this paper, we describe our participation in the MESINESP Task of the BioASQ biomedical semantic indexing challenge. The participating system follows an approach based solely on conventional information retrieval tools. We have evaluated various alternatives for extracting index terms from IBECS/LILACS documents in order to be stored in an Apache Lucene index. Those indexed representations are queried using the contents of the article to be annotated and a ranked list of candidate labels is created from the retrieved documents. We also have evaluated a sort of limited Label Powerset approach which creates meta-labels joining pairs of DeCS labels with high co-occurrence scores, and an alternative method based on label profile matching. Results obtained in official runs seem to confirm the suitability of this approach for languages like Spanish.",
    "path": "papers/24/02/2402.01916.json",
    "total_tokens": 767,
    "translated_title": "CoLe和LYS在BioASQ MESINESP8任务中的表征分配的相似度方法",
    "translated_abstract": "在本文中，我们描述了我们参与了BioASQ生物医学语义指标挑战赛的MESINESP任务。参与的系统仅使用了传统的信息检索工具。我们评估了从IBECS/LILACS文档中提取索引术语的多种方法，以便存储在Apache Lucene索引中。这些索引表示使用要注释的文章内容进行查询，并从检索到的文档创建一个候选标签的排序列表。我们还评估了一种有限的标签全集方法，该方法通过将具有高共现得分的DeCS标签配对并创建元标签，以及一种基于标签个人资料匹配的替代方法。在官方运行中获得的结果似乎证实了这种方法在西班牙语等语言中的适用性。",
    "tldr": "这篇论文介绍了基于相似度的描述符分配方法在BioASQ MESINESP8任务中的应用，通过使用传统的信息检索工具，并提出了适用于西班牙语等语言的方法。",
    "en_tdlr": "This paper presents the application of similarity-based descriptor assignment in the BioASQ MESINESP8 task, using conventional information retrieval tools, and proposes a method suitable for languages like Spanish."
}