{
    "title": "Arellano-Bond LASSO Estimator for Dynamic Linear Panel Models",
    "abstract": "The Arellano-Bond estimator can be severely biased when the time series dimension of the data, $T$, is long. The source of the bias is the large degree of overidentification. We propose a simple two-step approach to deal with this problem. The first step applies LASSO to the cross-section data at each time period to select the most informative moment conditions. The second step applies a linear instrumental variable estimator using the instruments constructed from the moment conditions selected in the first step. The two stages are combined using sample-splitting and cross-fitting to avoid overfitting bias. Using asymptotic sequences where the two dimensions of the panel grow with the sample size, we show that the new estimator is consistent and asymptotically normal under much weaker conditions on $T$ than the Arellano-Bond estimator. Our theory covers models with high dimensional covariates including multiple lags of the dependent variable, which are common in modern applications. We",
    "link": "https://arxiv.org/abs/2402.00584",
    "context": "Title: Arellano-Bond LASSO Estimator for Dynamic Linear Panel Models\nAbstract: The Arellano-Bond estimator can be severely biased when the time series dimension of the data, $T$, is long. The source of the bias is the large degree of overidentification. We propose a simple two-step approach to deal with this problem. The first step applies LASSO to the cross-section data at each time period to select the most informative moment conditions. The second step applies a linear instrumental variable estimator using the instruments constructed from the moment conditions selected in the first step. The two stages are combined using sample-splitting and cross-fitting to avoid overfitting bias. Using asymptotic sequences where the two dimensions of the panel grow with the sample size, we show that the new estimator is consistent and asymptotically normal under much weaker conditions on $T$ than the Arellano-Bond estimator. Our theory covers models with high dimensional covariates including multiple lags of the dependent variable, which are common in modern applications. We",
    "path": "papers/24/02/2402.00584.json",
    "total_tokens": 984,
    "translated_title": "Arellano-Bond LASSO估计器用于动态线性面板模型",
    "translated_abstract": "当数据的时间序列维度$T$较长时，Arellano-Bond估计器可能出现严重偏差。偏差的来源是过度识别的程度过大。我们提出了一种简单的两步方法来解决这个问题。第一步在每个时间段对横截面数据应用LASSO选择最有信息量的矩条件。第二步使用从第一步选择的矩条件构造的工具变量估计线性仪器。通过样本切分和交叉拟合两个阶段来避免过拟合偏差。使用随着样本大小增长的渐近序列，我们证明了新的估计器在对$T$的条件要求比Arellano-Bond估计器要弱的情况下是一致的和渐近正态的。我们的理论涵盖了包括依赖变量的多个滞后等高维协变量在内的模型，这在现代应用中很常见。",
    "tldr": "提出了一种针对长时间序列数据的Arellano-Bond估计器偏差问题的两步法。首先利用LASSO选择信息量最大的矩条件，然后使用这些条件构造工具变量进行线性仪器变量估计。该方法通过样本切分和交叉拟合来避免过拟合偏差，并且在对时间序列维度$T$的条件要求更弱的情况下是一致的和渐近正态的。"
}