{
    "title": "The Berkeley Single Cell Computational Microscopy (BSCCM) Dataset",
    "abstract": "Computational microscopy, in which hardware and algorithms of an imaging system are jointly designed, shows promise for making imaging systems that cost less, perform more robustly, and collect new types of information. Often, the performance of computational imaging systems, especially those that incorporate machine learning, is sample-dependent. Thus, standardized datasets are an essential tool for comparing the performance of different approaches. Here, we introduce the Berkeley Single Cell Computational Microscopy (BSCCM) dataset, which contains over ~12,000,000 images of 400,000 of individual white blood cells. The dataset contains images captured with multiple illumination patterns on an LED array microscope and fluorescent measurements of the abundance of surface proteins that mark different cell types. We hope this dataset will provide a valuable resource for the development and testing of new algorithms in computational microscopy and computer vision with practical biomedical ",
    "link": "https://arxiv.org/abs/2402.06191",
    "context": "Title: The Berkeley Single Cell Computational Microscopy (BSCCM) Dataset\nAbstract: Computational microscopy, in which hardware and algorithms of an imaging system are jointly designed, shows promise for making imaging systems that cost less, perform more robustly, and collect new types of information. Often, the performance of computational imaging systems, especially those that incorporate machine learning, is sample-dependent. Thus, standardized datasets are an essential tool for comparing the performance of different approaches. Here, we introduce the Berkeley Single Cell Computational Microscopy (BSCCM) dataset, which contains over ~12,000,000 images of 400,000 of individual white blood cells. The dataset contains images captured with multiple illumination patterns on an LED array microscope and fluorescent measurements of the abundance of surface proteins that mark different cell types. We hope this dataset will provide a valuable resource for the development and testing of new algorithms in computational microscopy and computer vision with practical biomedical ",
    "path": "papers/24/02/2402.06191.json",
    "total_tokens": 844,
    "translated_title": "伯克利单细胞计算显微镜（BSCCM）数据集",
    "translated_abstract": "计算显微镜，即硬件和算法的联合设计，显示出降低成本、更稳健地执行和收集新类型信息的潜力。计算显微镜系统的性能，特别是那些融合了机器学习的系统，通常是样本相关的。因此，标准数据集是比较不同方法性能的重要工具。在这里，我们介绍伯克利单细胞计算显微镜（BSCCM）数据集，其中包含了约12,000,000张个体白血细胞的图像。该数据集是在LED阵列显微镜上采用多种照明模式拍摄的图像，并且包含了标记不同细胞类型表面蛋白的荧光测量结果。我们希望这个数据集能为计算显微镜和计算机视觉中新算法的开发和测试提供宝贵资源。",
    "tldr": "伯克利单细胞计算显微镜（BSCCM）数据集包含了约12,000,000张个体白血细胞的图像，提供了用于计算显微镜和计算机视觉算法开发和测试的宝贵资源。",
    "en_tdlr": "The Berkeley Single Cell Computational Microscopy (BSCCM) dataset, which contains approximately 12,000,000 images of individual white blood cells, provides a valuable resource for the development and testing of algorithms in computational microscopy and computer vision."
}