{
    "title": "Generative Adversarial Network with Soft-Dynamic Time Warping and Parallel Reconstruction for Energy Time Series Anomaly Detection",
    "abstract": "arXiv:2402.14384v1 Announce Type: new  Abstract: In this paper, we employ a 1D deep convolutional generative adversarial network (DCGAN) for sequential anomaly detection in energy time series data. Anomaly detection involves gradient descent to reconstruct energy sub-sequences, identifying the noise vector that closely generates them through the generator network. Soft-DTW is used as a differentiable alternative for the reconstruction loss and is found to be superior to Euclidean distance. Combining reconstruction loss and the latent space's prior probability distribution serves as the anomaly score. Our novel method accelerates detection by parallel computation of reconstruction of multiple points and shows promise in identifying anomalous energy consumption in buildings, as evidenced by performing experiments on hourly energy time series from 15 buildings.",
    "link": "https://arxiv.org/abs/2402.14384",
    "context": "Title: Generative Adversarial Network with Soft-Dynamic Time Warping and Parallel Reconstruction for Energy Time Series Anomaly Detection\nAbstract: arXiv:2402.14384v1 Announce Type: new  Abstract: In this paper, we employ a 1D deep convolutional generative adversarial network (DCGAN) for sequential anomaly detection in energy time series data. Anomaly detection involves gradient descent to reconstruct energy sub-sequences, identifying the noise vector that closely generates them through the generator network. Soft-DTW is used as a differentiable alternative for the reconstruction loss and is found to be superior to Euclidean distance. Combining reconstruction loss and the latent space's prior probability distribution serves as the anomaly score. Our novel method accelerates detection by parallel computation of reconstruction of multiple points and shows promise in identifying anomalous energy consumption in buildings, as evidenced by performing experiments on hourly energy time series from 15 buildings.",
    "path": "papers/24/02/2402.14384.json",
    "total_tokens": 873,
    "translated_title": "具有软动态时间规整和并行重构的生成对抗网络用于能源时间序列异常检测",
    "translated_abstract": "在本文中，我们利用一维深度卷积生成对抗网络(DCGAN)来进行能源时间序列数据中的顺序异常检测。异常检测涉及梯度下降以重构能源子序列，通过生成器网络识别紧密生成它们的噪声向量。我们使用Soft-DTW作为重构损失的可微替代方案，并发现优于欧氏距离。将重构损失和潜在空间的先验概率分布相结合作为异常分数。我们的新颖方法通过并行计算多个点的重构加速检测，并显示出在识别建筑物中的异常能源消耗方面具有潜力，通过对来自15栋建筑物的小时能源时间序列进行实验加以证明。",
    "tldr": "本研究提出了一种利用深度卷积生成对抗网络来进行能源时间序列异常检测的方法，结合软动态时间规整和并行重构技术，通过将重构损失和潜在空间的先验概率分布相结合作为异常分数，加速了检测过程，实验证明在建筑能源消耗的异常检测上表现出很好的效果。",
    "en_tdlr": "This study proposes a method for energy time series anomaly detection using a deep convolutional generative adversarial network, incorporating soft-dynamic time warping and parallel reconstruction techniques, accelerating the detection process by combining the reconstruction loss and the prior probability distribution of the latent space as the anomaly score, and experiments demonstrate its effectiveness in anomaly detection of building energy consumption."
}