{
    "title": "Efficient Multi-task Uncertainties for Joint Semantic Segmentation and Monocular Depth Estimation",
    "abstract": "arXiv:2402.10580v1 Announce Type: cross  Abstract: Quantifying the predictive uncertainty emerged as a possible solution to common challenges like overconfidence or lack of explainability and robustness of deep neural networks, albeit one that is often computationally expensive. Many real-world applications are multi-modal in nature and hence benefit from multi-task learning. In autonomous driving, for example, the joint solution of semantic segmentation and monocular depth estimation has proven to be valuable. In this work, we first combine different uncertainty quantification methods with joint semantic segmentation and monocular depth estimation and evaluate how they perform in comparison to each other. Additionally, we reveal the benefits of multi-task learning with regard to the uncertainty quality compared to solving both tasks separately. Based on these insights, we introduce EMUFormer, a novel student-teacher distillation approach for joint semantic segmentation and monocular d",
    "link": "https://arxiv.org/abs/2402.10580",
    "context": "Title: Efficient Multi-task Uncertainties for Joint Semantic Segmentation and Monocular Depth Estimation\nAbstract: arXiv:2402.10580v1 Announce Type: cross  Abstract: Quantifying the predictive uncertainty emerged as a possible solution to common challenges like overconfidence or lack of explainability and robustness of deep neural networks, albeit one that is often computationally expensive. Many real-world applications are multi-modal in nature and hence benefit from multi-task learning. In autonomous driving, for example, the joint solution of semantic segmentation and monocular depth estimation has proven to be valuable. In this work, we first combine different uncertainty quantification methods with joint semantic segmentation and monocular depth estimation and evaluate how they perform in comparison to each other. Additionally, we reveal the benefits of multi-task learning with regard to the uncertainty quality compared to solving both tasks separately. Based on these insights, we introduce EMUFormer, a novel student-teacher distillation approach for joint semantic segmentation and monocular d",
    "path": "papers/24/02/2402.10580.json",
    "total_tokens": 889,
    "translated_title": "高效多任务不确定性用于联合语义分割和单目深度估计",
    "translated_abstract": "预测不确定性的量化成为应对深度神经网络普遍挑战（如过度自信、缺乏解释性和鲁棒性）的可能解决方案，尽管它往往具有较高的计算成本。许多现实世界的应用都具有多模态性质，因此受益于多任务学习。例如，在自动驾驶中，语义分割和单目深度估计的联合解决方案已被证明具有重要价值。在这项工作中，我们首先将不同的不确定性量化方法与联合语义分割和单目深度估计相结合，并评估它们相互之间的表现。此外，我们揭示了与单独解决这两个任务相比，多任务学习在不确定性质量方面的益处。基于这些见解，我们引入了EMUFormer，一种新的学生-教师蒸馏方法，用于联合语义分割和单目深度估计。",
    "tldr": "本研究将不同的不确定性量化方法与联合语义分割和单目深度估计相结合，介绍了一种新的学生-教师蒸馏方法 EMUFormer，揭示了多任务学习对不确定性质量的益处。"
}