{
    "title": "Learning Label Hierarchy with Supervised Contrastive Learning",
    "abstract": "Supervised contrastive learning (SCL) frameworks treat each class as independent and thus consider all classes to be equally important. This neglects the common scenario in which label hierarchy exists, where fine-grained classes under the same category show more similarity than very different ones. This paper introduces a family of Label-Aware SCL methods (LASCL) that incorporates hierarchical information to SCL by leveraging similarities between classes, resulting in creating a more well-structured and discriminative feature space. This is achieved by first adjusting the distance between instances based on measures of the proximity of their classes with the scaled instance-instance-wise contrastive. An additional instance-center-wise contrastive is introduced to move within-class examples closer to their centers, which are represented by a set of learnable label parameters. The learned label parameters can be directly used as a nearest neighbor classifier without further finetuning. ",
    "link": "https://arxiv.org/abs/2402.00232",
    "context": "Title: Learning Label Hierarchy with Supervised Contrastive Learning\nAbstract: Supervised contrastive learning (SCL) frameworks treat each class as independent and thus consider all classes to be equally important. This neglects the common scenario in which label hierarchy exists, where fine-grained classes under the same category show more similarity than very different ones. This paper introduces a family of Label-Aware SCL methods (LASCL) that incorporates hierarchical information to SCL by leveraging similarities between classes, resulting in creating a more well-structured and discriminative feature space. This is achieved by first adjusting the distance between instances based on measures of the proximity of their classes with the scaled instance-instance-wise contrastive. An additional instance-center-wise contrastive is introduced to move within-class examples closer to their centers, which are represented by a set of learnable label parameters. The learned label parameters can be directly used as a nearest neighbor classifier without further finetuning. ",
    "path": "papers/24/02/2402.00232.json",
    "total_tokens": 835,
    "translated_title": "使用有监督对比学习学习标签层次结构",
    "translated_abstract": "有监督对比学习（SCL）框架将每个类别视为独立的，因此认为所有类别同等重要。这忽略了标签层次存在的一般情况，即同一类别下的细粒度类别之间比非常不同的类别更相似。本文引入了一系列标签感知的SCL方法（LASCL），通过利用类别之间的相似性将层次信息融入SCL中，从而创建一个更为良好结构化和有区分性的特征空间。这是通过先根据类别之间的接近程度调整实例之间的距离来实现的，通过缩放的实例-实例对比。引入了一个额外的实例-中心对比，将同类别的示例移动到它们的中心附近，中心由一组可学习的标签参数表示。学习到的标签参数可以直接用作最近邻分类器，无需进一步微调。",
    "tldr": "本文介绍了一种将标签层次结构融入有监督对比学习的方法，通过调整实例之间的距离和引入额外的对比，创建一个更为良好结构化和有区分性的特征空间。",
    "en_tdlr": "This paper introduces a method that incorporates label hierarchy into supervised contrastive learning, creating a more well-structured and discriminative feature space by adjusting instance distances and introducing additional contrastive."
}