{
    "title": "Leveraging ChatGPT in Pharmacovigilance Event Extraction: An Empirical Study",
    "abstract": "arXiv:2402.15663v1 Announce Type: new  Abstract: With the advent of large language models (LLMs), there has been growing interest in exploring their potential for medical applications. This research aims to investigate the ability of LLMs, specifically ChatGPT, in the context of pharmacovigilance event extraction, of which the main goal is to identify and extract adverse events or potential therapeutic events from textual medical sources. We conduct extensive experiments to assess the performance of ChatGPT in the pharmacovigilance event extraction task, employing various prompts and demonstration selection strategies. The findings demonstrate that while ChatGPT demonstrates reasonable performance with appropriate demonstration selection strategies, it still falls short compared to fully fine-tuned small models. Additionally, we explore the potential of leveraging ChatGPT for data augmentation. However, our investigation reveals that the inclusion of synthesized data into fine-tuning m",
    "link": "https://arxiv.org/abs/2402.15663",
    "context": "Title: Leveraging ChatGPT in Pharmacovigilance Event Extraction: An Empirical Study\nAbstract: arXiv:2402.15663v1 Announce Type: new  Abstract: With the advent of large language models (LLMs), there has been growing interest in exploring their potential for medical applications. This research aims to investigate the ability of LLMs, specifically ChatGPT, in the context of pharmacovigilance event extraction, of which the main goal is to identify and extract adverse events or potential therapeutic events from textual medical sources. We conduct extensive experiments to assess the performance of ChatGPT in the pharmacovigilance event extraction task, employing various prompts and demonstration selection strategies. The findings demonstrate that while ChatGPT demonstrates reasonable performance with appropriate demonstration selection strategies, it still falls short compared to fully fine-tuned small models. Additionally, we explore the potential of leveraging ChatGPT for data augmentation. However, our investigation reveals that the inclusion of synthesized data into fine-tuning m",
    "path": "papers/24/02/2402.15663.json",
    "total_tokens": 855,
    "translated_title": "在药物监测事件提取中利用ChatGPT：一项实证研究",
    "translated_abstract": "随着大型语言模型（LLMs）的出现，人们越来越感兴趣探索其在医疗应用中的潜力。本研究旨在调查LLMs，特别是ChatGPT，在药物监测事件提取中的能力，其主要目标是从文本医疗来源中识别和提取不良事件或潜在治疗事件。我们进行了广泛实验，评估ChatGPT在药物监测事件提取任务中的性能，采用各种提示和演示选择策略。研究结果表明，尽管ChatGPT在适当的演示选择策略下表现出合理的性能，但与完全微调的小型模型相比仍存在不足。此外，我们探讨了利用ChatGPT进行数据增强的潜力。然而，我们的调查发现，将合成数据纳入微调中",
    "tldr": "该研究调查了在药物监测事件提取中利用ChatGPT的能力，并发现尽管ChatGPT在适当的演示选择策略下表现良好，但仍不及完全微调的小型模型。"
}