{
    "title": "BlockEcho: Retaining Long-Range Dependencies for Imputing Block-Wise Missing Data",
    "abstract": "arXiv:2402.18800v1 Announce Type: new  Abstract: Block-wise missing data poses significant challenges in real-world data imputation tasks. Compared to scattered missing data, block-wise gaps exacerbate adverse effects on subsequent analytic and machine learning tasks, as the lack of local neighboring elements significantly reduces the interpolation capability and predictive power. However, this issue has not received adequate attention. Most SOTA matrix completion methods appeared less effective, primarily due to overreliance on neighboring elements for predictions. We systematically analyze the issue and propose a novel matrix completion method ``BlockEcho\" for a more comprehensive solution. This method creatively integrates Matrix Factorization (MF) within Generative Adversarial Networks (GAN) to explicitly retain long-distance inter-element relationships in the original matrix. Besides, we incorporate an additional discriminator for GAN, comparing the generator's intermediate progre",
    "link": "https://arxiv.org/abs/2402.18800",
    "context": "Title: BlockEcho: Retaining Long-Range Dependencies for Imputing Block-Wise Missing Data\nAbstract: arXiv:2402.18800v1 Announce Type: new  Abstract: Block-wise missing data poses significant challenges in real-world data imputation tasks. Compared to scattered missing data, block-wise gaps exacerbate adverse effects on subsequent analytic and machine learning tasks, as the lack of local neighboring elements significantly reduces the interpolation capability and predictive power. However, this issue has not received adequate attention. Most SOTA matrix completion methods appeared less effective, primarily due to overreliance on neighboring elements for predictions. We systematically analyze the issue and propose a novel matrix completion method ``BlockEcho\" for a more comprehensive solution. This method creatively integrates Matrix Factorization (MF) within Generative Adversarial Networks (GAN) to explicitly retain long-distance inter-element relationships in the original matrix. Besides, we incorporate an additional discriminator for GAN, comparing the generator's intermediate progre",
    "path": "papers/24/02/2402.18800.json",
    "total_tokens": 934,
    "translated_title": "BlockEcho：保留长距离依赖关系用于填补块状缺失数据",
    "translated_abstract": "arXiv:2402.18800v1 类型：新  摘要：块状缺失数据在实际数据填补任务中带来了显著挑战。与分散的缺失数据相比，块状缺失数据加剧了对后续分析和机器学习任务的不利影响，因为缺乏局部相邻元素显著降低了插值能力和预测能力。然而，这个问题尚未得到充分关注。由于过度依赖邻近元素进行预测，大多数SOTA矩阵填充方法显示出较低的有效性。我们系统地分析了这个问题，并提出了一种新颖的矩阵填充方法“BlockEcho”以提供更全面的解决方案。该方法创造性地将矩阵分解（MF）与生成对抗网络（GAN）相结合，以明确保留原始矩阵中的长距离元素间关系。此外，我们还为GAN引入了一个额外的鉴别器，比较生成器的中间进程。",
    "tldr": "该论文提出了一种名为BlockEcho的新矩阵填充方法，通过将矩阵分解和生成对抗网络相结合，创造性地保留了原始矩阵中的长距离依赖关系，以解决块状缺失数据对数据插值和预测能力的挑战。"
}