{
    "title": "Learning-based Bone Quality Classification Method for Spinal Metastasis",
    "abstract": "arXiv:2402.08910v1 Announce Type: cross Abstract: Spinal metastasis is the most common disease in bone metastasis and may cause pain, instability and neurological injuries. Early detection of spinal metastasis is critical for accurate staging and optimal treatment. The diagnosis is usually facilitated with Computed Tomography (CT) scans, which requires considerable efforts from well-trained radiologists. In this paper, we explore a learning-based automatic bone quality classification method for spinal metastasis based on CT images. We simultaneously take the posterolateral spine involvement classification task into account, and employ multi-task learning (MTL) technique to improve the performance. MTL acts as a form of inductive bias which helps the model generalize better on each task by sharing representations between related tasks. Based on the prior knowledge that the mixed type can be viewed as both blastic and lytic, we model the task of bone quality classification as two binary ",
    "link": "https://arxiv.org/abs/2402.08910",
    "context": "Title: Learning-based Bone Quality Classification Method for Spinal Metastasis\nAbstract: arXiv:2402.08910v1 Announce Type: cross Abstract: Spinal metastasis is the most common disease in bone metastasis and may cause pain, instability and neurological injuries. Early detection of spinal metastasis is critical for accurate staging and optimal treatment. The diagnosis is usually facilitated with Computed Tomography (CT) scans, which requires considerable efforts from well-trained radiologists. In this paper, we explore a learning-based automatic bone quality classification method for spinal metastasis based on CT images. We simultaneously take the posterolateral spine involvement classification task into account, and employ multi-task learning (MTL) technique to improve the performance. MTL acts as a form of inductive bias which helps the model generalize better on each task by sharing representations between related tasks. Based on the prior knowledge that the mixed type can be viewed as both blastic and lytic, we model the task of bone quality classification as two binary ",
    "path": "papers/24/02/2402.08910.json",
    "total_tokens": 869,
    "translated_title": "基于学习的脊柱转移骨质量分类方法",
    "translated_abstract": "脊柱转移是骨转移中最常见的疾病，可能导致疼痛、不稳定性和神经损伤。早期检测脊柱转移对准确分期和最佳治疗至关重要。通常通过计算机断层扫描（CT）来辅助诊断，但这需要经验丰富的放射科医生付出大量努力。本文提出了一种基于CT图像的学习型自动脊柱转移骨质量分类方法。我们同时考虑了横纵脊柱受累分类任务，并利用多任务学习（MTL）技术来提高性能。MTL作为归纳偏置形式，通过在相关任务之间共享表示来帮助模型更好地泛化。基于混合型可被视为增生性和溶骨性的先验知识，我们将骨质量分类任务建模为两个二分类问题。",
    "tldr": "本文提出了一种基于CT图像的学习型自动脊柱转移骨质量分类方法，并利用多任务学习技术同时考虑横纵脊柱受累分类任务，以提高性能。",
    "en_tdlr": "This paper proposes a learning-based automatic bone quality classification method for spinal metastasis based on CT images. It also employs multi-task learning technique to simultaneously consider the classification of posterolateral spine involvement, improving the performance."
}