{
    "title": "Capturing waste collection planning expert knowledge in a fitness function through preference learning",
    "abstract": "This paper copes with the COGERSA waste collection process. Up to now, experts have been manually designed the process using a trial and error mechanism. This process is not globally optimized, since it has been progressively and locally built as council demands appear. Planning optimization algorithms usually solve it, but they need a fitness function to evaluate a route planning quality. The drawback is that even experts are not able to propose one in a straightforward way due to the complexity of the process. Hence, the goal of this paper is to build a fitness function though a preference framework, taking advantage of the available expert knowledge and expertise. Several key performance indicators together with preference judgments are carefully established according to the experts for learning a promising fitness function. Particularly, the additivity property of them makes the task be much more affordable, since it allows to work with routes rather than with route plannings. Besi",
    "link": "https://arxiv.org/abs/2402.01849",
    "context": "Title: Capturing waste collection planning expert knowledge in a fitness function through preference learning\nAbstract: This paper copes with the COGERSA waste collection process. Up to now, experts have been manually designed the process using a trial and error mechanism. This process is not globally optimized, since it has been progressively and locally built as council demands appear. Planning optimization algorithms usually solve it, but they need a fitness function to evaluate a route planning quality. The drawback is that even experts are not able to propose one in a straightforward way due to the complexity of the process. Hence, the goal of this paper is to build a fitness function though a preference framework, taking advantage of the available expert knowledge and expertise. Several key performance indicators together with preference judgments are carefully established according to the experts for learning a promising fitness function. Particularly, the additivity property of them makes the task be much more affordable, since it allows to work with routes rather than with route plannings. Besi",
    "path": "papers/24/02/2402.01849.json",
    "total_tokens": 846,
    "translated_title": "通过偏好学习将废物收集规划专家知识融入适应性函数中",
    "translated_abstract": "本文针对COGERSA废物收集流程进行研究。目前，专家们通过试错机制手动设计该流程。但该流程并不是全局优化的，因为它是根据委员会需求逐步和局部地构建的。规划优化算法通常可以解决这个问题，但需要一个适应性函数来评估路线规划的质量。然而，由于流程的复杂性，即使专家也无法直接提出一个适应性函数。因此，本文的目标是通过偏好框架建立一个适应性函数，利用现有的专家知识和专业能力。根据专家的意见，精心确定了几个关键绩效指标和偏好判断，以学习一个有前途的适应性函数。特别地，它们的可加性属性使任务更加可行，因为它允许我们处理路线而不是路线规划。",
    "tldr": "本文提出了一种通过偏好学习将废物收集规划专家知识融入适应性函数的方法，通过制定关键绩效指标和偏好判断，实现了全局优化的废物收集流程。",
    "en_tdlr": "This paper proposes a method to incorporate waste collection planning expert knowledge into a fitness function through preference learning, achieving globally optimized waste collection process by establishing key performance indicators and preference judgments."
}