{
    "title": "A literatura das receitas comerciais em aeroportos: discuss\\~oes e principais descobertas",
    "abstract": "arXiv:2402.12403v1 Announce Type: new  Abstract: The exploration of existing commercial opportunities has been increasing the share of commercial (non-aeronautical) revenues in the total revenues of airports worldwide. These revenues, also called commercial, non-aeronautical, or non-tariff revenues, come from rentals, duty-free shops, food and beverage sales, parking, advertising, etc. In other words, everything that is not the main business of the airport. Consequently, the dependence on commercial revenues has also become increasingly important, and airport managers are interested in understanding how to improve their financial results with this new revenue source, as it not only improves financial outcomes but also optimizes passengers' time and money consumption options at airports. Therefore, this chapter seeks to discuss the main determinants of commercial revenues at national airports, analyzing the possible impacts of the behavior of passengers from low-cost carriers (LCC) on t",
    "link": "https://arxiv.org/abs/2402.12403",
    "context": "Title: A literatura das receitas comerciais em aeroportos: discuss\\~oes e principais descobertas\nAbstract: arXiv:2402.12403v1 Announce Type: new  Abstract: The exploration of existing commercial opportunities has been increasing the share of commercial (non-aeronautical) revenues in the total revenues of airports worldwide. These revenues, also called commercial, non-aeronautical, or non-tariff revenues, come from rentals, duty-free shops, food and beverage sales, parking, advertising, etc. In other words, everything that is not the main business of the airport. Consequently, the dependence on commercial revenues has also become increasingly important, and airport managers are interested in understanding how to improve their financial results with this new revenue source, as it not only improves financial outcomes but also optimizes passengers' time and money consumption options at airports. Therefore, this chapter seeks to discuss the main determinants of commercial revenues at national airports, analyzing the possible impacts of the behavior of passengers from low-cost carriers (LCC) on t",
    "path": "papers/24/02/2402.12403.json",
    "total_tokens": 821,
    "translated_title": "机场商业配套设施文献研究：讨论与主要发现",
    "translated_abstract": "通过商业机会的探索，世界各地机场商业（非航空）收入在机场总收入中所占比例不断增加。这些收入也被称为商业、非航空或非关税收入，来自租金、免税店、食品饮料销售、停车费、广告等。换句话说，一切不属于机场主营业务的项目。因此，对商业收入的依赖性也变得越来越重要，机场管理者对了解如何通过这一新的收入来源改善财务业绩感兴趣，因为这不仅改善了财务结果，还优化了乘客在机场的时间和金钱消费选项。因此，本章旨在讨论国家机场商业收入的主要决定因素，分析廉价航空公司(LCC)乘客行为可能对其产生的影响。",
    "tldr": "该论文讨论了国家机场商业收入的主要决定因素以及廉价航空公司乘客行为可能对其产生的影响。",
    "en_tdlr": "This paper discusses the main determinants of commercial revenues at national airports and the potential impacts of low-cost carrier passengers' behavior on them."
}