{
    "title": "The European Commitment to Human-Centered Technology: The Integral Role of HCI in the EU AI Act's Success",
    "abstract": "arXiv:2402.14728v1 Announce Type: cross  Abstract: The evolution of AI is set to profoundly reshape the future. The European Union, recognizing this impending prominence, has enacted the AI Act, regulating market access for AI-based systems. A salient feature of the Act is to guard democratic and humanistic values by focusing regulation on transparency, explainability, and the human ability to understand and control AI systems. Hereby, the EU AI Act does not merely specify technological requirements for AI systems. The EU issues a democratic call for human-centered AI systems and, in turn, an interdisciplinary research agenda for human-centered innovation in AI development. Without robust methods to assess AI systems and their effect on individuals and society, the EU AI Act may lead to repeating the mistakes of the General Data Protection Regulation of the EU and to rushed, chaotic, ad-hoc, and ambiguous implementation, causing more confusion than lending guidance. Moreover, determine",
    "link": "https://arxiv.org/abs/2402.14728",
    "context": "Title: The European Commitment to Human-Centered Technology: The Integral Role of HCI in the EU AI Act's Success\nAbstract: arXiv:2402.14728v1 Announce Type: cross  Abstract: The evolution of AI is set to profoundly reshape the future. The European Union, recognizing this impending prominence, has enacted the AI Act, regulating market access for AI-based systems. A salient feature of the Act is to guard democratic and humanistic values by focusing regulation on transparency, explainability, and the human ability to understand and control AI systems. Hereby, the EU AI Act does not merely specify technological requirements for AI systems. The EU issues a democratic call for human-centered AI systems and, in turn, an interdisciplinary research agenda for human-centered innovation in AI development. Without robust methods to assess AI systems and their effect on individuals and society, the EU AI Act may lead to repeating the mistakes of the General Data Protection Regulation of the EU and to rushed, chaotic, ad-hoc, and ambiguous implementation, causing more confusion than lending guidance. Moreover, determine",
    "path": "papers/24/02/2402.14728.json",
    "total_tokens": 913,
    "translated_title": "欧洲对人本科技的承诺：HCI在欧盟AI法案成功中的重要作用",
    "translated_abstract": "AI的发展将深刻重塑未来。欧盟认识到这一即将到来的重要性，已经通过了AI法案，对基于AI的系统的市场准入进行监管。该法案的一个显著特征是通过专注于透明性、可解释性以及人类理解和控制AI系统的能力，维护民主和人道主义价值观。因此，欧盟AI法案不仅仅规定了AI系统的技术要求。欧盟发出了一个民主号召，要求人本AI系统，进而制定了人本创新的跨学科研究议程，促进AI发展中的人本创新。如果没有强大的方法来评估AI系统及其对个人和社会的影响，欧盟AI法案可能会导致重复欧盟《一般数据保护条例》的错误，导致仓促、混乱、临时和模糊的实施，带来更多的困惑而不是指导。",
    "tldr": "欧盟AI法案强调透明性、可解释性和人类理解能力，提出了人本AI系统的民主呼吁，同时制定了人本创新的跨学科研究议程，以避免重复GDPR的错误并避免实施混乱。"
}