{
    "title": "Statistical Guarantees for Link Prediction using Graph Neural Networks",
    "abstract": "This paper derives statistical guarantees for the performance of Graph Neural Networks (GNNs) in link prediction tasks on graphs generated by a graphon. We propose a linear GNN architecture (LG-GNN) that produces consistent estimators for the underlying edge probabilities. We establish a bound on the mean squared error and give guarantees on the ability of LG-GNN to detect high-probability edges. Our guarantees hold for both sparse and dense graphs. Finally, we demonstrate some of the shortcomings of the classical GCN architecture, as well as verify our results on real and synthetic datasets.",
    "link": "https://arxiv.org/abs/2402.02692",
    "context": "Title: Statistical Guarantees for Link Prediction using Graph Neural Networks\nAbstract: This paper derives statistical guarantees for the performance of Graph Neural Networks (GNNs) in link prediction tasks on graphs generated by a graphon. We propose a linear GNN architecture (LG-GNN) that produces consistent estimators for the underlying edge probabilities. We establish a bound on the mean squared error and give guarantees on the ability of LG-GNN to detect high-probability edges. Our guarantees hold for both sparse and dense graphs. Finally, we demonstrate some of the shortcomings of the classical GCN architecture, as well as verify our results on real and synthetic datasets.",
    "path": "papers/24/02/2402.02692.json",
    "total_tokens": 711,
    "translated_title": "使用图神经网络的链接预测的统计保证",
    "translated_abstract": "本文针对由图上生成的图网络中的链接预测任务，推导了图神经网络（GNN）性能的统计保证。我们提出了一个线性GNN架构（LG-GNN），可以产生对潜在边缘概率的一致估计。我们对均方误差进行了界定，并对LG-GNN在检测高概率边缘的能力给出了保证。我们的保证适用于稀疏和稠密图。最后，我们展示了经典GCN架构的一些缺点，并在真实和合成数据集上验证了我们的结果。",
    "tldr": "本文提出了一种线性图神经网络（LG-GNN）架构，通过计算边缘概率来预测图中的链接，并推导了其在链接预测任务中的性能统计保证。这种架构对于稀疏和稠密图都适用，并在真实和合成数据集上验证了其优势。",
    "en_tdlr": "This paper proposes a linear Graph Neural Network (LG-GNN) architecture to predict links in a graph by estimating edge probabilities, and derives statistical guarantees for its performance in link prediction tasks. The proposed architecture is applicable to both sparse and dense graphs, and its advantages are verified on real and synthetic datasets."
}