{
    "title": "Making a Long Story Short in Conversation Modeling",
    "abstract": "Conversation systems accommodate diverse users with unique personalities and distinct writing styles. Within the domain of multi-turn dialogue modeling, this work studies the impact of varied utterance lengths on the quality of subsequent responses generated by conversation models. Using GPT-3 as the base model, multiple dialogue datasets, and several metrics, we conduct a thorough exploration of this aspect of conversational models. Our analysis sheds light on the complex relationship between utterance lengths and the quality of follow-up responses generated by dialogue systems. Empirical findings suggests that, for certain types of conversations, utterance lengths can be reduced by up to 72% without any noticeable difference in the quality of follow-up responses.",
    "link": "https://arxiv.org/abs/2402.00143",
    "context": "Title: Making a Long Story Short in Conversation Modeling\nAbstract: Conversation systems accommodate diverse users with unique personalities and distinct writing styles. Within the domain of multi-turn dialogue modeling, this work studies the impact of varied utterance lengths on the quality of subsequent responses generated by conversation models. Using GPT-3 as the base model, multiple dialogue datasets, and several metrics, we conduct a thorough exploration of this aspect of conversational models. Our analysis sheds light on the complex relationship between utterance lengths and the quality of follow-up responses generated by dialogue systems. Empirical findings suggests that, for certain types of conversations, utterance lengths can be reduced by up to 72% without any noticeable difference in the quality of follow-up responses.",
    "path": "papers/24/02/2402.00143.json",
    "total_tokens": 720,
    "translated_title": "在对话建模中让故事简短",
    "translated_abstract": "对话系统适应了具有独特个性和不同写作风格的多样化用户。在多轮对话建模领域，本研究研究了话语长度的多样性对对话模型生成的后续回复质量的影响。使用GPT-3作为基础模型，多个对话数据集和多个评估指标，我们对对话模型的这一方面进行了彻底的探索。我们的分析揭示了话语长度与对话系统生成的后续回复质量之间的复杂关系。经验性发现表明，在某些类型的对话中，话语长度可以减少72%，而后续回复的质量没有明显差异。",
    "tldr": "本研究探讨了对话模型中话语长度多样性对生成后续回复质量的影响，发现在某些对话类型中，可以将话语长度减少72%而不影响质量。",
    "en_tdlr": "This work examines the impact of varying utterance lengths on the quality of follow-up responses generated by conversation models. The findings suggest that, for certain types of conversations, utterance lengths can be reduced by up to 72% without any noticeable difference in response quality."
}