{
    "title": "IntSat: Integer Linear Programming by Conflict-Driven Constraint-Learning",
    "abstract": "arXiv:2402.15522v1 Announce Type: new  Abstract: State-of-the-art SAT solvers are nowadays able to handle huge real-world instances. The key to this success is the so-called Conflict-Driven Clause-Learning (CDCL) scheme, which encompasses a number of techniques that exploit the conflicts that are encountered during the search for a solution. In this article we extend these techniques to Integer Linear Programming (ILP), where variables may take general integer values instead of purely binary ones, constraints are more expressive than just propositional clauses, and there may be an objective function to optimise. We explain how these methods can be implemented efficiently, and discuss possible improvements. Our work is backed with a basic implementation that shows that, even in this far less mature stage, our techniques are already a useful complement to the state of the art in ILP solving.",
    "link": "https://arxiv.org/abs/2402.15522",
    "context": "Title: IntSat: Integer Linear Programming by Conflict-Driven Constraint-Learning\nAbstract: arXiv:2402.15522v1 Announce Type: new  Abstract: State-of-the-art SAT solvers are nowadays able to handle huge real-world instances. The key to this success is the so-called Conflict-Driven Clause-Learning (CDCL) scheme, which encompasses a number of techniques that exploit the conflicts that are encountered during the search for a solution. In this article we extend these techniques to Integer Linear Programming (ILP), where variables may take general integer values instead of purely binary ones, constraints are more expressive than just propositional clauses, and there may be an objective function to optimise. We explain how these methods can be implemented efficiently, and discuss possible improvements. Our work is backed with a basic implementation that shows that, even in this far less mature stage, our techniques are already a useful complement to the state of the art in ILP solving.",
    "path": "papers/24/02/2402.15522.json",
    "total_tokens": 799,
    "translated_title": "IntSat: 基于冲突驱动约束学习的整数线性规划",
    "translated_abstract": "如今的最先进的SAT求解器能够处理大规模的现实世界实例。这一成功的关键在于所谓的冲突驱动子句学习（CDCL）方案，该方案包括一些利用在搜索解决方案过程中遇到的冲突的技术。在本文中，我们将这些技术扩展到整数线性规划（ILP）中，其中变量可以取一般整数值而不仅仅是二进制值，约束比命题子句更具表达力，可能存在一个要优化的目标函数。我们解释了如何高效地实现这些方法，并讨论了可能的改进。我们的工作得到了一个基本实现的支持，该实现表明，即使在这个远未成熟的阶段，我们的技术已经是ILP求解领域中最先进技术的有用补充。",
    "tldr": "把冲突驱动子句学习扩展到整数线性规划，有效实现并讨论改进，成为ILP求解领域有用的补充。",
    "en_tdlr": "Extending conflict-driven clause learning to Integer Linear Programming, efficiently implementing and discussing improvements, becoming a valuable complement in the field of ILP solving."
}