{
    "title": "PINN-BO: A Black-box Optimization Algorithm using Physics-Informed Neural Networks",
    "abstract": "Black-box optimization is a powerful approach for discovering global optima in noisy and expensive black-box functions, a problem widely encountered in real-world scenarios. Recently, there has been a growing interest in leveraging domain knowledge to enhance the efficacy of machine learning methods. Partial Differential Equations (PDEs) often provide an effective means for elucidating the fundamental principles governing the black-box functions. In this paper, we propose PINN-BO, a black-box optimization algorithm employing Physics-Informed Neural Networks that integrates the knowledge from Partial Differential Equations (PDEs) to improve the sample efficiency of the optimization. We analyze the theoretical behavior of our algorithm in terms of regret bound using advances in NTK theory and prove that the use of the PDE alongside the black-box function evaluations, PINN-BO leads to a tighter regret bound. We perform several experiments on a variety of optimization tasks and show that o",
    "link": "https://arxiv.org/abs/2402.03243",
    "context": "Title: PINN-BO: A Black-box Optimization Algorithm using Physics-Informed Neural Networks\nAbstract: Black-box optimization is a powerful approach for discovering global optima in noisy and expensive black-box functions, a problem widely encountered in real-world scenarios. Recently, there has been a growing interest in leveraging domain knowledge to enhance the efficacy of machine learning methods. Partial Differential Equations (PDEs) often provide an effective means for elucidating the fundamental principles governing the black-box functions. In this paper, we propose PINN-BO, a black-box optimization algorithm employing Physics-Informed Neural Networks that integrates the knowledge from Partial Differential Equations (PDEs) to improve the sample efficiency of the optimization. We analyze the theoretical behavior of our algorithm in terms of regret bound using advances in NTK theory and prove that the use of the PDE alongside the black-box function evaluations, PINN-BO leads to a tighter regret bound. We perform several experiments on a variety of optimization tasks and show that o",
    "path": "papers/24/02/2402.03243.json",
    "total_tokens": 794,
    "translated_title": "PINN-BO:一种使用物理启发式神经网络的黑箱优化算法",
    "translated_abstract": "黑箱优化是一种在嘈杂且昂贵的黑箱函数中发现全局最优解的强大方法，这在现实世界的场景中经常遇到。最近，利用领域知识增强机器学习方法的效力引起了越来越多的兴趣。偏微分方程常常是阐明控制黑箱函数的基本原理的有效手段。在本文中，我们提出了PINN-BO，一种采用物理启发式神经网络的黑箱优化算法，它将偏微分方程的知识与优化的样本效率相结合。我们利用NTK理论的进展分析了我们算法的理论行为，证明了在黑箱函数评估中使用PDE和PINN-BO可以得到更紧的后悔界。我们在多种优化任务上进行了多个实验，并展示了其性能。",
    "tldr": "PINN-BO是一种利用物理启发式神经网络和偏微分方程知识的黑箱优化算法，提高了优化的样本效率。",
    "en_tdlr": "PINN-BO is a black-box optimization algorithm that improves the sample efficiency by integrating Physics-Informed Neural Networks and knowledge from Partial Differential Equations (PDEs)."
}