{
    "title": "Automated Machine Learning for Multi-Label Classification",
    "abstract": "arXiv:2402.18198v1 Announce Type: new  Abstract: Automated machine learning (AutoML) aims to select and configure machine learning algorithms and combine them into machine learning pipelines tailored to a dataset at hand. For supervised learning tasks, most notably binary and multinomial classification, aka single-label classification (SLC), such AutoML approaches have shown promising results. However, the task of multi-label classification (MLC), where data points are associated with a set of class labels instead of a single class label, has received much less attention so far. In the context of multi-label classification, the data-specific selection and configuration of multi-label classifiers are challenging even for experts in the field, as it is a high-dimensional optimization problem with multi-level hierarchical dependencies. While for SLC, the space of machine learning pipelines is already huge, the size of the MLC search space outnumbers the one of SLC by several orders.   In ",
    "link": "https://arxiv.org/abs/2402.18198",
    "context": "Title: Automated Machine Learning for Multi-Label Classification\nAbstract: arXiv:2402.18198v1 Announce Type: new  Abstract: Automated machine learning (AutoML) aims to select and configure machine learning algorithms and combine them into machine learning pipelines tailored to a dataset at hand. For supervised learning tasks, most notably binary and multinomial classification, aka single-label classification (SLC), such AutoML approaches have shown promising results. However, the task of multi-label classification (MLC), where data points are associated with a set of class labels instead of a single class label, has received much less attention so far. In the context of multi-label classification, the data-specific selection and configuration of multi-label classifiers are challenging even for experts in the field, as it is a high-dimensional optimization problem with multi-level hierarchical dependencies. While for SLC, the space of machine learning pipelines is already huge, the size of the MLC search space outnumbers the one of SLC by several orders.   In ",
    "path": "papers/24/02/2402.18198.json",
    "total_tokens": 803,
    "translated_title": "用于多标签分类的自动机器学习",
    "translated_abstract": "arXiv:2402.18198v1 公告类型: 新的 摘要: 自动机器学习(AutoML)旨在选择和配置机器学习算法，并将它们组合成适用于特定数据集的机器学习流水线。对于监督学习任务，尤其是二元和多项分类，即单标签分类(SLC)，这些AutoML方法已经显示出有希望的结果。然而，多标签分类(MLC)的任务，其中数据点与一组类标签相关联而不是单个类标签，迄今为止受到的关注要少得多。在多标签分类的背景下，特定于数据的多标签分类器的选择和配置即使对于领域专家也具有挑战性，因为这是一个具有多层次依赖关系的高维优化问题。而对于SLC而言，机器学习流水线的空间已经非常庞大，MLC搜索空间的大小比SLC的一个数量级更大。",
    "tldr": "自动机器学习方法在多标签分类任务中的应用面临着挑战，因为其高维度的优化问题和庞大的搜索空间。",
    "en_tdlr": "Automated machine learning methods face challenges in multi-label classification tasks due to their high-dimensional optimization problems and huge search spaces."
}