{
    "title": "EMIFF: Enhanced Multi-scale Image Feature Fusion for Vehicle-Infrastructure Cooperative 3D Object Detection",
    "abstract": "arXiv:2402.15272v1 Announce Type: cross  Abstract: In autonomous driving, cooperative perception makes use of multi-view cameras from both vehicles and infrastructure, providing a global vantage point with rich semantic context of road conditions beyond a single vehicle viewpoint. Currently, two major challenges persist in vehicle-infrastructure cooperative 3D (VIC3D) object detection: $1)$ inherent pose errors when fusing multi-view images, caused by time asynchrony across cameras; $2)$ information loss in transmission process resulted from limited communication bandwidth. To address these issues, we propose a novel camera-based 3D detection framework for VIC3D task, Enhanced Multi-scale Image Feature Fusion (EMIFF). To fully exploit holistic perspectives from both vehicles and infrastructure, we propose Multi-scale Cross Attention (MCA) and Camera-aware Channel Masking (CCM) modules to enhance infrastructure and vehicle features at scale, spatial, and channel levels to correct the po",
    "link": "https://arxiv.org/abs/2402.15272",
    "context": "Title: EMIFF: Enhanced Multi-scale Image Feature Fusion for Vehicle-Infrastructure Cooperative 3D Object Detection\nAbstract: arXiv:2402.15272v1 Announce Type: cross  Abstract: In autonomous driving, cooperative perception makes use of multi-view cameras from both vehicles and infrastructure, providing a global vantage point with rich semantic context of road conditions beyond a single vehicle viewpoint. Currently, two major challenges persist in vehicle-infrastructure cooperative 3D (VIC3D) object detection: $1)$ inherent pose errors when fusing multi-view images, caused by time asynchrony across cameras; $2)$ information loss in transmission process resulted from limited communication bandwidth. To address these issues, we propose a novel camera-based 3D detection framework for VIC3D task, Enhanced Multi-scale Image Feature Fusion (EMIFF). To fully exploit holistic perspectives from both vehicles and infrastructure, we propose Multi-scale Cross Attention (MCA) and Camera-aware Channel Masking (CCM) modules to enhance infrastructure and vehicle features at scale, spatial, and channel levels to correct the po",
    "path": "papers/24/02/2402.15272.json",
    "total_tokens": 916,
    "translated_title": "EMIFF：增强型多尺度图像特征融合用于车路协同三维目标检测",
    "translated_abstract": "在自动驾驶中，合作感知利用来自车辆和基础设施的多视图摄像头，提供丰富的语义上下文，超越单个车辆视角的道路条件的全局视角。本文针对车路协同三维（VIC3D）目标检测中存在的两个主要挑战提出了一种新的基于相机的三维检测框架，增强型多尺度图像特征融合（EMIFF）。为了充分利用来自车辆和基础设施的整体视角，我们提出了多尺度交叉注意力（MCA）和相机感知通道屏蔽（CCM）模块，以增强基础设施和车辆特征在尺度、空间和通道级别上进行校正，以解决多视图图像融合时固有的姿态误差和传输过程中的信息丢失问题。",
    "tldr": "提出了一种新的基于相机的三维检测框架EMIFF，通过多尺度交叉注意力和相机感知通道屏蔽模块来增强基础设施和车辆特征，以解决车路协同三维目标检测中的姿态误差和信息丢失问题",
    "en_tdlr": "Introduced a novel camera-based 3D detection framework EMIFF, which enhances infrastructure and vehicle features using Multi-scale Cross Attention and Camera-aware Channel Masking modules to address pose errors and information loss in vehicle-infrastructure cooperative 3D object detection."
}