{
    "title": "ALISON: Fast and Effective Stylometric Authorship Obfuscation",
    "abstract": "Authorship Attribution (AA) and Authorship Obfuscation (AO) are two competing tasks of increasing importance in privacy research. Modern AA leverages an author's consistent writing style to match a text to its author using an AA classifier. AO is the corresponding adversarial task, aiming to modify a text in such a way that its semantics are preserved, yet an AA model cannot correctly infer its authorship. To address privacy concerns raised by state-of-the-art (SOTA) AA methods, new AO methods have been proposed but remain largely impractical to use due to their prohibitively slow training and obfuscation speed, often taking hours. To this challenge, we propose a practical AO method, ALISON, that (1) dramatically reduces training/obfuscation time, demonstrating more than 10x faster obfuscation than SOTA AO methods, (2) achieves better obfuscation success through attacking three transformer-based AA methods on two benchmark datasets, typically performing 15% better than competing method",
    "link": "https://arxiv.org/abs/2402.00835",
    "context": "Title: ALISON: Fast and Effective Stylometric Authorship Obfuscation\nAbstract: Authorship Attribution (AA) and Authorship Obfuscation (AO) are two competing tasks of increasing importance in privacy research. Modern AA leverages an author's consistent writing style to match a text to its author using an AA classifier. AO is the corresponding adversarial task, aiming to modify a text in such a way that its semantics are preserved, yet an AA model cannot correctly infer its authorship. To address privacy concerns raised by state-of-the-art (SOTA) AA methods, new AO methods have been proposed but remain largely impractical to use due to their prohibitively slow training and obfuscation speed, often taking hours. To this challenge, we propose a practical AO method, ALISON, that (1) dramatically reduces training/obfuscation time, demonstrating more than 10x faster obfuscation than SOTA AO methods, (2) achieves better obfuscation success through attacking three transformer-based AA methods on two benchmark datasets, typically performing 15% better than competing method",
    "path": "papers/24/02/2402.00835.json",
    "total_tokens": 884,
    "translated_title": "ALISON: 快速有效的风格学作者身份混淆",
    "translated_abstract": "作者归属度（AA）和作者身份混淆（AO）是隐私研究中日益重要的两项竞争任务。现代AA利用作者的一贯写作风格，使用AA分类器将文本与其作者匹配。AO是相应的对抗性任务，旨在以一种方式修改文本，使其语义得到保留，但AA模型无法正确推断其作者。为了解决最先进的AA方法引发的隐私问题，提出了新的AO方法，但由于其训练和混淆速度过慢（通常需要数小时），使用起来仍然不太实际。面对这一挑战，我们提出了一种实用的AO方法ALISON，它（1）大大减少了训练/混淆时间，演示了比最先进的AO方法快10倍以上的混淆速度，（2）通过攻击两个基准数据集上的三种基于Transformer的AA方法，实现了更好的混淆成功率，通常比竞争方法表现好15%。",
    "tldr": "ALISON是一种快速有效的风格学作者身份混淆方法，通过攻击AA模型来保护隐私，相比竞争方法，具有更快的混淆速度和更好的混淆成功率。",
    "en_tdlr": "ALISON is a fast and effective stylometric authorship obfuscation method that protects privacy by attacking AA models, with faster obfuscation speed and better obfuscation success rate compared to competing methods."
}