{
    "title": "SiLLM: Large Language Models for Simultaneous Machine Translation",
    "abstract": "arXiv:2402.13036v1 Announce Type: new  Abstract: Simultaneous Machine Translation (SiMT) generates translations while reading the source sentence, necessitating a policy to determine the optimal timing for reading and generating words. Despite the remarkable performance achieved by Large Language Models (LLM) across various NLP tasks, existing SiMT methods predominantly focus on conventional transformers, employing a single model to concurrently determine the policy and generate the translations. However, given the complexity of SiMT, it is challenging to effectively address both tasks with a single model. Therefore, there is a need to decouple the SiMT task into policy-decision and translation sub-tasks. We propose SiLLM, which delegates the two sub-tasks to separate agents, thereby incorporating LLM into SiMT. The policy-decision agent is managed by a conventional SiMT model, responsible for determining the translation policy. The translation agent, leveraging the capabilities of LLM",
    "link": "https://arxiv.org/abs/2402.13036",
    "context": "Title: SiLLM: Large Language Models for Simultaneous Machine Translation\nAbstract: arXiv:2402.13036v1 Announce Type: new  Abstract: Simultaneous Machine Translation (SiMT) generates translations while reading the source sentence, necessitating a policy to determine the optimal timing for reading and generating words. Despite the remarkable performance achieved by Large Language Models (LLM) across various NLP tasks, existing SiMT methods predominantly focus on conventional transformers, employing a single model to concurrently determine the policy and generate the translations. However, given the complexity of SiMT, it is challenging to effectively address both tasks with a single model. Therefore, there is a need to decouple the SiMT task into policy-decision and translation sub-tasks. We propose SiLLM, which delegates the two sub-tasks to separate agents, thereby incorporating LLM into SiMT. The policy-decision agent is managed by a conventional SiMT model, responsible for determining the translation policy. The translation agent, leveraging the capabilities of LLM",
    "path": "papers/24/02/2402.13036.json",
    "total_tokens": 850,
    "translated_title": "SiLLM：用于同时机器翻译的大型语言模型",
    "translated_abstract": "同时机器翻译（SiMT）在阅读源句子的同时生成翻译，需要一个策略来确定读取和生成单词的最佳时机。尽管大型语言模型（LLM）在各种自然语言处理任务中取得了显著表现，但现有的SiMT方法主要集中在传统的transformers上，采用单一模型同时确定策略和生成翻译。然而，考虑到SiMT的复杂性，用单一模型有效地处理这两个任务是具有挑战性的。因此，有必要将SiMT任务分解为策略决策和翻译子任务。我们提出了SiLLM，将这两个子任务委托给独立的代理，从而将LLM纳入SiMT中。策略决策代理由传统的SiMT模型管理，负责确定翻译策略。翻译代理利用LLM的能力",
    "tldr": "提出了SiLLM，将SiMT任务分解为策略决策和翻译子任务，并将这两个子任务委托给独立的代理，从而将大型语言模型引入SiMT。",
    "en_tdlr": "Introduced SiLLM, which decomposes the SiMT task into policy decision and translation sub-tasks, and delegates these two sub-tasks to separate agents, thus incorporating Large Language Models into SiMT."
}