{
    "title": "RoCode: A Dataset for Measuring Code Intelligence from Problem Definitions in Romanian",
    "abstract": "arXiv:2402.13222v1 Announce Type: new  Abstract: Recently, large language models (LLMs) have become increasingly powerful and have become capable of solving a plethora of tasks through proper instructions in natural language. However, the vast majority of testing suites assume that the instructions are written in English, the de facto prompting language. Code intelligence and problem solving still remain a difficult task, even for the most advanced LLMs. Currently, there are no datasets to measure the generalization power for code-generation models in a language other than English. In this work, we present RoCode, a competitive programming dataset, consisting of 2,642 problems written in Romanian, 11k solutions in C, C++ and Python and comprehensive testing suites for each problem. The purpose of RoCode is to provide a benchmark for evaluating the code intelligence of language models trained on Romanian / multilingual text as well as a fine-tuning set for pretrained Romanian models. Th",
    "link": "https://arxiv.org/abs/2402.13222",
    "context": "Title: RoCode: A Dataset for Measuring Code Intelligence from Problem Definitions in Romanian\nAbstract: arXiv:2402.13222v1 Announce Type: new  Abstract: Recently, large language models (LLMs) have become increasingly powerful and have become capable of solving a plethora of tasks through proper instructions in natural language. However, the vast majority of testing suites assume that the instructions are written in English, the de facto prompting language. Code intelligence and problem solving still remain a difficult task, even for the most advanced LLMs. Currently, there are no datasets to measure the generalization power for code-generation models in a language other than English. In this work, we present RoCode, a competitive programming dataset, consisting of 2,642 problems written in Romanian, 11k solutions in C, C++ and Python and comprehensive testing suites for each problem. The purpose of RoCode is to provide a benchmark for evaluating the code intelligence of language models trained on Romanian / multilingual text as well as a fine-tuning set for pretrained Romanian models. Th",
    "path": "papers/24/02/2402.13222.json",
    "total_tokens": 875,
    "translated_title": "RoCode: 用于测量罗马尼亚语问题定义中代码智能的数据集",
    "translated_abstract": "最近，大型语言模型（LLMs）变得越来越强大，并且能够通过自然语言中的适当指令解决大量任务。然而，绝大多数测试套件假定指令是用英语编写的，这是事实上的提示语言。即使对于最先进的LLMs来说，代码智能和问题解决仍然是一项困难的任务。目前，没有数据集可以衡量除英语以外的语言中代码生成模型的泛化能力。在这项工作中，我们提出了RoCode，一个竞赛性编程数据集，包含2,642个用罗马尼亚语编写的问题，11,000个用C、C ++和Python编写的解决方案以及每个问题的全面测试套件。RoCode的目的是为在罗马尼亚语/多语言文本上训练的语言模型的代码智能提供一个评估基准，以及为预训练的罗马尼亚语模型提供一个微调集。",
    "tldr": "提出了RoCode，一个用于测量罗马尼亚语编程问题的数据集，旨在评估在罗马尼亚语/多语言文本上训练的语言模型的代码智能。",
    "en_tdlr": "Introduced RoCode, a dataset for measuring code intelligence in Romanian programming problems, aimed at evaluating the code intelligence of language models trained on Romanian/multilingual text."
}