{
    "title": "The Dimension of Self-Directed Learning",
    "abstract": "arXiv:2402.13400v1 Announce Type: cross  Abstract: Understanding the self-directed learning complexity has been an important problem that has captured the attention of the online learning theory community since the early 1990s. Within this framework, the learner is allowed to adaptively choose its next data point in making predictions unlike the setting in adversarial online learning.   In this paper, we study the self-directed learning complexity in both the binary and multi-class settings, and we develop a dimension, namely $SDdim$, that exactly characterizes the self-directed learning mistake-bound for any concept class. The intuition behind $SDdim$ can be understood as a two-player game called the \"labelling game\". Armed with this two-player game, we calculate $SDdim$ on a whole host of examples with notable results on axis-aligned rectangles, VC dimension $1$ classes, and linear separators. We demonstrate several learnability gaps with a central focus on self-directed learning and",
    "link": "https://arxiv.org/abs/2402.13400",
    "context": "Title: The Dimension of Self-Directed Learning\nAbstract: arXiv:2402.13400v1 Announce Type: cross  Abstract: Understanding the self-directed learning complexity has been an important problem that has captured the attention of the online learning theory community since the early 1990s. Within this framework, the learner is allowed to adaptively choose its next data point in making predictions unlike the setting in adversarial online learning.   In this paper, we study the self-directed learning complexity in both the binary and multi-class settings, and we develop a dimension, namely $SDdim$, that exactly characterizes the self-directed learning mistake-bound for any concept class. The intuition behind $SDdim$ can be understood as a two-player game called the \"labelling game\". Armed with this two-player game, we calculate $SDdim$ on a whole host of examples with notable results on axis-aligned rectangles, VC dimension $1$ classes, and linear separators. We demonstrate several learnability gaps with a central focus on self-directed learning and",
    "path": "papers/24/02/2402.13400.json",
    "total_tokens": 915,
    "translated_title": "自主学习维度",
    "translated_abstract": "理解自主学习的复杂性是自1990年代初以来吸引在线学习理论社区关注的重要问题。在这个框架内，学习者被允许自适应地选择下一个数据点来进行预测，与对抗性在线学习设置不同。本文研究了二元和多类别设置下的自主学习复杂性，并开发了一个维度，即$SDdim$，精确地刻画了任何概念类别的自主学习错误上界。$SDdim$背后的直觉可以理解为一个称为“标记游戏”的双人游戏。利用这个双人游戏，我们对许多例子进行了$SDdim$的计算，特别是在轴对齐矩形、VC维数为$1$的类别和线性分隔器等方面取得了显着结果。我们展示了几个关于自主学习的学习差距，重点关注自主学习。",
    "tldr": "本论文研究了二元和多类别设置下的自主学习复杂性，提出了一个新的维度$SDdim$来精确刻画任何概念类别的自主学习错误上界，并利用“标记游戏”进行解释，展示了在各种例子中的计算结果和对自主学习的学习差距。",
    "en_tdlr": "This paper investigates the complexity of self-directed learning in both binary and multi-class settings, introduces a new dimension $SDdim$ to accurately characterize the self-directed learning mistake-bound for any concept class, explains it using a \"labelling game\", and demonstrates computation results on various examples along with learning gaps in self-directed learning."
}