{
    "title": "Understanding Oversmoothing in Diffusion-Based GNNs From the Perspective of Operator Semigroup Theory",
    "abstract": "arXiv:2402.15326v1 Announce Type: new  Abstract: This paper presents a novel study of the oversmoothing issue in diffusion-based Graph Neural Networks (GNNs). Diverging from extant approaches grounded in random walk analysis or particle systems, we approach this problem through operator semigroup theory. This theoretical framework allows us to rigorously prove that oversmoothing is intrinsically linked to the ergodicity of the diffusion operator. This finding further poses a general and mild ergodicity-breaking condition, encompassing the various specific solutions previously offered, thereby presenting a more universal and theoretically grounded approach to mitigating oversmoothing in diffusion-based GNNs. Additionally, we offer a probabilistic interpretation of our theory, forging a link with prior works and broadening the theoretical horizon. Our experimental results reveal that this ergodicity-breaking term effectively mitigates oversmoothing measured by Dirichlet energy, and simul",
    "link": "https://arxiv.org/abs/2402.15326",
    "context": "Title: Understanding Oversmoothing in Diffusion-Based GNNs From the Perspective of Operator Semigroup Theory\nAbstract: arXiv:2402.15326v1 Announce Type: new  Abstract: This paper presents a novel study of the oversmoothing issue in diffusion-based Graph Neural Networks (GNNs). Diverging from extant approaches grounded in random walk analysis or particle systems, we approach this problem through operator semigroup theory. This theoretical framework allows us to rigorously prove that oversmoothing is intrinsically linked to the ergodicity of the diffusion operator. This finding further poses a general and mild ergodicity-breaking condition, encompassing the various specific solutions previously offered, thereby presenting a more universal and theoretically grounded approach to mitigating oversmoothing in diffusion-based GNNs. Additionally, we offer a probabilistic interpretation of our theory, forging a link with prior works and broadening the theoretical horizon. Our experimental results reveal that this ergodicity-breaking term effectively mitigates oversmoothing measured by Dirichlet energy, and simul",
    "path": "papers/24/02/2402.15326.json",
    "total_tokens": 949,
    "translated_title": "从算子半群理论的视角理解扩散型GNN中的过度平滑问题",
    "translated_abstract": "本文从算子半群理论的角度对扩散型图神经网络（GNN）中的过度平滑问题进行了全新研究。与基于随机游走分析或粒子系统的现有方法不同，我们通过算子半群理论来解决这一问题。这一理论框架使我们能够严格证明过度平滑与扩散算子的遍历性息息相关。这一发现进一步提出了一个通用且温和的遍历性破坏条件，包括先前提出的各种特定解决方案，从而提出了一个更普遍和理论上基础的方法来减轻扩散型GNN中的过度平滑问题。此外，我们还提出了对我们理论的概率解释，与之前的研究建立了联系，拓宽了理论视野。我们的实验结果表明，这一遍历性破坏项有效地减少了以迪利克雷能量衡量的过度平滑，并达到了模拟",
    "tldr": "本文研究了扩散型GNN中的过度平滑问题，通过算子半群理论严格证明了过度平滑与扩散算子的遍历性密切相关，提出了一个更普遍和理论上基础的减轻过度平滑问题的方法，并提供了概率解释。"
}