{
    "title": "Towards a Digital Twin Framework in Additive Manufacturing: Machine Learning and Bayesian Optimization for Time Series Process Optimization",
    "abstract": "arXiv:2402.17718v1 Announce Type: new  Abstract: Laser-directed-energy deposition (DED) offers advantages in additive manufacturing (AM) for creating intricate geometries and material grading. Yet, challenges like material inconsistency and part variability remain, mainly due to its layer-wise fabrication. A key issue is heat accumulation during DED, which affects the material microstructure and properties. While closed-loop control methods for heat management are common in DED research, few integrate real-time monitoring, physics-based modeling, and control in a unified framework. Our work presents a digital twin (DT) framework for real-time predictive control of DED process parameters to meet specific design objectives. We develop a surrogate model using Long Short-Term Memory (LSTM)-based machine learning with Bayesian Inference to predict temperatures in DED parts. This model predicts future temperature states in real time. We also introduce Bayesian Optimization (BO) for Time Seri",
    "link": "https://arxiv.org/abs/2402.17718",
    "context": "Title: Towards a Digital Twin Framework in Additive Manufacturing: Machine Learning and Bayesian Optimization for Time Series Process Optimization\nAbstract: arXiv:2402.17718v1 Announce Type: new  Abstract: Laser-directed-energy deposition (DED) offers advantages in additive manufacturing (AM) for creating intricate geometries and material grading. Yet, challenges like material inconsistency and part variability remain, mainly due to its layer-wise fabrication. A key issue is heat accumulation during DED, which affects the material microstructure and properties. While closed-loop control methods for heat management are common in DED research, few integrate real-time monitoring, physics-based modeling, and control in a unified framework. Our work presents a digital twin (DT) framework for real-time predictive control of DED process parameters to meet specific design objectives. We develop a surrogate model using Long Short-Term Memory (LSTM)-based machine learning with Bayesian Inference to predict temperatures in DED parts. This model predicts future temperature states in real time. We also introduce Bayesian Optimization (BO) for Time Seri",
    "path": "papers/24/02/2402.17718.json",
    "total_tokens": 831,
    "translated_title": "面向增材制造的数字孪生框架：机器学习和贝叶斯优化用于时间序列过程优化",
    "translated_abstract": "Laser-directed-energy deposition (DED)提供增材制造(AM)中创造复杂几何和材料分级的优势。然而，由于其分层制造，材料的不一致性和零件的可变性等挑战仍然存在。DED过程中热积累是一个关键问题，影响材料的微观结构和性质。我们的工作提出了一个数字孪生(DT)框架，用于实时预测控制DED过程参数，以满足特定的设计目标。我们使用基于长短期记忆(LSTM)的机器学习与贝叶斯推断开发了一个代用模型，可以预测DED零件中的温度。这个模型能够实时预测未来的温度状态。我们还引入了贝叶斯优化(BO)用于时间序列过程。",
    "tldr": "提出了用于增材制造的数字孪生框架，结合机器学习和贝叶斯优化实现实时预测控制，解决DED过程中的热管理问题。",
    "en_tdlr": "Introduced a digital twin framework for additive manufacturing with real-time predictive control using machine learning and Bayesian optimization to address heat management issues in DED process."
}