{
    "title": "Causal Feature Selection for Responsible Machine Learning",
    "abstract": "Machine Learning (ML) has become an integral aspect of many real-world applications. As a result, the need for responsible machine learning has emerged, focusing on aligning ML models to ethical and social values, while enhancing their reliability and trustworthiness. Responsible ML involves many issues. This survey addresses four main issues: interpretability, fairness, adversarial robustness, and domain generalization. Feature selection plays a pivotal role in the responsible ML tasks. However, building upon statistical correlations between variables can lead to spurious patterns with biases and compromised performance. This survey focuses on the current study of causal feature selection: what it is and how it can reinforce the four aspects of responsible ML. By identifying features with causal impacts on outcomes and distinguishing causality from correlation, causal feature selection is posited as a unique approach to ensuring ML models to be ethically and socially responsible in hi",
    "link": "https://arxiv.org/abs/2402.02696",
    "context": "Title: Causal Feature Selection for Responsible Machine Learning\nAbstract: Machine Learning (ML) has become an integral aspect of many real-world applications. As a result, the need for responsible machine learning has emerged, focusing on aligning ML models to ethical and social values, while enhancing their reliability and trustworthiness. Responsible ML involves many issues. This survey addresses four main issues: interpretability, fairness, adversarial robustness, and domain generalization. Feature selection plays a pivotal role in the responsible ML tasks. However, building upon statistical correlations between variables can lead to spurious patterns with biases and compromised performance. This survey focuses on the current study of causal feature selection: what it is and how it can reinforce the four aspects of responsible ML. By identifying features with causal impacts on outcomes and distinguishing causality from correlation, causal feature selection is posited as a unique approach to ensuring ML models to be ethically and socially responsible in hi",
    "path": "papers/24/02/2402.02696.json",
    "total_tokens": 838,
    "translated_title": "对负责任机器学习的因果特征选择的研究",
    "translated_abstract": "机器学习（ML）已成为许多实际应用的重要方面。因此，负责任机器学习的需求已经出现，重点是将ML模型与伦理和社会价值相一致，同时增强其可靠性和可信度。负责任的ML涉及许多问题。本调查涉及四个主要问题：可解释性，公平性，对抗鲁棒性和域泛化。特征选择在负责任的ML任务中起着重要作用。然而，仅基于变量之间的统计相关性构建模型可能会导致带有偏见和性能下降的虚假模式。本调查专注于当前对因果特征选择的研究：什么是因果特征选择以及它如何加强负责任ML的四个方面。通过识别对结果产生因果影响并区分因果和相关性，因果特征选择被认为是确保ML模型在伦理和社会上负责任的独特方法。",
    "tldr": "本调查论文研究了负责任机器学习中的因果特征选择，强调了其对解释性、公平性、对抗鲁棒性和域泛化的作用。"
}