{
    "title": "Corpus-Steered Query Expansion with Large Language Models",
    "abstract": "arXiv:2402.18031v1 Announce Type: cross  Abstract: Recent studies demonstrate that query expansions generated by large language models (LLMs) can considerably enhance information retrieval systems by generating hypothetical documents that answer the queries as expansions. However, challenges arise from misalignments between the expansions and the retrieval corpus, resulting in issues like hallucinations and outdated information due to the limited intrinsic knowledge of LLMs. Inspired by Pseudo Relevance Feedback (PRF), we introduce Corpus-Steered Query Expansion (CSQE) to promote the incorporation of knowledge embedded within the corpus. CSQE utilizes the relevance assessing capability of LLMs to systematically identify pivotal sentences in the initially-retrieved documents. These corpus-originated texts are subsequently used to expand the query together with LLM-knowledge empowered expansions, improving the relevance prediction between the query and the target documents. Extensive exp",
    "link": "https://arxiv.org/abs/2402.18031",
    "context": "Title: Corpus-Steered Query Expansion with Large Language Models\nAbstract: arXiv:2402.18031v1 Announce Type: cross  Abstract: Recent studies demonstrate that query expansions generated by large language models (LLMs) can considerably enhance information retrieval systems by generating hypothetical documents that answer the queries as expansions. However, challenges arise from misalignments between the expansions and the retrieval corpus, resulting in issues like hallucinations and outdated information due to the limited intrinsic knowledge of LLMs. Inspired by Pseudo Relevance Feedback (PRF), we introduce Corpus-Steered Query Expansion (CSQE) to promote the incorporation of knowledge embedded within the corpus. CSQE utilizes the relevance assessing capability of LLMs to systematically identify pivotal sentences in the initially-retrieved documents. These corpus-originated texts are subsequently used to expand the query together with LLM-knowledge empowered expansions, improving the relevance prediction between the query and the target documents. Extensive exp",
    "path": "papers/24/02/2402.18031.json",
    "total_tokens": 813,
    "translated_title": "由大型语言模型引导的语料库查询扩展",
    "translated_abstract": "最近的研究表明，由大型语言模型（LLMs）生成的查询扩展可以通过生成能够回答查询的假设文档而显着增强信息检索系统。然而，由于LLMs的有限内在知识，扩展与检索语料库之间的不对齐导致问题，如幻觉和过时信息。受伪相关反馈（PRF）启发，我们引入了语料库引导的查询扩展（CSQE）来促进嵌入在语料库中的知识的整合。CSQE利用LLMs的相关性评估能力系统地识别最初检索到的文档中的关键句。这些由语料库产生的文本随后与LLM知识增强扩展一起用于扩展查询，改善查询与目标文档之间的相关性预测。广泛的实验证明CSQE明显提高了信息检索结果的质量。",
    "tldr": "通过引入语料库引导的查询扩展（CSQE），结合大型语言模型的知识增强扩展，改善了查询与目标文档之间的相关性预测。",
    "en_tdlr": "By introducing Corpus-Steered Query Expansion (CSQE) that combines corpus-guided expansions with knowledge-enhanced expansions from large language models, the relevance prediction between the query and the target documents is improved."
}