{
    "title": "Structural Knowledge Informed Continual Multivariate Time Series Forecasting",
    "abstract": "arXiv:2402.12722v1 Announce Type: new  Abstract: Recent studies in multivariate time series (MTS) forecasting reveal that explicitly modeling the hidden dependencies among different time series can yield promising forecasting performance and reliable explanations. However, modeling variable dependencies remains underexplored when MTS is continuously accumulated under different regimes (stages). Due to the potential distribution and dependency disparities, the underlying model may encounter the catastrophic forgetting problem, i.e., it is challenging to memorize and infer different types of variable dependencies across different regimes while maintaining forecasting performance. To address this issue, we propose a novel Structural Knowledge Informed Continual Learning (SKI-CL) framework to perform MTS forecasting within a continual learning paradigm, which leverages structural knowledge to steer the forecasting model toward identifying and adapting to different regimes, and selects repr",
    "link": "https://arxiv.org/abs/2402.12722",
    "context": "Title: Structural Knowledge Informed Continual Multivariate Time Series Forecasting\nAbstract: arXiv:2402.12722v1 Announce Type: new  Abstract: Recent studies in multivariate time series (MTS) forecasting reveal that explicitly modeling the hidden dependencies among different time series can yield promising forecasting performance and reliable explanations. However, modeling variable dependencies remains underexplored when MTS is continuously accumulated under different regimes (stages). Due to the potential distribution and dependency disparities, the underlying model may encounter the catastrophic forgetting problem, i.e., it is challenging to memorize and infer different types of variable dependencies across different regimes while maintaining forecasting performance. To address this issue, we propose a novel Structural Knowledge Informed Continual Learning (SKI-CL) framework to perform MTS forecasting within a continual learning paradigm, which leverages structural knowledge to steer the forecasting model toward identifying and adapting to different regimes, and selects repr",
    "path": "papers/24/02/2402.12722.json",
    "total_tokens": 853,
    "translated_title": "结构知识指导的持续多变量时间序列预测",
    "translated_abstract": "近期研究表明，在多变量时间序列（MTS）预测中，明确建模不同时间序列之间的隐藏依赖关系可以产生有前途的预测性能和可靠的解释。然而，当MTS在不同的制度（阶段）下持续积累时，建模变量之间的依赖仍未得到充分探讨。由于潜在的分布和依赖关系差异，基础模型可能会遇到灾难性遗忘问题，即在保持预测性能的同时，记忆和推断不同类型的变量依赖关系是具有挑战性的。为了解决这个问题，我们提出了一种新颖的结构知识指导的持续学习（SKI-CL）框架，以在持续学习范式中执行MTS预测，利用结构知识引导预测模型识别和适应不同制度，并选择repr。",
    "tldr": "提出了一种新颖的结构知识指导的持续学习（SKI-CL）框架，用于在不同制度下持续积累的多变量时间序列（MTS）预测中，可以有效解决变量依赖关系的灾难性遗忘问题。"
}