{
    "title": "Pulmonologists-Level lung cancer detection based on standard blood test results and smoking status using an explainable machine learning approach",
    "abstract": "arXiv:2402.09596v1 Announce Type: new  Abstract: Lung cancer (LC) remains the primary cause of cancer-related mortality, largely due to late-stage diagnoses. Effective strategies for early detection are therefore of paramount importance. In recent years, machine learning (ML) has demonstrated considerable potential in healthcare by facilitating the detection of various diseases. In this retrospective development and validation study, we developed an ML model based on dynamic ensemble selection (DES) for LC detection. The model leverages standard blood sample analysis and smoking history data from a large population at risk in Denmark. The study includes all patients examined on suspicion of LC in the Region of Southern Denmark from 2009 to 2018. We validated and compared the predictions by the DES model with diagnoses provided by five pulmonologists. Among the 38,944 patients, 9,940 had complete data of which 2,505 (25\\%) had LC. The DES model achieved an area under the roc curve of 0.",
    "link": "https://arxiv.org/abs/2402.09596",
    "context": "Title: Pulmonologists-Level lung cancer detection based on standard blood test results and smoking status using an explainable machine learning approach\nAbstract: arXiv:2402.09596v1 Announce Type: new  Abstract: Lung cancer (LC) remains the primary cause of cancer-related mortality, largely due to late-stage diagnoses. Effective strategies for early detection are therefore of paramount importance. In recent years, machine learning (ML) has demonstrated considerable potential in healthcare by facilitating the detection of various diseases. In this retrospective development and validation study, we developed an ML model based on dynamic ensemble selection (DES) for LC detection. The model leverages standard blood sample analysis and smoking history data from a large population at risk in Denmark. The study includes all patients examined on suspicion of LC in the Region of Southern Denmark from 2009 to 2018. We validated and compared the predictions by the DES model with diagnoses provided by five pulmonologists. Among the 38,944 patients, 9,940 had complete data of which 2,505 (25\\%) had LC. The DES model achieved an area under the roc curve of 0.",
    "path": "papers/24/02/2402.09596.json",
    "total_tokens": 1042,
    "translated_title": "基于标准血液检测结果和吸烟状况的可解释机器学习方法用于肺癌的肺病学水平检测",
    "translated_abstract": "肺癌（LC）仍然是癌症相关死亡的主要原因，主要是由于晚期诊断。因此，有效的早期检测策略非常重要。近年来，机器学习（ML）在医疗领域展示了相当大的潜力，可以帮助检测各种疾病。在这个回顾性开发和验证研究中，我们开发了一个基于动态集成选择（DES）的ML模型用于LC检测。该模型利用了来自丹麦患有风险的大量人口的标准血液样本分析和吸烟史数据。该研究包括2009年至2018年在丹麦南部地区疑似LC的所有患者。我们通过DES模型验证和比较了五位肺病专家提供的诊断预测。在38944名患者中，9940名患者有完整数据，其中2505名（25%）患有LC。DES模型的roc曲线下面积达到0.5。",
    "tldr": "本研究开发了一个基于动态集成选择（DES）的机器学习模型，通过利用标准血液样本分析和吸烟史数据进行肺癌的肺病学水平检测，在丹麦南部地区的大量患有风险的人群中进行了验证。模型在肺病专家提供的诊断预测方面取得了良好的效果。（摘要总结）",
    "en_tdlr": "This study developed a machine learning model based on dynamic ensemble selection (DES) for lung cancer detection at a pulmonologist's level, using standard blood sample analysis and smoking history data. The model was validated on a large population at risk in Southern Denmark and achieved good performance compared to diagnoses provided by pulmonologists."
}