{
    "title": "QoS prediction in radio vehicular environments via prior user information",
    "abstract": "arXiv:2402.17689v1 Announce Type: cross  Abstract: Reliable wireless communications play an important role in the automotive industry as it helps to enhance current use cases and enable new ones such as connected autonomous driving, platooning, cooperative maneuvering, teleoperated driving, and smart navigation. These and other use cases often rely on specific quality of service (QoS) levels for communication. Recently, the area of predictive quality of service (QoS) has received a great deal of attention as a key enabler to forecast communication quality well enough in advance. However, predicting QoS in a reliable manner is a notoriously difficult task. In this paper, we evaluate ML tree-ensemble methods to predict QoS in the range of minutes with data collected from a cellular test network. We discuss radio environment characteristics and we showcase how these can be used to improve ML performance and further support the uptake of ML in commercial networks. Specifically, we use the ",
    "link": "https://arxiv.org/abs/2402.17689",
    "context": "Title: QoS prediction in radio vehicular environments via prior user information\nAbstract: arXiv:2402.17689v1 Announce Type: cross  Abstract: Reliable wireless communications play an important role in the automotive industry as it helps to enhance current use cases and enable new ones such as connected autonomous driving, platooning, cooperative maneuvering, teleoperated driving, and smart navigation. These and other use cases often rely on specific quality of service (QoS) levels for communication. Recently, the area of predictive quality of service (QoS) has received a great deal of attention as a key enabler to forecast communication quality well enough in advance. However, predicting QoS in a reliable manner is a notoriously difficult task. In this paper, we evaluate ML tree-ensemble methods to predict QoS in the range of minutes with data collected from a cellular test network. We discuss radio environment characteristics and we showcase how these can be used to improve ML performance and further support the uptake of ML in commercial networks. Specifically, we use the ",
    "path": "papers/24/02/2402.17689.json",
    "total_tokens": 844,
    "translated_title": "通过先验用户信息在无线车载环境中预测QoS",
    "translated_abstract": "可靠的无线通信在汽车行业中扮演着重要角色，它有助于增强当前用例并实现新的用例，如连接的自动驾驶、编队行驶、合作操纵、远程驾驶和智能导航。这些以及其他用例通常依赖于特定的通信服务质量（QoS）水平。最近，预测性服务质量（QoS）领域受到了极大关注，因为它可以提前足够准确地预测通信质量。然而，在可靠地预测QoS方面是一项非常困难的任务。在本文中，我们评估使用从蜂窝测试网络收集的数据来预测QoS的ML树集成方法，范围为几分钟。我们讨论了无线环境特征，并展示了如何利用这些特征来提高ML性能，并进一步支持ML在商业网络中的应用。具体来说，我们使用了",
    "tldr": "本文评估了使用先前提取的用户信息对车载无线环境中的QoS进行预测的方法，展示了如何利用ML树集成方法来提高预测性能。",
    "en_tdlr": "This paper evaluates the use of prior user information to predict QoS in vehicular wireless environments, demonstrating how ML tree-ensemble methods can improve predictive performance."
}