{
    "title": "Statistical curriculum learning: An elimination algorithm achieving an oracle risk",
    "abstract": "arXiv:2402.13366v1 Announce Type: new  Abstract: We consider a statistical version of curriculum learning (CL) in a parametric prediction setting. The learner is required to estimate a target parameter vector, and can adaptively collect samples from either the target model, or other source models that are similar to the target model, but less noisy. We consider three types of learners, depending on the level of side-information they receive. The first two, referred to as strong/weak-oracle learners, receive high/low degrees of information about the models, and use these to learn. The third, a fully adaptive learner, estimates the target parameter vector without any prior information. In the single source case, we propose an elimination learning method, whose risk matches that of a strong-oracle learner. In the multiple source case, we advocate that the risk of the weak-oracle learner is a realistic benchmark for the risk of adaptive learners. We develop an adaptive multiple elimination",
    "link": "https://arxiv.org/abs/2402.13366",
    "context": "Title: Statistical curriculum learning: An elimination algorithm achieving an oracle risk\nAbstract: arXiv:2402.13366v1 Announce Type: new  Abstract: We consider a statistical version of curriculum learning (CL) in a parametric prediction setting. The learner is required to estimate a target parameter vector, and can adaptively collect samples from either the target model, or other source models that are similar to the target model, but less noisy. We consider three types of learners, depending on the level of side-information they receive. The first two, referred to as strong/weak-oracle learners, receive high/low degrees of information about the models, and use these to learn. The third, a fully adaptive learner, estimates the target parameter vector without any prior information. In the single source case, we propose an elimination learning method, whose risk matches that of a strong-oracle learner. In the multiple source case, we advocate that the risk of the weak-oracle learner is a realistic benchmark for the risk of adaptive learners. We develop an adaptive multiple elimination",
    "path": "papers/24/02/2402.13366.json",
    "total_tokens": 787,
    "translated_title": "统计课程学习：实现Oracle风险的淘汰算法",
    "translated_abstract": "我们考虑一个参数预测设置下的统计版本课程学习（CL）。学习者需要估计目标参数向量，并可以自适应地从目标模型或其他类似于目标模型但噪声较小的源模型中收集样本。根据他们接收的辅助信息水平，我们考虑三种类型的学习者。在单一来源情况下，我们提出了一个淘汰学习方法，其风险与强-Oracle学习者的风险相匹配。在多源情况下，我们主张弱-Oracle学习者的风险是自适应学习者风险的一个现实基准。我们发展了一种自适应多重淘汰方法。",
    "tldr": "提出了一种淘汰学习方法，其风险与强Oracle学习者相匹配，并将弱Oracle学习者的风险作为自适应学习者风险的一个实际基准。",
    "en_tdlr": "Introduced an elimination learning method whose risk matches that of a strong-oracle learner and advocated for the risk of weak-oracle learner as a realistic benchmark for adaptive learners."
}