{
    "title": "Research on Older Adults' Interaction with E-Health Interface Based on Explainable Artificial Intelligence",
    "abstract": "This paper proposed a comprehensive mixed-methods framework with varied samples of older adults, including user experience, usability assessments, and in-depth interviews with the integration of Explainable Artificial Intelligence (XAI) methods. The experience of older adults' interaction with the Ehealth interface is collected through interviews and transformed into operatable databases whereas XAI methods are utilized to explain the collected interview results in this research work. The results show that XAI-infused e-health interfaces could play an important role in bridging the age-related digital divide by investigating elders' preferences when interacting with E-health interfaces. Furthermore, the study identifies important design factors, such as intuitive visualization and straightforward explanations, that are critical for creating efficient Human Computer Interaction (HCI) tools among older users. Furthermore, this study emphasizes the revolutionary potential of XAI in e-heal",
    "link": "https://arxiv.org/abs/2402.07915",
    "context": "Title: Research on Older Adults' Interaction with E-Health Interface Based on Explainable Artificial Intelligence\nAbstract: This paper proposed a comprehensive mixed-methods framework with varied samples of older adults, including user experience, usability assessments, and in-depth interviews with the integration of Explainable Artificial Intelligence (XAI) methods. The experience of older adults' interaction with the Ehealth interface is collected through interviews and transformed into operatable databases whereas XAI methods are utilized to explain the collected interview results in this research work. The results show that XAI-infused e-health interfaces could play an important role in bridging the age-related digital divide by investigating elders' preferences when interacting with E-health interfaces. Furthermore, the study identifies important design factors, such as intuitive visualization and straightforward explanations, that are critical for creating efficient Human Computer Interaction (HCI) tools among older users. Furthermore, this study emphasizes the revolutionary potential of XAI in e-heal",
    "path": "papers/24/02/2402.07915.json",
    "total_tokens": 881,
    "translated_title": "基于可解释人工智能的老年人电子健康界面交互研究",
    "translated_abstract": "本文提出了一种综合的混合方法框架，通过各种样本的老年人的用户体验、可用性评估和深入访谈，结合可解释人工智能（XAI）方法。通过访谈收集老年人与电子健康界面的交互经验，并将其转化为可操作的数据库，然后利用XAI方法解释这些收集到的访谈结果。研究结果表明，注入XAI的电子健康界面能够在调查老年人与电子健康界面交互时，扮演重要的角色，促进年龄相关的数字鸿沟的消除。此外，研究还确定了重要的设计因素，如直观的可视化和简明扼要的解释，这些因素对于创建老年用户之间有效的人机交互工具至关重要。此外，本研究强调了XAI 在电子健康领域的革命潜力。",
    "tldr": "本研究基于可解释人工智能，探讨了老年人与电子健康界面的交互。结果显示，注入可解释人工智能的电子健康界面在消除年龄相关的数字鸿沟方面起到关键作用，并提出了直观可视化和简明解释等设计因素对于老年用户的重要性。本研究强调了XAI在电子健康领域的革命潜力。"
}