{
    "title": "Does Twinning Vehicular Networks Enhance Their Performance in Dense Areas?",
    "abstract": "arXiv:2402.10701v1 Announce Type: cross  Abstract: This paper investigates the potential of Digital Twins (DTs) to enhance network performance in densely populated urban areas, specifically focusing on vehicular networks. The study comprises two phases. In Phase I, we utilize traffic data and AI clustering to identify critical locations, particularly in crowded urban areas with high accident rates. In Phase II, we evaluate the advantages of twinning vehicular networks through three deployment scenarios: edge-based twin, cloud-based twin, and hybrid-based twin. Our analysis demonstrates that twinning significantly reduces network delays, with virtual twins outperforming physical networks. Virtual twins maintain low delays even with increased vehicle density, such as 15.05 seconds for 300 vehicles. Moreover, they exhibit faster computational speeds, with cloud-based twins being 1.7 times faster than edge twins in certain scenarios. These findings provide insights for efficient vehicular ",
    "link": "https://arxiv.org/abs/2402.10701",
    "context": "Title: Does Twinning Vehicular Networks Enhance Their Performance in Dense Areas?\nAbstract: arXiv:2402.10701v1 Announce Type: cross  Abstract: This paper investigates the potential of Digital Twins (DTs) to enhance network performance in densely populated urban areas, specifically focusing on vehicular networks. The study comprises two phases. In Phase I, we utilize traffic data and AI clustering to identify critical locations, particularly in crowded urban areas with high accident rates. In Phase II, we evaluate the advantages of twinning vehicular networks through three deployment scenarios: edge-based twin, cloud-based twin, and hybrid-based twin. Our analysis demonstrates that twinning significantly reduces network delays, with virtual twins outperforming physical networks. Virtual twins maintain low delays even with increased vehicle density, such as 15.05 seconds for 300 vehicles. Moreover, they exhibit faster computational speeds, with cloud-based twins being 1.7 times faster than edge twins in certain scenarios. These findings provide insights for efficient vehicular ",
    "path": "papers/24/02/2402.10701.json",
    "total_tokens": 880,
    "translated_title": "双生车联网络在密集区域中是否提升了它们的性能？",
    "translated_abstract": "本文研究数字双生体（DTs）对于提高在人口密集的城市地区中网络性能的潜力，特别关注车联网络。研究包括两个阶段。在第一阶段，我们利用交通数据和AI聚类来识别关键位置，特别是在高事故率的拥挤城区。在第二阶段，我们通过三种部署场景评估了双生车联网络的优势：基于边缘的双生体，基于云的双生体和混合双生体。我们的分析表明，双生显著减少网络延迟，虚拟双生胜过物理网络。虚拟双生即使在增加车辆密度的情况下也保持低延迟，例如在300辆车的情况下为15.05秒。此外，它们表现出更快的计算速度，在某些情况下，基于云的双生比基于边缘的双生快1.7倍。这些发现为效率车联网络提供了见解。",
    "tldr": "研究揭示了双生车联网络在密集区域中通过虚拟双生显著降低网络延迟、保持低延迟和提高计算速度的优势。",
    "en_tdlr": "The study reveals the advantages of twinning vehicular networks in dense areas, with virtual twins significantly reducing network delays, maintaining low delays, and improving computational speeds."
}