{
    "title": "PARCv2: Physics-aware Recurrent Convolutional Neural Networks for Spatiotemporal Dynamics Modeling",
    "abstract": "arXiv:2402.12503v1 Announce Type: new  Abstract: Modeling unsteady, fast transient, and advection-dominated physics problems is a pressing challenge for physics-aware deep learning (PADL). The physics of complex systems is governed by large systems of partial differential equations (PDEs) and ancillary constitutive models with nonlinear structures, as well as evolving state fields exhibiting sharp gradients and rapidly deforming material interfaces. Here, we investigate an inductive bias approach that is versatile and generalizable to model generic nonlinear field evolution problems. Our study focuses on the recent physics-aware recurrent convolutions (PARC), which incorporates a differentiator-integrator architecture that inductively models the spatiotemporal dynamics of generic physical systems. We extend the capabilities of PARC to simulate unsteady, transient, and advection-dominant systems. The extended model, referred to as PARCv2, is equipped with differential operators to model",
    "link": "https://arxiv.org/abs/2402.12503",
    "context": "Title: PARCv2: Physics-aware Recurrent Convolutional Neural Networks for Spatiotemporal Dynamics Modeling\nAbstract: arXiv:2402.12503v1 Announce Type: new  Abstract: Modeling unsteady, fast transient, and advection-dominated physics problems is a pressing challenge for physics-aware deep learning (PADL). The physics of complex systems is governed by large systems of partial differential equations (PDEs) and ancillary constitutive models with nonlinear structures, as well as evolving state fields exhibiting sharp gradients and rapidly deforming material interfaces. Here, we investigate an inductive bias approach that is versatile and generalizable to model generic nonlinear field evolution problems. Our study focuses on the recent physics-aware recurrent convolutions (PARC), which incorporates a differentiator-integrator architecture that inductively models the spatiotemporal dynamics of generic physical systems. We extend the capabilities of PARC to simulate unsteady, transient, and advection-dominant systems. The extended model, referred to as PARCv2, is equipped with differential operators to model",
    "path": "papers/24/02/2402.12503.json",
    "total_tokens": 890,
    "translated_title": "PARCv2：物理感知循环卷积神经网络用于时空动力学建模",
    "translated_abstract": "arXiv:2402.12503v1 公告类型：新摘要：对不稳定的、快速瞬态和优势传输主导的物理问题进行建模是物理感知深度学习（PADL）面临的迫切挑战。复杂系统的物理由大型偏微分方程（PDEs）系统和带有非线性结构的辅助本构模型所控制，同时还包括表现出急剧梯度和快速变形材料界面的演化状态场。在这里，我们研究了一种多功能且通用的归纳偏见方法，用于模拟通用的非线性场演变问题。我们的研究聚焦于最近的物理感知循环卷积（PARC），它结合了一种区分-积分器结构，归纳地模拟了通用物理系统的时空动力学。我们扩展了PARC的功能，以模拟不稳定、瞬态和传输主导系统。这个扩展模型被称为PARCv2，配备了微分算子来建模",
    "tldr": "PARCv2通过引入微分算子扩展了PARC模型，用于模拟不稳定、瞬态和传输主导系统的时空动力学。",
    "en_tdlr": "PARCv2 extends the PARC model by introducing differential operators for simulating the spatiotemporal dynamics of unsteady, transient, and advection-dominant systems."
}