{
    "title": "Deep Rib Fracture Instance Segmentation and Classification from CT on the RibFrac Challenge",
    "abstract": "arXiv:2402.09372v1 Announce Type: cross Abstract: Rib fractures are a common and potentially severe injury that can be challenging and labor-intensive to detect in CT scans. While there have been efforts to address this field, the lack of large-scale annotated datasets and evaluation benchmarks has hindered the development and validation of deep learning algorithms. To address this issue, the RibFrac Challenge was introduced, providing a benchmark dataset of over 5,000 rib fractures from 660 CT scans, with voxel-level instance mask annotations and diagnosis labels for four clinical categories (buckle, nondisplaced, displaced, or segmental). The challenge includes two tracks: a detection (instance segmentation) track evaluated by an FROC-style metric and a classification track evaluated by an F1-style metric. During the MICCAI 2020 challenge period, 243 results were evaluated, and seven teams were invited to participate in the challenge summary. The analysis revealed that several top ri",
    "link": "https://arxiv.org/abs/2402.09372",
    "context": "Title: Deep Rib Fracture Instance Segmentation and Classification from CT on the RibFrac Challenge\nAbstract: arXiv:2402.09372v1 Announce Type: cross Abstract: Rib fractures are a common and potentially severe injury that can be challenging and labor-intensive to detect in CT scans. While there have been efforts to address this field, the lack of large-scale annotated datasets and evaluation benchmarks has hindered the development and validation of deep learning algorithms. To address this issue, the RibFrac Challenge was introduced, providing a benchmark dataset of over 5,000 rib fractures from 660 CT scans, with voxel-level instance mask annotations and diagnosis labels for four clinical categories (buckle, nondisplaced, displaced, or segmental). The challenge includes two tracks: a detection (instance segmentation) track evaluated by an FROC-style metric and a classification track evaluated by an F1-style metric. During the MICCAI 2020 challenge period, 243 results were evaluated, and seven teams were invited to participate in the challenge summary. The analysis revealed that several top ri",
    "path": "papers/24/02/2402.09372.json",
    "total_tokens": 1139,
    "translated_title": "从CT图像中进行深度肋骨骨折实例分割和分类：基于RibFrac挑战赛",
    "translated_abstract": "肋骨骨折是一种常见且可能严重的损伤，检测肋骨骨折在CT扫描中可能具有挑战性且耗时。虽然已经有一些努力来解决这个领域的问题，但缺少大规模标注的数据集和评估基准妨碍了深度学习算法的发展和验证。为了解决这个问题，引入了RibFrac挑战赛，提供了一个包含超过5,000个肋骨骨折实例和660个CT扫描的基准数据集，包括每个实例的体素级别实例掩码标注以及针对四个临床类别（锁闭骨折、非移位骨折、移位骨折或分段骨折）的诊断标签。该挑战包括两个任务：一个是检测（实例分割）任务，评估指标为FROC风格，另一个是分类任务，评估指标为F1风格。在MICCAI 2020挑战期间，对243个结果进行了评估，并邀请了七个团队参加挑战总结。分析结果表明，几个顶尖团队的方法在肋骨骨折实例分割和分类任务上取得了显著的性能提升。",
    "tldr": "该论文介绍了基于RibFrac挑战赛的深度学习算法，可以从CT扫描中实现肋骨骨折的实例分割和分类。研究通过提供一个包含大量标注数据和评估指标的基准数据集，解决了肋骨骨折检测领域缺乏数据和评估的问题。MICCAI 2020挑战赛期间，七个团队的方法在实例分割和分类任务中表现出色。"
}