{
    "title": "PeriodGrad: Towards Pitch-Controllable Neural Vocoder Based on a Diffusion Probabilistic Model",
    "abstract": "arXiv:2402.14692v1 Announce Type: cross  Abstract: This paper presents a neural vocoder based on a denoising diffusion probabilistic model (DDPM) incorporating explicit periodic signals as auxiliary conditioning signals. Recently, DDPM-based neural vocoders have gained prominence as non-autoregressive models that can generate high-quality waveforms. The neural vocoders based on DDPM have the advantage of training with a simple time-domain loss. In practical applications, such as singing voice synthesis, there is a demand for neural vocoders to generate high-fidelity speech waveforms with flexible pitch control. However, conventional DDPM-based neural vocoders struggle to generate speech waveforms under such conditions. Our proposed model aims to accurately capture the periodic structure of speech waveforms by incorporating explicit periodic signals. Experimental results show that our model improves sound quality and provides better pitch control than conventional DDPM-based neural voco",
    "link": "https://arxiv.org/abs/2402.14692",
    "context": "Title: PeriodGrad: Towards Pitch-Controllable Neural Vocoder Based on a Diffusion Probabilistic Model\nAbstract: arXiv:2402.14692v1 Announce Type: cross  Abstract: This paper presents a neural vocoder based on a denoising diffusion probabilistic model (DDPM) incorporating explicit periodic signals as auxiliary conditioning signals. Recently, DDPM-based neural vocoders have gained prominence as non-autoregressive models that can generate high-quality waveforms. The neural vocoders based on DDPM have the advantage of training with a simple time-domain loss. In practical applications, such as singing voice synthesis, there is a demand for neural vocoders to generate high-fidelity speech waveforms with flexible pitch control. However, conventional DDPM-based neural vocoders struggle to generate speech waveforms under such conditions. Our proposed model aims to accurately capture the periodic structure of speech waveforms by incorporating explicit periodic signals. Experimental results show that our model improves sound quality and provides better pitch control than conventional DDPM-based neural voco",
    "path": "papers/24/02/2402.14692.json",
    "total_tokens": 845,
    "translated_title": "PeriodGrad: 基于扩散概率模型的可控音高神经声码器",
    "translated_abstract": "本文提出了一种基于去噪扩散概率模型（DDPM）的神经声码器，加入了明确的周期信号作为辅助调节信号。最近，基于DDPM的神经声码器作为非自回归模型而备受关注，可以生成高质量的波形。基于DDPM的神经声码器具有使用简单时间域损失进行训练的优势。在实际应用中，如歌声合成，需要神经声码器生成具有灵活音高控制的高保真度语音波形。然而，传统的基于DDPM的神经声码器在这种情况下很难生成语音波形。我们提出的模型旨在通过加入明确的周期信号准确捕捉语音波形的周期结构。实验结果表明，我们的模型改善了声音质量，并提供比传统基于DDPM的神经声码器更好的音高控制。",
    "tldr": "本文提出了一种基于扩散概率模型的神经声码器，通过加入明确的周期信号，提高了声音质量并提供了更好的音高控制。",
    "en_tdlr": "This paper presents a neural vocoder based on a diffusion probabilistic model (DDPM) incorporating explicit periodic signals, which improves sound quality and provides better pitch control."
}