{
    "title": "TaxDiff: Taxonomic-Guided Diffusion Model for Protein Sequence Generation",
    "abstract": "arXiv:2402.17156v1 Announce Type: cross  Abstract: Designing protein sequences with specific biological functions and structural stability is crucial in biology and chemistry. Generative models already demonstrated their capabilities for reliable protein design. However, previous models are limited to the unconditional generation of protein sequences and lack the controllable generation ability that is vital to biological tasks. In this work, we propose TaxDiff, a taxonomic-guided diffusion model for controllable protein sequence generation that combines biological species information with the generative capabilities of diffusion models to generate structurally stable proteins within the sequence space. Specifically, taxonomic control information is inserted into each layer of the transformer block to achieve fine-grained control. The combination of global and local attention ensures the sequence consistency and structural foldability of taxonomic-specific proteins. Extensive experimen",
    "link": "https://arxiv.org/abs/2402.17156",
    "context": "Title: TaxDiff: Taxonomic-Guided Diffusion Model for Protein Sequence Generation\nAbstract: arXiv:2402.17156v1 Announce Type: cross  Abstract: Designing protein sequences with specific biological functions and structural stability is crucial in biology and chemistry. Generative models already demonstrated their capabilities for reliable protein design. However, previous models are limited to the unconditional generation of protein sequences and lack the controllable generation ability that is vital to biological tasks. In this work, we propose TaxDiff, a taxonomic-guided diffusion model for controllable protein sequence generation that combines biological species information with the generative capabilities of diffusion models to generate structurally stable proteins within the sequence space. Specifically, taxonomic control information is inserted into each layer of the transformer block to achieve fine-grained control. The combination of global and local attention ensures the sequence consistency and structural foldability of taxonomic-specific proteins. Extensive experimen",
    "path": "papers/24/02/2402.17156.json",
    "total_tokens": 825,
    "translated_title": "TaxDiff：用于蛋白质序列生成的分类引导扩散模型",
    "translated_abstract": "设计具有特定生物功能和结构稳定性的蛋白质序列在生物学和化学中至关重要。生成模型已经展示了它们在可靠蛋白质设计方面的能力。然而，先前的模型仅限于无条件生成蛋白质序列，缺乏对生物任务至关重要的可控生成能力。在这项工作中，我们提出了TaxDiff，一种用于可控蛋白质序列生成的分类引导扩散模型，它将生物物种信息与扩散模型的生成能力相结合，以在序列空间内生成结构稳定的蛋白质。具体地，分类控制信息被插入到变压器块的每一层，以实现细粒度控制。全局和局部关注的结合确保了分类特定蛋白质的序列一致性和结构可折叠性。广泛的实验...",
    "tldr": "提出了一种名为TaxDiff的分类引导扩散模型，结合了生物物种信息和扩散模型的生成能力，用于可控生成结构稳定的蛋白质序列。"
}