{
    "title": "Le Nozze di Giustizia. Interactions between Artificial Intelligence, Law, Logic, Language and Computation with some case studies in Traffic Regulations and Health Care",
    "abstract": "An important aim of this paper is to convey some basics of mathematical logic to the legal community working with Artificial Intelligence. After analysing what AI is, we decide to delimit ourselves to rule-based AI leaving Neural Networks and Machine Learning aside. Rule based AI allows for Formal methods which are described in a rudimentary form. We will then see how mathematical logic interacts with legal rule-based AI practice. We shall see how mathematical logic imposes limitations and complications to AI applications. We classify the limitations and interactions between mathematical logic and legal AI in three categories: logical, computational and mathematical. The examples to showcase the interactions will largely come from European traffic regulations. The paper closes off with some reflections on how and where AI could be used and on basic mechanisms that shape society.",
    "link": "https://arxiv.org/abs/2402.06487",
    "context": "Title: Le Nozze di Giustizia. Interactions between Artificial Intelligence, Law, Logic, Language and Computation with some case studies in Traffic Regulations and Health Care\nAbstract: An important aim of this paper is to convey some basics of mathematical logic to the legal community working with Artificial Intelligence. After analysing what AI is, we decide to delimit ourselves to rule-based AI leaving Neural Networks and Machine Learning aside. Rule based AI allows for Formal methods which are described in a rudimentary form. We will then see how mathematical logic interacts with legal rule-based AI practice. We shall see how mathematical logic imposes limitations and complications to AI applications. We classify the limitations and interactions between mathematical logic and legal AI in three categories: logical, computational and mathematical. The examples to showcase the interactions will largely come from European traffic regulations. The paper closes off with some reflections on how and where AI could be used and on basic mechanisms that shape society.",
    "path": "papers/24/02/2402.06487.json",
    "total_tokens": 851,
    "translated_title": "《婚姻与正义》：人工智能、法律、逻辑、语言和计算之间的相互作用及其在交通法规和医疗保健方面的案例研究",
    "translated_abstract": "本文的一个重要目标是将一些基本的数学逻辑知识传达给与人工智能合作的法律界人士。在分析了人工智能的基本概念后，我们决定仅限于基于规则的人工智能，不涉及神经网络和机器学习。基于规则的人工智能可以使用形式方法，我们将以简单的形式描述这些方法。然后，我们将看到数学逻辑如何与法律中基于规则的人工智能实践相互作用。我们将讨论数学逻辑对人工智能应用的限制和复杂性。我们将把数学逻辑与法律人工智能之间的限制和相互作用分为三个类别：逻辑、计算和数学。展示相互作用的示例主要来自欧洲交通法规。本文最后还会对人工智能的使用场景和对塑造社会的基本机制进行一些思考。",
    "tldr": "本文旨在向法律界人士介绍数学逻辑与人工智能的基本原理及其在交通法规和医疗保健中的应用。同时探讨数学逻辑对人工智能应用的限制和影响。"
}