{
    "title": "Time-Series Classification for Dynamic Strategies in Multi-Step Forecasting",
    "abstract": "Multi-step forecasting (MSF) in time-series, the ability to make predictions multiple time steps into the future, is fundamental to almost all temporal domains. To make such forecasts, one must assume the recursive complexity of the temporal dynamics. Such assumptions are referred to as the forecasting strategy used to train a predictive model. Previous work shows that it is not clear which forecasting strategy is optimal a priori to evaluating on unseen data. Furthermore, current approaches to MSF use a single (fixed) forecasting strategy.   In this paper, we characterise the instance-level variance of optimal forecasting strategies and propose Dynamic Strategies (DyStrat) for MSF. We experiment using 10 datasets from different scales, domains, and lengths of multi-step horizons. When using a random-forest-based classifier, DyStrat outperforms the best fixed strategy, which is not knowable a priori, 94% of the time, with an average reduction in mean-squared error of 11%. Our approach ",
    "link": "https://arxiv.org/abs/2402.08373",
    "context": "Title: Time-Series Classification for Dynamic Strategies in Multi-Step Forecasting\nAbstract: Multi-step forecasting (MSF) in time-series, the ability to make predictions multiple time steps into the future, is fundamental to almost all temporal domains. To make such forecasts, one must assume the recursive complexity of the temporal dynamics. Such assumptions are referred to as the forecasting strategy used to train a predictive model. Previous work shows that it is not clear which forecasting strategy is optimal a priori to evaluating on unseen data. Furthermore, current approaches to MSF use a single (fixed) forecasting strategy.   In this paper, we characterise the instance-level variance of optimal forecasting strategies and propose Dynamic Strategies (DyStrat) for MSF. We experiment using 10 datasets from different scales, domains, and lengths of multi-step horizons. When using a random-forest-based classifier, DyStrat outperforms the best fixed strategy, which is not knowable a priori, 94% of the time, with an average reduction in mean-squared error of 11%. Our approach ",
    "path": "papers/24/02/2402.08373.json",
    "total_tokens": 849,
    "translated_title": "动态策略下多步预测的时间序列分类",
    "translated_abstract": "时间序列中的多步预测（MSF）是几乎所有时间领域的基础，能够预测多个未来时间步骤的能力。为了进行这种预测，必须假设时间动态的递归复杂性，这种假设被称为训练预测模型所使用的预测策略。之前的研究表明，在评估未见数据之前，不清楚哪种预测策略是最优的。此外，目前的多步预测方法使用单个（固定）的预测策略。在本文中，我们对最优预测策略的实例级别变化进行了描述，并提出了用于MSF的动态策略（DyStrat）。我们在来自不同规模、领域和多步预测长度的10个数据集上进行了实验。使用基于随机森林的分类器时，DyStrat在94%的时间内优于最佳固定策略，平均均方误差降低了11%。",
    "tldr": "本文提出了动态策略（DyStrat）用于多步预测，并在实验中证明了其在多个时间序列数据集上的优越性能。",
    "en_tdlr": "This paper proposes Dynamic Strategies (DyStrat) for multi-step forecasting and demonstrates its superior performance on multiple time series datasets."
}