{
    "title": "A Lightweight Inception Boosted U-Net Neural Network for Routability Prediction",
    "abstract": "arXiv:2402.10937v1 Announce Type: cross  Abstract: As the modern CPU, GPU, and NPU chip design complexity and transistor counts keep increasing, and with the relentless shrinking of semiconductor technology nodes to nearly 1 nanometer, the placement and routing have gradually become the two most pivotal processes in modern very-large-scale-integrated (VLSI) circuit back-end design. How to evaluate routability efficiently and accurately in advance (at the placement and global routing stages) has grown into a crucial research area in the field of artificial intelligence (AI) assisted electronic design automation (EDA). In this paper, we propose a novel U-Net variant model boosted by an Inception embedded module to predict Routing Congestion (RC) and Design Rule Checking (DRC) hotspots. Experimental results on the recently published CircuitNet dataset benchmark show that our proposed method achieves up to 5% (RC) and 20% (DRC) rate reduction in terms of Avg-NRMSE (Average Normalized Root ",
    "link": "https://arxiv.org/abs/2402.10937",
    "context": "Title: A Lightweight Inception Boosted U-Net Neural Network for Routability Prediction\nAbstract: arXiv:2402.10937v1 Announce Type: cross  Abstract: As the modern CPU, GPU, and NPU chip design complexity and transistor counts keep increasing, and with the relentless shrinking of semiconductor technology nodes to nearly 1 nanometer, the placement and routing have gradually become the two most pivotal processes in modern very-large-scale-integrated (VLSI) circuit back-end design. How to evaluate routability efficiently and accurately in advance (at the placement and global routing stages) has grown into a crucial research area in the field of artificial intelligence (AI) assisted electronic design automation (EDA). In this paper, we propose a novel U-Net variant model boosted by an Inception embedded module to predict Routing Congestion (RC) and Design Rule Checking (DRC) hotspots. Experimental results on the recently published CircuitNet dataset benchmark show that our proposed method achieves up to 5% (RC) and 20% (DRC) rate reduction in terms of Avg-NRMSE (Average Normalized Root ",
    "path": "papers/24/02/2402.10937.json",
    "total_tokens": 875,
    "translated_title": "一种轻量级Inception增强U-Net神经网络用于布线可预测性",
    "translated_abstract": "随着现代CPU、GPU和NPU芯片设计复杂性和晶体管数量的不断增加，以及半导体技术节点不断缩小至近1纳米，布局和布线逐渐成为现代超大规模集成（VLSI）电路后端设计中最关键的两个过程。如何有效准确地在先期评估可路由性（在布局和全局布线阶段）已成为人工智能辅助电子设计自动化（EDA）领域的关键研究领域。本文提出了一种新颖的U-Net变体模型，通过嵌入Inception模块来预测路由拥塞（RC）和设计规则检查（DRC）热点。最近发布的CircuitNet数据集基准上的实验结果表明，我们提出的方法在Avg-NRMSE（平均归一化根均方误差）方面实现了高达5%（RC）和20%（DRC）的降低率。",
    "tldr": "提出了一种轻量级Inception增强的U-Net神经网络模型，用于预测布线拥塞和设计规则检查热点，在实验中取得了显著的性能改进。",
    "en_tdlr": "Introduced a lightweight Inception boosted U-Net neural network model for predicting routing congestion and design rule checking hotspots, which achieved significant performance improvement in experiments."
}