{
    "title": "Modified K-means with Cluster Assignment -- Application to COVID-19 Data",
    "abstract": "Text extraction is a highly subjective problem which depends on the dataset that one is working on and the kind of summarization details that needs to be extracted out. All the steps ranging from preprocessing of the data, to the choice of an optimal model for predictions, depends on the problem and the corpus at hand. In this paper, we describe a text extraction model where the aim is to extract word specified information relating to the semantics such that we can get all related and meaningful information about that word in a succinct format. This model can obtain meaningful results and can augment ubiquitous search model or a normal clustering or topic modelling algorithms. By utilizing new technique called two cluster assignment technique with K-means model, we improved the ontology of the retrieved text. We further apply the vector average damping technique for flexible movement of clusters. Our experimental results on a recent corpus of Covid-19 shows that we obtain good results ",
    "link": "https://arxiv.org/abs/2402.03380",
    "context": "Title: Modified K-means with Cluster Assignment -- Application to COVID-19 Data\nAbstract: Text extraction is a highly subjective problem which depends on the dataset that one is working on and the kind of summarization details that needs to be extracted out. All the steps ranging from preprocessing of the data, to the choice of an optimal model for predictions, depends on the problem and the corpus at hand. In this paper, we describe a text extraction model where the aim is to extract word specified information relating to the semantics such that we can get all related and meaningful information about that word in a succinct format. This model can obtain meaningful results and can augment ubiquitous search model or a normal clustering or topic modelling algorithms. By utilizing new technique called two cluster assignment technique with K-means model, we improved the ontology of the retrieved text. We further apply the vector average damping technique for flexible movement of clusters. Our experimental results on a recent corpus of Covid-19 shows that we obtain good results ",
    "path": "papers/24/02/2402.03380.json",
    "total_tokens": 819,
    "translated_title": "修改的K-means聚类算法 - COVID-19数据应用",
    "translated_abstract": "文本提取是一个高度主观的问题，取决于正在处理的数据集和需要提取出的摘要细节的种类。从数据的预处理到选择最优模型进行预测的所有步骤都取决于问题和手头的语料库。在本文中，我们描述了一个文本提取模型，其目标是提取与语义相关的指定单词信息，从而以简洁的格式获取所有相关和有意义的信息。该模型可以获得有意义的结果，并可以增强普遍搜索模型或常规聚类或主题建模算法。通过利用称为两个聚类分配技术的新技术与K-means模型，我们改善了提取文本的本体论。我们进一步应用矢量平均阻尼技术以灵活移动聚类。我们在最近的Covid-19语料库上的实验结果表明，我们获得了良好的结果。",
    "tldr": "本论文描述了一个改进的K-means聚类算法，应用于COVID-19数据。通过利用两个聚类分配技术与K-means模型，提取文本的本体论被改善，进一步应用矢量平均阻尼技术以灵活移动聚类。实验结果表明，该算法在COVID-19数据上获得了良好的结果。"
}