{
    "title": "Game of Trojans: Adaptive Adversaries Against Output-based Trojaned-Model Detectors",
    "abstract": "arXiv:2402.08695v1 Announce Type: cross Abstract: We propose and analyze an adaptive adversary that can retrain a Trojaned DNN and is also aware of SOTA output-based Trojaned model detectors. We show that such an adversary can ensure (1) high accuracy on both trigger-embedded and clean samples and (2) bypass detection. Our approach is based on an observation that the high dimensionality of the DNN parameters provides sufficient degrees of freedom to simultaneously achieve these objectives. We also enable SOTA detectors to be adaptive by allowing retraining to recalibrate their parameters, thus modeling a co-evolution of parameters of a Trojaned model and detectors. We then show that this co-evolution can be modeled as an iterative game, and prove that the resulting (optimal) solution of this interactive game leads to the adversary successfully achieving the above objectives. In addition, we provide a greedy algorithm for the adversary to select a minimum number of input samples for emb",
    "link": "https://arxiv.org/abs/2402.08695",
    "context": "Title: Game of Trojans: Adaptive Adversaries Against Output-based Trojaned-Model Detectors\nAbstract: arXiv:2402.08695v1 Announce Type: cross Abstract: We propose and analyze an adaptive adversary that can retrain a Trojaned DNN and is also aware of SOTA output-based Trojaned model detectors. We show that such an adversary can ensure (1) high accuracy on both trigger-embedded and clean samples and (2) bypass detection. Our approach is based on an observation that the high dimensionality of the DNN parameters provides sufficient degrees of freedom to simultaneously achieve these objectives. We also enable SOTA detectors to be adaptive by allowing retraining to recalibrate their parameters, thus modeling a co-evolution of parameters of a Trojaned model and detectors. We then show that this co-evolution can be modeled as an iterative game, and prove that the resulting (optimal) solution of this interactive game leads to the adversary successfully achieving the above objectives. In addition, we provide a greedy algorithm for the adversary to select a minimum number of input samples for emb",
    "path": "papers/24/02/2402.08695.json",
    "total_tokens": 904,
    "translated_title": "Game of Trojans: 自适应的对抗者对抗基于输出的特洛伊模型检测器",
    "translated_abstract": "我们提出并分析了一种自适应对手，可以重新训练带有特洛伊的深度神经网络，并且了解最先进的基于输出的特洛伊模型检测器。我们展示了这样的对手可以确保（1）对于嵌入触发器和干净样本都具有高准确率，并且（2）可以规避检测。我们的方法基于一个观察：深度神经网络参数的高维度提供足够的自由度来同时实现这些目标。我们还通过允许重新训练来使最先进的检测器适应性，以重新校准其参数，从而模拟特洛伊模型和检测器参数的共同演化。然后我们展示了这种共同进化可以被建模为一个迭代博弈，并证明了得到的（最优）解决方案会使对手成功地实现上述目标。此外，我们为对手提供了一个贪婪算法来选择最少的输入样本进行嵌入。",
    "tldr": "该论文提出了一种自适应的对抗者，可以重新训练带特洛伊的深度神经网络，并且可以规避最先进的基于输出的特洛伊模型检测器，同时确保高准确率。",
    "en_tdlr": "This paper proposes an adaptive adversary that can retrain Trojaned DNNs and bypass state-of-the-art output-based Trojaned model detectors, while ensuring high accuracy."
}