{
    "title": "A YANG-aided Unified Strategy for Black Hole Detection for Backbone Networks",
    "abstract": "Despite the crucial importance of addressing Black Hole failures in Internet backbone networks, effective detection strategies in backbone networks are lacking. This is largely because previous research has been centered on Mobile Ad-hoc Networks (MANETs), which operate under entirely different dynamics, protocols, and topologies, making their findings not directly transferable to backbone networks. Furthermore, detecting Black Hole failures in backbone networks is particularly challenging. It requires a comprehensive range of network data due to the wide variety of conditions that need to be considered, making data collection and analysis far from straightforward. Addressing this gap, our study introduces a novel approach for Black Hole detection in backbone networks using specialized Yet Another Next Generation (YANG) data models with Black Hole-sensitive Metric Matrix (BHMM) analysis. This paper details our method of selecting and analyzing four YANG models relevant to Black Hole de",
    "link": "https://arxiv.org/abs/2402.00831",
    "context": "Title: A YANG-aided Unified Strategy for Black Hole Detection for Backbone Networks\nAbstract: Despite the crucial importance of addressing Black Hole failures in Internet backbone networks, effective detection strategies in backbone networks are lacking. This is largely because previous research has been centered on Mobile Ad-hoc Networks (MANETs), which operate under entirely different dynamics, protocols, and topologies, making their findings not directly transferable to backbone networks. Furthermore, detecting Black Hole failures in backbone networks is particularly challenging. It requires a comprehensive range of network data due to the wide variety of conditions that need to be considered, making data collection and analysis far from straightforward. Addressing this gap, our study introduces a novel approach for Black Hole detection in backbone networks using specialized Yet Another Next Generation (YANG) data models with Black Hole-sensitive Metric Matrix (BHMM) analysis. This paper details our method of selecting and analyzing four YANG models relevant to Black Hole de",
    "path": "papers/24/02/2402.00831.json",
    "total_tokens": 900,
    "translated_title": "YANG辅助下的骨干网络黑洞检测统一策略",
    "translated_abstract": "尽管在互联网骨干网络中解决黑洞故障的重要性不可忽视，但骨干网络中的有效检测策略仍然缺乏。这主要是因为先前的研究主要集中在移动自组网(MANETs)上，而MANETs在动态、协议和拓扑上有着完全不同的操作，因此其研究结果无法直接应用于骨干网络。此外，骨干网络中的黑洞故障检测是一项特别具有挑战性的任务。由于需要考虑多样的条件，这需要收集大量的网络数据，使得数据收集和分析变得并不直观。为填补这一空白，我们的研究引入了一种新颖的方法，使用专门的Yet Another Next Generation (YANG)数据模型与黑洞敏感度量矩阵(BHMM)分析来进行骨干网络中的黑洞检测。本文详细介绍了我们选择和分析了与黑洞检测相关的四个YANG模型的方法。",
    "tldr": "该论文介绍了一种使用YANG数据模型与黑洞敏感度量矩阵分析的方法，用于在骨干网络中进行黑洞检测。这种方法填补了骨干网络黑洞检测方法的空白，提供了有效的检测策略。",
    "en_tdlr": "This paper introduces a method of Black Hole detection in backbone networks using YANG data models and Black Hole-sensitive Metric Matrix analysis, filling the gap in effective detection strategies and providing an efficient approach."
}