{
    "title": "SLIM: Skill Learning with Multiple Critics",
    "abstract": "Self-supervised skill learning aims to acquire useful behaviors that leverage the underlying dynamics of the environment. Latent variable models, based on mutual information maximization, have been particularly successful in this task but still struggle in the context of robotic manipulation. As it requires impacting a possibly large set of degrees of freedom composing the environment, mutual information maximization fails alone in producing useful manipulation behaviors. To address this limitation, we introduce SLIM, a multi-critic learning approach for skill discovery with a particular focus on robotic manipulation. Our main insight is that utilizing multiple critics in an actor-critic framework to gracefully combine multiple reward functions leads to a significant improvement in latent-variable skill discovery for robotic manipulation while overcoming possible interference occurring among rewards which hinders convergence to useful skills. Furthermore, in the context of tabletop man",
    "link": "https://arxiv.org/abs/2402.00823",
    "context": "Title: SLIM: Skill Learning with Multiple Critics\nAbstract: Self-supervised skill learning aims to acquire useful behaviors that leverage the underlying dynamics of the environment. Latent variable models, based on mutual information maximization, have been particularly successful in this task but still struggle in the context of robotic manipulation. As it requires impacting a possibly large set of degrees of freedom composing the environment, mutual information maximization fails alone in producing useful manipulation behaviors. To address this limitation, we introduce SLIM, a multi-critic learning approach for skill discovery with a particular focus on robotic manipulation. Our main insight is that utilizing multiple critics in an actor-critic framework to gracefully combine multiple reward functions leads to a significant improvement in latent-variable skill discovery for robotic manipulation while overcoming possible interference occurring among rewards which hinders convergence to useful skills. Furthermore, in the context of tabletop man",
    "path": "papers/24/02/2402.00823.json",
    "total_tokens": 783,
    "translated_title": "SLIM: 多判别器在技能学习中的应用",
    "translated_abstract": "自我监督的技能学习旨在获取利用环境的底层动态的有用行为。基于互信息最大化的潜变量模型在此任务中取得了显著的成功，但在机器人操作领域仍存在困难。由于机器人操作可能涉及到环境中很多自由度，单纯的互信息最大化无法产生有用的操作行为。为了解决这个问题，我们引入了SLIM，一种针对机器人操作的多判别器学习方法。我们的主要观点是，在演员-评论者框架中利用多个判别器来优雅地组合多个奖励函数，能够显著改善机器人操作的潜变量技能发现，同时克服奖励之间可能发生的干扰，阻碍对有用技能的收敛。",
    "tldr": "SLIM是一种多判别器学习方法，通过在机器人操作中组合多个判别器的奖励函数，显著改善了潜变量技能发现，克服了奖励之间的干扰。",
    "en_tdlr": "SLIM is a multi-critic learning approach that significantly improves latent-variable skill discovery in robotic manipulation by combining multiple reward functions, overcoming interference among rewards."
}