{
    "title": "Innovative Cybersickness Detection: Exploring Head Movement Patterns in Virtual Reality",
    "abstract": "Despite the widespread adoption of Virtual Reality (VR) technology, cybersickness remains a barrier for some users. This research investigates head movement patterns as a novel physiological marker for cybersickness detection. Unlike traditional markers, head movements provide a continuous, non-invasive measure that can be easily captured through the sensors embedded in all commercial VR headsets. We used a publicly available dataset from a VR experiment involving 75 participants and analyzed head movements across six axes. An extensive feature extraction process was then performed on the head movement dataset and its derivatives, including velocity, acceleration, and jerk. Three categories of features were extracted, encompassing statistical, temporal, and spectral features. Subsequently, we employed the Recursive Feature Elimination method to select the most important and effective features. In a series of experiments, we trained a variety of machine learning algorithms. The results ",
    "link": "https://arxiv.org/abs/2402.02725",
    "context": "Title: Innovative Cybersickness Detection: Exploring Head Movement Patterns in Virtual Reality\nAbstract: Despite the widespread adoption of Virtual Reality (VR) technology, cybersickness remains a barrier for some users. This research investigates head movement patterns as a novel physiological marker for cybersickness detection. Unlike traditional markers, head movements provide a continuous, non-invasive measure that can be easily captured through the sensors embedded in all commercial VR headsets. We used a publicly available dataset from a VR experiment involving 75 participants and analyzed head movements across six axes. An extensive feature extraction process was then performed on the head movement dataset and its derivatives, including velocity, acceleration, and jerk. Three categories of features were extracted, encompassing statistical, temporal, and spectral features. Subsequently, we employed the Recursive Feature Elimination method to select the most important and effective features. In a series of experiments, we trained a variety of machine learning algorithms. The results ",
    "path": "papers/24/02/2402.02725.json",
    "total_tokens": 1040,
    "tldr": "本研究通过分析头部运动模式来检测虚拟现实疾病。与传统标记不同，头部运动提供了连续的、非侵入性的测量方式。该研究使用了一个公开可用的数据集，在头部运动数据上进行了广泛的特征提取以及机器学习算法的训练，结果表明头部运动模式在虚拟现实疾病检测中具有显著的效果。",
    "en_tdlr": "This research investigates head movement patterns as a novel physiological marker for cybersickness detection in virtual reality. The study uses a publicly available dataset, performs extensive feature extraction on head movement data, and trains machine learning algorithms, showing significant effectiveness of head movement patterns in cybersickness detection."
}