{
    "title": "Shapelet-based Model-agnostic Counterfactual Local Explanations for Time Series Classification",
    "abstract": "In this work, we propose a model-agnostic instance-based post-hoc explainability method for time series classification. The proposed algorithm, namely Time-CF, leverages shapelets and TimeGAN to provide counterfactual explanations for arbitrary time series classifiers. We validate the proposed method on several real-world univariate time series classification tasks from the UCR Time Series Archive. The results indicate that the counterfactual instances generated by Time-CF when compared to state-of-the-art methods, demonstrate better performance in terms of four explainability metrics: closeness, sensibility, plausibility, and sparsity.",
    "link": "https://rss.arxiv.org/abs/2402.01343",
    "context": "Title: Shapelet-based Model-agnostic Counterfactual Local Explanations for Time Series Classification\nAbstract: In this work, we propose a model-agnostic instance-based post-hoc explainability method for time series classification. The proposed algorithm, namely Time-CF, leverages shapelets and TimeGAN to provide counterfactual explanations for arbitrary time series classifiers. We validate the proposed method on several real-world univariate time series classification tasks from the UCR Time Series Archive. The results indicate that the counterfactual instances generated by Time-CF when compared to state-of-the-art methods, demonstrate better performance in terms of four explainability metrics: closeness, sensibility, plausibility, and sparsity.",
    "path": "papers/24/02/2402.01343.json",
    "total_tokens": 725,
    "translated_title": "基于形态特征和模型无关的时间序列分类的可反事实局部解释方法",
    "translated_abstract": "在这项工作中，我们提出了一种基于形态特征的模型无关的后期解释方法，用于时间序列分类。提出的算法，称为Time-CF，利用形态特征和TimeGAN为任意时间序列分类器提供可反事实解释。我们在UCR时间序列存档中对几个真实世界的单变量时间序列分类任务进行了验证。结果表明，与最先进的方法相比，Time-CF生成的可反事实实例在接近度、敏感度、合理性和稀疏性等四个解释性指标方面表现更好。",
    "tldr": "提出了一种基于形态特征和模型无关的后期解释方法，用于时间序列分类。该方法利用形态特征和TimeGAN生成可反事实解释，与最先进的方法相比，在解释性方面表现更好。",
    "en_tdlr": "A shapelet-based model-agnostic post-hoc explainability method is proposed for time series classification. The method, called Time-CF, leverages shapelets and TimeGAN to generate counterfactual explanations for arbitrary time series classifiers. The results show that Time-CF outperforms state-of-the-art methods in terms of explainability metrics such as closeness, sensibility, plausibility, and sparsity."
}