{
    "title": "One-to-many Reconstruction of 3D Geometry of cultural Artifacts using a synthetically trained Generative Model",
    "abstract": "Estimating the 3D shape of an object using a single image is a difficult problem. Modern approaches achieve good results for general objects, based on real photographs, but worse results on less expressive representations such as historic sketches. Our automated approach generates a variety of detailed 3D representation from a single sketch, depicting a medieval statue, and can be guided by multi-modal inputs, such as text prompts. It relies solely on synthetic data for training, making it adoptable even in cases of only small numbers of training examples. Our solution allows domain experts such as a curators to interactively reconstruct potential appearances of lost artifacts.",
    "link": "https://arxiv.org/abs/2402.08310",
    "context": "Title: One-to-many Reconstruction of 3D Geometry of cultural Artifacts using a synthetically trained Generative Model\nAbstract: Estimating the 3D shape of an object using a single image is a difficult problem. Modern approaches achieve good results for general objects, based on real photographs, but worse results on less expressive representations such as historic sketches. Our automated approach generates a variety of detailed 3D representation from a single sketch, depicting a medieval statue, and can be guided by multi-modal inputs, such as text prompts. It relies solely on synthetic data for training, making it adoptable even in cases of only small numbers of training examples. Our solution allows domain experts such as a curators to interactively reconstruct potential appearances of lost artifacts.",
    "path": "papers/24/02/2402.08310.json",
    "total_tokens": 875,
    "translated_title": "使用合成训练的生成模型进行文化艺术品的一对多三维几何重建",
    "translated_abstract": "使用单个图像来估计物体的三维形状是一个困难的问题。现代方法针对一般物体基于真实照片可以取得良好的结果，但在历史素描等不太表现力强的表示上表现较差。我们的自动化方法可以从单个素描生成多样化的详细三维表示，能够通过文本提示等多模态输入进行指导。它仅依赖于合成数据进行训练，即使在训练样本数量很少的情况下也能适应。我们的解决方案允许领域专家（如馆长）与之交互地重建丢失艺术品的可能外观。",
    "tldr": "这项研究利用合成训练的生成模型，通过单个素描实现了一对多的文化艺术品三维几何重建，并能够通过多模态输入进行指导，对于历史素描等不太表现力强的表示具有较好的效果。这种解决方案仅依赖于合成数据进行训练，即使在训练样本数量很少的情况下也能适应，使领域专家能够互动地重建丢失艺术品的可能外观。",
    "en_tdlr": "This research uses a synthetically trained generative model to achieve one-to-many reconstruction of the 3D geometry of cultural artifacts from a single sketch, with the ability to be guided by multi-modal inputs. It performs well on less expressive representations such as historic sketches and relies solely on synthetic data for training, making it adaptable even with a small number of training examples. This solution allows domain experts to interactively reconstruct potential appearances of lost artifacts."
}