{
    "title": "Generative Modeling of Discrete Joint Distributions by E-Geodesic Flow Matching on Assignment Manifolds",
    "abstract": "This paper introduces a novel generative model for discrete distributions based on continuous normalizing flows on the submanifold of factorizing discrete measures. Integration of the flow gradually assigns categories and avoids issues of discretizing the latent continuous model like rounding, sample truncation etc. General non-factorizing discrete distributions capable of representing complex statistical dependencies of structured discrete data, can be approximated by embedding the submanifold into a the meta-simplex of all joint discrete distributions and data-driven averaging. Efficient training of the generative model is demonstrated by matching the flow of geodesics of factorizing discrete distributions. Various experiments underline the approach's broad applicability.",
    "link": "https://arxiv.org/abs/2402.07846",
    "context": "Title: Generative Modeling of Discrete Joint Distributions by E-Geodesic Flow Matching on Assignment Manifolds\nAbstract: This paper introduces a novel generative model for discrete distributions based on continuous normalizing flows on the submanifold of factorizing discrete measures. Integration of the flow gradually assigns categories and avoids issues of discretizing the latent continuous model like rounding, sample truncation etc. General non-factorizing discrete distributions capable of representing complex statistical dependencies of structured discrete data, can be approximated by embedding the submanifold into a the meta-simplex of all joint discrete distributions and data-driven averaging. Efficient training of the generative model is demonstrated by matching the flow of geodesics of factorizing discrete distributions. Various experiments underline the approach's broad applicability.",
    "path": "papers/24/02/2402.07846.json",
    "total_tokens": 816,
    "translated_title": "利用在赋值流形上的E-测地线流匹配生成离散联合分布的模型",
    "translated_abstract": "本文介绍了一种基于连续归一化流在分解离散度量子流形上的生成模型，该模型逐步对类别进行分配，避免了离散化潜在连续模型时的舍入、样本截断等问题。将子流形嵌入到所有联合离散分布和数据驱动平均的元单纯形中，可以近似表示能够表示结构化离散数据的复杂统计依赖关系的一般非分解离散分布。通过匹配分解离散分布的测地线流，演示了该生成模型的高效训练。各种实验突出了该方法的广泛适用性。",
    "tldr": "本文提出了一种基于连续归一化流的生成模型，该模型可以逐步分配类别，避免了离散化潜在连续模型时的舍入和样本截断等问题。通过匹配分解离散分布的测地线流，可以高效地训练该模型，并且适用于表示复杂统计依赖关系的非分解离散分布。",
    "en_tdlr": "This paper introduces a generative model based on continuous normalizing flows which gradually assigns categories and avoids issues of discretizing the latent continuous model. Efficient training is demonstrated by matching the flow of geodesics of factorizing discrete distributions, making the model applicable for representing complex statistical dependencies."
}