{
    "title": "Disentangling Imperfect: A Wavelet-Infused Multilevel Heterogeneous Network for Human Activity Recognition in Flawed Wearable Sensor Data",
    "abstract": "arXiv:2402.09434v1 Announce Type: cross  Abstract: The popularity and diffusion of wearable devices provides new opportunities for sensor-based human activity recognition that leverages deep learning-based algorithms. Although impressive advances have been made, two major challenges remain. First, sensor data is often incomplete or noisy due to sensor placement and other issues as well as data transmission failure, calling for imputation of missing values, which also introduces noise. Second, human activity has multi-scale characteristics. Thus, different groups of people and even the same person may behave differently under different circumstances. To address these challenges, we propose a multilevel heterogeneous neural network, called MHNN, for sensor data analysis. We utilize multilevel discrete wavelet decomposition to extract multi-resolution features from sensor data. This enables distinguishing signals with different frequencies, thereby suppressing noise. As the components res",
    "link": "https://arxiv.org/abs/2402.09434",
    "context": "Title: Disentangling Imperfect: A Wavelet-Infused Multilevel Heterogeneous Network for Human Activity Recognition in Flawed Wearable Sensor Data\nAbstract: arXiv:2402.09434v1 Announce Type: cross  Abstract: The popularity and diffusion of wearable devices provides new opportunities for sensor-based human activity recognition that leverages deep learning-based algorithms. Although impressive advances have been made, two major challenges remain. First, sensor data is often incomplete or noisy due to sensor placement and other issues as well as data transmission failure, calling for imputation of missing values, which also introduces noise. Second, human activity has multi-scale characteristics. Thus, different groups of people and even the same person may behave differently under different circumstances. To address these challenges, we propose a multilevel heterogeneous neural network, called MHNN, for sensor data analysis. We utilize multilevel discrete wavelet decomposition to extract multi-resolution features from sensor data. This enables distinguishing signals with different frequencies, thereby suppressing noise. As the components res",
    "path": "papers/24/02/2402.09434.json",
    "total_tokens": 928,
    "translated_title": "解开不完美之谜：一种融合小波的多层异构网络用于人体活动识别中的不完美穿戴式传感器数据",
    "translated_abstract": "可穿戴设备的流行和普及为基于传感器的人体活动识别提供了利用基于深度学习的算法的新机会。尽管取得了令人印象深刻的进展，但仍然存在两个主要挑战。第一，由于传感器的放置和其他问题以及数据传输故障，传感器数据通常不完整或嘈杂，需要填充缺失值，这也会引入噪音。第二，人体活动具有多尺度特征。因此，不同的人群甚至同一个人在不同情况下可能表现不同。为了解决这些挑战，我们提出了一种名为MHNN的多层异构神经网络，用于传感器数据分析。我们利用多层离散小波分解从传感器数据中提取多分辨率特征。这样可以区分具有不同频率的信号，从而抑制噪音。",
    "tldr": "该论文提出了一种融合小波的多层异构网络（MHNN）用于处理不完美的穿戴式传感器数据。研究团队通过多层离散小波分解提取了多分辨率特征，实现了对不同频率信号的区分，以抑制噪音。"
}