{
    "title": "What's in People's Digital File Collections?",
    "abstract": "Thoughtfully designing services and rigorously testing software to support personal information management (PIM) requires understanding the relevant collections, but relatively little is known about what people keep in their file collections, especially personal collections. Complementing recent work on the structure of 348 file collections, we examine those collections' contents, how much content is duplicated, and how collections used for personal matters differ from those used for study and work. Though all collections contain many images, some intuitively common file types are surprisingly scarce. Personal collections contain more audio than others, knowledge workers' collections contain more text documents but far fewer folders, and IT collections exhibit unusual traits. Collection duplication is correlated to collections' structural traits, but surprisingly, not to collection age. We discuss our findings in light of prior works and provide implications for various kinds of inform",
    "link": "https://arxiv.org/abs/2402.06421",
    "context": "Title: What's in People's Digital File Collections?\nAbstract: Thoughtfully designing services and rigorously testing software to support personal information management (PIM) requires understanding the relevant collections, but relatively little is known about what people keep in their file collections, especially personal collections. Complementing recent work on the structure of 348 file collections, we examine those collections' contents, how much content is duplicated, and how collections used for personal matters differ from those used for study and work. Though all collections contain many images, some intuitively common file types are surprisingly scarce. Personal collections contain more audio than others, knowledge workers' collections contain more text documents but far fewer folders, and IT collections exhibit unusual traits. Collection duplication is correlated to collections' structural traits, but surprisingly, not to collection age. We discuss our findings in light of prior works and provide implications for various kinds of inform",
    "path": "papers/24/02/2402.06421.json",
    "total_tokens": 791,
    "translated_title": "人们的数字文件收藏中有什么？",
    "translated_abstract": "深入了解人们数字文件收藏中的内容对于设计支持个人信息管理（PIM）的服务和进行软件测试至关重要，但关于人们的文件收藏，尤其是个人收藏的了解相对较少。在最近关于348个文件收藏结构的研究基础上，我们研究了这些收藏的内容，重复内容的数量以及个人收藏和学习工作用途收藏的差异。尽管所有收藏都包含很多图片，但一些直观上常见的文件类型却相当稀缺。个人收藏包含更多音频，知识型工作者的收藏包含更多文本文档但文件夹较少，IT收藏具有不寻常的特点。收藏的重复与其结构特征相关，但令人惊讶的是，与收藏的年龄无关。我们根据以前的研究讨论了我们的发现，并提供了对各种类型信息的启示。",
    "tldr": "该研究通过分析348个文件收藏的结构和内容，发现人们的数字文件收藏中包含丰富多样的内容。不同的收藏类型在内容、重复率和使用目的上存在差异。通过这些研究结果，我们可以更好地设计和测试个人信息管理的服务和软件。"
}