{
    "title": "Deciphering Heartbeat Signatures: A Vision Transformer Approach to Explainable Atrial Fibrillation Detection from ECG Signals",
    "abstract": "arXiv:2402.09474v1 Announce Type: cross  Abstract: Remote patient monitoring based on wearable single-lead electrocardiogram (ECG) devices has significant potential for enabling the early detection of heart disease, especially in combination with artificial intelligence (AI) approaches for automated heart disease detection. There have been prior studies applying AI approaches based on deep learning for heart disease detection. However, these models are yet to be widely accepted as a reliable aid for clinical diagnostics, in part due to the current black-box perception surrounding many AI algorithms. In particular, there is a need to identify the key features of the ECG signal that contribute toward making an accurate diagnosis, thereby enhancing the interpretability of the model. In the present study, we develop a vision transformer approach to identify atrial fibrillation based on single-lead ECG data. A residual network (ResNet) approach is also developed for comparison with the visi",
    "link": "https://arxiv.org/abs/2402.09474",
    "context": "Title: Deciphering Heartbeat Signatures: A Vision Transformer Approach to Explainable Atrial Fibrillation Detection from ECG Signals\nAbstract: arXiv:2402.09474v1 Announce Type: cross  Abstract: Remote patient monitoring based on wearable single-lead electrocardiogram (ECG) devices has significant potential for enabling the early detection of heart disease, especially in combination with artificial intelligence (AI) approaches for automated heart disease detection. There have been prior studies applying AI approaches based on deep learning for heart disease detection. However, these models are yet to be widely accepted as a reliable aid for clinical diagnostics, in part due to the current black-box perception surrounding many AI algorithms. In particular, there is a need to identify the key features of the ECG signal that contribute toward making an accurate diagnosis, thereby enhancing the interpretability of the model. In the present study, we develop a vision transformer approach to identify atrial fibrillation based on single-lead ECG data. A residual network (ResNet) approach is also developed for comparison with the visi",
    "path": "papers/24/02/2402.09474.json",
    "total_tokens": 817,
    "translated_title": "解读心率信号：一种基于视觉变压器技术的可解释性房颤检测方法",
    "translated_abstract": "基于可穿戴单导联心电图（ECG）设备的远程患者监测在结合人工智能（AI）方法进行自动心脏疾病检测方面具有巨大潜力。先前的研究已经应用基于深度学习的AI方法进行心脏疾病检测，但由于目前AI算法的黑盒特性，这些模型尚未被广泛接受作为临床诊断的可靠辅助工具。尤其需要确定ECG信号中贡献于准确诊断的关键特征，从而提高模型的可解释性。本研究开发了一种基于视觉变压器的方法，通过单导联ECG数据识别房颤，并提出了一种残差网络（ResNet）方法以作对比。",
    "tldr": "本研究使用视觉变压器方法解读心率信号，提高心脏疾病检测模型的解释性和可靠性。",
    "en_tdlr": "This study uses a vision transformer approach to decipher heartbeat signatures, enhancing the interpretability and reliability of the heart disease detection model."
}