{
    "title": "Pretrained Generative Language Models as General Learning Frameworks for Sequence-Based Tasks",
    "abstract": "We propose that small pretrained foundational generative language models with millions of parameters can be utilized as a general learning framework for sequence-based tasks. Our proposal overcomes the computational resource, skill set, and timeline challenges associated with training neural networks and language models from scratch. Further, our approach focuses on creating small and highly specialized models that can accurately execute a challenging task of which the base model is incapable of performing. We demonstrate that 125M, 350M, and 1.3B parameter pretrained foundational language models can be instruction fine-tuned with 10,000-to-1,000,000 instruction examples to achieve near state-of-the-art results on challenging cheminformatics tasks. We also demonstrate the role of successive language model fine-tuning epochs on improved outcomes, as well as the importance of both data formatting and pretrained foundational language model selection for instruction fine-tuning success.",
    "link": "https://arxiv.org/abs/2402.05616",
    "context": "Title: Pretrained Generative Language Models as General Learning Frameworks for Sequence-Based Tasks\nAbstract: We propose that small pretrained foundational generative language models with millions of parameters can be utilized as a general learning framework for sequence-based tasks. Our proposal overcomes the computational resource, skill set, and timeline challenges associated with training neural networks and language models from scratch. Further, our approach focuses on creating small and highly specialized models that can accurately execute a challenging task of which the base model is incapable of performing. We demonstrate that 125M, 350M, and 1.3B parameter pretrained foundational language models can be instruction fine-tuned with 10,000-to-1,000,000 instruction examples to achieve near state-of-the-art results on challenging cheminformatics tasks. We also demonstrate the role of successive language model fine-tuning epochs on improved outcomes, as well as the importance of both data formatting and pretrained foundational language model selection for instruction fine-tuning success.",
    "path": "papers/24/02/2402.05616.json",
    "total_tokens": 827,
    "translated_title": "预训练的生成式语言模型作为序列型任务的通用学习框架",
    "translated_abstract": "我们提出了一个观点，即具有数百万参数的小型预训练基础生成式语言模型可以用作序列型任务的通用学习框架。我们的提议解决了从头开始训练神经网络和语言模型所面临的计算资源、技能需求和时间限制等挑战。此外，我们的方法专注于创建小型且高度专业化的模型，能够准确执行基于任务模型无法完成的挑战性任务。我们证明了使用125M、350M和1.3B参数的预训练基础语言模型进行指令微调，使用10,000到1,000,000个指令示例可以在具有挑战性的化学信息学任务上实现接近最先进结果。我们还展示了连续的语言模型微调时期对改进结果的作用，以及数据格式和预训练基础语言模型选择对指令微调成功的重要性。",
    "tldr": "预训练的小型生成式语言模型可以作为序列型任务的通用学习框架，通过指令微调可以在化学信息学任务中实现接近最先进结果。",
    "en_tdlr": "Pretrained small generative language models can be used as a general learning framework for sequence-based tasks. Instruction fine-tuning achieves near state-of-the-art results in challenging cheminformatics tasks."
}