{
    "title": "Event-based Product Carousel Recommendation with Query-Click Graph",
    "abstract": "Many current recommender systems mainly focus on the product-to-product recommendations and user-to-product recommendations even during the time of events rather than modeling the typical recommendations for the target event (e.g., festivals, seasonal activities, or social activities) without addressing the multiple aspects of the shopping demands for the target event. Product recommendations for the multiple aspects of the target event are usually generated by human curators who manually identify the aspects and select a list of aspect-related products (i.e., product carousel) for each aspect as recommendations. However, building a recommender system with machine learning is non-trivial due to the lack of both the ground truth of event-related aspects and the aspect-related products. To fill this gap, we define the novel problem as the event-based product carousel recommendations in e-commerce and propose an effective recommender system based on the query-click bipartite graph. We app",
    "link": "https://arxiv.org/abs/2402.03277",
    "context": "Title: Event-based Product Carousel Recommendation with Query-Click Graph\nAbstract: Many current recommender systems mainly focus on the product-to-product recommendations and user-to-product recommendations even during the time of events rather than modeling the typical recommendations for the target event (e.g., festivals, seasonal activities, or social activities) without addressing the multiple aspects of the shopping demands for the target event. Product recommendations for the multiple aspects of the target event are usually generated by human curators who manually identify the aspects and select a list of aspect-related products (i.e., product carousel) for each aspect as recommendations. However, building a recommender system with machine learning is non-trivial due to the lack of both the ground truth of event-related aspects and the aspect-related products. To fill this gap, we define the novel problem as the event-based product carousel recommendations in e-commerce and propose an effective recommender system based on the query-click bipartite graph. We app",
    "path": "papers/24/02/2402.03277.json",
    "total_tokens": 776,
    "translated_title": "基于事件的查询-点击图的产品推荐轮播",
    "translated_abstract": "当前许多推荐系统主要关注的是产品对产品的推荐和用户对产品的推荐，即使在事件发生时也没有模拟目标事件的典型推荐（例如节日、季节活动或社交活动），而忽略了目标事件的多方面购物需求。通常，针对目标事件的多个方面的产品推荐是由人工策划者生成的，他们手动识别出各个方面，并选择一系列与方面相关的产品（即产品轮播）作为推荐。然而，由于缺乏事件相关方面和相关产品的准确信息，利用机器学习构建推荐系统是非常具有挑战性的。为了弥补这一空白，我们在电子商务领域定义了新问题，即基于事件的产品推荐轮播，并提出了一种基于查询-点击二部图的有效推荐系统。",
    "tldr": "该论文提出了基于事件的产品推荐轮播问题，并提出了一种基于查询-点击二部图的有效推荐系统来解决该问题。",
    "en_tdlr": "This paper proposes a problem of event-based product carousel recommendation and presents an effective recommender system based on query-click bipartite graph to address this problem."
}