{
    "title": "Top-Personalized-K Recommendation",
    "abstract": "arXiv:2402.16304v1 Announce Type: new  Abstract: The conventional top-K recommendation, which presents the top-K items with the highest ranking scores, is a common practice for generating personalized ranking lists. However, is this fixed-size top-K recommendation the optimal approach for every user's satisfaction? Not necessarily. We point out that providing fixed-size recommendations without taking into account user utility can be suboptimal, as it may unavoidably include irrelevant items or limit the exposure to relevant ones. To address this issue, we introduce Top-Personalized-K Recommendation, a new recommendation task aimed at generating a personalized-sized ranking list to maximize individual user satisfaction. As a solution to the proposed task, we develop a model-agnostic framework named PerK. PerK estimates the expected user utility by leveraging calibrated interaction probabilities, subsequently selecting the recommendation size that maximizes this expected utility. Through",
    "link": "https://arxiv.org/abs/2402.16304",
    "context": "Title: Top-Personalized-K Recommendation\nAbstract: arXiv:2402.16304v1 Announce Type: new  Abstract: The conventional top-K recommendation, which presents the top-K items with the highest ranking scores, is a common practice for generating personalized ranking lists. However, is this fixed-size top-K recommendation the optimal approach for every user's satisfaction? Not necessarily. We point out that providing fixed-size recommendations without taking into account user utility can be suboptimal, as it may unavoidably include irrelevant items or limit the exposure to relevant ones. To address this issue, we introduce Top-Personalized-K Recommendation, a new recommendation task aimed at generating a personalized-sized ranking list to maximize individual user satisfaction. As a solution to the proposed task, we develop a model-agnostic framework named PerK. PerK estimates the expected user utility by leveraging calibrated interaction probabilities, subsequently selecting the recommendation size that maximizes this expected utility. Through",
    "path": "papers/24/02/2402.16304.json",
    "total_tokens": 780,
    "translated_title": "个性化大小的Top-K推荐",
    "translated_abstract": "传统的Top-K推荐将呈现具有最高排名得分的前K个物品，这是生成个性化排名列表的常见做法。然而，固定大小的Top-K推荐对于每个用户的满意度是否是最佳方法？未必。我们指出，如果不考虑用户效用而提供固定大小的推荐可能是次优的，因为它可能会不可避免地包含无关项目或限制与相关项目的接触。为了解决这个问题，我们引入了Top-Personalized-K推荐，这是一个旨在生成个性化大小排名列表以最大化个人用户满意度的新推荐任务。作为提出任务的解决方案，我们开发了一个名为PerK的模型无关框架。PerK通过利用校准的交互概率来估计期望的用户效用，随后选择最大化这种期望效用的推荐大小。",
    "tldr": "引入了个性化大小的Top-K推荐任务，提出了模型PerK，通过估计用户效用以最大化期望效用来选择推荐大小",
    "en_tdlr": "Introducing a new task of personalized-sized Top-K recommendation and proposing a model PerK, which estimates user utility to maximize expected utility for recommendation size selection."
}