{
    "title": "Improving Molecule Generation and Drug Discovery with a Knowledge-enhanced Generative Model",
    "abstract": "arXiv:2402.08790v1 Announce Type: new Abstract: Recent advancements in generative models have established state-of-the-art benchmarks in generating molecules and novel drug candidates. Despite these successes, a significant gap persists between generative models and the utilization of extensive biomedical knowledge, often systematized within knowledge graphs, whose potential to inform and enhance generative processes has not been realized. In this paper, we present a novel approach that bridges this divide by developing a framework for knowledge-enhanced generative models called K-DReAM. We develop a scalable methodology to extend the functionality of knowledge graphs while preserving semantic integrity and incorporate this contextual information into a generative framework to guide a diffusion-based model. The integration of knowledge graph embeddings with our generative model furnishes a robust mechanism for producing novel drug candidates possessing specific characteristics while en",
    "link": "https://arxiv.org/abs/2402.08790",
    "context": "Title: Improving Molecule Generation and Drug Discovery with a Knowledge-enhanced Generative Model\nAbstract: arXiv:2402.08790v1 Announce Type: new Abstract: Recent advancements in generative models have established state-of-the-art benchmarks in generating molecules and novel drug candidates. Despite these successes, a significant gap persists between generative models and the utilization of extensive biomedical knowledge, often systematized within knowledge graphs, whose potential to inform and enhance generative processes has not been realized. In this paper, we present a novel approach that bridges this divide by developing a framework for knowledge-enhanced generative models called K-DReAM. We develop a scalable methodology to extend the functionality of knowledge graphs while preserving semantic integrity and incorporate this contextual information into a generative framework to guide a diffusion-based model. The integration of knowledge graph embeddings with our generative model furnishes a robust mechanism for producing novel drug candidates possessing specific characteristics while en",
    "path": "papers/24/02/2402.08790.json",
    "total_tokens": 820,
    "translated_title": "用知识增强的生成模型改进分子生成和药物发现",
    "translated_abstract": "生成模型在生成分子和新药候选物方面取得了最先进的成果。尽管取得了这些成功，但是生成模型与广泛的生物医学知识之间仍存在重大差距，这些知识通常被系统化在知识图谱中，而这些知识对于信息和增强生成过程的潜力尚未实现。本文提出了一种新方法，通过开发一个名为K-DReAM的知识增强生成模型框架来弥合这个差距。我们开发了一种可扩展的方法，扩展了知识图谱的功能，同时保持语义完整性，并将这些上下文信息结合到一个生成框架中，以指导扩散模型。知识图谱嵌入与我们的生成模型相结合，为产生具有特定特征的新药候选物提供了强大的机制。",
    "tldr": "本文介绍了一种名为K-DReAM的知识增强生成模型框架，该框架将知识图谱嵌入到生成模型中，以产生具有特定特征的新药候选物。",
    "en_tdlr": "This paper presents a knowledge-enhanced generative model framework called K-DReAM, which incorporates knowledge graph embeddings into the generative process to produce novel drug candidates with specific characteristics."
}