{
    "title": "The Relevance Feature and Vector Machine for health applications",
    "abstract": "This paper presents the Relevance Feature and Vector Machine (RFVM), a novel model that addresses the challenges of the fat-data problem when dealing with clinical prospective studies. The fat-data problem refers to the limitations of Machine Learning (ML) algorithms when working with databases in which the number of features is much larger than the number of samples (a common scenario in certain medical fields). To overcome such limitations, the RFVM incorporates different characteristics: (1) A Bayesian formulation which enables the model to infer its parameters without overfitting thanks to the Bayesian model averaging. (2) A joint optimisation that overcomes the limitations arising from the fat-data characteristic by simultaneously including the variables that define the primal space (features) and those that define the dual space (observations). (3) An integrated prunning that removes the irrelevant features and samples during the training iterative optimization. Also, this last p",
    "link": "https://arxiv.org/abs/2402.07079",
    "context": "Title: The Relevance Feature and Vector Machine for health applications\nAbstract: This paper presents the Relevance Feature and Vector Machine (RFVM), a novel model that addresses the challenges of the fat-data problem when dealing with clinical prospective studies. The fat-data problem refers to the limitations of Machine Learning (ML) algorithms when working with databases in which the number of features is much larger than the number of samples (a common scenario in certain medical fields). To overcome such limitations, the RFVM incorporates different characteristics: (1) A Bayesian formulation which enables the model to infer its parameters without overfitting thanks to the Bayesian model averaging. (2) A joint optimisation that overcomes the limitations arising from the fat-data characteristic by simultaneously including the variables that define the primal space (features) and those that define the dual space (observations). (3) An integrated prunning that removes the irrelevant features and samples during the training iterative optimization. Also, this last p",
    "path": "papers/24/02/2402.07079.json",
    "total_tokens": 861,
    "translated_title": "健康应用中的相关特征与向量机",
    "translated_abstract": "本文介绍了一种新颖的模型——相关特征与向量机（RFVM），用于解决在临床前瞻性研究中处理大数据问题时面临的挑战。大数据问题是指当机器学习算法与特征数远大于样本数的数据库一起工作时的限制（在某些医学领域中是常见情况）。为了克服这些限制，RFVM融合了以下几个特点：（1）贝叶斯公式，使模型在贝叶斯模型平均的推断下能够避免过拟合问题。（2）联合优化，通过同时引入定义原始空间（特征）和对偶空间（观测）的变量，克服了大数据特征所带来的限制。（3）集成修剪，可以在训练迭代优化期间移除不相关的特征和样本。此外，最后这个修剪方法可以提高模型的效果和效率。",
    "tldr": "本文提出了一种名为RFVM的模型，用于解决临床前瞻性研究中的大数据问题。该模型结合了贝叶斯公式、联合优化和集成修剪等特点，以提高模型的效果和效率。",
    "en_tdlr": "This paper introduces a novel model called RFVM for addressing the challenges of the fat-data problem in clinical prospective studies. RFVM incorporates a Bayesian formulation, joint optimization, and integrated pruning to improve the model's effectiveness and efficiency."
}