{
    "title": "Genetic-based Constraint Programming for Resource Constrained Job Scheduling",
    "abstract": "Resource constrained job scheduling is a hard combinatorial optimisation problem that originates in the mining industry. Off-the-shelf solvers cannot solve this problem satisfactorily in reasonable timeframes, while other solution methods such as many evolutionary computation methods and matheuristics cannot guarantee optimality and require low-level customisation and specialised heuristics to be effective. This paper addresses this gap by proposing a genetic programming algorithm to discover efficient search strategies of constraint programming for resource-constrained job scheduling. In the proposed algorithm, evolved programs represent variable selectors to be used in the search process of constraint programming, and their fitness is determined by the quality of solutions obtained for training instances. The novelties of this algorithm are (1) a new representation of variable selectors, (2) a new fitness evaluation scheme, and (3) a pre-selection mechanism. Tests with a large set of",
    "link": "https://arxiv.org/abs/2402.00459",
    "context": "Title: Genetic-based Constraint Programming for Resource Constrained Job Scheduling\nAbstract: Resource constrained job scheduling is a hard combinatorial optimisation problem that originates in the mining industry. Off-the-shelf solvers cannot solve this problem satisfactorily in reasonable timeframes, while other solution methods such as many evolutionary computation methods and matheuristics cannot guarantee optimality and require low-level customisation and specialised heuristics to be effective. This paper addresses this gap by proposing a genetic programming algorithm to discover efficient search strategies of constraint programming for resource-constrained job scheduling. In the proposed algorithm, evolved programs represent variable selectors to be used in the search process of constraint programming, and their fitness is determined by the quality of solutions obtained for training instances. The novelties of this algorithm are (1) a new representation of variable selectors, (2) a new fitness evaluation scheme, and (3) a pre-selection mechanism. Tests with a large set of",
    "path": "papers/24/02/2402.00459.json",
    "total_tokens": 849,
    "translated_title": "基于遗传的约束编程在资源受限作业调度中的应用",
    "translated_abstract": "资源受限的作业调度是一种困难的组合优化问题，源自于采矿行业。通用求解器无法在合理的时间内令人满意地解决这个问题，而其他解法方法如许多进化计算方法和元启发式方法不能保证最优性，并且需要低级定制和专门的启发式技巧才能有效。本文通过提出一种基于遗传编程的算法来发现资源受限作业调度约束编程的高效搜索策略来填补这个缺口。在所提出的算法中，进化的程序代表了在约束编程的搜索过程中要使用的变量选择器，它们的适应度由针对训练实例获得的解质量来确定。该算法的创新点有：（1）新的变量选择器表示方法，（2）新的适应度评估方案，和（3）预选择机制。",
    "tldr": "本论文提出了一种基于遗传算法的约束编程方法来解决资源受限作业调度问题，该方法通过进化编程发现高效的搜索策略，并通过新的表示方法、适应度评估方案和预选择机制实现了创新。",
    "en_tdlr": "This paper proposes a genetic programming algorithm for resource-constrained job scheduling, which addresses the limitations of off-the-shelf solvers and other solution methods. The algorithm discovers efficient search strategies and introduces novel representations, fitness evaluation scheme, and pre-selection mechanism."
}