{
    "title": "Harnessing the Plug-and-Play Controller by Prompting",
    "abstract": "Controllable text generation is a growing field within natural language generation (NLG) that focuses on producing text that meets specific constraints in real-world applications. Previous approaches, such as plug-and-play controllers (PPCs), aimed to steer the properties of generated text in a flexible manner. However, these methods often compromised the integrity of the language model's decoding process, resulting in less smooth text generation. Alternatively, other techniques utilized multiple attribute prompts to align the generated text with desired attributes, but this approach required prompt design for each attribute and was dependent on the size of the language model. This paper introduces a novel method for flexible attribute control in text generation using pre-trained language models (PLMs). The proposed approach aims to enhance the fluency of generated text by guiding the generation process with PPCs. The key idea is to dynamically adjust the distribution of generated text",
    "link": "https://arxiv.org/abs/2402.04160",
    "context": "Title: Harnessing the Plug-and-Play Controller by Prompting\nAbstract: Controllable text generation is a growing field within natural language generation (NLG) that focuses on producing text that meets specific constraints in real-world applications. Previous approaches, such as plug-and-play controllers (PPCs), aimed to steer the properties of generated text in a flexible manner. However, these methods often compromised the integrity of the language model's decoding process, resulting in less smooth text generation. Alternatively, other techniques utilized multiple attribute prompts to align the generated text with desired attributes, but this approach required prompt design for each attribute and was dependent on the size of the language model. This paper introduces a novel method for flexible attribute control in text generation using pre-trained language models (PLMs). The proposed approach aims to enhance the fluency of generated text by guiding the generation process with PPCs. The key idea is to dynamically adjust the distribution of generated text",
    "path": "papers/24/02/2402.04160.json",
    "total_tokens": 839,
    "translated_title": "通过提示来控制“即插即用”控制器的利用",
    "translated_abstract": "可控文本生成是自然语言生成（NLG）中一个快速发展的领域，其专注于在实际应用中生成满足特定约束的文本。之前的方法，如即插即用控制器（PPC），旨在以灵活的方式引导生成文本的属性。然而，这些方法常常损害了语言模型的解码过程的完整性，导致生成文本的流畅性下降。另外，其他技术使用多个属性提示来将生成的文本与所需属性对齐，但这种方法需要为每个属性进行提示设计，并且依赖于语言模型的大小。本文介绍了一种使用预训练语言模型（PLM）进行文本生成中灵活属性控制的创新方法。所提出的方法旨在通过引导生成过程使用PPC来提高生成文本的流畅性。关键思路是动态调整生成文本的分布",
    "tldr": "本文提出了一种新的文本生成方法，使用预训练语言模型（PLMs）实现了对生成文本属性的灵活控制，提高了流畅性，通过引导生成过程使用即插即用控制器（PPCs），动态调整生成文本的分布。"
}