{
    "title": "Correlational Lagrangian Schr\\\"odinger Bridge: Learning Dynamics with Population-Level Regularization",
    "abstract": "arXiv:2402.10227v1 Announce Type: new  Abstract: Accurate modeling of system dynamics holds intriguing potential in broad scientific fields including cytodynamics and fluid mechanics. This task often presents significant challenges when (i) observations are limited to cross-sectional samples (where individual trajectories are inaccessible for learning), and moreover, (ii) the behaviors of individual particles are heterogeneous (especially in biological systems due to biodiversity). To address them, we introduce a novel framework dubbed correlational Lagrangian Schr\\\"odinger bridge (CLSB), aiming to seek for the evolution \"bridging\" among cross-sectional observations, while regularized for the minimal population \"cost\". In contrast to prior methods relying on \\textit{individual}-level regularizers for all particles \\textit{homogeneously} (e.g. restraining individual motions), CLSB operates at the population level admitting the heterogeneity nature, resulting in a more generalizable mode",
    "link": "https://arxiv.org/abs/2402.10227",
    "context": "Title: Correlational Lagrangian Schr\\\"odinger Bridge: Learning Dynamics with Population-Level Regularization\nAbstract: arXiv:2402.10227v1 Announce Type: new  Abstract: Accurate modeling of system dynamics holds intriguing potential in broad scientific fields including cytodynamics and fluid mechanics. This task often presents significant challenges when (i) observations are limited to cross-sectional samples (where individual trajectories are inaccessible for learning), and moreover, (ii) the behaviors of individual particles are heterogeneous (especially in biological systems due to biodiversity). To address them, we introduce a novel framework dubbed correlational Lagrangian Schr\\\"odinger bridge (CLSB), aiming to seek for the evolution \"bridging\" among cross-sectional observations, while regularized for the minimal population \"cost\". In contrast to prior methods relying on \\textit{individual}-level regularizers for all particles \\textit{homogeneously} (e.g. restraining individual motions), CLSB operates at the population level admitting the heterogeneity nature, resulting in a more generalizable mode",
    "path": "papers/24/02/2402.10227.json",
    "total_tokens": 868,
    "translated_title": "相关拉格朗日薛定谔桥：通过人口级正则化学习动力学",
    "translated_abstract": "系统动态的准确建模在包括细胞动力学和流体力学在内的广泛科学领域中具有引人注目的潜力。然而，当（i）观察仅限于横截面样本（个体轨迹不可学习）时，以及（ii）个体粒子行为异质时（尤其是由于生物多样性而为生物系统）。为了解决这些问题，我们引入了一个名为相关拉格朗日薛定谔桥（CLSB）的新框架，旨在寻求在横截观察之间的演变“桥梁”，同时以最小人口“成本”进行正则化。与先前依赖\\textit{个体}级正则化器的方法形成对比（例如，限制个体运动），CLSB在人口水平运行，接受异质性本质，从而产生更具泛化性的模式。",
    "tldr": "提出了一个名为相关拉格朗日薛定谔桥（CLSB）的新框架，通过人口级正则化来学习跨截面样本中的系统动态，适应个体粒子行为的异质性。",
    "en_tdlr": "Introduced a novel framework called correlational Lagrangian Schr\\\"odinger bridge (CLSB), which learns system dynamics from cross-sectional samples using population-level regularization to accommodate the heterogeneity of individual particle behaviors."
}