{
    "title": "LLM-Assisted Crisis Management: Building Advanced LLM Platforms for Effective Emergency Response and Public Collaboration",
    "abstract": "arXiv:2402.10908v1 Announce Type: cross  Abstract: Emergencies and critical incidents often unfold rapidly, necessitating a swift and effective response. In this research, we introduce a novel approach to identify and classify emergency situations from social media posts and direct emergency messages using an open source Large Language Model, LLAMA2. The goal is to harness the power of natural language processing and machine learning to assist public safety telecommunicators and huge crowds during countrywide emergencies. Our research focuses on developing a language model that can understand users describe their situation in the 911 call, enabling LLAMA2 to analyze the content and offer relevant instructions to the telecommunicator, while also creating workflows to notify government agencies with the caller's information when necessary. Another benefit this language model provides is its ability to assist people during a significant emergency incident when the 911 system is overwhelme",
    "link": "https://arxiv.org/abs/2402.10908",
    "context": "Title: LLM-Assisted Crisis Management: Building Advanced LLM Platforms for Effective Emergency Response and Public Collaboration\nAbstract: arXiv:2402.10908v1 Announce Type: cross  Abstract: Emergencies and critical incidents often unfold rapidly, necessitating a swift and effective response. In this research, we introduce a novel approach to identify and classify emergency situations from social media posts and direct emergency messages using an open source Large Language Model, LLAMA2. The goal is to harness the power of natural language processing and machine learning to assist public safety telecommunicators and huge crowds during countrywide emergencies. Our research focuses on developing a language model that can understand users describe their situation in the 911 call, enabling LLAMA2 to analyze the content and offer relevant instructions to the telecommunicator, while also creating workflows to notify government agencies with the caller's information when necessary. Another benefit this language model provides is its ability to assist people during a significant emergency incident when the 911 system is overwhelme",
    "path": "papers/24/02/2402.10908.json",
    "total_tokens": 891,
    "translated_title": "LLM辅助危机管理：构建用于有效应急响应和公众协作的先进LLM平台",
    "translated_abstract": "紧急情况和重大事件往往迅速发展，需要迅速有效的响应。本研究介绍了一种新方法，利用开源大型语言模型LLAMA2，从社交媒体帖子和直接的紧急消息中识别和分类紧急情况。旨在利用自然语言处理和机器学习的力量，协助公共安全话务员和大量民众在全国范围内的紧急情况中。我们的研究集中于开发一种语言模型，能够理解用户在911呼叫中描述自己的情况，使LLAMA2能够分析内容并为话务员提供相关指导，同时创建工作流程，在必要时将呼叫者信息通知政府机构。该语言模型提供的另一个好处是，当911系统不堪重负时，它能够在重大紧急事件中协助人们。",
    "tldr": "通过LLAMA2语言模型，建立了一个能够从社交媒体和紧急消息中识别和分类紧急情况的方法，可协助在全国范围内的紧急情况下公共安全话务员和大众，提供相关指导并通知政府机构。",
    "en_tdlr": "A method was developed using the LLAMA2 language model to identify and classify emergency situations from social media and emergency messages, assisting public safety telecommunicators and the public during nationwide emergencies by providing relevant guidance and notifying government agencies."
}