{
    "title": "MADRL-based UAVs Trajectory Design with Anti-Collision Mechanism in Vehicular Networks",
    "abstract": "In upcoming 6G networks, unmanned aerial vehicles (UAVs) are expected to play a fundamental role by acting as mobile base stations, particularly for demanding vehicle-to-everything (V2X) applications. In this scenario, one of the most challenging problems is the design of trajectories for multiple UAVs, cooperatively serving the same area. Such joint trajectory design can be performed using multi-agent deep reinforcement learning (MADRL) algorithms, but ensuring collision-free paths among UAVs becomes a critical challenge. Traditional methods involve imposing high penalties during training to discourage unsafe conditions, but these can be proven to be ineffective, whereas binary masks can be used to restrict unsafe actions, but naively applying them to all agents can lead to suboptimal solutions and inefficiencies. To address these issues, we propose a rank-based binary masking approach. Higher-ranked UAVs move optimally, while lower-ranked UAVs use this information to define improved ",
    "link": "https://arxiv.org/abs/2402.03342",
    "context": "Title: MADRL-based UAVs Trajectory Design with Anti-Collision Mechanism in Vehicular Networks\nAbstract: In upcoming 6G networks, unmanned aerial vehicles (UAVs) are expected to play a fundamental role by acting as mobile base stations, particularly for demanding vehicle-to-everything (V2X) applications. In this scenario, one of the most challenging problems is the design of trajectories for multiple UAVs, cooperatively serving the same area. Such joint trajectory design can be performed using multi-agent deep reinforcement learning (MADRL) algorithms, but ensuring collision-free paths among UAVs becomes a critical challenge. Traditional methods involve imposing high penalties during training to discourage unsafe conditions, but these can be proven to be ineffective, whereas binary masks can be used to restrict unsafe actions, but naively applying them to all agents can lead to suboptimal solutions and inefficiencies. To address these issues, we propose a rank-based binary masking approach. Higher-ranked UAVs move optimally, while lower-ranked UAVs use this information to define improved ",
    "path": "papers/24/02/2402.03342.json",
    "total_tokens": 864,
    "translated_title": "基于MADRL的车联网中具有防碰撞机制的无人机轨迹设计",
    "translated_abstract": "在即将到来的6G网络中，无人机作为移动基站，特别是针对车辆到一切（V2X）应用，将发挥重要作用。在这种情况下，最具挑战性的问题之一是多个无人机的轨迹设计，共同为同一区域提供服务。这种联合轨迹设计可以使用多智能体深度强化学习（MADRL）算法进行，但确保无人机之间的无碰撞路径成为一个关键挑战。传统方法在训练过程中施加高惩罚以避免不安全情况，但这些方法证明是无效的，而二进制掩码可以用来限制不安全的行动，但是简单应用于所有智能体可能导致次优解和低效率。为了解决这些问题，我们提出了一种基于等级的二进制掩码方法。较高等级的无人机移动优化，较低等级的无人机利用这些信息定义了改进的路径。",
    "tldr": "本论文提出了一种基于MADRL的无人机轨迹设计方法，采用排名二进制掩码的方式，实现了多个无人机之间的无碰撞路径设计。",
    "en_tdlr": "This paper proposes a MADRL-based trajectory design method for UAVs, utilizing rank-based binary masking to achieve collision-free paths among multiple UAVs."
}