{
    "title": "Exploring the Limits of Semantic Image Compression at Micro-bits per Pixel",
    "abstract": "arXiv:2402.13536v1 Announce Type: cross  Abstract: Traditional methods, such as JPEG, perform image compression by operating on structural information, such as pixel values or frequency content. These methods are effective to bitrates around one bit per pixel (bpp) and higher at standard image sizes. In contrast, text-based semantic compression directly stores concepts and their relationships using natural language, which has evolved with humans to efficiently represent these salient concepts. These methods can operate at extremely low bitrates by disregarding structural information like location, size, and orientation. In this work, we use GPT-4V and DALL-E3 from OpenAI to explore the quality-compression frontier for image compression and identify the limitations of current technology. We push semantic compression as low as 100 $\\mu$bpp (up to $10,000\\times$ smaller than JPEG) by introducing an iterative reflection process to improve the decoded image. We further hypothesize this 100 ",
    "link": "https://arxiv.org/abs/2402.13536",
    "context": "Title: Exploring the Limits of Semantic Image Compression at Micro-bits per Pixel\nAbstract: arXiv:2402.13536v1 Announce Type: cross  Abstract: Traditional methods, such as JPEG, perform image compression by operating on structural information, such as pixel values or frequency content. These methods are effective to bitrates around one bit per pixel (bpp) and higher at standard image sizes. In contrast, text-based semantic compression directly stores concepts and their relationships using natural language, which has evolved with humans to efficiently represent these salient concepts. These methods can operate at extremely low bitrates by disregarding structural information like location, size, and orientation. In this work, we use GPT-4V and DALL-E3 from OpenAI to explore the quality-compression frontier for image compression and identify the limitations of current technology. We push semantic compression as low as 100 $\\mu$bpp (up to $10,000\\times$ smaller than JPEG) by introducing an iterative reflection process to improve the decoded image. We further hypothesize this 100 ",
    "path": "papers/24/02/2402.13536.json",
    "total_tokens": 855,
    "translated_title": "探索每微比特语义图像压缩的极限",
    "translated_abstract": "传统方法，如JPEG，通过处理结构信息（如像素值或频率内容）来进行图像压缩。在标准图像尺寸下，这些方法在每像素约一比特（bpp）及以上的比特率上是有效的。相比之下，基于文本的语义压缩直接使用自然语言存储概念及其关系，这些关系已与人类一起演变，以有效表示这些突出的概念。通过忽略位置、大小和方向等结构信息，这些方法可以在极低比特率下运行。本文利用OpenAI的GPT-4V和DALL-E3探索图像压缩的质量-压缩前沿，并确定当前技术的限制。通过引入迭代反射过程来改善解码图像，我们将语义压缩推至每像素100微比特（比JPEG小$10,000\\times$）。我们进一步假设",
    "tldr": "本文使用GPT-4V和DALL-E3来探索图像压缩的质量和压缩界限，推动语义压缩降至每像素100微比特，并通过迭代反射过程改善解码图像。",
    "en_tdlr": "This paper explores the quality-compression frontier for image compression using GPT-4V and DALL-E3, pushing semantic compression as low as 100 micro-bits per pixel and improving the decoded images through an iterative reflection process."
}