{
    "title": "Learning Planning Action Models from State Traces",
    "abstract": "arXiv:2402.10726v1 Announce Type: new  Abstract: Previous STRIPS domain model acquisition approaches that learn from state traces start with the names and parameters of the actions to be learned. Therefore their only task is to deduce the preconditions and effects of the given actions. In this work, we explore learning in situations when the parameters of learned actions are not provided. We define two levels of trace quality based on which information is provided and present an algorithm for each. In one level (L1), the states in the traces are labeled with action names, so we can deduce the number and names of the actions, but we still need to work out the number and types of parameters. In the other level (L2), the states are additionally labeled with objects that constitute the parameters of the corresponding grounded actions. Here we still need to deduce the types of the parameters in the learned actions. We experimentally evaluate the proposed algorithms and compare them with the",
    "link": "https://arxiv.org/abs/2402.10726",
    "context": "Title: Learning Planning Action Models from State Traces\nAbstract: arXiv:2402.10726v1 Announce Type: new  Abstract: Previous STRIPS domain model acquisition approaches that learn from state traces start with the names and parameters of the actions to be learned. Therefore their only task is to deduce the preconditions and effects of the given actions. In this work, we explore learning in situations when the parameters of learned actions are not provided. We define two levels of trace quality based on which information is provided and present an algorithm for each. In one level (L1), the states in the traces are labeled with action names, so we can deduce the number and names of the actions, but we still need to work out the number and types of parameters. In the other level (L2), the states are additionally labeled with objects that constitute the parameters of the corresponding grounded actions. Here we still need to deduce the types of the parameters in the learned actions. We experimentally evaluate the proposed algorithms and compare them with the",
    "path": "papers/24/02/2402.10726.json",
    "total_tokens": 835,
    "translated_title": "从状态轨迹中学习规划行动模型",
    "translated_abstract": "先前从状态轨迹中学习STRIPS领域模型的方法通常从要学习的行动的名称和参数开始。因此，它们的唯一任务是推断给定行动的前提条件和效应。在这项工作中，我们探讨了在学习时未提供学习行动的参数的情况。我们根据提供的信息定义了两个级别的跟踪质量，并提出了相应的算法。在一个级别(L1)中，轨迹中的状态被标记为行动名称，因此我们可以推断出行动的数量和名称，但我们仍需要弄清参数的数量和类型。在另一个级别(L2)中，状态还额外标记有构成相应基于对象的行动的参数。在这里，我们仍然需要推断学习行动中参数的类型。我们对所提出的算法进行了实验评估，并将其与其他方法进行了比较。",
    "tldr": "该论文探讨了一种从状态轨迹中学习规划行动模型的方法，尤其关注在参数未提供的情况下进行学习，并提出了两种不同级别的跟踪质量以及相应的算法。",
    "en_tdlr": "This paper discusses a method for learning planning action models from state traces, focusing on situations where parameters of learned actions are not provided, introducing two levels of trace quality and corresponding algorithms."
}