{
    "title": "Development and Testing of a Novel Large Language Model-Based Clinical Decision Support Systems for Medication Safety in 12 Clinical Specialties",
    "abstract": "Importance: We introduce a novel Retrieval Augmented Generation (RAG)-Large Language Model (LLM) as a Clinical Decision Support System (CDSS) for safe medication prescription. This model addresses the limitations of traditional rule-based CDSS by providing relevant prescribing error alerts tailored to patient context and institutional guidelines.   Objective: The study evaluates the efficacy of an LLM-based CDSS in identifying medication errors across various medical and surgical case vignettes, compared to a human expert panel. It also examines clinician preferences among different CDSS integration modalities: junior pharmacist, LLM-based CDSS alone, and a combination of both.   Design, Setting, and Participants: Utilizing a RAG model with GPT-4.0, the study involved 61 prescribing error scenarios within 23 clinical vignettes across 12 specialties. An expert panel assessed these cases using the PCNE classification and NCC MERP index. Three junior pharmacists independently reviewed eac",
    "link": "https://arxiv.org/abs/2402.01741",
    "context": "Title: Development and Testing of a Novel Large Language Model-Based Clinical Decision Support Systems for Medication Safety in 12 Clinical Specialties\nAbstract: Importance: We introduce a novel Retrieval Augmented Generation (RAG)-Large Language Model (LLM) as a Clinical Decision Support System (CDSS) for safe medication prescription. This model addresses the limitations of traditional rule-based CDSS by providing relevant prescribing error alerts tailored to patient context and institutional guidelines.   Objective: The study evaluates the efficacy of an LLM-based CDSS in identifying medication errors across various medical and surgical case vignettes, compared to a human expert panel. It also examines clinician preferences among different CDSS integration modalities: junior pharmacist, LLM-based CDSS alone, and a combination of both.   Design, Setting, and Participants: Utilizing a RAG model with GPT-4.0, the study involved 61 prescribing error scenarios within 23 clinical vignettes across 12 specialties. An expert panel assessed these cases using the PCNE classification and NCC MERP index. Three junior pharmacists independently reviewed eac",
    "path": "papers/24/02/2402.01741.json",
    "total_tokens": 1049,
    "translated_title": "开发并测试一种新的基于大型语言模型的临床决策支持系统，用于药物安全的12种临床专业",
    "translated_abstract": "重要性：我们介绍了一种新颖的基于检索增强生成（RAG）-大型语言模型（LLM）的临床决策支持系统（CDSS），用于安全用药处方。该模型通过提供与患者背景和机构指南相关的处方错误警报，解决了传统基于规则的CDSS的局限性。目标：本研究评估了基于LLM的CDSS在识别各种医学和外科病例中的药物错误方面的有效性，与人工专家小组进行比较。它还研究了临床医生在不同CDSS集成方式（初级药师、仅基于LLM的CDSS和二者的组合）中的偏好。设计、设置和参与者：利用带有GPT-4.0的RAG模型，本研究涉及12个专业中23个临床案例的61个处方错误场景。专家小组使用PCNE分类和NCC MERP指数评估这些案例。三名初级药师独立审核每个场景，并提出处理建议。根据检查的错误和建议编制了反馈报告。 然后，三名医生独立审核这些报告，并提出对下一步处理的意见。",
    "tldr": "本研究开发并测试了一种新的基于大型语言模型的临床决策支持系统，用于在12个临床专业中提供安全的药物处方。该系统通过定制的处方错误警报解决了传统基于规则的系统的局限性，并评估了其在识别药物错误方面的有效性和临床医生的偏好。"
}