{
    "title": "Differentiable and accelerated wavelet transforms on the sphere and ball",
    "abstract": "Directional wavelet dictionaries are hierarchical representations which efficiently capture and segment information across scale, location and orientation. Such representations demonstrate a particular affinity to physical signals, which often exhibit highly anisotropic, localised multiscale structure. Many physically important signals are observed over spherical domains, such as the celestial sky in cosmology. Leveraging recent advances in computational harmonic analysis, we design new highly distributable and automatically differentiable directional wavelet transforms on the $2$-dimensional sphere $\\mathbb{S}^2$ and $3$-dimensional ball $\\mathbb{B}^3 = \\mathbb{R}^+ \\times \\mathbb{S}^2$ (the space formed by augmenting the sphere with the radial half-line). We observe up to a $300$-fold and $21800$-fold acceleration for signals on the sphere and ball, respectively, compared to existing software, whilst maintaining 64-bit machine precision. Not only do these algorithms dramatically acce",
    "link": "https://rss.arxiv.org/abs/2402.01282",
    "context": "Title: Differentiable and accelerated wavelet transforms on the sphere and ball\nAbstract: Directional wavelet dictionaries are hierarchical representations which efficiently capture and segment information across scale, location and orientation. Such representations demonstrate a particular affinity to physical signals, which often exhibit highly anisotropic, localised multiscale structure. Many physically important signals are observed over spherical domains, such as the celestial sky in cosmology. Leveraging recent advances in computational harmonic analysis, we design new highly distributable and automatically differentiable directional wavelet transforms on the $2$-dimensional sphere $\\mathbb{S}^2$ and $3$-dimensional ball $\\mathbb{B}^3 = \\mathbb{R}^+ \\times \\mathbb{S}^2$ (the space formed by augmenting the sphere with the radial half-line). We observe up to a $300$-fold and $21800$-fold acceleration for signals on the sphere and ball, respectively, compared to existing software, whilst maintaining 64-bit machine precision. Not only do these algorithms dramatically acce",
    "path": "papers/24/02/2402.01282.json",
    "total_tokens": 883,
    "translated_title": "在球面和球上的可微分和加速小波变换",
    "translated_abstract": "方向小波字典是一种层次结构的表示方法，可以高效地捕捉和分割各种尺度、位置和方向上的信息。这种表示方法对于物理信号具有特殊的亲和性，因为物理信号通常具有高各向异性、局部多尺度结构。许多重要的物理信号在球形域上观测，例如宇宙学中的天空。借助最近在计算谐波分析方面的进展，我们设计了新的高度可分布和自动可微分的方向小波变换，应用于二维球面S^2和三维球体B^3=R^+ x S^2（通过将球面与径向半线结合而形成的空间）。与现有软件相比，我们观察到球面和球上信号的加速比分别高达300倍和21800倍，同时保持64位机器精度。这些算法不仅在加速领域取得了显著的进展，同时具有可微分性质。",
    "tldr": "本研究设计了新的高度可分布和自动可微分的方向小波变换，在球面和球上的信号处理中取得了显著的加速效果，同时保持高精度，具有重要的实际应用价值。"
}