{
    "title": "Fluent dreaming for language models",
    "abstract": "Feature visualization, also known as \"dreaming\", offers insights into vision models by optimizing the inputs to maximize a neuron's activation or other internal component. However, dreaming has not been successfully applied to language models because the input space is discrete. We extend Greedy Coordinate Gradient, a method from the language model adversarial attack literature, to design the Evolutionary Prompt Optimization (EPO) algorithm. EPO optimizes the input prompt to simultaneously maximize the Pareto frontier between a chosen internal feature and prompt fluency, enabling fluent dreaming for language models. We demonstrate dreaming with neurons, output logits and arbitrary directions in activation space. We measure the fluency of the resulting prompts and compare language model dreaming with max-activating dataset examples. Critically, fluent dreaming allows automatically exploring the behavior of model internals in reaction to mildly out-of-distribution prompts. Code for runni",
    "link": "https://arxiv.org/abs/2402.01702",
    "context": "Title: Fluent dreaming for language models\nAbstract: Feature visualization, also known as \"dreaming\", offers insights into vision models by optimizing the inputs to maximize a neuron's activation or other internal component. However, dreaming has not been successfully applied to language models because the input space is discrete. We extend Greedy Coordinate Gradient, a method from the language model adversarial attack literature, to design the Evolutionary Prompt Optimization (EPO) algorithm. EPO optimizes the input prompt to simultaneously maximize the Pareto frontier between a chosen internal feature and prompt fluency, enabling fluent dreaming for language models. We demonstrate dreaming with neurons, output logits and arbitrary directions in activation space. We measure the fluency of the resulting prompts and compare language model dreaming with max-activating dataset examples. Critically, fluent dreaming allows automatically exploring the behavior of model internals in reaction to mildly out-of-distribution prompts. Code for runni",
    "path": "papers/24/02/2402.01702.json",
    "total_tokens": 876,
    "translated_title": "语言模型的流畅梦境",
    "translated_abstract": "特征可视化，也称为“梦境”，通过优化输入以最大化神经元的激活或其他内部组件，为视觉模型提供了洞察力。然而，由于输入空间是离散的，梦境在语言模型上尚未成功应用。我们对语言模型对抗攻击文献中的贪婪坐标梯度方法进行了扩展，设计了进化提示优化（EPO）算法。EPO优化输入提示，以同时最大化所选内部特征和提示流畅性之间的帕累托前沿，实现语言模型的流畅梦境。我们演示了使用神经元、输出logits和激活空间中的任意方向进行梦境。我们衡量了生成的提示的流畅性，并将语言模型的梦境与最大激活数据集示例进行了比较。关键是，流畅梦境允许自动探索模型内部对轻度分布之外的提示的行为反应。用于运行的代码",
    "tldr": "扩展了贪婪坐标梯度方法，设计了进化提示优化算法，实现了语言模型的流畅梦境，能够同时最大化内部特征和提示流畅性，可以自动探索模型对轻度分布之外提示的反应。",
    "en_tdlr": "This paper extends the Greedy Coordinate Gradient method and introduces the Evolutionary Prompt Optimization algorithm for fluent dreaming in language models. It allows exploration of model reactions to out-of-distribution prompts by maximizing both internal features and prompt fluency."
}