{
    "title": "Target Score Matching",
    "abstract": "Denoising Score Matching estimates the score of a noised version of a target distribution by minimizing a regression loss and is widely used to train the popular class of Denoising Diffusion Models. A well known limitation of Denoising Score Matching, however, is that it yields poor estimates of the score at low noise levels. This issue is particularly unfavourable for problems in the physical sciences and for Monte Carlo sampling tasks for which the score of the clean original target is known. Intuitively, estimating the score of a slightly noised version of the target should be a simple task in such cases. In this paper, we address this shortcoming and show that it is indeed possible to leverage knowledge of the target score. We present a Target Score Identity and corresponding Target Score Matching regression loss which allows us to obtain score estimates admitting favourable properties at low noise levels.",
    "link": "https://arxiv.org/abs/2402.08667",
    "context": "Title: Target Score Matching\nAbstract: Denoising Score Matching estimates the score of a noised version of a target distribution by minimizing a regression loss and is widely used to train the popular class of Denoising Diffusion Models. A well known limitation of Denoising Score Matching, however, is that it yields poor estimates of the score at low noise levels. This issue is particularly unfavourable for problems in the physical sciences and for Monte Carlo sampling tasks for which the score of the clean original target is known. Intuitively, estimating the score of a slightly noised version of the target should be a simple task in such cases. In this paper, we address this shortcoming and show that it is indeed possible to leverage knowledge of the target score. We present a Target Score Identity and corresponding Target Score Matching regression loss which allows us to obtain score estimates admitting favourable properties at low noise levels.",
    "path": "papers/24/02/2402.08667.json",
    "total_tokens": 784,
    "translated_title": "目标分数匹配",
    "translated_abstract": "噪声分数匹配通过最小化回归损失来估计目标分布的噪声版本的分数，并广泛用于训练流行的去噪扩散模型。然而，众所周知，噪声分数匹配的一个局限性是在低噪声水平下会产生较差的分数估计。这个问题在物理科学和对于已知干净的原始目标分数的蒙特卡洛抽样任务中特别不利。直观地说，在这些情况下，估计目标稍有噪声版本的分数应该是一个简单的任务。在本文中，我们解决了这个缺点，并展示了利用目标分数的知识确实可以实现。我们提出了目标分数身份和相应的目标分数匹配回归损失，这使我们能够在低噪声水平下获得具有有利属性的分数估计。",
    "tldr": "本文提出了目标分数匹配方法，通过最小化回归损失来估计目标分布的噪声版本的分数。与传统的噪声分数匹配方法不同，该方法在低噪声水平下能够获得更准确的分数估计。"
}