{
    "title": "Bangla AI: A Framework for Machine Translation Utilizing Large Language Models for Ethnic Media",
    "abstract": "arXiv:2402.14179v1 Announce Type: cross  Abstract: Ethnic media, which caters to diaspora communities in host nations, serves as a vital platform for these communities to both produce content and access information. Rather than utilizing the language of the host nation, ethnic media delivers news in the language of the immigrant community. For instance, in the USA, Bangla ethnic media presents news in Bangla rather than English. This research delves into the prospective integration of large language models (LLM) and multi-lingual machine translations (MMT) within the ethnic media industry. It centers on the transformative potential of using LLM in MMT in various facets of news translation, searching, and categorization. The paper outlines a theoretical framework elucidating the integration of LLM and MMT into the news searching and translation processes for ethnic media. Additionally, it briefly addresses the potential ethical challenges associated with the incorporation of LLM and MMT",
    "link": "https://arxiv.org/abs/2402.14179",
    "context": "Title: Bangla AI: A Framework for Machine Translation Utilizing Large Language Models for Ethnic Media\nAbstract: arXiv:2402.14179v1 Announce Type: cross  Abstract: Ethnic media, which caters to diaspora communities in host nations, serves as a vital platform for these communities to both produce content and access information. Rather than utilizing the language of the host nation, ethnic media delivers news in the language of the immigrant community. For instance, in the USA, Bangla ethnic media presents news in Bangla rather than English. This research delves into the prospective integration of large language models (LLM) and multi-lingual machine translations (MMT) within the ethnic media industry. It centers on the transformative potential of using LLM in MMT in various facets of news translation, searching, and categorization. The paper outlines a theoretical framework elucidating the integration of LLM and MMT into the news searching and translation processes for ethnic media. Additionally, it briefly addresses the potential ethical challenges associated with the incorporation of LLM and MMT",
    "path": "papers/24/02/2402.14179.json",
    "total_tokens": 888,
    "translated_title": "孟加拉AI：利用大型语言模型进行族裔媒体机器翻译的框架",
    "translated_abstract": "民族媒体是为驻留在东道国的侨民社区提供服务的重要平台，既服务于这些社区制作内容，又让他们获取信息。与使用东道国语言不同，民族媒体以移民社区的语言发布新闻。举例来说，在美国，孟加拉族裔媒体使用孟加拉语而不是英语发布新闻。本研究探讨了在民族媒体领域潜在整合大型语言模型（LLM）和多语言机器翻译（MMT）的可能性。它着重探讨了在新闻翻译、搜索和分类的各个方面中使用LLM进行MMT的变革潜力。论文概述了一个理论框架，阐明了如何将LLM和MMT整合到民族媒体的新闻搜索和翻译过程中。此外，它还简要讨论了与LLM和MMT整合相关的潜在伦理挑战。",
    "tldr": "该研究探讨了如何在民族媒体领域整合大型语言模型和多语言机器翻译，以提升新闻翻译、搜索和分类的效率和准确性。",
    "en_tdlr": "This research explores the integration of large language models and multilingual machine translation in ethnic media to enhance the efficiency and accuracy of news translation, searching, and categorization."
}