{
    "title": "Social Convos: Capturing Agendas and Emotions on Social Media",
    "abstract": "arXiv:2402.15571v1 Announce Type: cross  Abstract: Social media platforms are popular tools for disseminating targeted information during major public events like elections or pandemics. Systematic analysis of the message traffic can provide valuable insights into prevailing opinions and social dynamics among different segments of the population. We are specifically interested in influence spread, and in particular whether more deliberate influence operations can be detected. However, filtering out the essential messages with telltale influence indicators from the extensive and often chaotic social media traffic is a major challenge. In this paper we present a novel approach to extract influence indicators from messages circulating among groups of users discussing particular topics. We build upon the concept of a convo to identify influential authors who are actively promoting some particular agenda around that topic within the group. We focus on two influence indicators: the (control ",
    "link": "https://arxiv.org/abs/2402.15571",
    "context": "Title: Social Convos: Capturing Agendas and Emotions on Social Media\nAbstract: arXiv:2402.15571v1 Announce Type: cross  Abstract: Social media platforms are popular tools for disseminating targeted information during major public events like elections or pandemics. Systematic analysis of the message traffic can provide valuable insights into prevailing opinions and social dynamics among different segments of the population. We are specifically interested in influence spread, and in particular whether more deliberate influence operations can be detected. However, filtering out the essential messages with telltale influence indicators from the extensive and often chaotic social media traffic is a major challenge. In this paper we present a novel approach to extract influence indicators from messages circulating among groups of users discussing particular topics. We build upon the concept of a convo to identify influential authors who are actively promoting some particular agenda around that topic within the group. We focus on two influence indicators: the (control ",
    "path": "papers/24/02/2402.15571.json",
    "total_tokens": 814,
    "translated_title": "Social Convos: 捕捉社交媒体上的议程和情绪",
    "translated_abstract": "社交媒体平台是在类似选举或流行病等重大公共事件期间传播有针对性信息的热门工具。对信息流量的系统分析可以为不同人群之间的主流观点和社会动态提供宝贵见解。我们特别关注影响传播，特别是是否能够检测到更有意图的影响操作。然而，过滤出具有显著影响指标的基本信息，以及通常混乱的社交媒体流量是一个重大挑战。在本文中，我们提出了一种新方法，从围绕特定话题讨论的用户群之间传播的信息中提取影响指标。我们建立在\"对话\"的概念上，以识别积极推动该话题周围某种特定议程的有影响力的作者。我们专注于两个影响指标：（控制）",
    "tldr": "本文提出了一种新颖的方法，用于从讨论特定话题的用户群之间传播的信息中提取影响指标，重点关注影响传播和检测更有意图的影响操作。",
    "en_tdlr": "This paper presents a novel approach to extract influence indicators from messages circulating among groups of users discussing specific topics, focusing on influence spread and detecting more deliberate influence operations."
}