{
    "title": "PANDAS: Prototype-based Novel Class Discovery and Detection",
    "abstract": "arXiv:2402.17420v1 Announce Type: cross  Abstract: Object detectors are typically trained once and for all on a fixed set of classes. However, this closed-world assumption is unrealistic in practice, as new classes will inevitably emerge after the detector is deployed in the wild. In this work, we look at ways to extend a detector trained for a set of base classes so it can i) spot the presence of novel classes, and ii) automatically enrich its repertoire to be able to detect those newly discovered classes together with the base ones. We propose PANDAS, a method for novel class discovery and detection. It discovers clusters representing novel classes from unlabeled data, and represents old and new classes with prototypes. During inference, a distance-based classifier uses these prototypes to assign a label to each detected object instance. The simplicity of our method makes it widely applicable. We experimentally demonstrate the effectiveness of PANDAS on the VOC 2012 and COCO-to-LVIS ",
    "link": "https://arxiv.org/abs/2402.17420",
    "context": "Title: PANDAS: Prototype-based Novel Class Discovery and Detection\nAbstract: arXiv:2402.17420v1 Announce Type: cross  Abstract: Object detectors are typically trained once and for all on a fixed set of classes. However, this closed-world assumption is unrealistic in practice, as new classes will inevitably emerge after the detector is deployed in the wild. In this work, we look at ways to extend a detector trained for a set of base classes so it can i) spot the presence of novel classes, and ii) automatically enrich its repertoire to be able to detect those newly discovered classes together with the base ones. We propose PANDAS, a method for novel class discovery and detection. It discovers clusters representing novel classes from unlabeled data, and represents old and new classes with prototypes. During inference, a distance-based classifier uses these prototypes to assign a label to each detected object instance. The simplicity of our method makes it widely applicable. We experimentally demonstrate the effectiveness of PANDAS on the VOC 2012 and COCO-to-LVIS ",
    "path": "papers/24/02/2402.17420.json",
    "total_tokens": 887,
    "translated_title": "PANDAS: 基于原型的新类别发现与检测",
    "translated_abstract": "目标检测器通常在固定的一组类别上进行一次训练。然而，这种封闭世界的假设在实践中是不现实的，因为在检测器部署在野外后，新的类别必然会出现。在这项工作中，我们研究了扩展训练为一组基础类别的检测器的方法，使其能够 i) 发现新类别的存在，并 ii) 自动丰富其库以能够检测这些新发现的类别以及基础类别。我们提出了 PANDAS，一种用于新类别发现和检测的方法。它从无标签数据中发现代表新类别的聚类，并用原型来表示旧类别和新类别。在推断过程中，基于距离的分类器使用这些原型为每个检测到的对象实例分配标签。我们的方法的简单性使其具有广泛的适用性。我们在VOC 2012和COCO-to-LVIS数据集上通过实验展示了PANDAS的有效性。",
    "tldr": "PANDAS是一种用于新类别发现和检测的方法，通过从无标签数据中发现代表新类别的聚类，并用原型表示类别，实现了在基础类别的基础上检测新发现的类别。",
    "en_tdlr": "PANDAS is a method for novel class discovery and detection that discovers clusters representing novel classes from unlabeled data and represents classes with prototypes, enabling the detection of newly discovered classes on top of the base classes."
}