{
    "title": "TIAViz: A Browser-based Visualization Tool for Computational Pathology Models",
    "abstract": "arXiv:2402.09990v1 Announce Type: cross  Abstract: Digital pathology has gained significant traction in modern healthcare systems. This shift from optical microscopes to digital imagery brings with it the potential for improved diagnosis, efficiency, and the integration of AI tools into the pathologists workflow. A critical aspect of this is visualization. Throughout the development of a machine learning (ML) model in digital pathology, it is crucial to have flexible, openly available tools to visualize models, from their outputs and predictions to the underlying annotations and images used to train or test a model. We introduce TIAViz, a Python-based visualization tool built into TIAToolbox which allows flexible, interactive, fully zoomable overlay of a wide variety of information onto whole slide images, including graphs, heatmaps, segmentations, annotations and other WSIs. The UI is browser-based, allowing use either locally, on a remote machine, or on a server to provide publicly a",
    "link": "https://arxiv.org/abs/2402.09990",
    "context": "Title: TIAViz: A Browser-based Visualization Tool for Computational Pathology Models\nAbstract: arXiv:2402.09990v1 Announce Type: cross  Abstract: Digital pathology has gained significant traction in modern healthcare systems. This shift from optical microscopes to digital imagery brings with it the potential for improved diagnosis, efficiency, and the integration of AI tools into the pathologists workflow. A critical aspect of this is visualization. Throughout the development of a machine learning (ML) model in digital pathology, it is crucial to have flexible, openly available tools to visualize models, from their outputs and predictions to the underlying annotations and images used to train or test a model. We introduce TIAViz, a Python-based visualization tool built into TIAToolbox which allows flexible, interactive, fully zoomable overlay of a wide variety of information onto whole slide images, including graphs, heatmaps, segmentations, annotations and other WSIs. The UI is browser-based, allowing use either locally, on a remote machine, or on a server to provide publicly a",
    "path": "papers/24/02/2402.09990.json",
    "total_tokens": 886,
    "translated_title": "TIAViz：一种基于浏览器的计算病理学模型可视化工具",
    "translated_abstract": "数字病理学在现代医疗系统中获得了显著的关注。这种从光学显微镜到数字图像的转变带来了提高诊断效率和将人工智能工具整合到病理学家工作流程中的潜力。其中一个关键方面是可视化。在数字病理学中开发机器学习（ML）模型的过程中，拥有灵活、开放的可视化工具以可视化模型的输出、预测以及用于训练或测试模型的底层注释和图像至关重要。我们介绍了TIAViz，它是一个基于Python的可视化工具，内置于TIAToolbox中，允许在整个切片图像上灵活、交互式、完全可缩放地叠加各种信息，包括图表、热图、分割、标注和其他WSI。用户界面基于浏览器，可以在本地、远程计算机上或服务器上使用，提供公开访问。",
    "tldr": "TIAViz是一种基于浏览器的计算病理学模型可视化工具，可以灵活、交互式地显示图表、热图、分割、标注和其他信息在整个切片图像上。",
    "en_tdlr": "TIAViz is a browser-based visualization tool for computational pathology models, allowing flexible and interactive display of graphs, heatmaps, segmentations, annotations, and other information on whole slide images."
}