{
    "title": "Learning solutions of parametric Navier-Stokes with physics-informed neural networks",
    "abstract": "We leverage Physics-Informed Neural Networks (PINNs) to learn solution functions of parametric Navier-Stokes Equations (NSE). Our proposed approach results in a feasible optimization problem setup that bypasses PINNs' limitations in converging to solutions of highly nonlinear parametric-PDEs like NSE. We consider the parameter(s) of interest as inputs of PINNs along with spatio-temporal coordinates, and train PINNs on generated numerical solutions of parametric-PDES for instances of the parameters. We perform experiments on the classical 2D flow past cylinder problem aiming to learn velocities and pressure functions over a range of Reynolds numbers as parameter of interest. Provision of training data from generated numerical simulations allows for interpolation of the solution functions for a range of parameters. Therefore, we compare PINNs with unconstrained conventional Neural Networks (NN) on this problem setup to investigate the effectiveness of considering the PDEs regularization ",
    "link": "https://arxiv.org/abs/2402.03153",
    "context": "Title: Learning solutions of parametric Navier-Stokes with physics-informed neural networks\nAbstract: We leverage Physics-Informed Neural Networks (PINNs) to learn solution functions of parametric Navier-Stokes Equations (NSE). Our proposed approach results in a feasible optimization problem setup that bypasses PINNs' limitations in converging to solutions of highly nonlinear parametric-PDEs like NSE. We consider the parameter(s) of interest as inputs of PINNs along with spatio-temporal coordinates, and train PINNs on generated numerical solutions of parametric-PDES for instances of the parameters. We perform experiments on the classical 2D flow past cylinder problem aiming to learn velocities and pressure functions over a range of Reynolds numbers as parameter of interest. Provision of training data from generated numerical simulations allows for interpolation of the solution functions for a range of parameters. Therefore, we compare PINNs with unconstrained conventional Neural Networks (NN) on this problem setup to investigate the effectiveness of considering the PDEs regularization ",
    "path": "papers/24/02/2402.03153.json",
    "total_tokens": 871,
    "translated_title": "使用物理合理的神经网络学习参数化的Navier-Stokes方程的解决方案",
    "translated_abstract": "我们利用物理合理的神经网络（PINNs）来学习参数化的Navier-Stokes方程（NSE）的解决方案函数。我们提出的方法在可行的优化问题设置中绕过了PINNs在收敛到高度非线性参数化PDEs（如NSE）的解决方案时的局限性。我们将感兴趣的参数作为PINNs的输入，与时空坐标一起训练PINNs，使用参数的实例生成的数值解的训练数据对PINNs进行训练。我们在经典的二维圆柱流问题上进行实验，旨在学习在一定范围的雷诺数作为感兴趣参数时的速度和压力函数。使用来自生成的数值模拟的训练数据，可以对一系列参数进行解决方案函数的插值。因此，我们将PINNs与无约束的传统神经网络（NN）在这个问题设置上进行比较，以研究考虑PDE的正则化的效果。",
    "tldr": "本论文利用物理合理的神经网络学习参数化的Navier-Stokes方程的解决方案函数，并通过生成的数值解进行训练，实现了对一系列参数下的速度和压力函数的插值。"
}