{
    "title": "Bias correction of wind power forecasts with SCADA data and continuous learning",
    "abstract": "arXiv:2402.13916v1 Announce Type: new  Abstract: Wind energy plays a critical role in the transition towards renewable energy sources. However, the uncertainty and variability of wind can impede its full potential and the necessary growth of wind power capacity. To mitigate these challenges, wind power forecasting methods are employed for applications in power management, energy trading, or maintenance scheduling. In this work, we present, evaluate, and compare four machine learning-based wind power forecasting models. Our models correct and improve 48-hour forecasts extracted from a numerical weather prediction (NWP) model. The models are evaluated on datasets from a wind park comprising 65 wind turbines. The best improvement in forecasting error and mean bias was achieved by a convolutional neural network, reducing the average NRMSE down to 22%, coupled with a significant reduction in mean bias, compared to a NRMSE of 35% from the strongly biased baseline model using uncorrected NWP ",
    "link": "https://arxiv.org/abs/2402.13916",
    "context": "Title: Bias correction of wind power forecasts with SCADA data and continuous learning\nAbstract: arXiv:2402.13916v1 Announce Type: new  Abstract: Wind energy plays a critical role in the transition towards renewable energy sources. However, the uncertainty and variability of wind can impede its full potential and the necessary growth of wind power capacity. To mitigate these challenges, wind power forecasting methods are employed for applications in power management, energy trading, or maintenance scheduling. In this work, we present, evaluate, and compare four machine learning-based wind power forecasting models. Our models correct and improve 48-hour forecasts extracted from a numerical weather prediction (NWP) model. The models are evaluated on datasets from a wind park comprising 65 wind turbines. The best improvement in forecasting error and mean bias was achieved by a convolutional neural network, reducing the average NRMSE down to 22%, coupled with a significant reduction in mean bias, compared to a NRMSE of 35% from the strongly biased baseline model using uncorrected NWP ",
    "path": "papers/24/02/2402.13916.json",
    "total_tokens": 899,
    "translated_title": "利用SCADA数据和连续学习进行风力发电预测的偏差校正",
    "translated_abstract": "风能在向可再生能源过渡中扮演着关键角色，然而，风力的不确定性和变化性可能会限制其全面潜力和风电容量的必要增长。为了减轻这些挑战，风力预测方法被应用于电力管理、能源交易或维护调度等应用中。本文提出、评估并比较了四种基于机器学习的风力预测模型。我们的模型对从数值天气预报（NWP）模型提取的48小时预测进行了校正和改进。模型在包含65台风力涡轮机的风电场数据集上进行了评估。卷积神经网络取得了最佳的预测误差和平均偏差改进，将平均NRMSE降低到22%，与未校正NWP使用的强偏差基线模型的35%的NRMSE相比，偏差显著降低。",
    "tldr": "本研究利用机器学习方法对风力发电进行预测，通过校正数值天气预报模型提取的48小时预测数据，其中卷积神经网络取得了最佳的预测效果，将平均NRMSE降低至22%。",
    "en_tdlr": "This study utilizes machine learning methods to forecast wind power by correcting 48-hour forecasts extracted from numerical weather prediction models, with a convolutional neural network achieving the best prediction performance and reducing the average NRMSE to 22%."
}