{
    "title": "From Summary to Action: Enhancing Large Language Models for Complex Tasks with Open World APIs",
    "abstract": "arXiv:2402.18157v1 Announce Type: new  Abstract: The distinction between humans and animals lies in the unique ability of humans to use and create tools. Tools empower humans to overcome physiological limitations, fostering the creation of magnificent civilizations. Similarly, enabling foundational models like Large Language Models (LLMs) with the capacity to learn external tool usage may serve as a pivotal step toward realizing artificial general intelligence. Previous studies in this field have predominantly pursued two distinct approaches to augment the tool invocation capabilities of LLMs. The first approach emphasizes the construction of relevant datasets for model fine-tuning. The second approach, in contrast, aims to fully exploit the inherent reasoning abilities of LLMs through in-context learning strategies. In this work, we introduce a novel tool invocation pipeline designed to control massive real-world APIs. This pipeline mirrors the human task-solving process, addressing c",
    "link": "https://arxiv.org/abs/2402.18157",
    "context": "Title: From Summary to Action: Enhancing Large Language Models for Complex Tasks with Open World APIs\nAbstract: arXiv:2402.18157v1 Announce Type: new  Abstract: The distinction between humans and animals lies in the unique ability of humans to use and create tools. Tools empower humans to overcome physiological limitations, fostering the creation of magnificent civilizations. Similarly, enabling foundational models like Large Language Models (LLMs) with the capacity to learn external tool usage may serve as a pivotal step toward realizing artificial general intelligence. Previous studies in this field have predominantly pursued two distinct approaches to augment the tool invocation capabilities of LLMs. The first approach emphasizes the construction of relevant datasets for model fine-tuning. The second approach, in contrast, aims to fully exploit the inherent reasoning abilities of LLMs through in-context learning strategies. In this work, we introduce a novel tool invocation pipeline designed to control massive real-world APIs. This pipeline mirrors the human task-solving process, addressing c",
    "path": "papers/24/02/2402.18157.json",
    "total_tokens": 821,
    "translated_title": "从总结到行动：利用开放世界API增强复杂任务的大型语言模型",
    "translated_abstract": "人类与动物之间的区别在于人类具有使用和创造工具的独特能力。工具使人类能够克服生理限制，促进了宏伟文明的创造。类似地，将像大型语言模型（LLMs）这样的基础模型赋予学习外部工具使用能力可能是实现人工智能的关键一步。本领域先前的研究主要追求两种不同的方法来增强LLMs的工具调用能力。第一种方法强调构建用于模型微调的相关数据集。相反，第二种方法旨在通过上下文学习策略充分利用LLMs固有的推理能力。在这项工作中，我们介绍了一个旨在控制大型现实世界API的创新工具调用管道。这一管道反映了人类解决任务的过程，解决了c",
    "tldr": "本研究引入了一个新颖的工具调用管道，旨在控制大规模现实世界API，从而增强大型语言模型在复杂任务中的应用能力。",
    "en_tdlr": "This study introduces a novel tool invocation pipeline designed to control massive real-world APIs, enhancing the application capability of large language models in complex tasks."
}