{
    "title": "The Role of Child Gender in the Formation of Parents' Social Networks",
    "abstract": "Social networks play an important role in various aspects of life. While extensive research has explored factors such as gender, race, and education in network formation, one dimension that has received less attention is the gender of one's child. Children tend to form friendships with same-gender peers, potentially leading their parents to interact based on their child's gender. Focusing on households with children aged 3-5, we leverage a rich dataset from rural Bangladesh to investigate the role of children's gender in parental network formation. We estimate an equilibrium model of network formation that considers a child's gender alongside other socioeconomic factors. Counterfactual analyses reveal that children's gender significantly shapes parents' network structure. Specifically, if all children share the same gender, households would have approximately 15% more links, with a stronger effect for families having girls. Importantly, the impact of children's gender on network struct",
    "link": "https://arxiv.org/abs/2402.04474",
    "context": "Title: The Role of Child Gender in the Formation of Parents' Social Networks\nAbstract: Social networks play an important role in various aspects of life. While extensive research has explored factors such as gender, race, and education in network formation, one dimension that has received less attention is the gender of one's child. Children tend to form friendships with same-gender peers, potentially leading their parents to interact based on their child's gender. Focusing on households with children aged 3-5, we leverage a rich dataset from rural Bangladesh to investigate the role of children's gender in parental network formation. We estimate an equilibrium model of network formation that considers a child's gender alongside other socioeconomic factors. Counterfactual analyses reveal that children's gender significantly shapes parents' network structure. Specifically, if all children share the same gender, households would have approximately 15% more links, with a stronger effect for families having girls. Importantly, the impact of children's gender on network struct",
    "path": "papers/24/02/2402.04474.json",
    "total_tokens": 960,
    "translated_title": "孩子的性别在父母社交网络形成中的作用",
    "translated_abstract": "社交网络在生活的各个方面起着重要的作用。尽管广泛的研究探索了性别、种族和教育等因素在网络形成中的作用，但一个得到较少关注的维度是孩子的性别。孩子倾向于与同性朋友形成友谊，这可能导致父母之间的互动基于他们孩子的性别。本研究以3-5岁孩子为对象，利用孟加拉农村的丰富数据来研究孩子的性别对父母网络形成的作用。我们估计了一个考虑了孩子性别和其他社会经济因素的网络形成均衡模型。对照分析结果表明，孩子的性别在父母网络结构中起到了重要的作用。具体来说，如果所有孩子都是同性别，家庭之间的联系将增加约15％，对于有女孩的家庭影响更为显著。重要的是，孩子的性别对网络结构的影响十分明显。",
    "tldr": "孩子的性别对父母社交网络的形成具有重要影响，孩子们倾向于与同性朋友交友，这导致了父母之间基于孩子性别的互动。研究发现，如果所有孩子都是同性别，家庭之间的联系将增加约15％，而对于有女孩的家庭影响更为明显。",
    "en_tdlr": "The gender of children significantly influences the formation of parents' social networks, as children tend to form friendships with peers of the same gender, leading parents to interact based on their child's gender. The study found that if all children share the same gender, households would have approximately 15% more links, with a stronger effect for families having girls."
}