{
    "title": "Unlocking Insights: Semantic Search in Jupyter Notebooks",
    "abstract": "arXiv:2402.13234v1 Announce Type: cross  Abstract: Semantic search, a process aimed at delivering highly relevant search results by comprehending the searcher's intent and the contextual meaning of terms within a searchable dataspace, plays a pivotal role in information retrieval. In this paper, we investigate the application of large language models to enhance semantic search capabilities, specifically tailored for the domain of Jupyter Notebooks. Our objective is to retrieve generated outputs, such as figures or tables, associated functions and methods, and other pertinent information.   We demonstrate a semantic search framework that achieves a comprehensive semantic understanding of the entire notebook's contents, enabling it to effectively handle various types of user queries. Key components of this framework include:   1). A data preprocessor is designed to handle diverse types of cells within Jupyter Notebooks, encompassing both markdown and code cells. 2). An innovative methodo",
    "link": "https://arxiv.org/abs/2402.13234",
    "context": "Title: Unlocking Insights: Semantic Search in Jupyter Notebooks\nAbstract: arXiv:2402.13234v1 Announce Type: cross  Abstract: Semantic search, a process aimed at delivering highly relevant search results by comprehending the searcher's intent and the contextual meaning of terms within a searchable dataspace, plays a pivotal role in information retrieval. In this paper, we investigate the application of large language models to enhance semantic search capabilities, specifically tailored for the domain of Jupyter Notebooks. Our objective is to retrieve generated outputs, such as figures or tables, associated functions and methods, and other pertinent information.   We demonstrate a semantic search framework that achieves a comprehensive semantic understanding of the entire notebook's contents, enabling it to effectively handle various types of user queries. Key components of this framework include:   1). A data preprocessor is designed to handle diverse types of cells within Jupyter Notebooks, encompassing both markdown and code cells. 2). An innovative methodo",
    "path": "papers/24/02/2402.13234.json",
    "total_tokens": 777,
    "translated_title": "在Jupyter笔记本中解锁洞见：语义搜索",
    "translated_abstract": "语义搜索旨在通过理解搜索者的意图和可搜索数据空间中术语的上下文含义，提供高度相关的搜索结果，在信息检索中起着至关重要的作用。本文探讨了应用大型语言模型增强语义搜索能力的方法，特别针对Jupyter笔记本领域进行了定制。我们的目标是检索生成的输出，如图表、关联函数和方法以及其他相关信息。我们展示了一个语义搜索框架，可以全面理解整个笔记本内容的语义，从而有效处理各种类型的用户查询。该框架的关键组成部分包括：1）设计了一个数据预处理器，用于处理Jupyter笔记本中各种类型的单元格，包括Markdown和代码单元格。2）一种创新的方法",
    "tldr": "本文探讨了在Jupyter笔记本中应用大型语言模型增强语义搜索能力的方法，展示了一个全面理解整个笔记本内容语义的搜索框架。",
    "en_tdlr": "This paper investigates the application of large language models to enhance semantic search capabilities in Jupyter Notebooks, demonstrating a search framework that comprehensively understands the semantic content of the entire notebook."
}