{
    "title": "Dropout-Based Rashomon Set Exploration for Efficient Predictive Multiplicity Estimation",
    "abstract": "Predictive multiplicity refers to the phenomenon in which classification tasks may admit multiple competing models that achieve almost-equally-optimal performance, yet generate conflicting outputs for individual samples. This presents significant concerns, as it can potentially result in systemic exclusion, inexplicable discrimination, and unfairness in practical applications. Measuring and mitigating predictive multiplicity, however, is computationally challenging due to the need to explore all such almost-equally-optimal models, known as the Rashomon set, in potentially huge hypothesis spaces. To address this challenge, we propose a novel framework that utilizes dropout techniques for exploring models in the Rashomon set. We provide rigorous theoretical derivations to connect the dropout parameters to properties of the Rashomon set, and empirically evaluate our framework through extensive experimentation. Numerical results show that our technique consistently outperforms baselines in",
    "link": "https://arxiv.org/abs/2402.00728",
    "context": "Title: Dropout-Based Rashomon Set Exploration for Efficient Predictive Multiplicity Estimation\nAbstract: Predictive multiplicity refers to the phenomenon in which classification tasks may admit multiple competing models that achieve almost-equally-optimal performance, yet generate conflicting outputs for individual samples. This presents significant concerns, as it can potentially result in systemic exclusion, inexplicable discrimination, and unfairness in practical applications. Measuring and mitigating predictive multiplicity, however, is computationally challenging due to the need to explore all such almost-equally-optimal models, known as the Rashomon set, in potentially huge hypothesis spaces. To address this challenge, we propose a novel framework that utilizes dropout techniques for exploring models in the Rashomon set. We provide rigorous theoretical derivations to connect the dropout parameters to properties of the Rashomon set, and empirically evaluate our framework through extensive experimentation. Numerical results show that our technique consistently outperforms baselines in",
    "path": "papers/24/02/2402.00728.json",
    "total_tokens": 864,
    "translated_title": "用于高效预测多重性评估的基于Dropout的拉肖蒙集探索",
    "translated_abstract": "预测多重性是指分类任务可能存在多个竞争模型，它们实现了几乎最优性能，但为单个样本生成了相互冲突的输出。这带来了显著的担忧，因为它可能导致系统性排除、难以解释的歧视和不公平的实际应用。然而，由于需要在可能庞大的假设空间中探索所有这些几乎最优的模型，即拉肖蒙集，度量和减轻预测多重性在计算上具有挑战性。为了应对这一挑战，我们提出了一个利用Dropout技术探索拉肖蒙集中模型的新框架。我们提供了严格的理论推导，将Dropout参数与拉肖蒙集的属性相连接，并通过广泛的实验对我们的框架进行了实证评价。数值结果显示，我们的技术在性能上始终优于基线模型。",
    "tldr": "本文提出了一种利用Dropout技术探索拉肖蒙集中模型的新框架，以度量和减轻预测多重性。通过严格的理论推导和广泛的实验评价，结果表明我们的技术始终优于基线模型。",
    "en_tdlr": "This paper proposes a novel framework that utilizes dropout techniques to explore models in the Rashomon set for measuring and mitigating predictive multiplicity. Empirical evaluation demonstrates that our technique consistently outperforms baselines."
}