{
    "title": "LogicPrpBank: A Corpus for Logical Implication and Equivalence",
    "abstract": "arXiv:2402.09609v1 Announce Type: cross  Abstract: Logic reasoning has been critically needed in problem-solving and decision-making. Although Language Models (LMs) have demonstrated capabilities of handling multiple reasoning tasks (e.g., commonsense reasoning), their ability to reason complex mathematical problems, specifically propositional logic, remains largely underexplored. This lack of exploration can be attributed to the limited availability of annotated corpora. Here, we present a well-labeled propositional logic corpus, LogicPrpBank, containing 7093 Propositional Logic Statements (PLSs) across six mathematical subjects, to study a brand-new task of reasoning logical implication and equivalence. We benchmark LogicPrpBank with widely-used LMs to show that our corpus offers a useful resource for this challenging task and there is ample room for model improvement.",
    "link": "https://arxiv.org/abs/2402.09609",
    "context": "Title: LogicPrpBank: A Corpus for Logical Implication and Equivalence\nAbstract: arXiv:2402.09609v1 Announce Type: cross  Abstract: Logic reasoning has been critically needed in problem-solving and decision-making. Although Language Models (LMs) have demonstrated capabilities of handling multiple reasoning tasks (e.g., commonsense reasoning), their ability to reason complex mathematical problems, specifically propositional logic, remains largely underexplored. This lack of exploration can be attributed to the limited availability of annotated corpora. Here, we present a well-labeled propositional logic corpus, LogicPrpBank, containing 7093 Propositional Logic Statements (PLSs) across six mathematical subjects, to study a brand-new task of reasoning logical implication and equivalence. We benchmark LogicPrpBank with widely-used LMs to show that our corpus offers a useful resource for this challenging task and there is ample room for model improvement.",
    "path": "papers/24/02/2402.09609.json",
    "total_tokens": 843,
    "translated_title": "LogicPrpBank：一个用于逻辑蕴含和等价的语料库",
    "translated_abstract": "逻辑推理在问题解决和决策中至关重要。虽然语言模型已经证明了处理多种推理任务（例如常识推理）的能力，但它们对于复杂的数学问题，特别是命题逻辑的推理能力仍然很少被探索。这种探索的不足可以归因于标注语料库的有限性。在这里，我们提供了一个经过良好标注的命题逻辑语料库LogicPrpBank，其中包含了7093个命题逻辑陈述（PLS）涵盖六个数学科目，以研究推理逻辑蕴含和等价的全新任务。我们使用广泛使用的语言模型对LogicPrpBank进行了基准测试，展示了我们的语料库为这一具有挑战性的任务提供了有用的资源，并且模型改进的空间还很大。",
    "tldr": "LogicPrpBank是一个新的命题逻辑语料库，用于研究逻辑蕴含和等价的任务。通过与现有的语言模型进行基准测试，展示了该语料库在这一具有挑战性的任务中提供了有用的资源，并且还有改进的空间。",
    "en_tdlr": "LogicPrpBank is a new propositional logic corpus for studying the task of logical implication and equivalence. Benchmarking with existing language models demonstrates that LogicPrpBank provides a useful resource for this challenging task, with room for further improvement."
}