{
    "title": "Assisting in Writing Wikipedia-like Articles From Scratch with Large Language Models",
    "abstract": "arXiv:2402.14207v1 Announce Type: cross  Abstract: We study how to apply large language models to write grounded and organized long-form articles from scratch, with comparable breadth and depth to Wikipedia pages. This underexplored problem poses new challenges at the pre-writing stage, including how to research the topic and prepare an outline prior to writing. We propose STORM, a writing system for the Synthesis of Topic Outlines through Retrieval and Multi-perspective Question Asking. STORM models the pre-writing stage by (1) discovering diverse perspectives in researching the given topic, (2) simulating conversations where writers carrying different perspectives pose questions to a topic expert grounded on trusted Internet sources, (3) curating the collected information to create an outline.   For evaluation, we curate FreshWiki, a dataset of recent high-quality Wikipedia articles, and formulate outline assessments to evaluate the pre-writing stage. We further gather feedback from ",
    "link": "https://arxiv.org/abs/2402.14207",
    "context": "Title: Assisting in Writing Wikipedia-like Articles From Scratch with Large Language Models\nAbstract: arXiv:2402.14207v1 Announce Type: cross  Abstract: We study how to apply large language models to write grounded and organized long-form articles from scratch, with comparable breadth and depth to Wikipedia pages. This underexplored problem poses new challenges at the pre-writing stage, including how to research the topic and prepare an outline prior to writing. We propose STORM, a writing system for the Synthesis of Topic Outlines through Retrieval and Multi-perspective Question Asking. STORM models the pre-writing stage by (1) discovering diverse perspectives in researching the given topic, (2) simulating conversations where writers carrying different perspectives pose questions to a topic expert grounded on trusted Internet sources, (3) curating the collected information to create an outline.   For evaluation, we curate FreshWiki, a dataset of recent high-quality Wikipedia articles, and formulate outline assessments to evaluate the pre-writing stage. We further gather feedback from ",
    "path": "papers/24/02/2402.14207.json",
    "total_tokens": 852,
    "translated_title": "用大型语言模型从头开始辅助撰写类似维基百科文章",
    "translated_abstract": "我们研究如何应用大型语言模型从头开始撰写基于事实和有条理的长篇文章，使其在广度和深度上与维基百科页面可媲美。这一尚未深入研究的问题在撰写前阶段提出了新的挑战，包括如何研究主题并准备大纲以便撰写。我们提出了STORM，一个用于通过检索和多视角提问进行主题概要合成的写作系统。STORM模拟了撰写前阶段，其中（1）发现研究给定主题的多样化观点，（2）模拟会话，撰写持有不同观点的作者向基于可信互联网来源的主题专家提问，（3）整理收集到的信息以创建大纲。为了评估，我们整理了FreshWiki，一个包含最新高质量维基百科文章的数据集，并制定了大纲评估指标以评估撰写前阶段。",
    "tldr": "提出了一种名为STORM的写作系统，用于通过检索和多视角提问合成主题概要，以辅助从头开始写类似维基百科的文章。",
    "en_tdlr": "Proposed a writing system called STORM that helps in writing Wikipedia-like articles from scratch by synthesizing topic outlines through retrieval and multi-perspective question asking."
}