{
    "title": "CEV-LM: Controlled Edit Vector Language Model for Shaping Natural Language Generations",
    "abstract": "arXiv:2402.14290v1 Announce Type: new  Abstract: As large-scale language models become the standard for text generation, there is a greater need to tailor the generations to be more or less concise, targeted, and informative, depending on the audience/application. Existing control approaches primarily adjust the semantic (e.g., emotion, topics), structural (e.g., syntax tree, parts-of-speech), and lexical (e.g., keyword/phrase inclusion) properties of text, but are insufficient to accomplish complex objectives such as pacing which control the complexity and readability of the text. In this paper, we introduce CEV-LM - a lightweight, semi-autoregressive language model that utilizes constrained edit vectors to control three complementary metrics (speed, volume, and circuitousness) that quantify the shape of text (e.g., pacing of content). We study an extensive set of state-of-the-art CTG models and find that CEV-LM provides significantly more targeted and precise control of these three m",
    "link": "https://arxiv.org/abs/2402.14290",
    "context": "Title: CEV-LM: Controlled Edit Vector Language Model for Shaping Natural Language Generations\nAbstract: arXiv:2402.14290v1 Announce Type: new  Abstract: As large-scale language models become the standard for text generation, there is a greater need to tailor the generations to be more or less concise, targeted, and informative, depending on the audience/application. Existing control approaches primarily adjust the semantic (e.g., emotion, topics), structural (e.g., syntax tree, parts-of-speech), and lexical (e.g., keyword/phrase inclusion) properties of text, but are insufficient to accomplish complex objectives such as pacing which control the complexity and readability of the text. In this paper, we introduce CEV-LM - a lightweight, semi-autoregressive language model that utilizes constrained edit vectors to control three complementary metrics (speed, volume, and circuitousness) that quantify the shape of text (e.g., pacing of content). We study an extensive set of state-of-the-art CTG models and find that CEV-LM provides significantly more targeted and precise control of these three m",
    "path": "papers/24/02/2402.14290.json",
    "total_tokens": 890,
    "translated_title": "CEV-LM: 受控编辑向量语言模型用于塑造自然语言生成",
    "translated_abstract": "随着大规模语言模型成为文本生成的标准，需要更多地定制生成的紧凑性、针对性和信息性，具体取决于受众/应用程序。现有的控制方法主要调整文本的语义（如情感、主题）、结构（如句法树、词性）和词汇（如关键词/短语包含），但无法实现复杂的目标，如控制文本的复杂性和可读性,我们引入了CEV-LM——一种轻量级、半自回归语言模型，利用受限制的编辑向量来控制三个补充度量（速度、音量和绕圈），以量化文本的形状（例如内容的节奏）。 我们研究了一系列最先进的CTG模型，发现CEV-LM 可显著更有针对性和精确地控制这三个量。",
    "tldr": "CEV-LM 是一个轻量、半自回归语言模型，利用受限制的编辑向量控制文本的速度、音量和绕圈度量，从而更精准地定制生成的文本形状，比现有控制方法具有更好的控制效果。",
    "en_tdlr": "CEV-LM is a lightweight, semi-autoregressive language model that utilizes constrained edit vectors to control the speed, volume, and circuitousness metrics of text shape, providing more precise control over text generation compared to existing methods."
}