{
    "title": "From explained variance of correlated components to PCA without orthogonality constraints",
    "abstract": "Block Principal Component Analysis (Block PCA) of a data matrix A, where loadings Z are determined by maximization of AZ 2 over unit norm orthogonal loadings, is difficult to use for the design of sparse PCA by 1 regularization, due to the difficulty of taking care of both the orthogonality constraint on loadings and the non differentiable 1 penalty. Our objective in this paper is to relax the orthogonality constraint on loadings by introducing new objective functions expvar(Y) which measure the part of the variance of the data matrix A explained by correlated components Y = AZ. So we propose first a comprehensive study of mathematical and numerical properties of expvar(Y) for two existing definitions Zou et al. [2006], Shen and Huang [2008] and four new definitions. Then we show that only two of these explained variance are fit to use as objective function in block PCA formulations for A rid of orthogonality constraints.",
    "link": "https://arxiv.org/abs/2402.04692",
    "context": "Title: From explained variance of correlated components to PCA without orthogonality constraints\nAbstract: Block Principal Component Analysis (Block PCA) of a data matrix A, where loadings Z are determined by maximization of AZ 2 over unit norm orthogonal loadings, is difficult to use for the design of sparse PCA by 1 regularization, due to the difficulty of taking care of both the orthogonality constraint on loadings and the non differentiable 1 penalty. Our objective in this paper is to relax the orthogonality constraint on loadings by introducing new objective functions expvar(Y) which measure the part of the variance of the data matrix A explained by correlated components Y = AZ. So we propose first a comprehensive study of mathematical and numerical properties of expvar(Y) for two existing definitions Zou et al. [2006], Shen and Huang [2008] and four new definitions. Then we show that only two of these explained variance are fit to use as objective function in block PCA formulations for A rid of orthogonality constraints.",
    "path": "papers/24/02/2402.04692.json",
    "total_tokens": 849,
    "translated_title": "从相关分量的解释方差到无正交约束的主成分分析",
    "translated_abstract": "针对数据矩阵A的块状主成分分析(Block PCA)中的加载Z由于在单位范数正交加载上最大化AZ的困难，使得使用1正则化来设计稀疏PCA变得困难，因为很难同时处理加载的正交约束和不可微的1惩罚。本文的目标是通过引入衡量数据矩阵A中由相关分量Y = AZ解释的方差部分的新目标函数expvar(Y)来放松加载的正交约束。因此，我们首先对两个现有定义Zou et al. [2006]和Shen and Huang [2008]的expvar(Y)进行了全面的数学和数值属性研究，并提出了四个新的定义。然后我们证明只有这两个解释方差才适合作为块状PCA形式中去除正交约束的目标函数。",
    "tldr": "本文提出了一种从相关分量的解释方差到无正交约束的主成分分析的方法，通过引入衡量数据矩阵A中由相关分量Y = AZ解释的方差部分的新目标函数expvar(Y)，放松了加载的正交约束。",
    "en_tdlr": "This paper proposes a method for Principal Component Analysis (PCA) without orthogonality constraints by introducing a new objective function, expvar(Y), which measures the part of the variance of the data matrix A explained by correlated components Y = AZ."
}