{
    "title": "Constraint Latent Space Matters: An Anti-anomalous Waveform Transformation Solution from Photoplethysmography to Arterial Blood Pressure",
    "abstract": "arXiv:2402.17780v1 Announce Type: cross  Abstract: Arterial blood pressure (ABP) holds substantial promise for proactive cardiovascular health management. Notwithstanding its potential, the invasive nature of ABP measurements confines their utility primarily to clinical environments, limiting their applicability for continuous monitoring beyond medical facilities. The conversion of photoplethysmography (PPG) signals into ABP equivalents has garnered significant attention due to its potential in revolutionizing cardiovascular disease management. Recent strides in PPG-to-ABP prediction encompass the integration of generative and discriminative models. Despite these advances, the efficacy of these models is curtailed by the latent space shift predicament, stemming from alterations in PPG data distribution across disparate hardware and individuals, potentially leading to distorted ABP waveforms. To tackle this problem, we present an innovative solution named the Latent Space Constraint Tra",
    "link": "https://arxiv.org/abs/2402.17780",
    "context": "Title: Constraint Latent Space Matters: An Anti-anomalous Waveform Transformation Solution from Photoplethysmography to Arterial Blood Pressure\nAbstract: arXiv:2402.17780v1 Announce Type: cross  Abstract: Arterial blood pressure (ABP) holds substantial promise for proactive cardiovascular health management. Notwithstanding its potential, the invasive nature of ABP measurements confines their utility primarily to clinical environments, limiting their applicability for continuous monitoring beyond medical facilities. The conversion of photoplethysmography (PPG) signals into ABP equivalents has garnered significant attention due to its potential in revolutionizing cardiovascular disease management. Recent strides in PPG-to-ABP prediction encompass the integration of generative and discriminative models. Despite these advances, the efficacy of these models is curtailed by the latent space shift predicament, stemming from alterations in PPG data distribution across disparate hardware and individuals, potentially leading to distorted ABP waveforms. To tackle this problem, we present an innovative solution named the Latent Space Constraint Tra",
    "path": "papers/24/02/2402.17780.json",
    "total_tokens": 925,
    "translated_title": "约束潜在空间的重要性：从激光脉动测血法到动脉血压的抗异常波形转换解决方案",
    "translated_abstract": "动脉血压（ABP）在积极的心血管健康管理方面拥有巨大潜力。尽管潜力巨大，但ABP测量的侵入性质限制了其主要用途仅限于临床环境，限制了其在医疗设施之外的连续监测适用性。将光谱脉搏图（PPG）信号转换为ABP等效物已引起广泛关注，因其有望革新心血管疾病管理。最近在PPG到ABP预测方面取得的进展包括生成模型和判别模型的整合。尽管这些进展，这些模型的效力受到潜在空间转移困境的限制，源于PPG数据分布在不同硬件和个体之间的变化，可能导致扭曲的ABP波形。为了解决这一问题，我们提出了一种名为潜在空间约束的创新解决方案",
    "tldr": "提出了一种名为潜在空间约束的创新解决方案，用于处理潜在空间转移困境，从而将光谱脉搏图（PPG）信号转换为准确的动脉血压等效物"
}