{
    "title": "Does the Use of Unusual Combinations of Datasets Contribute to Greater Scientific Impact?",
    "abstract": "Scientific datasets play a crucial role in contemporary data-driven research, as they allow for the progress of science by facilitating the discovery of new patterns and phenomena. This mounting demand for empirical research raises important questions on how strategic data utilization in research projects can stimulate scientific advancement. In this study, we examine the hypothesis inspired by the recombination theory, which suggests that innovative combinations of existing knowledge, including the use of unusual combinations of datasets, can lead to high-impact discoveries. We investigate the scientific outcomes of such atypical data combinations in more than 30,000 publications that leverage over 6,000 datasets curated within one of the largest social science databases, ICPSR. This study offers four important insights. First, combining datasets, particularly those infrequently paired, significantly contributes to both scientific and broader impacts (e.g., dissemination to the genera",
    "link": "https://arxiv.org/abs/2402.05024",
    "context": "Title: Does the Use of Unusual Combinations of Datasets Contribute to Greater Scientific Impact?\nAbstract: Scientific datasets play a crucial role in contemporary data-driven research, as they allow for the progress of science by facilitating the discovery of new patterns and phenomena. This mounting demand for empirical research raises important questions on how strategic data utilization in research projects can stimulate scientific advancement. In this study, we examine the hypothesis inspired by the recombination theory, which suggests that innovative combinations of existing knowledge, including the use of unusual combinations of datasets, can lead to high-impact discoveries. We investigate the scientific outcomes of such atypical data combinations in more than 30,000 publications that leverage over 6,000 datasets curated within one of the largest social science databases, ICPSR. This study offers four important insights. First, combining datasets, particularly those infrequently paired, significantly contributes to both scientific and broader impacts (e.g., dissemination to the genera",
    "path": "papers/24/02/2402.05024.json",
    "total_tokens": 792,
    "translated_title": "使用不寻常的数据集组合是否有助于更大的科学影响力？",
    "translated_abstract": "科学数据集在当代数据驱动研究中起着至关重要的作用，它们通过促进新模式和现象的发现，推动科学的进步。这种对实证研究的不断需求引发了关于如何在研究项目中战略性地利用数据以促进科学进步的重要问题。本研究基于重组理论提出了一个假设，即创新性地组合现有知识，包括使用不寻常的数据集组合，可以导致高影响的发现。我们调查了超过30,000篇文章中使用了超过6,000个数据集的社会科学数据库ICPSR中这种非典型数据组合的科学成果。本研究提供了四个重要的见解。首先，组合数据集，特别是那些不常见的组合，对科学和更广泛的影响（例如向一般公众传播）都有显著贡献。",
    "tldr": "使用不寻常的数据集组合可以显著贡献于科学和更广泛的影响，并促进科学的进步。",
    "en_tdlr": "Unusual combinations of datasets significantly contribute to both scientific and broader impacts and stimulate scientific advancement."
}