{
    "title": "TransFlower: An Explainable Transformer-Based Model with Flow-to-Flow Attention for Commuting Flow Prediction",
    "abstract": "arXiv:2402.15398v1 Announce Type: cross  Abstract: Understanding the link between urban planning and commuting flows is crucial for guiding urban development and policymaking. This research, bridging computer science and urban studies, addresses the challenge of integrating these fields with their distinct focuses. Traditional urban studies methods, like the gravity and radiation models, often underperform in complex scenarios due to their limited handling of multiple variables and reliance on overly simplistic and unrealistic assumptions, such as spatial isotropy. While deep learning models offer improved accuracy, their black-box nature poses a trade-off between performance and explainability -- both vital for analyzing complex societal phenomena like commuting flows. To address this, we introduce TransFlower, an explainable, transformer-based model employing flow-to-flow attention to predict urban commuting patterns. It features a geospatial encoder with an anisotropy-aware relative",
    "link": "https://arxiv.org/abs/2402.15398",
    "context": "Title: TransFlower: An Explainable Transformer-Based Model with Flow-to-Flow Attention for Commuting Flow Prediction\nAbstract: arXiv:2402.15398v1 Announce Type: cross  Abstract: Understanding the link between urban planning and commuting flows is crucial for guiding urban development and policymaking. This research, bridging computer science and urban studies, addresses the challenge of integrating these fields with their distinct focuses. Traditional urban studies methods, like the gravity and radiation models, often underperform in complex scenarios due to their limited handling of multiple variables and reliance on overly simplistic and unrealistic assumptions, such as spatial isotropy. While deep learning models offer improved accuracy, their black-box nature poses a trade-off between performance and explainability -- both vital for analyzing complex societal phenomena like commuting flows. To address this, we introduce TransFlower, an explainable, transformer-based model employing flow-to-flow attention to predict urban commuting patterns. It features a geospatial encoder with an anisotropy-aware relative",
    "path": "papers/24/02/2402.15398.json",
    "total_tokens": 882,
    "translated_title": "TransFlower: 一种基于Transformer的模型，使用Flow-to-Flow注意力进行通勤流预测",
    "translated_abstract": "理解城市规划和通勤流之间的联系对指导城市发展和政策制定至关重要。这项研究跨越计算机科学和城市研究，解决了整合这些领域及其不同关注点的挑战。传统的城市研究方法，如引力和辐射模型，通常在复杂情况下表现不佳，因为它们对多个变量的处理有限，并且依赖于过于简化且不现实的假设，如空间各向同性。虽然深度学习模型提供了更高的准确性，但它们的黑盒特性在性能和可解释性之间存在权衡，这两者对于分析通勤流等复杂社会现象至关重要。为了解决这个问题，我们引入了TransFlower，一种可解释的、基于Transformer的模型，采用Flow-to-Flow注意力来预测城市通勤模式。它具有一个带有各向异性感知的地理空间编码器",
    "tldr": "TransFlower模型是一种基于Transformer的可解释模型，采用Flow-to-Flow注意力来预测城市通勤模式，以解决深度学习模型准确性和可解释性之间的权衡问题。",
    "en_tdlr": "TransFlower model is an explainable transformer-based model utilizing flow-to-flow attention for predicting urban commuting patterns, addressing the trade-off between accuracy and explainability in deep learning models."
}