{
    "title": "Are Bounded Contracts Learnable and Approximately Optimal?",
    "abstract": "arXiv:2402.14486v1 Announce Type: cross  Abstract: This paper considers the hidden-action model of the principal-agent problem, in which a principal incentivizes an agent to work on a project using a contract. We investigate whether contracts with bounded payments are learnable and approximately optimal. Our main results are two learning algorithms that can find a nearly optimal bounded contract using a polynomial number of queries, under two standard assumptions in the literature: a costlier action for the agent leads to a better outcome distribution for the principal, and the agent's cost/effort has diminishing returns. Our polynomial query complexity upper bound shows that standard assumptions are sufficient for achieving an exponential improvement upon the known lower bound for general instances. Unlike the existing algorithms, which relied on discretizing the contract space, our algorithms directly learn the underlying outcome distributions. As for the approximate optimality of bo",
    "link": "https://arxiv.org/abs/2402.14486",
    "context": "Title: Are Bounded Contracts Learnable and Approximately Optimal?\nAbstract: arXiv:2402.14486v1 Announce Type: cross  Abstract: This paper considers the hidden-action model of the principal-agent problem, in which a principal incentivizes an agent to work on a project using a contract. We investigate whether contracts with bounded payments are learnable and approximately optimal. Our main results are two learning algorithms that can find a nearly optimal bounded contract using a polynomial number of queries, under two standard assumptions in the literature: a costlier action for the agent leads to a better outcome distribution for the principal, and the agent's cost/effort has diminishing returns. Our polynomial query complexity upper bound shows that standard assumptions are sufficient for achieving an exponential improvement upon the known lower bound for general instances. Unlike the existing algorithms, which relied on discretizing the contract space, our algorithms directly learn the underlying outcome distributions. As for the approximate optimality of bo",
    "path": "papers/24/02/2402.14486.json",
    "total_tokens": 837,
    "translated_title": "边界合同是否可学习并近似最优?",
    "translated_abstract": "本文考虑委托-代理问题的隐藏动作模型，其中委托方通过合同激励代理人按合同开展项目。我们研究了带有有界支付的合同是否可学习并近似最优。我们的主要结果是两种学习算法，可以在有界的查询次数内找到几乎最优的有界合同，基于文献中的两个标准假设：代理人的更昂贵的行动导致委托方的更好的结果分布，并且代理人的成本/努力具有递减回报。我们的多项式查询复杂度上界表明，标准假设足以实现对一般情况已知下界的指数改进。与现有的算法不同，后者依赖于对合同空间的离散化，我们的算法直接学习潜在的结果分布。",
    "tldr": "分析了在隐藏动作模型下的合同与委托-代理问题，提出了两个学习算法可以找到几乎最优的有界合同，对于一般情况的查询次数具有多项式上界，并且直接学习潜在的结果分布。",
    "en_tdlr": "Investigated whether contracts with bounded payments are learnable and approximately optimal in the hidden-action model of the principal-agent problem, and proposed two learning algorithms that can find a nearly optimal bounded contract with polynomial number of queries, directly learning the underlying outcome distributions."
}