{
    "title": "Quantifying analogy of concepts via ologs and wiring diagrams",
    "abstract": "We build on the theory of ontology logs (ologs) created by Spivak and Kent, and define a notion of wiring diagrams. In this article, a wiring diagram is a finite directed labelled graph. The labels correspond to types in an olog; they can also be interpreted as readings of sensors in an autonomous system. As such, wiring diagrams can be used as a framework for an autonomous system to form abstract concepts. We show that the graphs underlying skeleton wiring diagrams form a category. This allows skeleton wiring diagrams to be compared and manipulated using techniques from both graph theory and category theory. We also extend the usual definition of graph edit distance to the case of wiring diagrams by using operations only available to wiring diagrams, leading to a metric on the set of all skeleton wiring diagrams. In the end, we give an extended example on calculating the distance between two concepts represented by wiring diagrams, and explain how to apply our framework to any applica",
    "link": "https://rss.arxiv.org/abs/2402.01020",
    "context": "Title: Quantifying analogy of concepts via ologs and wiring diagrams\nAbstract: We build on the theory of ontology logs (ologs) created by Spivak and Kent, and define a notion of wiring diagrams. In this article, a wiring diagram is a finite directed labelled graph. The labels correspond to types in an olog; they can also be interpreted as readings of sensors in an autonomous system. As such, wiring diagrams can be used as a framework for an autonomous system to form abstract concepts. We show that the graphs underlying skeleton wiring diagrams form a category. This allows skeleton wiring diagrams to be compared and manipulated using techniques from both graph theory and category theory. We also extend the usual definition of graph edit distance to the case of wiring diagrams by using operations only available to wiring diagrams, leading to a metric on the set of all skeleton wiring diagrams. In the end, we give an extended example on calculating the distance between two concepts represented by wiring diagrams, and explain how to apply our framework to any applica",
    "path": "papers/24/02/2402.01020.json",
    "total_tokens": 885,
    "translated_title": "通过ologs和接线图量化概念的类比",
    "translated_abstract": "我们在Spivak和Kent创建的本体日志(ologs)理论的基础上，定义了一种称为接线图的概念。在本文中，接线图是一个有限的有向标记图。标记对应于olog中的类型；它们也可以被解释为自主系统中传感器的读数。因此，接线图可以用作自主系统形成抽象概念的框架。我们展示了基于骨架接线图的图形形成一个范畴。这使得骨架接线图可以使用图论和范畴论的技术进行比较和操作。我们还通过使用仅适用于接线图的操作将传统的图编辑距离定义扩展到接线图的情况，从而得到了所有骨架接线图集合上的度量。最后，我们给出了一个计算由接线图表示的两个概念之间距离的扩展示例，并解释了如何将我们的框架应用于任何应用领域。",
    "tldr": "本文通过ologs和接线图的概念，建立了一个量化概念类比的框架，使得自主系统能够形成抽象概念，并通过图论和范畴论的技术进行比较和操作，同时使用接线图操作定义了度量和图编辑距离。",
    "en_tdlr": "This paper establishes a framework for quantifying analogy of concepts using ologs and wiring diagrams, allowing autonomous systems to form abstract concepts and manipulate them using graph theory and category theory techniques. It also defines a metric and extends the graph edit distance for wiring diagrams."
}