{
    "title": "Simpson's Paradox and the Accuracy-Fluency Tradeoff in Translation",
    "abstract": "arXiv:2402.12690v1 Announce Type: new  Abstract: A good translation should be faithful to the source and should respect the norms of the target language. We address a theoretical puzzle about the relationship between these objectives. On one hand, intuition and some prior work suggest that accuracy and fluency should trade off against each other, and that capturing every detail of the source can only be achieved at the cost of fluency. On the other hand, quality assessment researchers often suggest that accuracy and fluency are highly correlated and difficult for human raters to distinguish (Callison-Burch et al. 2007). We show that the tension between these views is an instance of Simpson's paradox, and that accuracy and fluency are positively correlated at the level of the corpus but trade off at the level of individual source segments. We further suggest that the relationship between accuracy and fluency is best evaluated at the segment (or sentence) level, and that the trade off be",
    "link": "https://arxiv.org/abs/2402.12690",
    "context": "Title: Simpson's Paradox and the Accuracy-Fluency Tradeoff in Translation\nAbstract: arXiv:2402.12690v1 Announce Type: new  Abstract: A good translation should be faithful to the source and should respect the norms of the target language. We address a theoretical puzzle about the relationship between these objectives. On one hand, intuition and some prior work suggest that accuracy and fluency should trade off against each other, and that capturing every detail of the source can only be achieved at the cost of fluency. On the other hand, quality assessment researchers often suggest that accuracy and fluency are highly correlated and difficult for human raters to distinguish (Callison-Burch et al. 2007). We show that the tension between these views is an instance of Simpson's paradox, and that accuracy and fluency are positively correlated at the level of the corpus but trade off at the level of individual source segments. We further suggest that the relationship between accuracy and fluency is best evaluated at the segment (or sentence) level, and that the trade off be",
    "path": "papers/24/02/2402.12690.json",
    "total_tokens": 716,
    "translated_title": "辛普森悖论与翻译中的准确性-流畅度权衡",
    "translated_abstract": "一篇好的翻译应该忠实于原文并遵守目标语言的规范。本文探讨了关于这些目标之间关系的理论难题。我们展示了准确性和流畅度之间的关系是辛普森悖论的一种实例，表明在语料库级别上，准确性和流畅度呈正相关但在单个源段的级别上存在权衡。",
    "tldr": "准确性和流畅度在翻译中表现为正相关的悖论，这是辛普森悖论的一个实例，在语料库级别上二者呈正相关，在单个源段级别上存在权衡。"
}