{
    "title": "FactPICO: Factuality Evaluation for Plain Language Summarization of Medical Evidence",
    "abstract": "arXiv:2402.11456v1 Announce Type: new  Abstract: Plain language summarization with LLMs can be useful for improving textual accessibility of technical content. But how factual are these summaries in a high-stakes domain like medicine? This paper presents FactPICO, a factuality benchmark for plain language summarization of medical texts describing randomized controlled trials (RCTs), which are the basis of evidence-based medicine and can directly inform patient treatment. FactPICO consists of 345 plain language summaries of RCT abstracts generated from three LLMs (i.e., GPT-4, Llama-2, and Alpaca), with fine-grained evaluation and natural language rationales from experts. We assess the factuality of critical elements of RCTs in those summaries: Populations, Interventions, Comparators, Outcomes (PICO), as well as the reported findings concerning these. We also evaluate the correctness of the extra information (e.g., explanations) added by LLMs. Using FactPICO, we benchmark a range of exi",
    "link": "https://arxiv.org/abs/2402.11456",
    "context": "Title: FactPICO: Factuality Evaluation for Plain Language Summarization of Medical Evidence\nAbstract: arXiv:2402.11456v1 Announce Type: new  Abstract: Plain language summarization with LLMs can be useful for improving textual accessibility of technical content. But how factual are these summaries in a high-stakes domain like medicine? This paper presents FactPICO, a factuality benchmark for plain language summarization of medical texts describing randomized controlled trials (RCTs), which are the basis of evidence-based medicine and can directly inform patient treatment. FactPICO consists of 345 plain language summaries of RCT abstracts generated from three LLMs (i.e., GPT-4, Llama-2, and Alpaca), with fine-grained evaluation and natural language rationales from experts. We assess the factuality of critical elements of RCTs in those summaries: Populations, Interventions, Comparators, Outcomes (PICO), as well as the reported findings concerning these. We also evaluate the correctness of the extra information (e.g., explanations) added by LLMs. Using FactPICO, we benchmark a range of exi",
    "path": "papers/24/02/2402.11456.json",
    "total_tokens": 921,
    "translated_title": "FactPICO: 医学证据的简明语言摘要的事实性评估",
    "translated_abstract": "arXiv:2402.11456v1 公告类型: 新的 摘要: 利用LLMs进行简明语言摘要可以改善技术内容的文本可访问性。但是在医学这样一个高风险领域，这些摘要有多真实？本文介绍了FactPICO，这是一个用于描述随机对照试验（RCTs）的医学文本的简明语言摘要的事实性基准，RCTs是循证医学的基础，可以直接为患者治疗提供信息。FactPICO由来自三个LLMs（即GPT-4、Llama-2和Alpaca）生成的345个RCT摘要的简明语言摘要组成，具有专家细致评估和自然语言理由。我们评估这些摘要中RCT的关键要素（人群、干预措施、对照组、结果（PICO））以及关于这些内容的报告发现的事实性。我们还评估LLMs添加的额外信息（例如解释）的正确性。使用FactPICO，我们对多个现有",
    "tldr": "本文提出FactPICO，用于评估医学文本的简明语言摘要的事实性基准，对RCT中的关键要素和报告结果进行评估，并对LLMs添加的额外信息进行检查。",
    "en_tdlr": "This paper introduces FactPICO, a factuality benchmark for plain language summarization of medical texts, evaluating key elements and reported findings in RCTs, as well as checking the correctness of additional information added by LLMs."
}