{
    "title": "Location Agnostic Adaptive Rain Precipitation Prediction using Deep Learning",
    "abstract": "Rain precipitation prediction is a challenging task as it depends on weather and meteorological features which vary from location to location. As a result, a prediction model that performs well at one location does not perform well at other locations due to the distribution shifts. In addition, due to global warming, the weather patterns are changing very rapidly year by year which creates the possibility of ineffectiveness of those models even at the same location as time passes. In our work, we have proposed an adaptive deep learning-based framework in order to provide a solution to the aforementioned challenges. Our method can generalize the model for the prediction of precipitation for any location where the methods without adaptation fail. Our method has shown 43.51%, 5.09%, and 38.62% improvement after adaptation using a deep neural network for predicting the precipitation of Paris, Los Angeles, and Tokyo, respectively.",
    "link": "https://rss.arxiv.org/abs/2402.01208",
    "context": "Title: Location Agnostic Adaptive Rain Precipitation Prediction using Deep Learning\nAbstract: Rain precipitation prediction is a challenging task as it depends on weather and meteorological features which vary from location to location. As a result, a prediction model that performs well at one location does not perform well at other locations due to the distribution shifts. In addition, due to global warming, the weather patterns are changing very rapidly year by year which creates the possibility of ineffectiveness of those models even at the same location as time passes. In our work, we have proposed an adaptive deep learning-based framework in order to provide a solution to the aforementioned challenges. Our method can generalize the model for the prediction of precipitation for any location where the methods without adaptation fail. Our method has shown 43.51%, 5.09%, and 38.62% improvement after adaptation using a deep neural network for predicting the precipitation of Paris, Los Angeles, and Tokyo, respectively.",
    "path": "papers/24/02/2402.01208.json",
    "total_tokens": 905,
    "translated_title": "基于深度学习的位置无关自适应降雨预测",
    "translated_abstract": "降雨预测是一项具有挑战性的任务，因为它依赖于因地而异的气候和气象特征。因此，一个在一个位置表现良好的预测模型，在其他位置可能表现不佳，因为分布的变化。此外，由于全球变暖，天气模式年复一年地发生着快速变化，这可能导致即使在相同位置，时间过去后那些模型也变得无效。在我们的工作中，我们提出了一种自适应深度学习框架，以解决上述挑战。我们的方法能够推广模型，用于预测那些没有适应机制的方法无法预测降水的任何位置。我们的方法经过深度神经网络适应后，在巴黎、洛杉矶和东京的降水预测方面分别显示了43.51%、5.09%和38.62%的改进。",
    "tldr": "本研究提出了一种基于深度学习的自适应框架，能够解决降雨预测中的位置差异和气候变化带来的挑战。通过在巴黎、洛杉矶和东京进行适应，我们方法的预测能力分别提高了43.51%、5.09%和38.62%。",
    "en_tdlr": "This study proposes an adaptive framework based on deep learning to address the challenges of location differences and climate change in rain precipitation prediction. By adapting to Paris, Los Angeles, and Tokyo, our method achieves improvements in prediction accuracy of 43.51%, 5.09%, and 38.62%, respectively."
}