{
    "title": "Detection and Pose Estimation of flat, Texture-less Industry Objects on HoloLens using synthetic Training",
    "abstract": "Current state-of-the-art 6d pose estimation is too compute intensive to be deployed on edge devices, such as Microsoft HoloLens (2) or Apple iPad, both used for an increasing number of augmented reality applications. The quality of AR is greatly dependent on its capabilities to detect and overlay geometry within the scene. We propose a synthetically trained client-server-based augmented reality application, demonstrating state-of-the-art object pose estimation of metallic and texture-less industry objects on edge devices. Synthetic data enables training without real photographs, i.e. for yet-to-be-manufactured objects. Our qualitative evaluation on an AR-assisted sorting task, and quantitative evaluation on both renderings, as well as real-world data recorded on HoloLens 2, sheds light on its real-world applicability.",
    "link": "https://arxiv.org/abs/2402.04979",
    "context": "Title: Detection and Pose Estimation of flat, Texture-less Industry Objects on HoloLens using synthetic Training\nAbstract: Current state-of-the-art 6d pose estimation is too compute intensive to be deployed on edge devices, such as Microsoft HoloLens (2) or Apple iPad, both used for an increasing number of augmented reality applications. The quality of AR is greatly dependent on its capabilities to detect and overlay geometry within the scene. We propose a synthetically trained client-server-based augmented reality application, demonstrating state-of-the-art object pose estimation of metallic and texture-less industry objects on edge devices. Synthetic data enables training without real photographs, i.e. for yet-to-be-manufactured objects. Our qualitative evaluation on an AR-assisted sorting task, and quantitative evaluation on both renderings, as well as real-world data recorded on HoloLens 2, sheds light on its real-world applicability.",
    "path": "papers/24/02/2402.04979.json",
    "total_tokens": 753,
    "translated_title": "使用合成训练在HoloLens上检测和姿态估计平面纹理缺失的工业物体",
    "translated_abstract": "当前最先进的6D姿态估计对于Edge设备，如Microsoft HoloLens（2）或Apple iPad来说计算密集度太高，无法部署在上面。增强现实的质量在很大程度上取决于其检测和叠加场景中的几何结构的能力。我们提出了一种基于客户端服务器的合成训练增强现实应用程序，在Edge设备上展示了对金属和纹理缺失的工业物体的最先进姿态估计。合成数据使得可以对尚未制造的物体进行训练，而不需要真实照片。我们在AR辅助的分类任务上进行了定性评估，并在渲染和在HoloLens 2上记录的真实世界数据上进行了定量评估，揭示了其在实际应用中的适用性。",
    "tldr": "该论文提出了一种使用合成训练的增强现实应用程序，能够在Edge设备上实现对平面纹理缺失的工业物体进行最先进的姿态估计。"
}