{
    "title": "Measuring the performance of investments in information security startups: An empirical analysis by cybersecurity sectors using Crunchbase data",
    "abstract": "Early-stage firms play a significant role in driving innovation and creating new products and services, especially for cybersecurity. Therefore, evaluating their performance is crucial for investors and policymakers. This work presents a financial evaluation of early-stage firms' performance in 19 cybersecurity sectors using a private-equity dataset from 2010 to 2022 retrieved from Crunchbase. We observe firms, their primary and secondary activities, funding rounds, and pre and post-money valuations. We compare cybersecurity sectors regarding the amount raised over funding rounds and post-money valuations while inferring missing observations. We observe significant investor interest variations across categories, periods, and locations. In particular, we find the average capital raised (valuations) to range from USD 7.24 mln (USD 32.39 mln) for spam filtering to USD 45.46 mln (USD 447.22 mln) for the private cloud sector. Next, we assume a log process for returns computed from post-mone",
    "link": "https://arxiv.org/abs/2402.04765",
    "context": "Title: Measuring the performance of investments in information security startups: An empirical analysis by cybersecurity sectors using Crunchbase data\nAbstract: Early-stage firms play a significant role in driving innovation and creating new products and services, especially for cybersecurity. Therefore, evaluating their performance is crucial for investors and policymakers. This work presents a financial evaluation of early-stage firms' performance in 19 cybersecurity sectors using a private-equity dataset from 2010 to 2022 retrieved from Crunchbase. We observe firms, their primary and secondary activities, funding rounds, and pre and post-money valuations. We compare cybersecurity sectors regarding the amount raised over funding rounds and post-money valuations while inferring missing observations. We observe significant investor interest variations across categories, periods, and locations. In particular, we find the average capital raised (valuations) to range from USD 7.24 mln (USD 32.39 mln) for spam filtering to USD 45.46 mln (USD 447.22 mln) for the private cloud sector. Next, we assume a log process for returns computed from post-mone",
    "path": "papers/24/02/2402.04765.json",
    "total_tokens": 992,
    "translated_title": "使用Crunchbase数据对信息安全创业公司的投资绩效进行测量：基于网络安全领域的实证分析",
    "translated_abstract": "早期阶段的公司在推动创新和创造新产品和服务方面发挥着重要作用，尤其是在网络安全领域。因此，对它们的绩效进行评估对于投资者和政策制定者至关重要。本研究基于从Crunchbase获取的2010年至2022年的私募股权数据，对19个网络安全领域的早期阶段公司的绩效进行了金融评估。我们观察了公司及其主要和次要活动、融资轮次以及前后估值。我们比较了不同网络安全领域在融资轮次和后估值方面的差异，并推断了缺失观察。我们观察到在不同类别、时期和地区之间，投资者的兴趣差异显著。特别是，我们发现垃圾邮件过滤的平均融资金额（估值）为724万美元（3.239亿美元），而私有云领域为4546万美元（4.4722亿美元）。接下来，我们假设从后估值计算得到的回报率符合对数过程。",
    "tldr": "使用Crunchbase数据对19个网络安全领域的早期阶段公司进行了金融评估，发现不同领域之间存在显著的融资差异，并推断了缺失观察。最高的平均融资金额为4546万美元，对应私有云领域。",
    "en_tdlr": "This paper presents a financial evaluation of early-stage firms in 19 cybersecurity sectors using Crunchbase data, revealing significant funding variations among different sectors and inferring missing observations. The highest average funding amount is $45.46 million, corresponding to the private cloud sector."
}