{
    "title": "Electricity Price Forecasting in the Irish Balancing Market",
    "abstract": "Short-term electricity markets are becoming more relevant due to less-predictable renewable energy sources, attracting considerable attention from the industry. The balancing market is the closest to real-time and the most volatile among them. Its price forecasting literature is limited, inconsistent and outdated, with few deep learning attempts and no public dataset. This work applies to the Irish balancing market a variety of price prediction techniques proven successful in the widely studied day-ahead market. We compare statistical, machine learning, and deep learning models using a framework that investigates the impact of different training sizes. The framework defines hyperparameters and calibration settings; the dataset and models are made public to ensure reproducibility and to be used as benchmarks for future works. An extensive numerical study shows that well-performing models in the day-ahead market do not perform well in the balancing one, highlighting that these markets ar",
    "link": "https://arxiv.org/abs/2402.06714",
    "context": "Title: Electricity Price Forecasting in the Irish Balancing Market\nAbstract: Short-term electricity markets are becoming more relevant due to less-predictable renewable energy sources, attracting considerable attention from the industry. The balancing market is the closest to real-time and the most volatile among them. Its price forecasting literature is limited, inconsistent and outdated, with few deep learning attempts and no public dataset. This work applies to the Irish balancing market a variety of price prediction techniques proven successful in the widely studied day-ahead market. We compare statistical, machine learning, and deep learning models using a framework that investigates the impact of different training sizes. The framework defines hyperparameters and calibration settings; the dataset and models are made public to ensure reproducibility and to be used as benchmarks for future works. An extensive numerical study shows that well-performing models in the day-ahead market do not perform well in the balancing one, highlighting that these markets ar",
    "path": "papers/24/02/2402.06714.json",
    "total_tokens": 888,
    "translated_title": "爱尔兰平衡市场的电价预测",
    "translated_abstract": "随着可再生能源来源越来越不可预测，短期电力市场变得越来越重要，引起了行业的广泛关注。平衡市场是最接近实时并且最不稳定的市场。然而，目前对其价格预测的文献有限、不一致且过时，针对该市场的深度学习研究尝试很少，也没有公开数据集可用。本研究将在广泛研究的日前市场中成功应用的各种价格预测技术应用于爱尔兰的平衡市场。我们使用一个框架比较了统计学、机器学习和深度学习模型，并研究了不同训练大小对模型的影响。该框架定义了超参数和校准设置，数据集和模型公开以确保可重现性，并作为未来工作的基准。大量的数值研究表明，在日前市场上表现良好的模型在平衡市场上效果不佳，突显了这些市场的不同特点。",
    "tldr": "本研究针对爱尔兰的平衡市场应用了各种已被证明成功的价格预测技术，并发现在日前市场表现良好的模型在平衡市场中效果不佳，突显了这些市场的不同特点。"
}