{
    "title": "PASCL: Supervised Contrastive Learning with Perturbative Augmentation for Particle Decay Reconstruction",
    "abstract": "arXiv:2402.11538v1 Announce Type: cross  Abstract: In high-energy physics, particles produced in collision events decay in a format of a hierarchical tree structure, where only the final decay products can be observed using detectors. However, the large combinatorial space of possible tree structures makes it challenging to recover the actual decay process given a set of final particles. To better analyse the hierarchical tree structure, we propose a graph-based deep learning model to infer the tree structure to reconstruct collision events. In particular, we use a compact matrix representation termed as lowest common ancestor generations (LCAG) matrix, to encode the particle decay tree structure. Then, we introduce a perturbative augmentation technique applied to node features, aiming to mimic experimental uncertainties and increase data diversity. We further propose a supervised graph contrastive learning algorithm to utilize the information of inter-particle relations from multiple ",
    "link": "https://arxiv.org/abs/2402.11538",
    "context": "Title: PASCL: Supervised Contrastive Learning with Perturbative Augmentation for Particle Decay Reconstruction\nAbstract: arXiv:2402.11538v1 Announce Type: cross  Abstract: In high-energy physics, particles produced in collision events decay in a format of a hierarchical tree structure, where only the final decay products can be observed using detectors. However, the large combinatorial space of possible tree structures makes it challenging to recover the actual decay process given a set of final particles. To better analyse the hierarchical tree structure, we propose a graph-based deep learning model to infer the tree structure to reconstruct collision events. In particular, we use a compact matrix representation termed as lowest common ancestor generations (LCAG) matrix, to encode the particle decay tree structure. Then, we introduce a perturbative augmentation technique applied to node features, aiming to mimic experimental uncertainties and increase data diversity. We further propose a supervised graph contrastive learning algorithm to utilize the information of inter-particle relations from multiple ",
    "path": "papers/24/02/2402.11538.json",
    "total_tokens": 841,
    "translated_title": "PASCL: 带扰动增强的监督对比学习用于粒子衰变重建",
    "translated_abstract": "在高能物理学中，在碰撞事件中产生的粒子以层次树结构的形式衰变，只有最终的衰变产物可以通过探测器观测到。然而，可能的树结构巨大的排列空间使得在给定一组最终粒子的情况下重建实际衰变过程具有挑战性。为了更好地分析层次树结构，我们提出了一个基于图的深度学习模型来推断树结构以重建碰撞事件。具体地，我们使用一种紧凑的矩阵表示，称为最低公共祖先代数（LCAG）矩阵，来编码粒子衰变树结构。然后，我们引入了一种应用于节点特征的扰动增强技术，旨在模拟实验不确定性并增加数据多样性。此外，我们提出了一种监督图对比学习算法，利用来自多个粒子之间关系的信息",
    "tldr": "提出了PASCL算法，在高能物理学中使用带扰动增强的监督对比学习，利用图结构重建粒子衰变层次树。"
}