{
    "title": "Enhancing Steganographic Text Extraction: Evaluating the Impact of NLP Models on Accuracy and Semantic Coherence",
    "abstract": "arXiv:2402.18849v1 Announce Type: cross  Abstract: This study discusses a new method combining image steganography technology with Natural Language Processing (NLP) large models, aimed at improving the accuracy and robustness of extracting steganographic text. Traditional Least Significant Bit (LSB) steganography techniques face challenges in accuracy and robustness of information extraction when dealing with complex character encoding, such as Chinese characters. To address this issue, this study proposes an innovative LSB-NLP hybrid framework. This framework integrates the advanced capabilities of NLP large models, such as error detection, correction, and semantic consistency analysis, as well as information reconstruction techniques, thereby significantly enhancing the robustness of steganographic text extraction. Experimental results show that the LSB-NLP hybrid framework excels in improving the extraction accuracy of steganographic text, especially in handling Chinese characters. ",
    "link": "https://arxiv.org/abs/2402.18849",
    "context": "Title: Enhancing Steganographic Text Extraction: Evaluating the Impact of NLP Models on Accuracy and Semantic Coherence\nAbstract: arXiv:2402.18849v1 Announce Type: cross  Abstract: This study discusses a new method combining image steganography technology with Natural Language Processing (NLP) large models, aimed at improving the accuracy and robustness of extracting steganographic text. Traditional Least Significant Bit (LSB) steganography techniques face challenges in accuracy and robustness of information extraction when dealing with complex character encoding, such as Chinese characters. To address this issue, this study proposes an innovative LSB-NLP hybrid framework. This framework integrates the advanced capabilities of NLP large models, such as error detection, correction, and semantic consistency analysis, as well as information reconstruction techniques, thereby significantly enhancing the robustness of steganographic text extraction. Experimental results show that the LSB-NLP hybrid framework excels in improving the extraction accuracy of steganographic text, especially in handling Chinese characters. ",
    "path": "papers/24/02/2402.18849.json",
    "total_tokens": 875,
    "translated_title": "提升隐写文本提取：评估自然语言处理模型对准确性和语义连贯性的影响",
    "translated_abstract": "这项研究讨论了一种新方法，将图像隐写术技术与自然语言处理（NLP）大型模型相结合，旨在提高提取隐写文本的准确性和鲁棒性。传统的最低有效位（LSB）隐写术技术在处理复杂字符编码（如中文字符）时在信息提取的准确性和鲁棒性方面面临挑战。为了解决这一问题，本研究提出了一种创新的LSB-NLP混合框架。该框架集成了NLP大型模型的先进能力，如错误检测、纠正和语义一致性分析，以及信息重建技术，从而显著提高了隐写文本提取的鲁棒性。实验结果显示，LSB-NLP混合框架在提高隐写文本提取准确性方面表现出色，特别是在处理中文字符方面。",
    "tldr": "通过整合NLP大型模型，本研究提出一种LSB-NLP混合框架，显著提高了隐写文本提取的准确性和鲁棒性，尤其在处理中文字符时表现优异。"
}