{
    "title": "Enhancing Complex Question Answering over Knowledge Graphs through Evidence Pattern Retrieval",
    "abstract": "Information retrieval (IR) methods for KGQA consist of two stages: subgraph extraction and answer reasoning. We argue current subgraph extraction methods underestimate the importance of structural dependencies among evidence facts. We propose Evidence Pattern Retrieval (EPR) to explicitly model the structural dependencies during subgraph extraction. We implement EPR by indexing the atomic adjacency pattern of resource pairs. Given a question, we perform dense retrieval to obtain atomic patterns formed by resource pairs. We then enumerate their combinations to construct candidate evidence patterns. These evidence patterns are scored using a neural model, and the best one is selected to extract a subgraph for downstream answer reasoning. Experimental results demonstrate that the EPR-based approach has significantly improved the F1 scores of IR-KGQA methods by over 10 points on ComplexWebQuestions and achieves competitive performance on WebQuestionsSP.",
    "link": "https://arxiv.org/abs/2402.02175",
    "context": "Title: Enhancing Complex Question Answering over Knowledge Graphs through Evidence Pattern Retrieval\nAbstract: Information retrieval (IR) methods for KGQA consist of two stages: subgraph extraction and answer reasoning. We argue current subgraph extraction methods underestimate the importance of structural dependencies among evidence facts. We propose Evidence Pattern Retrieval (EPR) to explicitly model the structural dependencies during subgraph extraction. We implement EPR by indexing the atomic adjacency pattern of resource pairs. Given a question, we perform dense retrieval to obtain atomic patterns formed by resource pairs. We then enumerate their combinations to construct candidate evidence patterns. These evidence patterns are scored using a neural model, and the best one is selected to extract a subgraph for downstream answer reasoning. Experimental results demonstrate that the EPR-based approach has significantly improved the F1 scores of IR-KGQA methods by over 10 points on ComplexWebQuestions and achieves competitive performance on WebQuestionsSP.",
    "path": "papers/24/02/2402.02175.json",
    "total_tokens": 878,
    "translated_title": "通过证据模式检索增强知识图谱上的复杂问题回答",
    "translated_abstract": "知识图谱问答系统的信息检索方法包括两个阶段：子图提取和答案推理。我们认为当前的子图提取方法低估了证据事实之间的结构依赖的重要性。我们提出了证据模式检索（EPR）来在子图提取过程中明确地建模结构依赖。我们通过索引资源对的原子邻接模式来实现EPR。给定一个问题，我们进行密集检索以获取由资源对形成的原子模式。然后，我们枚举它们的组合以构建候选证据模式。这些证据模式使用神经模型进行打分，并选择最佳模式来提取下游答案推理所需的子图。实验结果表明，基于EPR的方法在ComplexWebQuestions上将IR-KGQA方法的F1得分显著提高了10个百分点以上，并在WebQuestionsSP上取得了有竞争力的性能。",
    "tldr": "本论文提出了一种名为EPR的方法，通过索引原子邻接模式并将其组合，明确建模结构依赖，并在知识图谱中进行子图提取。实验结果表明，EPR方法在复杂问题回答方面取得了显著的改进，提高了F1得分，并在WebQuestionsSP上表现出竞争力。",
    "en_tdlr": "This paper proposes a method called EPR, which indexes atomic adjacency patterns and combines them to explicitly model structural dependencies for subgraph extraction in knowledge graphs. Experimental results show that EPR significantly improves F1 scores in complex question answering and achieves competitive performance on WebQuestionsSP."
}