{
    "title": "Online Efficient Safety-Critical Control for Mobile Robots in Unknown Dynamic Multi-Obstacle Environments",
    "abstract": "arXiv:2402.16449v1 Announce Type: cross  Abstract: This paper proposes a LiDAR-based goal-seeking and exploration framework, addressing the efficiency of online obstacle avoidance in unstructured environments populated with static and moving obstacles. This framework addresses two significant challenges associated with traditional dynamic control barrier functions (D-CBFs): their online construction and the diminished real-time performance caused by utilizing multiple D-CBFs. To tackle the first challenge, the framework's perception component begins with clustering point clouds via the DBSCAN algorithm, followed by encapsulating these clusters with the minimum bounding ellipses (MBEs) algorithm to create elliptical representations. By comparing the current state of MBEs with those stored from previous moments, the differentiation between static and dynamic obstacles is realized, and the Kalman filter is utilized to predict the movements of the latter. Such analysis facilitates the D-CB",
    "link": "https://arxiv.org/abs/2402.16449",
    "context": "Title: Online Efficient Safety-Critical Control for Mobile Robots in Unknown Dynamic Multi-Obstacle Environments\nAbstract: arXiv:2402.16449v1 Announce Type: cross  Abstract: This paper proposes a LiDAR-based goal-seeking and exploration framework, addressing the efficiency of online obstacle avoidance in unstructured environments populated with static and moving obstacles. This framework addresses two significant challenges associated with traditional dynamic control barrier functions (D-CBFs): their online construction and the diminished real-time performance caused by utilizing multiple D-CBFs. To tackle the first challenge, the framework's perception component begins with clustering point clouds via the DBSCAN algorithm, followed by encapsulating these clusters with the minimum bounding ellipses (MBEs) algorithm to create elliptical representations. By comparing the current state of MBEs with those stored from previous moments, the differentiation between static and dynamic obstacles is realized, and the Kalman filter is utilized to predict the movements of the latter. Such analysis facilitates the D-CB",
    "path": "papers/24/02/2402.16449.json",
    "total_tokens": 841,
    "translated_title": "在未知动态多障碍环境中的移动机器人在线高效安全关键控制",
    "translated_abstract": "本文提出了一种基于LiDAR的目标导向和勘探框架，解决了在线障碍物避免在由静态和移动障碍物填满的非结构化环境中的效率问题。该框架解决了传统动态控制屏障功能（D-CBFs）所面临的两个重要挑战：在线构建和由于使用多个D-CBFs导致的实时性能下降。为了解决第一个挑战，该框架的感知组件通过DBSCAN算法对点云进行聚类，然后利用最小界限椭球（MBEs）算法将这些聚类进行封装，创造出椭圆形表示。通过将当前状态的MBEs与之前存储的MBEs进行比较，实现了静态和动态障碍物的区分，并利用卡尔曼滤波器来预测后者的移动。这种分析有助于实施D-CB",
    "tldr": "提出了一个基于LiDAR的目标导向和勘探框架，实现了在线障碍物避免在未知动态多障碍环境中的高效控制",
    "en_tdlr": "The paper presents a LiDAR-based goal-seeking and exploration framework that achieves efficient obstacle avoidance for mobile robots in unknown dynamic multi-obstacle environments."
}