{
    "title": "Exploiting Low-level Representations for Ultra-Fast Road Segmentation",
    "abstract": "Achieving real-time and accuracy on embedded platforms has always been the pursuit of road segmentation methods. To this end, they have proposed many lightweight networks. However, they ignore the fact that roads are \"stuff\" (background or environmental elements) rather than \"things\" (specific identifiable objects), which inspires us to explore the feasibility of representing roads with low-level instead of high-level features. Surprisingly, we find that the primary stage of mainstream network models is sufficient to represent most pixels of the road for segmentation. Motivated by this, we propose a Low-level Feature Dominated Road Segmentation network (LFD-RoadSeg). Specifically, LFD-RoadSeg employs a bilateral structure. The spatial detail branch is firstly designed to extract low-level feature representation for the road by the first stage of ResNet-18. To suppress texture-less regions mistaken as the road in the low-level feature, the context semantic branch is then designed to ext",
    "link": "https://arxiv.org/abs/2402.02430",
    "context": "Title: Exploiting Low-level Representations for Ultra-Fast Road Segmentation\nAbstract: Achieving real-time and accuracy on embedded platforms has always been the pursuit of road segmentation methods. To this end, they have proposed many lightweight networks. However, they ignore the fact that roads are \"stuff\" (background or environmental elements) rather than \"things\" (specific identifiable objects), which inspires us to explore the feasibility of representing roads with low-level instead of high-level features. Surprisingly, we find that the primary stage of mainstream network models is sufficient to represent most pixels of the road for segmentation. Motivated by this, we propose a Low-level Feature Dominated Road Segmentation network (LFD-RoadSeg). Specifically, LFD-RoadSeg employs a bilateral structure. The spatial detail branch is firstly designed to extract low-level feature representation for the road by the first stage of ResNet-18. To suppress texture-less regions mistaken as the road in the low-level feature, the context semantic branch is then designed to ext",
    "path": "papers/24/02/2402.02430.json",
    "total_tokens": 905,
    "translated_title": "利用低层次表示进行超快速道路分割",
    "translated_abstract": "实现嵌入式平台上的实时性和准确性一直是道路分割方法的追求。为此，他们提出了许多轻量级网络。然而，他们忽视了道路是“物质”（背景或环境元素）而不是“东西”（特定可识别的对象）的事实，这激发了我们探索用低层次特征而不是高层次特征来表示道路的可行性。令人惊讶的是，我们发现主流网络模型的主要阶段足以表示大部分像素的道路进行分割。在此基础上，我们提出了一个以低层次特征为主导的道路分割网络（LFD-RoadSeg）。具体而言，LFD-RoadSeg采用了双边结构。首先设计了空间细节分支，通过ResNet-18的第一阶段提取道路的低层次特征表示。然后设计了上下文语义分支，以抑制低层次特征中错误地将无纹理区域误认为道路。",
    "tldr": "本研究利用低层次特征表示进行道路分割，在主流网络模型的主要阶段实现了大部分道路像素的准确表示，提出了以低层次特征为主导的道路分割网络（LFD-RoadSeg）。",
    "en_tdlr": "This study explores the use of low-level feature representations for road segmentation and achieves accurate representation of most road pixels in the primary stage of mainstream network models. It proposes a Low-level Feature Dominated Road Segmentation network (LFD-RoadSeg) as the solution."
}