{
    "title": "Solving Hierarchical Information-Sharing Dec-POMDPs: An Extensive-Form Game Approach",
    "abstract": "A recent theory shows that a multi-player decentralized partially observable Markov decision process can be transformed into an equivalent single-player game, enabling the application of \\citeauthor{bellman}'s principle of optimality to solve the single-player game by breaking it down into single-stage subgames. However, this approach entangles the decision variables of all players at each single-stage subgame, resulting in backups with a double-exponential complexity. This paper demonstrates how to disentangle these decision variables while maintaining optimality under hierarchical information sharing, a prominent management style in our society. To achieve this, we apply the principle of optimality to solve any single-stage subgame by breaking it down further into smaller subgames, enabling us to make single-player decisions at a time. Our approach reveals that extensive-form games always exist with solutions to a single-stage subgame, significantly reducing time complexity. Our expe",
    "link": "https://arxiv.org/abs/2402.02954",
    "context": "Title: Solving Hierarchical Information-Sharing Dec-POMDPs: An Extensive-Form Game Approach\nAbstract: A recent theory shows that a multi-player decentralized partially observable Markov decision process can be transformed into an equivalent single-player game, enabling the application of \\citeauthor{bellman}'s principle of optimality to solve the single-player game by breaking it down into single-stage subgames. However, this approach entangles the decision variables of all players at each single-stage subgame, resulting in backups with a double-exponential complexity. This paper demonstrates how to disentangle these decision variables while maintaining optimality under hierarchical information sharing, a prominent management style in our society. To achieve this, we apply the principle of optimality to solve any single-stage subgame by breaking it down further into smaller subgames, enabling us to make single-player decisions at a time. Our approach reveals that extensive-form games always exist with solutions to a single-stage subgame, significantly reducing time complexity. Our expe",
    "path": "papers/24/02/2402.02954.json",
    "total_tokens": 1003,
    "translated_title": "解决分层信息共享的分布式部分可观察马尔可夫决策过程：一种广义博弈方法",
    "translated_abstract": "最近的理论表明，多人分散的部分可观察马尔可夫决策过程可以转化为等效的单人游戏，使得可以应用贝尔曼的最优性原理通过将其分解为单阶段子游戏来解决单人游戏。然而，这种方法在每个单阶段子游戏中纠缠了所有玩家的决策变量，导致指数复杂度的备份。本文展示了如何在保持分层信息共享的前提下解开这些决策变量的纠缠，这是我们社会中一种突出的管理风格。为了实现这个目标，我们应用最优性原理通过进一步将任何单阶段子游戏分解为更小的子游戏来解决它，使我们能够逐次进行单人决策。我们的方法揭示了存在于单阶段子游戏中的广义博弈解决方案，极大地减少了时间复杂度。我们的实验结果验证了我们方法的有效性，证明它可以在解决分层信息共享的分布式部分可观察马尔可夫决策过程中发挥重要作用。",
    "tldr": "本文通过应用最优性原理研究了分层信息共享的分布式部分可观察马尔可夫决策过程的解决方法。通过将问题分解成单阶段子游戏，并通过进一步分解子游戏，我们成功地解开了决策变量的纠缠，同时显著减少了时间复杂度。",
    "en_tdlr": "This paper presents a solution for solving hierarchical information-sharing decentralized partially observable Markov decision processes by applying the principle of optimality. By breaking down the problem into single-stage subgames and further decomposing them, the entanglement of decision variables is resolved, leading to a significant reduction in time complexity."
}