{
    "title": "Differential Private Federated Transfer Learning for Mental Health Monitoring in Everyday Settings: A Case Study on Stress Detection",
    "abstract": "arXiv:2402.10862v1 Announce Type: new  Abstract: Mental health conditions, prevalent across various demographics, necessitate efficient monitoring to mitigate their adverse impacts on life quality. The surge in data-driven methodologies for mental health monitoring has underscored the importance of privacy-preserving techniques in handling sensitive health data. Despite strides in federated learning for mental health monitoring, existing approaches struggle with vulnerabilities to certain cyber-attacks and data insufficiency in real-world applications. In this paper, we introduce a differential private federated transfer learning framework for mental health monitoring to enhance data privacy and enrich data sufficiency. To accomplish this, we integrate federated learning with two pivotal elements: (1) differential privacy, achieved by introducing noise into the updates, and (2) transfer learning, employing a pre-trained universal model to adeptly address issues of data imbalance and in",
    "link": "https://arxiv.org/abs/2402.10862",
    "context": "Title: Differential Private Federated Transfer Learning for Mental Health Monitoring in Everyday Settings: A Case Study on Stress Detection\nAbstract: arXiv:2402.10862v1 Announce Type: new  Abstract: Mental health conditions, prevalent across various demographics, necessitate efficient monitoring to mitigate their adverse impacts on life quality. The surge in data-driven methodologies for mental health monitoring has underscored the importance of privacy-preserving techniques in handling sensitive health data. Despite strides in federated learning for mental health monitoring, existing approaches struggle with vulnerabilities to certain cyber-attacks and data insufficiency in real-world applications. In this paper, we introduce a differential private federated transfer learning framework for mental health monitoring to enhance data privacy and enrich data sufficiency. To accomplish this, we integrate federated learning with two pivotal elements: (1) differential privacy, achieved by introducing noise into the updates, and (2) transfer learning, employing a pre-trained universal model to adeptly address issues of data imbalance and in",
    "path": "papers/24/02/2402.10862.json",
    "total_tokens": 869,
    "translated_title": "在日常环境中的差分隐私联邦迁移学习用于心理健康监测：以压力检测为案例研究",
    "translated_abstract": "心理健康状况在各个人群中普遍存在，需要有效的监测来减轻其对生活质量的不利影响。数据驱动的心理健康监测方法的兴起强调了在处理敏感健康数据时隐私保护技术的重要性。尽管联邦学习在心理健康监测方面取得了进展，但现有方法在应对特定网络攻击和现实应用中的数据不足方面存在困难。本文介绍了一种差分私有联邦迁移学习框架，用于增强数据隐私性并丰富数据充足性。为实现这一目标，我们将联邦学习与差分隐私（通过将噪声引入更新）和迁移学习（利用预训练的通用模型）两个关键元素相结合，以应对数据不平衡和缺如问题。",
    "tldr": "该论文介绍了一种差分私有联邦迁移学习框架，结合差分隐私和迁移学习，以提升心理健康监测中的数据隐私性和数据充足性。",
    "en_tdlr": "This paper presents a differential private federated transfer learning framework that integrates differential privacy and transfer learning to enhance data privacy and data sufficiency in mental health monitoring."
}