{
    "title": "A Deep-Learning Technique to Locate Cryptographic Operations in Side-Channel Traces",
    "abstract": "arXiv:2402.19037v1 Announce Type: cross  Abstract: Side-channel attacks allow extracting secret information from the execution of cryptographic primitives by correlating the partially known computed data and the measured side-channel signal. However, to set up a successful side-channel attack, the attacker has to perform i) the challenging task of locating the time instant in which the target cryptographic primitive is executed inside a side-channel trace and then ii)the time-alignment of the measured data on that time instant. This paper presents a novel deep-learning technique to locate the time instant in which the target computed cryptographic operations are executed in the side-channel trace. In contrast to state-of-the-art solutions, the proposed methodology works even in the presence of trace deformations obtained through random delay insertion techniques. We validated our proposal through a successful attack against a variety of unprotected and protected cryptographic primitive",
    "link": "https://arxiv.org/abs/2402.19037",
    "context": "Title: A Deep-Learning Technique to Locate Cryptographic Operations in Side-Channel Traces\nAbstract: arXiv:2402.19037v1 Announce Type: cross  Abstract: Side-channel attacks allow extracting secret information from the execution of cryptographic primitives by correlating the partially known computed data and the measured side-channel signal. However, to set up a successful side-channel attack, the attacker has to perform i) the challenging task of locating the time instant in which the target cryptographic primitive is executed inside a side-channel trace and then ii)the time-alignment of the measured data on that time instant. This paper presents a novel deep-learning technique to locate the time instant in which the target computed cryptographic operations are executed in the side-channel trace. In contrast to state-of-the-art solutions, the proposed methodology works even in the presence of trace deformations obtained through random delay insertion techniques. We validated our proposal through a successful attack against a variety of unprotected and protected cryptographic primitive",
    "path": "papers/24/02/2402.19037.json",
    "total_tokens": 687,
    "translated_title": "一种用于定位侧信道跟踪中密码操作的深度学习技术",
    "translated_abstract": "侧信道攻击通过相关部分已知计算数据和已测量的侧信道信号，允许从加密原语的执行中提取秘密信息。本文提出了一种新颖的深度学习技术，用于定位侧信道追踪中执行的目标计算密码操作的时间瞬间。与现有解决方案相比，所提出的方法甚至在通过随机延迟插入技术获得的跟踪变形的情况下也能工作。",
    "tldr": "通过深度学习技术，成功实现了在侧信道跟踪中定位目标加密操作的时间瞬间，即使存在跟踪变形。",
    "en_tdlr": "Successfully locating the time instant of target cryptographic operations in side-channel traces through deep-learning technique, even in the presence of trace deformations."
}