{
    "title": "Copyleft for Alleviating AIGC Copyright Dilemma: What-if Analysis, Public Perception and Implications",
    "abstract": "arXiv:2402.12216v1 Announce Type: cross  Abstract: As AIGC has impacted our society profoundly in the past years, ethical issues have received tremendous attention. The most urgent one is the AIGC copyright dilemma, which can immensely stifle the development of AIGC and greatly cost the entire society. Given the complexity of AIGC copyright governance and the fact that no perfect solution currently exists, previous work advocated copyleft on AI governance but without substantive analysis. In this paper, we take a step further to explore the feasibility of copyleft to alleviate the AIGC copyright dilemma. We conduct a mixed-methods study from two aspects: qualitatively, we use a formal what-if analysis to clarify the dilemma and provide case studies to show the feasibility of copyleft; quantitatively, we perform a carefully designed survey to find out how the public feels about copylefting AIGC. The key findings include: a) people generally perceive the dilemma, b) they prefer to use au",
    "link": "https://arxiv.org/abs/2402.12216",
    "context": "Title: Copyleft for Alleviating AIGC Copyright Dilemma: What-if Analysis, Public Perception and Implications\nAbstract: arXiv:2402.12216v1 Announce Type: cross  Abstract: As AIGC has impacted our society profoundly in the past years, ethical issues have received tremendous attention. The most urgent one is the AIGC copyright dilemma, which can immensely stifle the development of AIGC and greatly cost the entire society. Given the complexity of AIGC copyright governance and the fact that no perfect solution currently exists, previous work advocated copyleft on AI governance but without substantive analysis. In this paper, we take a step further to explore the feasibility of copyleft to alleviate the AIGC copyright dilemma. We conduct a mixed-methods study from two aspects: qualitatively, we use a formal what-if analysis to clarify the dilemma and provide case studies to show the feasibility of copyleft; quantitatively, we perform a carefully designed survey to find out how the public feels about copylefting AIGC. The key findings include: a) people generally perceive the dilemma, b) they prefer to use au",
    "path": "papers/24/02/2402.12216.json",
    "total_tokens": 948,
    "translated_title": "减轻AIGC版权困境的Copyleft：假设分析、公众认知和影响",
    "translated_abstract": "随着人工智能与全球治理（AIGC）在过去几年深刻影响我们的社会，伦理问题受到了极大关注。其中最紧迫的问题是AIGC版权困境，这可能极大地阻碍AIGC的发展并给整个社会带来巨大成本。鉴于AIGC版权治理的复杂性以及当前没有完美解决方案的事实，先前的研究主张在AI治理中采用Copyleft，但没有进行实质性分析。本文进一步探讨了采用Copyleft减轻AIGC版权困境的可行性。我们从两个方面进行了混合方法研究：在定性方面，我们使用了正式的假设分析来澄清困境，并提供案例研究来展示Copyleft的可行性；在定量方面，我们进行了精心设计的调查，以了解公众对AIGC使用Copyleft的看法。关键发现包括：a）人们普遍感知到这一困境，b）他们更倾向于使用自由授权.",
    "tldr": "本研究探讨了通过采用Copyleft减轻AIGC版权困境的可行性，通过定性和定量研究发现，人们普遍感知到困境并倾向于使用自由授权。"
}