{
    "title": "AnthroScore: A Computational Linguistic Measure of Anthropomorphism",
    "abstract": "Anthropomorphism, or the attribution of human-like characteristics to non-human entities, has shaped conversations about the impacts and possibilities of technology. We present AnthroScore, an automatic metric of implicit anthropomorphism in language. We use a masked language model to quantify how non-human entities are implicitly framed as human by the surrounding context. We show that AnthroScore corresponds with human judgments of anthropomorphism and dimensions of anthropomorphism described in social science literature. Motivated by concerns of misleading anthropomorphism in computer science discourse, we use AnthroScore to analyze 15 years of research papers and downstream news articles. In research papers, we find that anthropomorphism has steadily increased over time, and that papers related to language models have the most anthropomorphism. Within ACL papers, temporal increases in anthropomorphism are correlated with key neural advancements. Building upon concerns of scientific",
    "link": "https://arxiv.org/abs/2402.02056",
    "context": "Title: AnthroScore: A Computational Linguistic Measure of Anthropomorphism\nAbstract: Anthropomorphism, or the attribution of human-like characteristics to non-human entities, has shaped conversations about the impacts and possibilities of technology. We present AnthroScore, an automatic metric of implicit anthropomorphism in language. We use a masked language model to quantify how non-human entities are implicitly framed as human by the surrounding context. We show that AnthroScore corresponds with human judgments of anthropomorphism and dimensions of anthropomorphism described in social science literature. Motivated by concerns of misleading anthropomorphism in computer science discourse, we use AnthroScore to analyze 15 years of research papers and downstream news articles. In research papers, we find that anthropomorphism has steadily increased over time, and that papers related to language models have the most anthropomorphism. Within ACL papers, temporal increases in anthropomorphism are correlated with key neural advancements. Building upon concerns of scientific",
    "path": "papers/24/02/2402.02056.json",
    "total_tokens": 848,
    "translated_title": "AnthroScore: 一种计算语言学的人性度量方法",
    "translated_abstract": "人形化，即将人类特征赋予非人类实体，已经塑造了关于技术影响和可能性的对话。我们提出了AnthroScore，一种隐含人性化语言的自动度量标准。我们使用遮蔽语言模型来量化非人类实体在周围语境中被隐式地框架为人类的程度。我们证明了AnthroScore与人类对人性化的判断以及社会科学文献中描述的人性化维度相一致。受到计算机科学话语中误导性人形化的担忧的驱动，我们使用AnthroScore分析了15年的研究论文和下游新闻文章。在研究论文中，我们发现人形化在时间上稳步增加，并且与语言模型相关的论文中具有最高的人形化水平。在ACL论文中，人形化的时间增加与关键神经进展相关。在科学担忧的基础上构建。",
    "tldr": "AnthroScore是一种计算语言学的度量方法，用于隐含人性化语言。研究发现，AnthroScore与人类对人性化的判断和社会科学文献中的人性化维度相一致。分析结果显示，近15年来研究论文中的人形化水平稳步增加，与语言模型相关的论文具有最高的人形化水平。"
}