{
    "title": "Balancing Spectral, Temporal and Spatial Information for EEG-based Alzheimer's Disease Classification",
    "abstract": "arXiv:2402.13523v1 Announce Type: cross  Abstract: The prospect of future treatment warrants the development of cost-effective screening for Alzheimer's disease (AD). A promising candidate in this regard is electroencephalography (EEG), as it is one of the most economic imaging modalities. Recent efforts in EEG analysis have shifted towards leveraging spatial information, employing novel frameworks such as graph signal processing or graph neural networks. Here, we systematically investigate the importance of spatial information relative to spectral or temporal information by varying the proportion of each dimension for AD classification. To do so, we test various dimension resolution configurations on two routine EEG datasets. We find that spatial information is consistently more relevant than temporal information and equally relevant as spectral information. These results emphasise the necessity to consider spatial information for EEG-based AD classification. On our second dataset, we",
    "link": "https://arxiv.org/abs/2402.13523",
    "context": "Title: Balancing Spectral, Temporal and Spatial Information for EEG-based Alzheimer's Disease Classification\nAbstract: arXiv:2402.13523v1 Announce Type: cross  Abstract: The prospect of future treatment warrants the development of cost-effective screening for Alzheimer's disease (AD). A promising candidate in this regard is electroencephalography (EEG), as it is one of the most economic imaging modalities. Recent efforts in EEG analysis have shifted towards leveraging spatial information, employing novel frameworks such as graph signal processing or graph neural networks. Here, we systematically investigate the importance of spatial information relative to spectral or temporal information by varying the proportion of each dimension for AD classification. To do so, we test various dimension resolution configurations on two routine EEG datasets. We find that spatial information is consistently more relevant than temporal information and equally relevant as spectral information. These results emphasise the necessity to consider spatial information for EEG-based AD classification. On our second dataset, we",
    "path": "papers/24/02/2402.13523.json",
    "total_tokens": 861,
    "translated_title": "平衡脑电图中的频谱、时间和空间信息用于基于脑电图的阿尔茨海默病分类",
    "translated_abstract": "未来治疗前景需要开发经济有效的阿尔茨海默病筛查方法。在这方面，脑电图（EEG）是一个有前途的候选方法，因为它是最经济的成像模式之一。最近的脑电图分析工作已经转向利用空间信息，采用新颖的框架，如图信号处理或图神经网络。在本研究中，我们系统地调查了相对于频谱或时间信息的空间信息的重要性，通过改变每个维度所占比例来进行阿尔茨海默病分类。为此，我们在两个常规脑电图数据集上测试了各种维度分辨率配置。我们发现，空间信息始终比时间信息更相关，与频谱信息的相关性相同。这些结果强调了考虑空间信息进行基于脑电图的阿尔茨海默病分类的必要性。在我们的第二个数据集上，",
    "tldr": "通过变化每个维度的比例来调查空间信息对于脑电图阿尔茨海默病分类的重要性，结果表明空间信息比时间信息更相关，与频谱信息的相关性相同",
    "en_tdlr": "Investigating the importance of spatial information for EEG-based Alzheimer's Disease classification by varying the proportion of each dimension, showing that spatial information is more relevant than temporal information and equally relevant as spectral information."
}