{
    "title": "Leveraging AI to Advance Science and Computing Education across Africa: Progress, Challenges, and Opportunities",
    "abstract": "Across the African continent, students grapple with various educational challenges, including limited access to essential resources such as computers, internet connectivity, reliable electricity, and a shortage of qualified teachers. Despite these challenges, recent advances in AI such as BERT, and GPT-4 have demonstrated their potential for advancing education. Yet, these AI tools tend to be deployed and evaluated predominantly within the context of Western educational settings, with limited attention directed towards the unique needs and challenges faced by students in Africa. In this book chapter, we describe our works developing and deploying AI in Education tools in Africa: (1) SuaCode, an AI-powered app that enables Africans to learn to code using their smartphones, (2) AutoGrad, an automated grading, and feedback tool for graphical and interactive coding assignments, (3) a tool for code plagiarism detection that shows visual evidence of plagiarism, (4) Kwame, a bilingual AI teac",
    "link": "https://arxiv.org/abs/2402.07397",
    "context": "Title: Leveraging AI to Advance Science and Computing Education across Africa: Progress, Challenges, and Opportunities\nAbstract: Across the African continent, students grapple with various educational challenges, including limited access to essential resources such as computers, internet connectivity, reliable electricity, and a shortage of qualified teachers. Despite these challenges, recent advances in AI such as BERT, and GPT-4 have demonstrated their potential for advancing education. Yet, these AI tools tend to be deployed and evaluated predominantly within the context of Western educational settings, with limited attention directed towards the unique needs and challenges faced by students in Africa. In this book chapter, we describe our works developing and deploying AI in Education tools in Africa: (1) SuaCode, an AI-powered app that enables Africans to learn to code using their smartphones, (2) AutoGrad, an automated grading, and feedback tool for graphical and interactive coding assignments, (3) a tool for code plagiarism detection that shows visual evidence of plagiarism, (4) Kwame, a bilingual AI teac",
    "path": "papers/24/02/2402.07397.json",
    "total_tokens": 962,
    "translated_title": "利用人工智能推进非洲科学和计算教育：进展、挑战和机遇",
    "translated_abstract": "在非洲大陆，学生们面临着各种教育挑战，包括获取计算机、网络连接、可靠电力和合格教师等基本资源的限制。尽管存在这些挑战，但最近人工智能（如BERT和GPT-4）的进展已经展示了其促进教育的潜力。然而，这些人工智能工具往往在西方教育环境中进行部署和评估，对非洲学生面临的独特需求和挑战的关注有限。在本章中，我们描述了我们在非洲开发和部署人工智能教育工具的工作：（1）SuaCode，一款AI动力的应用程序，使非洲人可以使用智能手机学习编程，（2）AutoGrad，用于图形和交互式编程作业的自动评分和反馈工具，（3）一种代码抄袭检测工具，展示了抄袭的可视证据，（4）Kwame，一款双语的AI教师。",
    "tldr": "这项研究描述了在非洲开发和使用人工智能教育工具的工作，包括SuaCode学习编码应用、AutoGrad自动评分和反馈工具、代码抄袭检测工具以及双语AI教师Kwame。这些工具有助于解决非洲学生在教育中面临的挑战。",
    "en_tdlr": "This research describes the development and use of AI education tools in Africa, including SuaCode for learning coding, AutoGrad for automated grading and feedback, a code plagiarism detection tool, and a bilingual AI teacher named Kwame. These tools help address the challenges faced by African students in education."
}