{
    "title": "Regularization by denoising: Bayesian model and Langevin-within-split Gibbs sampling",
    "abstract": "arXiv:2402.12292v1 Announce Type: cross  Abstract: This paper introduces a Bayesian framework for image inversion by deriving a probabilistic counterpart to the regularization-by-denoising (RED) paradigm. It additionally implements a Monte Carlo algorithm specifically tailored for sampling from the resulting posterior distribution, based on an asymptotically exact data augmentation (AXDA). The proposed algorithm is an approximate instance of split Gibbs sampling (SGS) which embeds one Langevin Monte Carlo step. The proposed method is applied to common imaging tasks such as deblurring, inpainting and super-resolution, demonstrating its efficacy through extensive numerical experiments. These contributions advance Bayesian inference in imaging by leveraging data-driven regularization strategies within a probabilistic framework.",
    "link": "https://arxiv.org/abs/2402.12292",
    "context": "Title: Regularization by denoising: Bayesian model and Langevin-within-split Gibbs sampling\nAbstract: arXiv:2402.12292v1 Announce Type: cross  Abstract: This paper introduces a Bayesian framework for image inversion by deriving a probabilistic counterpart to the regularization-by-denoising (RED) paradigm. It additionally implements a Monte Carlo algorithm specifically tailored for sampling from the resulting posterior distribution, based on an asymptotically exact data augmentation (AXDA). The proposed algorithm is an approximate instance of split Gibbs sampling (SGS) which embeds one Langevin Monte Carlo step. The proposed method is applied to common imaging tasks such as deblurring, inpainting and super-resolution, demonstrating its efficacy through extensive numerical experiments. These contributions advance Bayesian inference in imaging by leveraging data-driven regularization strategies within a probabilistic framework.",
    "path": "papers/24/02/2402.12292.json",
    "total_tokens": 806,
    "translated_title": "正则化去噪：贝叶斯模型和随后的Langevin-within-split Gibbs采样",
    "translated_abstract": "本文介绍了一种贝叶斯框架，通过推导出一个概率化的相对应于正则化去噪（RED）范式的方法实现对图像反演。此外，它实现了一个蒙特卡洛算法，专门设计用于从所得的后验分布中采样，基于渐近精确数据增广（AXDA）。所提出的算法是一个嵌入了一个Langevin蒙特卡洛步骤的拆分Gibbs采样（SGS）的近似实例。所提出的方法应用于常见的成像任务，如去模糊、修补和超分辨率，通过大量的数值实验展示了其有效性。这些贡献通过在概率框架内利用数据驱动的正则化策略，促进了成像中的贝叶斯推断。",
    "tldr": "该论文引入了一种贝叶斯框架，通过将数据驱动的正则化策略融入概率框架，提出了一种正则化去噪的方法，并应用于图像反演任务中，在成像中推动了贝叶斯推断。",
    "en_tdlr": "The paper introduces a Bayesian framework for regularization by denoising in imaging tasks, advancing Bayesian inference by incorporating data-driven regularization strategies within a probabilistic framework."
}