{
    "title": "Scaling on-chip photonic neural processors using arbitrarily programmable wave propagation",
    "abstract": "arXiv:2402.17750v1 Announce Type: cross  Abstract: On-chip photonic processors for neural networks have potential benefits in both speed and energy efficiency but have not yet reached the scale at which they can outperform electronic processors. The dominant paradigm for designing on-chip photonics is to make networks of relatively bulky discrete components connected by one-dimensional waveguides. A far more compact alternative is to avoid explicitly defining any components and instead sculpt the continuous substrate of the photonic processor to directly perform the computation using waves freely propagating in two dimensions. We propose and demonstrate a device whose refractive index as a function of space, $n(x,z)$, can be rapidly reprogrammed, allowing arbitrary control over the wave propagation in the device. Our device, a 2D-programmable waveguide, combines photoconductive gain with the electro-optic effect to achieve massively parallel modulation of the refractive index of a slab",
    "link": "https://arxiv.org/abs/2402.17750",
    "context": "Title: Scaling on-chip photonic neural processors using arbitrarily programmable wave propagation\nAbstract: arXiv:2402.17750v1 Announce Type: cross  Abstract: On-chip photonic processors for neural networks have potential benefits in both speed and energy efficiency but have not yet reached the scale at which they can outperform electronic processors. The dominant paradigm for designing on-chip photonics is to make networks of relatively bulky discrete components connected by one-dimensional waveguides. A far more compact alternative is to avoid explicitly defining any components and instead sculpt the continuous substrate of the photonic processor to directly perform the computation using waves freely propagating in two dimensions. We propose and demonstrate a device whose refractive index as a function of space, $n(x,z)$, can be rapidly reprogrammed, allowing arbitrary control over the wave propagation in the device. Our device, a 2D-programmable waveguide, combines photoconductive gain with the electro-optic effect to achieve massively parallel modulation of the refractive index of a slab",
    "path": "papers/24/02/2402.17750.json",
    "total_tokens": 847,
    "translated_title": "利用任意可编程波传播来扩展芯片光子神经处理器的规模",
    "translated_abstract": "用于神经网络的芯片光子处理器在速度和能量效率方面具有潜在优势，但尚未达到能够胜过电子处理器的规模。设计芯片光子学的主导范式是制作由相对笨重的离散元件构成的网络，这些元件通过一维波导连接。一个更紧凑的替代方案是避免明确定义任何元件，而是通过在两个维度中自由传播的波直接塑造光子处理器的连续衬底来执行计算。我们提出并展示了一种可以快速重新编程空间折射率$n(x,z)$的设备，从而实现对设备中波传播的任意控制。我们的设备，一维可编程波导，将光电导增益与电光效应结合，实现了对板块的折射率的并行调制。",
    "tldr": "提出并演示了一种利用任意可编程波传播的2D波导器件，通过组合光电导增益和电光效应实现对板块的折射率进行大规模并行调制",
    "en_tdlr": "Proposed and demonstrated a 2D programmable waveguide device that achieves massively parallel modulation of the refractive index of a slab using a combination of photoconductive gain and the electro-optic effect."
}