{
    "title": "Large-scale Generative AI Models Lack Visual Number Sense",
    "abstract": "Humans can readily judge the number of objects in a visual scene, even without counting, and such a skill has been documented in a variety of animal species and in babies prior to language development and formal schooling. Numerical judgments are error-free for small sets, while for larger collections responses become approximate, with variability increasing proportionally to the target number. This response pattern is observed for items of all kinds, despite variation in object features (such as color or shape), suggesting that our visual number sense relies on abstract representations of numerosity. Here, we investigated whether generative Artificial Intelligence (AI) models based on large-scale transformer architectures can reliably name the number of objects in simple visual stimuli or generate images containing a target number of items in the 1-10 range. Surprisingly, none of the foundation models considered performed in a human-like way: They all made striking errors even with sm",
    "link": "https://arxiv.org/abs/2402.03328",
    "context": "Title: Large-scale Generative AI Models Lack Visual Number Sense\nAbstract: Humans can readily judge the number of objects in a visual scene, even without counting, and such a skill has been documented in a variety of animal species and in babies prior to language development and formal schooling. Numerical judgments are error-free for small sets, while for larger collections responses become approximate, with variability increasing proportionally to the target number. This response pattern is observed for items of all kinds, despite variation in object features (such as color or shape), suggesting that our visual number sense relies on abstract representations of numerosity. Here, we investigated whether generative Artificial Intelligence (AI) models based on large-scale transformer architectures can reliably name the number of objects in simple visual stimuli or generate images containing a target number of items in the 1-10 range. Surprisingly, none of the foundation models considered performed in a human-like way: They all made striking errors even with sm",
    "path": "papers/24/02/2402.03328.json",
    "total_tokens": 921,
    "translated_title": "大规模生成AI模型缺乏视觉数字感知能力",
    "translated_abstract": "人类能够在视觉场景中轻松判断物体的数量，即使不进行计数，而且这种技能在各种动物物种和语言发展和正式学校教育之前的婴儿中都有记录。对于小的物体集，数字判断是无误的，而对于更大的集合，回应变得近似，并且变异性与目标数字成比例增加。尽管物体特征（如颜色或形状）存在差异，但这种回应模式在所有类型的物体上观察到，这表明我们的视觉数字感知依赖于数字数量的抽象表示。在本研究中，我们调查了基于大规模Transformer架构的生成性人工智能（AI）模型是否可以可靠地命名简单视觉刺激中的物体数量或生成包含目标物品数量的图像（1-10范围内）。令人惊讶的是，所考虑的所有基础模型都没有以类似人类一样的方式表现出来：即使是具有较小数量的物体也会犯下显著的错误。",
    "tldr": "本研究调查了基于大规模Transformer架构的生成性AI模型是否能够准确命名物体数量或生成包含目标数量物品的图像，结果发现这些模型都没有以类似人类的方式表现，并且即使对于小数量的物体也会出现显著的错误。",
    "en_tdlr": "This study investigates whether generative AI models based on large-scale transformer architectures can accurately name object quantities or generate images with a target number of items. The results show that these models do not perform in a human-like manner and make significant errors even for small quantities of objects."
}