{
    "title": "Key Design Choices in Source-Free Unsupervised Domain Adaptation: An In-depth Empirical Analysis",
    "abstract": "arXiv:2402.16090v1 Announce Type: cross  Abstract: This study provides a comprehensive benchmark framework for Source-Free Unsupervised Domain Adaptation (SF-UDA) in image classification, aiming to achieve a rigorous empirical understanding of the complex relationships between multiple key design factors in SF-UDA methods. The study empirically examines a diverse set of SF-UDA techniques, assessing their consistency across datasets, sensitivity to specific hyperparameters, and applicability across different families of backbone architectures. Moreover, it exhaustively evaluates pre-training datasets and strategies, particularly focusing on both supervised and self-supervised methods, as well as the impact of fine-tuning on the source domain. Our analysis also highlights gaps in existing benchmark practices, guiding SF-UDA research towards more effective and general approaches. It emphasizes the importance of backbone architecture and pre-training dataset selection on SF-UDA performance",
    "link": "https://arxiv.org/abs/2402.16090",
    "context": "Title: Key Design Choices in Source-Free Unsupervised Domain Adaptation: An In-depth Empirical Analysis\nAbstract: arXiv:2402.16090v1 Announce Type: cross  Abstract: This study provides a comprehensive benchmark framework for Source-Free Unsupervised Domain Adaptation (SF-UDA) in image classification, aiming to achieve a rigorous empirical understanding of the complex relationships between multiple key design factors in SF-UDA methods. The study empirically examines a diverse set of SF-UDA techniques, assessing their consistency across datasets, sensitivity to specific hyperparameters, and applicability across different families of backbone architectures. Moreover, it exhaustively evaluates pre-training datasets and strategies, particularly focusing on both supervised and self-supervised methods, as well as the impact of fine-tuning on the source domain. Our analysis also highlights gaps in existing benchmark practices, guiding SF-UDA research towards more effective and general approaches. It emphasizes the importance of backbone architecture and pre-training dataset selection on SF-UDA performance",
    "path": "papers/24/02/2402.16090.json",
    "total_tokens": 888,
    "translated_title": "无源无监督领域自适应中的关键设计选择：深入实证分析",
    "translated_abstract": "本研究为图像分类中的无源无监督领域自适应（SF-UDA）提供了全面的基准框架，旨在通过严谨的实证理解SF-UDA方法中多个关键设计因素之间复杂关系。研究从实证角度检验了多种SF-UDA技术，评估其在数据集上的一致性、对特定超参数的敏感性以及在不同主干架构系列上的适用性。此外，它全面评估了预训练数据集和策略，特别关注监督和自监督方法，以及微调对源领域的影响。我们的分析还强调了现有基准实践中的差距，引导SF-UDA研究朝着更有效和通用的方法发展。它强调了主干架构和预训练数据集选择对SF-UDA性能的重要性。",
    "tldr": "无源无监督领域自适应中的关键设计选择研究了多种技术，评估了它们在数据集上的表现、对超参数的敏感性，以及在不同主干架构上的适用性，强调了主干架构和预训练数据集选择对性能的重要性",
    "en_tdlr": "Key design choices in source-free unsupervised domain adaptation were studied, evaluating various techniques' performance on datasets, sensitivity to hyperparameters, and applicability on different backbone architectures, emphasizing the importance of backbone architecture and pre-training dataset selection on performance."
}