{
    "title": "An Iterative Associative Memory Model for Empathetic Response Generation",
    "abstract": "arXiv:2402.17959v1 Announce Type: new  Abstract: Empathetic response generation is to comprehend the cognitive and emotional states in dialogue utterances and generate proper responses. Psychological theories posit that comprehending emotional and cognitive states necessitates iteratively capturing and understanding associated words across dialogue utterances. However, existing approaches regard dialogue utterances as either a long sequence or independent utterances for comprehension, which are prone to overlook the associated words between them. To address this issue, we propose an Iterative Associative Memory Model (IAMM) for empathetic response generation. Specifically, we employ a novel second-order interaction attention mechanism to iteratively capture vital associated words between dialogue utterances and situations, dialogue history, and a memory module (for storing associated words), thereby accurately and nuancedly comprehending the utterances. We conduct experiments on the Em",
    "link": "https://arxiv.org/abs/2402.17959",
    "context": "Title: An Iterative Associative Memory Model for Empathetic Response Generation\nAbstract: arXiv:2402.17959v1 Announce Type: new  Abstract: Empathetic response generation is to comprehend the cognitive and emotional states in dialogue utterances and generate proper responses. Psychological theories posit that comprehending emotional and cognitive states necessitates iteratively capturing and understanding associated words across dialogue utterances. However, existing approaches regard dialogue utterances as either a long sequence or independent utterances for comprehension, which are prone to overlook the associated words between them. To address this issue, we propose an Iterative Associative Memory Model (IAMM) for empathetic response generation. Specifically, we employ a novel second-order interaction attention mechanism to iteratively capture vital associated words between dialogue utterances and situations, dialogue history, and a memory module (for storing associated words), thereby accurately and nuancedly comprehending the utterances. We conduct experiments on the Em",
    "path": "papers/24/02/2402.17959.json",
    "total_tokens": 792,
    "translated_title": "一种用于共情响应生成的迭代关联记忆模型",
    "translated_abstract": "共情响应生成是理解对话话语中的认知和情感状态，并生成恰当回应。心理学理论认为，理解情感和认知状态需要迭代地捕捉和理解对话话语之间的相关词语。然而，现有方法将对话话语视为长序列或独立话语来理解，往往会忽视它们之间的关联词语。为解决这一问题，我们提出了一种用于共情响应生成的迭代关联记忆模型（IAMM）。具体来说，我们采用一种新颖的二阶交互注意机制，迭代地捕捉对话话语、情境、对话历史和记忆模块（用于存储相关词语）之间的重要关联词语，从而准确而细致地理解话语。",
    "tldr": "提出了一种用于共情响应生成的迭代关联记忆模型，采用二阶交互注意机制迭代地捕捉相关词语，实现准确、细致地理解话语。",
    "en_tdlr": "Proposed an Iterative Associative Memory Model for empathetic response generation, which uses a second-order interaction attention mechanism to iteratively capture associated words for accurate and nuanced comprehension of utterances."
}