{
    "title": "A step towards the integration of machine learning and small area estimation",
    "abstract": "The use of machine-learning techniques has grown in numerous research areas. Currently, it is also widely used in statistics, including the official statistics for data collection (e.g. satellite imagery, web scraping and text mining, data cleaning, integration and imputation) but also for data analysis. However, the usage of these methods in survey sampling including small area estimation is still very limited. Therefore, we propose a predictor supported by these algorithms which can be used to predict any population or subpopulation characteristics based on cross-sectional and longitudinal data. Machine learning methods have already been shown to be very powerful in identifying and modelling complex and nonlinear relationships between the variables, which means that they have very good properties in case of strong departures from the classic assumptions. Therefore, we analyse the performance of our proposal under a different set-up, in our opinion of greater importance in real-life s",
    "link": "https://arxiv.org/abs/2402.07521",
    "context": "Title: A step towards the integration of machine learning and small area estimation\nAbstract: The use of machine-learning techniques has grown in numerous research areas. Currently, it is also widely used in statistics, including the official statistics for data collection (e.g. satellite imagery, web scraping and text mining, data cleaning, integration and imputation) but also for data analysis. However, the usage of these methods in survey sampling including small area estimation is still very limited. Therefore, we propose a predictor supported by these algorithms which can be used to predict any population or subpopulation characteristics based on cross-sectional and longitudinal data. Machine learning methods have already been shown to be very powerful in identifying and modelling complex and nonlinear relationships between the variables, which means that they have very good properties in case of strong departures from the classic assumptions. Therefore, we analyse the performance of our proposal under a different set-up, in our opinion of greater importance in real-life s",
    "path": "papers/24/02/2402.07521.json",
    "total_tokens": 876,
    "translated_title": "机器学习与小区域估计的整合步骤",
    "translated_abstract": "机器学习技术的应用已经在许多研究领域得到了发展。目前，在统计学中，包括正式统计学在内，也广泛应用于数据收集（如卫星图像、网络爬取和文本挖掘、数据清洗、集成和插补）以及数据分析。然而，在调查抽样包括小区域估计方面，这些方法的使用仍然非常有限。因此，我们提出一个由这些算法支持的预测模型，可以根据横断面和纵向数据预测任何人群或子人群的特征。机器学习方法已经显示出在识别和建模变量之间复杂和非线性关系方面非常强大，这意味着在强烈偏离经典假设的情况下，它们具有非常好的性能。因此，我们分析了我们的模型在一种不同的背景下的表现，这个背景在我们看来在实际生活中更重要。",
    "tldr": "本文提出了一个基于机器学习算法的预测模型，可以根据横断面和纵向数据预测任何人群或子人群的特征，并分析了在实际生活中更重要的背景下的性能。",
    "en_tdlr": "This paper proposes a predictive model supported by machine learning algorithms, which can predict the characteristics of any population or subpopulation based on cross-sectional and longitudinal data. The performance of the model is analyzed in a context of greater importance in real-life situations."
}