{
    "title": "GraphKD: Exploring Knowledge Distillation Towards Document Object Detection with Structured Graph Creation",
    "abstract": "arXiv:2402.11401v1 Announce Type: cross  Abstract: Object detection in documents is a key step to automate the structural elements identification process in a digital or scanned document through understanding the hierarchical structure and relationships between different elements. Large and complex models, while achieving high accuracy, can be computationally expensive and memory-intensive, making them impractical for deployment on resource constrained devices. Knowledge distillation allows us to create small and more efficient models that retain much of the performance of their larger counterparts. Here we present a graph-based knowledge distillation framework to correctly identify and localize the document objects in a document image. Here, we design a structured graph with nodes containing proposal-level features and edges representing the relationship between the different proposal regions. Also, to reduce text bias an adaptive node sampling strategy is designed to prune the weight",
    "link": "https://arxiv.org/abs/2402.11401",
    "context": "Title: GraphKD: Exploring Knowledge Distillation Towards Document Object Detection with Structured Graph Creation\nAbstract: arXiv:2402.11401v1 Announce Type: cross  Abstract: Object detection in documents is a key step to automate the structural elements identification process in a digital or scanned document through understanding the hierarchical structure and relationships between different elements. Large and complex models, while achieving high accuracy, can be computationally expensive and memory-intensive, making them impractical for deployment on resource constrained devices. Knowledge distillation allows us to create small and more efficient models that retain much of the performance of their larger counterparts. Here we present a graph-based knowledge distillation framework to correctly identify and localize the document objects in a document image. Here, we design a structured graph with nodes containing proposal-level features and edges representing the relationship between the different proposal regions. Also, to reduce text bias an adaptive node sampling strategy is designed to prune the weight",
    "path": "papers/24/02/2402.11401.json",
    "total_tokens": 836,
    "translated_title": "GraphKD：探索知识蒸馏在文档目标检测中的应用，并通过结构化图创建实现",
    "translated_abstract": "在文档中进行目标检测是自动化识别数字或扫描文档中的结构元素的关键步骤，通过理解不同元素之间的分层结构和关系。大型和复杂的模型虽然可以实现高准确性，但在计算上昂贵且占用内存，使其在资源受限设备上部署变得不切实际。知识蒸馏允许我们创建小型且更高效的模型，这些模型保留了大型模型的大部分性能。在这里，我们提出了一种基于图的知识蒸馏框架，以正确识别并定位文档图像中的文档对象。在这里，我们设计了一个具有建议级特征的结构化图，边表示不同建议区域之间的关系。此外，为了减少文本偏见，设计了一种自适应节点抽样策略来修剪权重。",
    "tldr": "提出了一种基于图的知识蒸馏框架，用于在文档图像中识别和定位文档对象，以减少大型模型在资源受限设备上的部署成本"
}