{
    "title": "Towards Efficient Pareto-optimal Utility-Fairness between Groups in Repeated Rankings",
    "abstract": "arXiv:2402.14305v1 Announce Type: cross  Abstract: In this paper, we tackle the problem of computing a sequence of rankings with the guarantee of the Pareto-optimal balance between (1) maximizing the utility of the consumers and (2) minimizing unfairness between producers of the items. Such a multi-objective optimization problem is typically solved using a combination of a scalarization method and linear programming on bi-stochastic matrices, representing the distribution of possible rankings of items. However, the above-mentioned approach relies on Birkhoff-von Neumann (BvN) decomposition, of which the computational complexity is $\\mathcal{O}(n^5)$ with $n$ being the number of items, making it impractical for large-scale systems. To address this drawback, we introduce a novel approach to the above problem by using the Expohedron - a permutahedron whose points represent all achievable exposures of items. On the Expohedron, we profile the Pareto curve which captures the trade-off betwee",
    "link": "https://arxiv.org/abs/2402.14305",
    "context": "Title: Towards Efficient Pareto-optimal Utility-Fairness between Groups in Repeated Rankings\nAbstract: arXiv:2402.14305v1 Announce Type: cross  Abstract: In this paper, we tackle the problem of computing a sequence of rankings with the guarantee of the Pareto-optimal balance between (1) maximizing the utility of the consumers and (2) minimizing unfairness between producers of the items. Such a multi-objective optimization problem is typically solved using a combination of a scalarization method and linear programming on bi-stochastic matrices, representing the distribution of possible rankings of items. However, the above-mentioned approach relies on Birkhoff-von Neumann (BvN) decomposition, of which the computational complexity is $\\mathcal{O}(n^5)$ with $n$ being the number of items, making it impractical for large-scale systems. To address this drawback, we introduce a novel approach to the above problem by using the Expohedron - a permutahedron whose points represent all achievable exposures of items. On the Expohedron, we profile the Pareto curve which captures the trade-off betwee",
    "path": "papers/24/02/2402.14305.json",
    "total_tokens": 889,
    "translated_title": "有效实现在重复排名中群体间帕累托最优的效用—公平性",
    "translated_abstract": "在本文中，我们致力于解决计算具有帕累托最优平衡保证的一系列排名的问题，其中考虑了（1）最大化消费者效用和（2）最小化物品生产者之间的不公平性。这样的多目标优化问题通常使用标量化方法和线性规划来解决，基于表示物品可能排名分布的双随机矩阵。然而，上述方法依赖于Birkhoff-von Neumann（BvN）分解，其计算复杂度为$\\mathcal{O}(n^5)$，其中$n$是物品数量，这使得在大规模系统中变得不切实际。为解决这一缺陷，我们引入了一种新颖的方法，通过使用Expohedron来解决上述问题 - 一个表征所有可达到物品曝光的排列多面体。在Expohedron上，我们绘制了帕累托曲线，捕捉了在最大化效用和最小化不公平性之间的权衡。",
    "tldr": "引入了使用Expohedron解决帕累托最优效用-公平性问题的新方法，避免了Birkhoff-von Neumann分解的高计算复杂度。",
    "en_tdlr": "Introduced a novel approach using Expohedron to solve the Pareto-optimal utility-fairness problem, avoiding the high computational complexity of Birkhoff-von Neumann decomposition."
}