{
    "title": "Learning and Calibrating Heterogeneous Bounded Rational Market Behaviour with Multi-Agent Reinforcement Learning",
    "abstract": "Agent-based models (ABMs) have shown promise for modelling various real world phenomena incompatible with traditional equilibrium analysis. However, a critical concern is the manual definition of behavioural rules in ABMs. Recent developments in multi-agent reinforcement learning (MARL) offer a way to address this issue from an optimisation perspective, where agents strive to maximise their utility, eliminating the need for manual rule specification. This learning-focused approach aligns with established economic and financial models through the use of rational utility-maximising agents. However, this representation departs from the fundamental motivation for ABMs: that realistic dynamics emerging from bounded rationality and agent heterogeneity can be modelled. To resolve this apparent disparity between the two approaches, we propose a novel technique for representing heterogeneous processing-constrained agents within a MARL framework. The proposed approach treats agents as constraine",
    "link": "https://arxiv.org/abs/2402.00787",
    "context": "Title: Learning and Calibrating Heterogeneous Bounded Rational Market Behaviour with Multi-Agent Reinforcement Learning\nAbstract: Agent-based models (ABMs) have shown promise for modelling various real world phenomena incompatible with traditional equilibrium analysis. However, a critical concern is the manual definition of behavioural rules in ABMs. Recent developments in multi-agent reinforcement learning (MARL) offer a way to address this issue from an optimisation perspective, where agents strive to maximise their utility, eliminating the need for manual rule specification. This learning-focused approach aligns with established economic and financial models through the use of rational utility-maximising agents. However, this representation departs from the fundamental motivation for ABMs: that realistic dynamics emerging from bounded rationality and agent heterogeneity can be modelled. To resolve this apparent disparity between the two approaches, we propose a novel technique for representing heterogeneous processing-constrained agents within a MARL framework. The proposed approach treats agents as constraine",
    "path": "papers/24/02/2402.00787.json",
    "total_tokens": 883,
    "translated_title": "用多智能体强化学习学习和校准异质有界理性市场行为",
    "translated_abstract": "基于智能体的模型（ABM）已经显示出在无法与传统均衡分析兼容的各种现实世界现象建模方面的潜力。然而，一个关键问题是在ABM中手动定义行为规则。最近在多智能体强化学习（MARL）方面的发展提供了一种从优化角度解决这个问题的方法，智能体们努力最大化自己的效用，消除了手动规则规定的需要。这种以学习为重点的方法通过使用理性的效用最大化智能体与已有的经济和金融模型相一致。然而，这种表达方式违背了ABM的根本动机：可以建模从有界理性和智能体异质性中产生的真实动态。为了解决这两种方法之间的明显不一致，我们提出了一种在MARL框架中表示异质处理受限代理的新技术。",
    "tldr": "本论文提出了一种方法，利用多智能体强化学习学习和校准异质有界理性市场行为。这种方法可以消除在基于智能体的模型中手动定义行为规则的需要，并将智能体表示与经济和金融模型相一致。",
    "en_tdlr": "This paper proposes a method to learn and calibrate heterogeneous bounded rational market behavior using multi-agent reinforcement learning. The method eliminates the need for manual rule specification in agent-based models and aligns the representation of agents with established economic and financial models."
}