{
    "title": "Empowering Language Models with Active Inquiry for Deeper Understanding",
    "abstract": "The rise of large language models (LLMs) has revolutionized the way that we interact with artificial intelligence systems through natural language. However, LLMs often misinterpret user queries because of their uncertain intention, leading to less helpful responses. In natural human interactions, clarification is sought through targeted questioning to uncover obscure information. Thus, in this paper, we introduce LaMAI (Language Model with Active Inquiry), designed to endow LLMs with this same level of interactive engagement. LaMAI leverages active learning techniques to raise the most informative questions, fostering a dynamic bidirectional dialogue. This approach not only narrows the contextual gap but also refines the output of the LLMs, aligning it more closely with user expectations. Our empirical studies, across a variety of complex datasets where LLMs have limited conversational context, demonstrate the effectiveness of LaMAI. The method improves answer accuracy from 31.9% to 50",
    "link": "https://arxiv.org/abs/2402.03719",
    "context": "Title: Empowering Language Models with Active Inquiry for Deeper Understanding\nAbstract: The rise of large language models (LLMs) has revolutionized the way that we interact with artificial intelligence systems through natural language. However, LLMs often misinterpret user queries because of their uncertain intention, leading to less helpful responses. In natural human interactions, clarification is sought through targeted questioning to uncover obscure information. Thus, in this paper, we introduce LaMAI (Language Model with Active Inquiry), designed to endow LLMs with this same level of interactive engagement. LaMAI leverages active learning techniques to raise the most informative questions, fostering a dynamic bidirectional dialogue. This approach not only narrows the contextual gap but also refines the output of the LLMs, aligning it more closely with user expectations. Our empirical studies, across a variety of complex datasets where LLMs have limited conversational context, demonstrate the effectiveness of LaMAI. The method improves answer accuracy from 31.9% to 50",
    "path": "papers/24/02/2402.03719.json",
    "total_tokens": 847,
    "translated_title": "用主动询问赋予语言模型更深入的理解能力",
    "translated_abstract": "大型语言模型（LLMs）的兴起革新了我们通过自然语言与人工智能系统互动的方式。然而，由于LLMs对用户查询意图的不确定性，它们经常会错误解读用户的查询，导致不太有帮助的回复。在自然人类互动中，通过有针对性的问题寻求澄清，以揭示不明确的信息。因此，在本文中，我们引入了LaMAI（带有主动询问的语言模型），旨在赋予LLMs与用户的交互性。LaMAI利用主动学习技术提出最具信息量的问题，促进动态的双向对话。这种方法不仅缩小了上下文差距，还改善了LLMs的输出，使其更加符合用户的期望。我们在各种复杂数据集上进行的实证研究表明了LaMAI的有效性，特别是在LLMs的对话上下文有限的情况下，回答的准确率从31.9%提高到50%",
    "tldr": "本文提出了一种名为LaMAI的语言模型，通过主动询问的方式与用户进行交互，有效提高了对用户查询的理解能力，并减少了错误解读的发生。",
    "en_tdlr": "This paper introduces LaMAI, a language model that engages in interactive questioning with users to improve understanding and reduce misinterpretation."
}