{
    "title": "Improving Building Temperature Forecasting: A Data-driven Approach with System Scenario Clustering",
    "abstract": "arXiv:2402.13628v1 Announce Type: new  Abstract: Heat, Ventilation and Air Conditioning (HVAC) systems play a critical role in maintaining a comfortable thermal environment and cost approximately 40% of primary energy usage in the building sector. For smart energy management in buildings, usage patterns and their resulting profiles allow the improvement of control systems with prediction capabilities. However, for large-scale HVAC system management, it is difficult to construct a detailed model for each subsystem. In this paper, a new data-driven room temperature prediction model is proposed based on the k-means clustering method. The proposed data-driven temperature prediction approach extracts the system operation feature through historical data analysis and further simplifies the system-level model to improve generalization and computational efficiency. We evaluate the proposed approach in the real world. The results demonstrated that our approach can significantly reduce modeling t",
    "link": "https://arxiv.org/abs/2402.13628",
    "context": "Title: Improving Building Temperature Forecasting: A Data-driven Approach with System Scenario Clustering\nAbstract: arXiv:2402.13628v1 Announce Type: new  Abstract: Heat, Ventilation and Air Conditioning (HVAC) systems play a critical role in maintaining a comfortable thermal environment and cost approximately 40% of primary energy usage in the building sector. For smart energy management in buildings, usage patterns and their resulting profiles allow the improvement of control systems with prediction capabilities. However, for large-scale HVAC system management, it is difficult to construct a detailed model for each subsystem. In this paper, a new data-driven room temperature prediction model is proposed based on the k-means clustering method. The proposed data-driven temperature prediction approach extracts the system operation feature through historical data analysis and further simplifies the system-level model to improve generalization and computational efficiency. We evaluate the proposed approach in the real world. The results demonstrated that our approach can significantly reduce modeling t",
    "path": "papers/24/02/2402.13628.json",
    "total_tokens": 880,
    "translated_title": "改进建筑温度预测：一种基于系统场景聚类的数据驱动方法",
    "translated_abstract": "arXiv:2402.13628v1 公告类型：新 抽象：供热、通风和空调系统在维持舒适的热环境中起着至关重要的作用，占建筑部门约40%的主要能源使用量。为了实现建筑智能能源管理，使用模式及其产生的配置允许改进预测能力的控制系统。然而，对于大规模供热通风空调系统管理来说，为每个子系统构建详细模型是困难的。本文提出了一种基于k-means聚类方法的新的数据驱动室温预测模型。所提出的数据驱动温度预测方法通过历史数据分析提取系统运行特征，并进一步简化系统级模型以提高泛化和计算效率。我们在真实世界中评估了所提出的方法。结果表明，我们的方法可以显著减少建模时间。",
    "tldr": "本文提出了一种基于系统场景聚类的数据驱动室温预测模型，通过历史数据分析提取系统运行特征，进一步简化系统模型以提高泛化和计算效率，并在真实世界中取得了显著降低建模时间的效果。"
}