{
    "title": "The Potential of AutoML for Recommender Systems",
    "abstract": "Automated Machine Learning (AutoML) has greatly advanced applications of Machine Learning (ML) including model compression, machine translation, and computer vision. Recommender Systems (RecSys) can be seen as an application of ML. Yet, AutoML has found little attention in the RecSys community; nor has RecSys found notable attention in the AutoML community. Only few and relatively simple Automated Recommender Systems (AutoRecSys) libraries exist that adopt AutoML techniques. However, these libraries are based on student projects and do not offer the features and thorough development of AutoML libraries. We set out to determine how AutoML libraries perform in the scenario of an inexperienced user who wants to implement a recommender system. We compared the predictive performance of 60 AutoML, AutoRecSys, ML, and RecSys algorithms from 15 libraries, including a mean predictor baseline, on 14 explicit feedback RecSys datasets. To simulate the perspective of an inexperienced user, the algo",
    "link": "https://arxiv.org/abs/2402.04453",
    "context": "Title: The Potential of AutoML for Recommender Systems\nAbstract: Automated Machine Learning (AutoML) has greatly advanced applications of Machine Learning (ML) including model compression, machine translation, and computer vision. Recommender Systems (RecSys) can be seen as an application of ML. Yet, AutoML has found little attention in the RecSys community; nor has RecSys found notable attention in the AutoML community. Only few and relatively simple Automated Recommender Systems (AutoRecSys) libraries exist that adopt AutoML techniques. However, these libraries are based on student projects and do not offer the features and thorough development of AutoML libraries. We set out to determine how AutoML libraries perform in the scenario of an inexperienced user who wants to implement a recommender system. We compared the predictive performance of 60 AutoML, AutoRecSys, ML, and RecSys algorithms from 15 libraries, including a mean predictor baseline, on 14 explicit feedback RecSys datasets. To simulate the perspective of an inexperienced user, the algo",
    "path": "papers/24/02/2402.04453.json",
    "total_tokens": 839,
    "translated_title": "自动机器学习在推荐系统中的潜力",
    "translated_abstract": "自动化机器学习（AutoML）已经在包括模型压缩、机器翻译和计算机视觉等领域大大推进了机器学习（ML）的应用。推荐系统（RecSys）可以被看作是ML的一个应用。然而，AutoML在RecSys社区中并没有得到太多关注，RecSys也没有在AutoML社区中引起显著的关注。目前只有少数几个相对简单的自动化推荐系统（AutoRecSys）库采用了AutoML技术。然而，这些库都是基于学生项目开发的，并且没有提供AutoML库的功能和完善的开发。我们的目标是确定在一个没有经验的用户想要实现一个推荐系统的场景中，AutoML库的表现如何。我们比较了来自15个库的60个AutoML、AutoRecSys、ML和RecSys算法以及一个均值预测基准模型在14个显式反馈的RecSys数据集上的预测性能。",
    "tldr": "这项研究探讨了在推荐系统领域中，自动机器学习（AutoML）的巨大潜力以及目前相对少有的关注和开发。",
    "en_tdlr": "This research investigates the potential of automated machine learning (AutoML) in the field of recommender systems, highlighting the limited attention and development it has received so far."
}