{
    "title": "Predicting the Emergence of Solar Active Regions Using Machine Learning",
    "abstract": "arXiv:2402.08890v1 Announce Type: cross Abstract: To create early warning capabilities for upcoming Space Weather disturbances, we have selected a dataset of 61 emerging active regions, which allows us to identify characteristic features in the evolution of acoustic power density to predict continuum intensity emergence. For our study, we have utilized Doppler shift and continuum intensity observations from the Helioseismic and Magnetic Imager (HMI) onboard the Solar Dynamics Observatory (SDO). The local tracking of 30.66 x 30.66-degree patches in the vicinity of active regions allowed us to trace the evolution of active regions starting from the pre-emergence state. We have developed a machine learning model to capture the acoustic power flux density variations associated with upcoming magnetic flux emergence. The trained Long Short-Term Memory (LSTM) model is able to predict 5 hours ahead whether, in a given area of the solar surface, continuum intensity values will decrease. The per",
    "link": "https://arxiv.org/abs/2402.08890",
    "context": "Title: Predicting the Emergence of Solar Active Regions Using Machine Learning\nAbstract: arXiv:2402.08890v1 Announce Type: cross Abstract: To create early warning capabilities for upcoming Space Weather disturbances, we have selected a dataset of 61 emerging active regions, which allows us to identify characteristic features in the evolution of acoustic power density to predict continuum intensity emergence. For our study, we have utilized Doppler shift and continuum intensity observations from the Helioseismic and Magnetic Imager (HMI) onboard the Solar Dynamics Observatory (SDO). The local tracking of 30.66 x 30.66-degree patches in the vicinity of active regions allowed us to trace the evolution of active regions starting from the pre-emergence state. We have developed a machine learning model to capture the acoustic power flux density variations associated with upcoming magnetic flux emergence. The trained Long Short-Term Memory (LSTM) model is able to predict 5 hours ahead whether, in a given area of the solar surface, continuum intensity values will decrease. The per",
    "path": "papers/24/02/2402.08890.json",
    "total_tokens": 869,
    "translated_title": "使用机器学习预测太阳活动区的出现",
    "translated_abstract": "为了创建即将发生的太空天气干扰的早期警报能力，我们选择了一个包含61个新出现的活动区的数据集，这使我们能够识别声功率密度演化中的特征，以预测连续强度的出现。为了进行我们的研究，我们利用了太阳动力学观测卫星（SDO）上的地震声学和磁场成像仪（HMI）观测的多普勒频移和连续强度数据。通过在活动区附近跟踪30.66 x 30.66度的区域，我们可以追踪活动区从预出现状态开始的演化。我们开发了一个机器学习模型来捕捉即将出现的磁通量变化所关联的声功率流密度变化。经过训练的长短期记忆（LSTM）模型能够提前5个小时预测太阳表面某个区域的连续强度值是否会下降。",
    "tldr": "该论文通过使用机器学习模型，利用声功率密度演化特征以及多普勒频移和连续强度观测数据预测太阳活动区出现的连续强度变化。"
}