{
    "title": "Transforming Norm-based To Graph-based Spatial Representation for Spatio-Temporal Epidemiological Models",
    "abstract": "arXiv:2402.14539v1 Announce Type: new  Abstract: Pandemics, with their profound societal and economic impacts, pose significant threats to global health, mortality rates, economic stability, and political landscapes. In response to the persistent challenges posed by emerging and reemerging pandemics, numerous studies have employed spatio-temporal models to enhance our understanding and management of these complex phenomena. These spatio-temporal models can be roughly divided into two main spatial categories: norm-based and graph-based trade-offering between accuracy, computational burden, and representational feasibility. In this study, we explore the ability to transform from norm-based to graph-based spatial representation for these models. We introduce a novel framework for this task together with twelve possible implementations using a wide range of heuristic optimization approaches. Our findings show that by leveraging agent-based simulations and heuristic algorithms for the graph",
    "link": "https://arxiv.org/abs/2402.14539",
    "context": "Title: Transforming Norm-based To Graph-based Spatial Representation for Spatio-Temporal Epidemiological Models\nAbstract: arXiv:2402.14539v1 Announce Type: new  Abstract: Pandemics, with their profound societal and economic impacts, pose significant threats to global health, mortality rates, economic stability, and political landscapes. In response to the persistent challenges posed by emerging and reemerging pandemics, numerous studies have employed spatio-temporal models to enhance our understanding and management of these complex phenomena. These spatio-temporal models can be roughly divided into two main spatial categories: norm-based and graph-based trade-offering between accuracy, computational burden, and representational feasibility. In this study, we explore the ability to transform from norm-based to graph-based spatial representation for these models. We introduce a novel framework for this task together with twelve possible implementations using a wide range of heuristic optimization approaches. Our findings show that by leveraging agent-based simulations and heuristic algorithms for the graph",
    "path": "papers/24/02/2402.14539.json",
    "total_tokens": 815,
    "translated_title": "将基于规范的空间表示转换为基于图的时空流行病学模型",
    "translated_abstract": "疫情大流行以其深远的社会和经济影响，对全球健康、死亡率、经济稳定性和政治格局构成重大威胁。为了应对新兴和再现疫情带来的持续挑战，许多研究采用时空模型来增强我们对这些复杂现象的理解和管理。这些时空模型可以大致分为两种主要空间类别：基于规范和基于图的模型，在准确性、计算负担和可表示性之间进行权衡。在本研究中，我们探讨了将这些模型从基于规范转换为基于图的空间表示的能力。我们引入了一个新颖的框架，以及使用广泛的启发式优化方法的十二种可能实现。我们的研究结果显示，通过利用基于代理的模拟和启发式算法来实现图模型",
    "tldr": "研究介绍了将基于规范的空间表示转换为基于图的时空流行病学模型的新框架和方法。",
    "en_tdlr": "This study presents a novel framework and methods for transforming norm-based spatial representation to graph-based spatial representation in spatio-temporal epidemiological models."
}