{
    "title": "Reinforcement learning to maximise wind turbine energy generation",
    "abstract": "arXiv:2402.11384v1 Announce Type: new  Abstract: We propose a reinforcement learning strategy to control wind turbine energy generation by actively changing the rotor speed, the rotor yaw angle and the blade pitch angle. A double deep Q-learning with a prioritized experience replay agent is coupled with a blade element momentum model and is trained to allow control for changing winds. The agent is trained to decide the best control (speed, yaw, pitch) for simple steady winds and is subsequently challenged with real dynamic turbulent winds, showing good performance. The double deep Q- learning is compared with a classic value iteration reinforcement learning control and both strategies outperform a classic PID control in all environments. Furthermore, the reinforcement learning approach is well suited to changing environments including turbulent/gusty winds, showing great adaptability. Finally, we compare all control strategies with real winds and compute the annual energy production. I",
    "link": "https://arxiv.org/abs/2402.11384",
    "context": "Title: Reinforcement learning to maximise wind turbine energy generation\nAbstract: arXiv:2402.11384v1 Announce Type: new  Abstract: We propose a reinforcement learning strategy to control wind turbine energy generation by actively changing the rotor speed, the rotor yaw angle and the blade pitch angle. A double deep Q-learning with a prioritized experience replay agent is coupled with a blade element momentum model and is trained to allow control for changing winds. The agent is trained to decide the best control (speed, yaw, pitch) for simple steady winds and is subsequently challenged with real dynamic turbulent winds, showing good performance. The double deep Q- learning is compared with a classic value iteration reinforcement learning control and both strategies outperform a classic PID control in all environments. Furthermore, the reinforcement learning approach is well suited to changing environments including turbulent/gusty winds, showing great adaptability. Finally, we compare all control strategies with real winds and compute the annual energy production. I",
    "path": "papers/24/02/2402.11384.json",
    "total_tokens": 843,
    "translated_title": "强化学习用于最大化风力发电",
    "translated_abstract": "我们提出了一种强化学习策略，通过主动调整转子速度、转子偏航角和叶片倾角来控制风力发电。我们将双深度Q学习与优先经验重播代理与叶片元素动量模型耦合，并训练该代理以允许控制不断变化的风。该代理经过训练，可以在简单稳定风中决定最佳控制（速度、偏航、倾角），随后挑战真实的动态紊流风，表现良好。双深度Q学习与经典值迭代强化学习控制进行比较，在所有环境中都优于经典PID控制。此外，强化学习方法非常适合变化的环境，包括紊乱/阵风风，表现出很强的适应性。最后，我们将所有控制策略与真实风进行比较，并计算年度能源产量。",
    "tldr": "提出了一种利用强化学习控制风力发电以最大化能量产生的方法，表现出在各种环境下比传统PID控制更优异，并在真实风条件下进行了对比验证。",
    "en_tdlr": "A reinforcement learning strategy for controlling wind turbine energy generation is proposed, outperforming traditional PID control in various environments, and validated with real wind conditions."
}