{
    "title": "High Resolution Guitar Transcription via Domain Adaptation",
    "abstract": "arXiv:2402.15258v1 Announce Type: cross  Abstract: Automatic music transcription (AMT) has achieved high accuracy for piano due to the availability of large, high-quality datasets such as MAESTRO and MAPS, but comparable datasets are not yet available for other instruments. In recent work, however, it has been demonstrated that aligning scores to transcription model activations can produce high quality AMT training data for instruments other than piano. Focusing on the guitar, we refine this approach to training on score data using a dataset of commercially available score-audio pairs. We propose the use of a high-resolution piano transcription model to train a new guitar transcription model. The resulting model obtains state-of-the-art transcription results on GuitarSet in a zero-shot context, improving on previously published methods.",
    "link": "https://arxiv.org/abs/2402.15258",
    "context": "Title: High Resolution Guitar Transcription via Domain Adaptation\nAbstract: arXiv:2402.15258v1 Announce Type: cross  Abstract: Automatic music transcription (AMT) has achieved high accuracy for piano due to the availability of large, high-quality datasets such as MAESTRO and MAPS, but comparable datasets are not yet available for other instruments. In recent work, however, it has been demonstrated that aligning scores to transcription model activations can produce high quality AMT training data for instruments other than piano. Focusing on the guitar, we refine this approach to training on score data using a dataset of commercially available score-audio pairs. We propose the use of a high-resolution piano transcription model to train a new guitar transcription model. The resulting model obtains state-of-the-art transcription results on GuitarSet in a zero-shot context, improving on previously published methods.",
    "path": "papers/24/02/2402.15258.json",
    "total_tokens": 740,
    "translated_title": "高分辨率吉他转录的域自适应",
    "translated_abstract": "自动音乐转录（AMT）对于钢琴已经取得了很高的准确性，这得益于MAESTRO和MAPS等大型高质量数据集的可用性，但其他乐器的可比数据集尚不可用。最近的研究表明，将乐谱与转录模型的激活对准可以为除钢琴以外的乐器生成高质量的AMT训练数据。本文专注于吉他，对使用商用乐谱-音频对数据集进行训练的方法进行了改进。我们提出使用高分辨率钢琴转录模型来训练新的吉他转录模型。最终模型在零样本情况下在GuitarSet上获得了最先进的转录结果，优于先前发表的方法。",
    "tldr": "通过域自适应实现了高分辨率吉他转录的新方法，并在零样本情况下在GuitarSet上取得了最先进的转录结果。",
    "en_tdlr": "A novel approach for high-resolution guitar transcription was achieved through domain adaptation, resulting in state-of-the-art transcription results on GuitarSet in a zero-shot context."
}