{
    "title": "A Self-supervised Pressure Map human keypoint Detection Approch: Optimizing Generalization and Computational Efficiency Across Datasets",
    "abstract": "arXiv:2402.14241v1 Announce Type: cross  Abstract: In environments where RGB images are inadequate, pressure maps is a viable alternative, garnering scholarly attention. This study introduces a novel self-supervised pressure map keypoint detection (SPMKD) method, addressing the current gap in specialized designs for human keypoint extraction from pressure maps. Central to our contribution is the Encoder-Fuser-Decoder (EFD) model, which is a robust framework that integrates a lightweight encoder for precise human keypoint detection, a fuser for efficient gradient propagation, and a decoder that transforms human keypoints into reconstructed pressure maps. This structure is further enhanced by the Classification-to-Regression Weight Transfer (CRWT) method, which fine-tunes accuracy through initial classification task training. This innovation not only enhances human keypoint generalization without manual annotations but also showcases remarkable efficiency and generalization, evidenced by",
    "link": "https://arxiv.org/abs/2402.14241",
    "context": "Title: A Self-supervised Pressure Map human keypoint Detection Approch: Optimizing Generalization and Computational Efficiency Across Datasets\nAbstract: arXiv:2402.14241v1 Announce Type: cross  Abstract: In environments where RGB images are inadequate, pressure maps is a viable alternative, garnering scholarly attention. This study introduces a novel self-supervised pressure map keypoint detection (SPMKD) method, addressing the current gap in specialized designs for human keypoint extraction from pressure maps. Central to our contribution is the Encoder-Fuser-Decoder (EFD) model, which is a robust framework that integrates a lightweight encoder for precise human keypoint detection, a fuser for efficient gradient propagation, and a decoder that transforms human keypoints into reconstructed pressure maps. This structure is further enhanced by the Classification-to-Regression Weight Transfer (CRWT) method, which fine-tunes accuracy through initial classification task training. This innovation not only enhances human keypoint generalization without manual annotations but also showcases remarkable efficiency and generalization, evidenced by",
    "path": "papers/24/02/2402.14241.json",
    "total_tokens": 917,
    "translated_title": "一种自监督压力图人体关键点检测方法：跨数据集优化泛化和计算效率",
    "translated_abstract": "在RGB图像无法满足需求的环境中，压力图成为一种备选方案，吸引了学术界的注意。本研究介绍了一种新颖的自监督压力图关键点检测（SPMKD）方法，解决了目前针对压力图中人体关键点提取的专门设计的空白。我们的贡献核心是编码器-融合器-解码器（EFD）模型，这是一个强大的框架，集成了精确人体关键点检测的轻量级编码器、用于高效梯度传播的融合器，以及将人体关键点转换为重构压力图的解码器。该结构通过分类到回归权重转移（CRWT）方法进一步增强，通过初始分类任务训练对精确度进行微调。这一创新不仅提高了人体关键点的泛化能力，而且展示了显着的效率和泛化能力，得到了证明。",
    "tldr": "提出了一种自监督压力图关键点检测方法，采用Encoder-Fuser-Decoder（EFD）模型和分类到回归权重转移（CRWT）方法，在不需要手动标注的情况下提高了人体关键点的泛化能力和计算效率。",
    "en_tdlr": "A self-supervised pressure map keypoint detection method was proposed, utilizing the Encoder-Fuser-Decoder (EFD) model and the Classification-to-Regression Weight Transfer (CRWT) method to enhance human keypoint generalization and computational efficiency without the need for manual annotations."
}