{
    "title": "Foul prediction with estimated poses from soccer broadcast video",
    "abstract": "arXiv:2402.09650v1 Announce Type: cross  Abstract: Recent advances in computer vision have made significant progress in tracking and pose estimation of sports players. However, there have been fewer studies on behavior prediction with pose estimation in sports, in particular, the prediction of soccer fouls is challenging because of the smaller image size of each player and of difficulty in the usage of e.g., the ball and pose information. In our research, we introduce an innovative deep learning approach for anticipating soccer fouls. This method integrates video data, bounding box positions, image details, and pose information by curating a novel soccer foul dataset. Our model utilizes a combination of convolutional and recurrent neural networks (CNNs and RNNs) to effectively merge information from these four modalities. The experimental results show that our full model outperformed the ablated models, and all of the RNN modules, bounding box position and image, and estimated pose wer",
    "link": "https://arxiv.org/abs/2402.09650",
    "context": "Title: Foul prediction with estimated poses from soccer broadcast video\nAbstract: arXiv:2402.09650v1 Announce Type: cross  Abstract: Recent advances in computer vision have made significant progress in tracking and pose estimation of sports players. However, there have been fewer studies on behavior prediction with pose estimation in sports, in particular, the prediction of soccer fouls is challenging because of the smaller image size of each player and of difficulty in the usage of e.g., the ball and pose information. In our research, we introduce an innovative deep learning approach for anticipating soccer fouls. This method integrates video data, bounding box positions, image details, and pose information by curating a novel soccer foul dataset. Our model utilizes a combination of convolutional and recurrent neural networks (CNNs and RNNs) to effectively merge information from these four modalities. The experimental results show that our full model outperformed the ablated models, and all of the RNN modules, bounding box position and image, and estimated pose wer",
    "path": "papers/24/02/2402.09650.json",
    "total_tokens": 890,
    "translated_title": "利用足球广播视频中的估计姿势来预测犯规",
    "translated_abstract": "近年来，计算机视觉在运动员跟踪和姿势估计方面取得了显著进展。然而，在运动中使用姿势估计进行行为预测的研究较少，特别是对于足球犯规的预测具有挑战性，因为每个球员的图像尺寸较小，并且使用例如球和姿势信息的困难。在我们的研究中，我们引入了一种创新的深度学习方法来预测足球犯规。该方法通过整理一个新颖的足球犯规数据集，将视频数据、边界框位置、图像细节和姿势信息相结合。我们的模型利用卷积神经网络（CNN）和循环神经网络（RNN）的结合方法有效地融合这四种模态的信息。实验结果表明，我们的完整模型优于剥离模型，以及所有的RNN模块、边界框位置和图像、估计的姿势。",
    "tldr": "通过整合视频数据、边界框位置、图像细节和姿势信息，我们提出了一种创新的深度学习方法来预测足球犯规。实验结果表明，我们的模型在各方面表现出色。",
    "en_tdlr": "We propose an innovative deep learning approach to predict soccer fouls by integrating video data, bounding box positions, image details, and pose information. Experimental results show that our model outperforms other methods."
}