{
    "title": "Combination of Weak Learners eXplanations to Improve Random Forest eXplicability Robustness",
    "abstract": "arXiv:2402.19025v1 Announce Type: cross  Abstract: The notion of robustness in XAI refers to the observed variations in the explanation of the prediction of a learned model with respect to changes in the input leading to that prediction. Intuitively, if the input being explained is modified slightly subtly enough so as to not change the prediction of the model too much, then we would expect that the explanation provided for that new input does not change much either. We argue that a combination through discriminative averaging of ensembles weak learners explanations can improve the robustness of explanations in ensemble methods.This approach has been implemented and tested with post-hoc SHAP method and Random Forest ensemble with successful results. The improvements obtained have been measured quantitatively and some insights into the explicability robustness in ensemble methods are presented.",
    "link": "https://arxiv.org/abs/2402.19025",
    "context": "Title: Combination of Weak Learners eXplanations to Improve Random Forest eXplicability Robustness\nAbstract: arXiv:2402.19025v1 Announce Type: cross  Abstract: The notion of robustness in XAI refers to the observed variations in the explanation of the prediction of a learned model with respect to changes in the input leading to that prediction. Intuitively, if the input being explained is modified slightly subtly enough so as to not change the prediction of the model too much, then we would expect that the explanation provided for that new input does not change much either. We argue that a combination through discriminative averaging of ensembles weak learners explanations can improve the robustness of explanations in ensemble methods.This approach has been implemented and tested with post-hoc SHAP method and Random Forest ensemble with successful results. The improvements obtained have been measured quantitatively and some insights into the explicability robustness in ensemble methods are presented.",
    "path": "papers/24/02/2402.19025.json",
    "total_tokens": 798,
    "translated_title": "将弱学习者解释的组合用于改进随机森林的解释性和稳健性",
    "translated_abstract": "XAI中的稳健性概念指的是观察到的关于学习模型预测解释在对导致该预测的输入变化时的变化。直觉上，如果要解释的输入略微变化，以至于不会太大程度改变模型的预测，那么我们期望对于该新输入的解释也不会有太大变化。我们认为，通过对弱学习者解释进行判别平均的组合可以提高集成方法中解释的稳健性。该方法已经在后续SHAP方法和随机森林集成中得到实施和测试，并取得了成功的结果。所获得的改进已经通过定量方式进行了测量，并提供了一些关于集成方法中解释性稳健性的见解。",
    "tldr": "引入了将弱学习者解释组合的方法来改进随机森林的解释性和稳健性，通过对集成方法中解释进行判别平均，取得了成功的实验结果和定量改进。",
    "en_tdlr": "Introducing a method of combining weak learners' explanations to improve the interpretability and robustness of Random Forest, successful experimental results and quantitative improvements were achieved by discriminatively averaging the explanations in ensemble methods."
}