{
    "title": "Analyzing Sentiment Polarity Reduction in News Presentation through Contextual Perturbation and Large Language Models",
    "abstract": "In today's media landscape, where news outlets play a pivotal role in shaping public opinion, it is imperative to address the issue of sentiment manipulation within news text. News writers often inject their own biases and emotional language, which can distort the objectivity of reporting. This paper introduces a novel approach to tackle this problem by reducing the polarity of latent sentiments in news content. Drawing inspiration from adversarial attack-based sentence perturbation techniques and a prompt based method using ChatGPT, we employ transformation constraints to modify sentences while preserving their core semantics. Using three perturbation methods: replacement, insertion, and deletion coupled with a context-aware masked language model, we aim to maximize the desired sentiment score for targeted news aspects through a beam search algorithm. Our experiments and human evaluations demonstrate the effectiveness of these two models in achieving reduced sentiment polarity with mi",
    "link": "https://arxiv.org/abs/2402.02145",
    "context": "Title: Analyzing Sentiment Polarity Reduction in News Presentation through Contextual Perturbation and Large Language Models\nAbstract: In today's media landscape, where news outlets play a pivotal role in shaping public opinion, it is imperative to address the issue of sentiment manipulation within news text. News writers often inject their own biases and emotional language, which can distort the objectivity of reporting. This paper introduces a novel approach to tackle this problem by reducing the polarity of latent sentiments in news content. Drawing inspiration from adversarial attack-based sentence perturbation techniques and a prompt based method using ChatGPT, we employ transformation constraints to modify sentences while preserving their core semantics. Using three perturbation methods: replacement, insertion, and deletion coupled with a context-aware masked language model, we aim to maximize the desired sentiment score for targeted news aspects through a beam search algorithm. Our experiments and human evaluations demonstrate the effectiveness of these two models in achieving reduced sentiment polarity with mi",
    "path": "papers/24/02/2402.02145.json",
    "total_tokens": 912,
    "translated_title": "通过上下文扰动和大型语言模型分析新闻报道中的情感极性降低",
    "translated_abstract": "在当今的媒体环境中，新闻媒体在塑造公众舆论方面起着至关重要的作用，有必要解决新闻文本中的情感操纵问题。新闻作者常常注入自己的偏见和情感语言，这会扭曲报道的客观性。本文通过降低新闻内容中潜在情感的极性，提出了一种新颖的方法来解决这个问题。我们从对抗攻击的句子扰动技术和使用ChatGPT的基于提示的方法中汲取灵感，采用转换约束来修改句子，同时保留其核心语义。通过替换、插入和删除三种扰动方法，再结合上下文感知的掩码语言模型，我们通过一种波束搜索算法来最大化针对新闻方面的期望情感分数。我们的实验和人工评估表明，这两个模型在实现情感极性降低方面的有效性。",
    "tldr": "通过引入对抗攻击的句子扰动技术和基于提示的方法，本论文提出了一种新颖的方法，通过降低新闻内容中的情感极性来解决新闻报道中的情感操纵问题。实验和人工评估表明，这两个模型在实现情感极性降低方面非常有效。"
}