{
    "title": "Why are hyperbolic neural networks effective? A study on hierarchical representation capability",
    "abstract": "Hyperbolic Neural Networks (HNNs), operating in hyperbolic space, have been widely applied in recent years, motivated by the existence of an optimal embedding in hyperbolic space that can preserve data hierarchical relationships (termed Hierarchical Representation Capability, HRC) more accurately than Euclidean space. However, there is no evidence to suggest that HNNs can achieve this theoretical optimal embedding, leading to much research being built on flawed motivations. In this paper, we propose a benchmark for evaluating HRC and conduct a comprehensive analysis of why HNNs are effective through large-scale experiments. Inspired by the analysis results, we propose several pre-training strategies to enhance HRC and improve the performance of downstream tasks, further validating the reliability of the analysis. Experiments show that HNNs cannot achieve the theoretical optimal embedding. The HRC is significantly affected by the optimization objectives and hierarchical structures, and ",
    "link": "https://arxiv.org/abs/2402.02478",
    "context": "Title: Why are hyperbolic neural networks effective? A study on hierarchical representation capability\nAbstract: Hyperbolic Neural Networks (HNNs), operating in hyperbolic space, have been widely applied in recent years, motivated by the existence of an optimal embedding in hyperbolic space that can preserve data hierarchical relationships (termed Hierarchical Representation Capability, HRC) more accurately than Euclidean space. However, there is no evidence to suggest that HNNs can achieve this theoretical optimal embedding, leading to much research being built on flawed motivations. In this paper, we propose a benchmark for evaluating HRC and conduct a comprehensive analysis of why HNNs are effective through large-scale experiments. Inspired by the analysis results, we propose several pre-training strategies to enhance HRC and improve the performance of downstream tasks, further validating the reliability of the analysis. Experiments show that HNNs cannot achieve the theoretical optimal embedding. The HRC is significantly affected by the optimization objectives and hierarchical structures, and ",
    "path": "papers/24/02/2402.02478.json",
    "total_tokens": 844,
    "translated_title": "为什么双曲神经网络有效？关于层级表示能力的研究",
    "translated_abstract": "双曲神经网络（HNNs）在双曲空间中运作，在过去几年中被广泛应用，其动机是双曲空间中存在一种优化嵌入，能够比欧几里得空间更准确地保留数据的层级关系（称为层级表示能力，HRC）。然而，没有证据表明HNN可以达到理论上的最优嵌入，这导致了许多研究建立在错误的动机上。本文提出了一个评估HRC的基准，并通过大规模实验对HNN为何有效进行了全面分析。受到分析结果的启发，我们提出了几种预训练策略来增强HRC并提高下游任务的性能，进一步验证了分析的可靠性。实验证明，HNN无法实现理论上的最优嵌入。HRC受优化目标和层级结构的显著影响，",
    "tldr": "本文通过大规模实验对为什么双曲神经网络有效进行了全面分析，并提出了几种预训练策略来增强层级表示能力，从而改进下游任务的性能。",
    "en_tdlr": "This paper conducts a comprehensive analysis of why hyperbolic neural networks are effective through large-scale experiments, and proposes pre-training strategies to enhance hierarchical representation capability and improve the performance of downstream tasks."
}