{
    "title": "Learning from the Best: Active Learning for Wireless Communications",
    "abstract": "Collecting an over-the-air wireless communications training dataset for deep learning-based communication tasks is relatively simple. However, labeling the dataset requires expert involvement and domain knowledge, may involve private intellectual properties, and is often computationally and financially expensive. Active learning is an emerging area of research in machine learning that aims to reduce the labeling overhead without accuracy degradation. Active learning algorithms identify the most critical and informative samples in an unlabeled dataset and label only those samples, instead of the complete set. In this paper, we introduce active learning for deep learning applications in wireless communications, and present its different categories. We present a case study of deep learning-based mmWave beam selection, where labeling is performed by a compute-intensive algorithm based on exhaustive search. We evaluate the performance of different active learning algorithms on a publicly av",
    "link": "https://arxiv.org/abs/2402.04896",
    "context": "Title: Learning from the Best: Active Learning for Wireless Communications\nAbstract: Collecting an over-the-air wireless communications training dataset for deep learning-based communication tasks is relatively simple. However, labeling the dataset requires expert involvement and domain knowledge, may involve private intellectual properties, and is often computationally and financially expensive. Active learning is an emerging area of research in machine learning that aims to reduce the labeling overhead without accuracy degradation. Active learning algorithms identify the most critical and informative samples in an unlabeled dataset and label only those samples, instead of the complete set. In this paper, we introduce active learning for deep learning applications in wireless communications, and present its different categories. We present a case study of deep learning-based mmWave beam selection, where labeling is performed by a compute-intensive algorithm based on exhaustive search. We evaluate the performance of different active learning algorithms on a publicly av",
    "path": "papers/24/02/2402.04896.json",
    "total_tokens": 865,
    "translated_title": "从最佳中学习：无线通信的主动学习",
    "translated_abstract": "对于基于深度学习的通信任务来说，收集一份空中无线通信训练数据集相对简单。然而，标注这个数据集需要专家参与和领域知识，可能涉及私有知识产权，并且通常在计算和财务方面都很昂贵。主动学习是机器学习中的新兴研究领域，旨在减少标注开销而不会降低准确性。主动学习算法能够在未标注的数据集中识别出最关键和信息量丰富的样本，只标注这些样本，而不是整个数据集。在本文中，我们介绍了在无线通信中应用主动学习的深度学习方法，并介绍了其不同的类别。我们还提供了一个基于深度学习的毫米波波束选择的案例研究，其中的标注由一个基于穷举搜索的计算密集型算法执行。我们评估了不同主动学习算法在一个公开可用数据集上的性能。",
    "tldr": "本文介绍了无线通信中应用主动学习的深度学习方法，并提供了一个基于深度学习的毫米波波束选择的案例研究，评估了不同主动学习算法在一个公开可用数据集上的性能。",
    "en_tdlr": "This paper introduces deep learning methods with active learning for wireless communications and presents a case study on mmWave beam selection. The performance of different active learning algorithms is evaluated on a publicly available dataset."
}