{
    "title": "A Conflict-Aware Optimal Goal Assignment Algorithm for Multi-Robot Systems",
    "abstract": "arXiv:2402.13292v1 Announce Type: cross  Abstract: The fundamental goal assignment problem for a multi-robot application aims to assign a unique goal to each robot while ensuring collision-free paths, minimizing the total movement cost. A plausible algorithmic solution to this NP-hard problem involves an iterative process that integrates a task planner to compute the goal assignment while ignoring the collision possibilities among the robots and a multi-agent path-finding algorithm to find the collision-free trajectories for a given assignment. This procedure involves a method for computing the next best assignment given the current best assignment. A naive way of computing the next best assignment, as done in the state-of-the-art solutions, becomes a roadblock to achieving scalability in solving the overall problem. To obviate this bottleneck, we propose an efficient conflict-guided method to compute the next best assignment. Additionally, we introduce two more optimizations to the al",
    "link": "https://arxiv.org/abs/2402.13292",
    "context": "Title: A Conflict-Aware Optimal Goal Assignment Algorithm for Multi-Robot Systems\nAbstract: arXiv:2402.13292v1 Announce Type: cross  Abstract: The fundamental goal assignment problem for a multi-robot application aims to assign a unique goal to each robot while ensuring collision-free paths, minimizing the total movement cost. A plausible algorithmic solution to this NP-hard problem involves an iterative process that integrates a task planner to compute the goal assignment while ignoring the collision possibilities among the robots and a multi-agent path-finding algorithm to find the collision-free trajectories for a given assignment. This procedure involves a method for computing the next best assignment given the current best assignment. A naive way of computing the next best assignment, as done in the state-of-the-art solutions, becomes a roadblock to achieving scalability in solving the overall problem. To obviate this bottleneck, we propose an efficient conflict-guided method to compute the next best assignment. Additionally, we introduce two more optimizations to the al",
    "path": "papers/24/02/2402.13292.json",
    "total_tokens": 730,
    "translated_title": "一个针对多机器人系统的冲突感知最优目标分配算法",
    "translated_abstract": "多机器人应用中的基本目标分配问题旨在为每个机器人分配一个唯一目标，同时确保路径无碰撞，最小化总移动成本。这个NP-hard问题的一个可行算法解决方案涉及一个迭代过程，该过程整合了一个任务规划器来计算目标分配，同时忽略机器人之间的碰撞可能性，以及一个多代理路径规划算法来找到给定分配的无碰撞轨迹。为了避免这一瓶颈，我们提出了一种高效的冲突引导方法来计算下一个最佳分配。此外，我们还引入了另外两种优化方法到算法中。",
    "tldr": "提出了针对多机器人系统的冲突感知最优目标分配算法，并引入了冲突引导方法和其他优化方法。"
}