{
    "title": "NCoder -- A Quantum Field Theory approach to encoding data",
    "abstract": "In this paper we present a novel approach to interpretable AI inspired by Quantum Field Theory (QFT) which we call the NCoder. The NCoder is a modified autoencoder neural network whose latent layer is prescribed to be a subset of $n$-point correlation functions. Regarding images as draws from a lattice field theory, this architecture mimics the task of perturbatively constructing the effective action of the theory order by order in an expansion using Feynman diagrams. Alternatively, the NCoder may be regarded as simulating the procedure of statistical inference whereby high dimensional data is first summarized in terms of several lower dimensional summary statistics (here the $n$-point correlation functions), and subsequent out-of-sample data is generated by inferring the data generating distribution from these statistics. In this way the NCoder suggests a fascinating correspondence between perturbative renormalizability and the sufficiency of models. We demonstrate the efficacy of the",
    "link": "https://rss.arxiv.org/abs/2402.00944",
    "context": "Title: NCoder -- A Quantum Field Theory approach to encoding data\nAbstract: In this paper we present a novel approach to interpretable AI inspired by Quantum Field Theory (QFT) which we call the NCoder. The NCoder is a modified autoencoder neural network whose latent layer is prescribed to be a subset of $n$-point correlation functions. Regarding images as draws from a lattice field theory, this architecture mimics the task of perturbatively constructing the effective action of the theory order by order in an expansion using Feynman diagrams. Alternatively, the NCoder may be regarded as simulating the procedure of statistical inference whereby high dimensional data is first summarized in terms of several lower dimensional summary statistics (here the $n$-point correlation functions), and subsequent out-of-sample data is generated by inferring the data generating distribution from these statistics. In this way the NCoder suggests a fascinating correspondence between perturbative renormalizability and the sufficiency of models. We demonstrate the efficacy of the",
    "path": "papers/24/02/2402.00944.json",
    "total_tokens": 992,
    "translated_title": "NCoder -- 一种基于量子场论的数据编码方法",
    "translated_abstract": "在本文中，我们提出了一种基于量子场论（QFT）的可解释 AI 方法，称为 NCoder。NCoder 是一个修改过的自编码神经网络，其潜在层被规定为一个 $n$-点关联函数的子集。将图像视为格点场论的抽样，这个架构模拟了使用费曼图按阶展开来扰动地构建理论有效作用量的任务。或者，NCoder 可以被视为模拟统计推断过程，通过用几个较低维度的汇总统计量（这里是 $n$-点关联函数）来总结高维度数据，并从这些统计量推断数据生成分布来生成样本外数据。通过这种方式，NCoder 提示了扰动重整化和模型的充分性之间的有趣对应关系。我们展示了 NCoder 在数据编码任务上的有效性。",
    "tldr": "NCoder 是一种基于量子场论的数据编码方法，通过修改自编码神经网络的结构，将潜在层规定为一组 $n$-点关联函数的子集，模拟了通过费曼图按阶展开构建理论有效作用量的过程。同时，NCoder 也可以看作是模拟统计推断过程的方法，通过几个较低维度的统计量来总结高维度数据，并从这些统计量中推断数据生成分布。这种方法提示了扰动重整化和模型的充分性之间的有趣对应关系。",
    "en_tdlr": "NCoder is a data encoding method based on quantum field theory, which modifies the structure of autoencoder neural network and specifies the latent layer as a subset of $n$-point correlation functions, mimicking the process of perturbatively constructing the effective action of the theory using Feynman diagrams. Alternatively, NCoder can be seen as a method of simulating statistical inference, summarizing high-dimensional data with several lower-dimensional summary statistics and inferring the data generating distribution from these statistics. This approach suggests an interesting correspondence between perturbative renormalizability and the sufficiency of models."
}