{
    "title": "Group Decision-Making among Privacy-Aware Agents",
    "abstract": "How can individuals exchange information to learn from each other despite their privacy needs and security concerns? For example, consider individuals deliberating a contentious topic and being concerned about divulging their private experiences. Preserving individual privacy and enabling efficient social learning are both important desiderata but seem fundamentally at odds with each other and very hard to reconcile. We do so by controlling information leakage using rigorous statistical guarantees that are based on differential privacy (DP). Our agents use log-linear rules to update their beliefs after communicating with their neighbors. Adding DP randomization noise to beliefs provides communicating agents with plausible deniability with regard to their private information and their network neighborhoods. We consider two learning environments one for distributed maximum-likelihood estimation given a finite number of private signals and another for online learning from an infinite, int",
    "link": "https://arxiv.org/abs/2402.08156",
    "context": "Title: Group Decision-Making among Privacy-Aware Agents\nAbstract: How can individuals exchange information to learn from each other despite their privacy needs and security concerns? For example, consider individuals deliberating a contentious topic and being concerned about divulging their private experiences. Preserving individual privacy and enabling efficient social learning are both important desiderata but seem fundamentally at odds with each other and very hard to reconcile. We do so by controlling information leakage using rigorous statistical guarantees that are based on differential privacy (DP). Our agents use log-linear rules to update their beliefs after communicating with their neighbors. Adding DP randomization noise to beliefs provides communicating agents with plausible deniability with regard to their private information and their network neighborhoods. We consider two learning environments one for distributed maximum-likelihood estimation given a finite number of private signals and another for online learning from an infinite, int",
    "path": "papers/24/02/2402.08156.json",
    "total_tokens": 834,
    "tldr": "本论文通过使用差分隐私来控制信息泄露，实现了个体隐私的保护和高效社会学习的平衡。代理使用对数线性规则更新信念，并通过添加DP随机化噪声为通信代理提供了可信否认的方式。",
    "en_tdlr": "This paper achieves a balance between individual privacy protection and efficient social learning by controlling information leakage with differential privacy. Agents update their beliefs using log-linear rules and provide plausible deniability to communicating agents by adding DP randomization noise."
}