{
    "title": "Online Feature Updates Improve Online (Generalized) Label Shift Adaptation",
    "abstract": "This paper addresses the prevalent issue of label shift in an online setting with missing labels, where data distributions change over time and obtaining timely labels is challenging. While existing methods primarily focus on adjusting or updating the final layer of a pre-trained classifier, we explore the untapped potential of enhancing feature representations using unlabeled data at test-time. Our novel method, Online Label Shift adaptation with Online Feature Updates (OLS-OFU), leverages self-supervised learning to refine the feature extraction process, thereby improving the prediction model. Theoretical analyses confirm that OLS-OFU reduces algorithmic regret by capitalizing on self-supervised learning for feature refinement. Empirical studies on various datasets, under both online label shift and generalized label shift conditions, underscore the effectiveness and robustness of OLS-OFU, especially in cases of domain shifts.",
    "link": "https://arxiv.org/abs/2402.03545",
    "context": "Title: Online Feature Updates Improve Online (Generalized) Label Shift Adaptation\nAbstract: This paper addresses the prevalent issue of label shift in an online setting with missing labels, where data distributions change over time and obtaining timely labels is challenging. While existing methods primarily focus on adjusting or updating the final layer of a pre-trained classifier, we explore the untapped potential of enhancing feature representations using unlabeled data at test-time. Our novel method, Online Label Shift adaptation with Online Feature Updates (OLS-OFU), leverages self-supervised learning to refine the feature extraction process, thereby improving the prediction model. Theoretical analyses confirm that OLS-OFU reduces algorithmic regret by capitalizing on self-supervised learning for feature refinement. Empirical studies on various datasets, under both online label shift and generalized label shift conditions, underscore the effectiveness and robustness of OLS-OFU, especially in cases of domain shifts.",
    "path": "papers/24/02/2402.03545.json",
    "total_tokens": 882,
    "translated_title": "在线特征更新改善在线（广义）标签转移适应问题",
    "translated_abstract": "本文解决了在线设置中标签转移的普遍问题，其中存在缺失的标签，数据分布随时间变化，及时获得标签是一项具有挑战性的任务。虽然现有的方法主要集中在调整或更新预训练分类器的最后一层，我们探索了在测试时使用无标签数据来改进特征表示的未被发掘的潜力。我们的新方法，在线标签转移自适应与在线特征更新（OLS-OFU），利用自监督学习来优化特征提取过程，从而改进预测模型。理论分析证实，OLS-OFU通过利用自监督学习进行特征优化，减少了算法遗憾。在各种数据集上的实证研究，在在线标签转移和广义标签转移条件下，强调了OLS-OFU的有效性和鲁棒性，特别是在领域转移的情况下。",
    "tldr": "本文提出了一种名为OLS-OFU的新方法，通过在测试时利用无标签数据进行自监督学习和特征优化，以解决在线设置中的标签转移问题。研究结果表明，OLS-OFU在各种数据集和领域转移条件下都表现出了有效性和鲁棒性。",
    "en_tdlr": "This paper proposes a method called OLS-OFU, which utilizes self-supervised learning and feature optimization with unlabeled data at test-time to address the issue of label shift in an online setting. The empirical studies demonstrate the effectiveness and robustness of OLS-OFU across various datasets and domain shift conditions."
}