{
    "title": "Generative AI and Process Systems Engineering: The Next Frontier",
    "abstract": "arXiv:2402.10977v1 Announce Type: new  Abstract: This article explores how emerging generative artificial intelligence (GenAI) models, such as large language models (LLMs), can enhance solution methodologies within process systems engineering (PSE). These cutting-edge GenAI models, particularly foundation models (FMs), which are pre-trained on extensive, general-purpose datasets, offer versatile adaptability for a broad range of tasks, including responding to queries, image generation, and complex decision-making. Given the close relationship between advancements in PSE and developments in computing and systems technologies, exploring the synergy between GenAI and PSE is essential. We begin our discussion with a compact overview of both classic and emerging GenAI models, including FMs, and then dive into their applications within key PSE domains: synthesis and design, optimization and integration, and process monitoring and control. In each domain, we explore how GenAI models could pot",
    "link": "https://arxiv.org/abs/2402.10977",
    "context": "Title: Generative AI and Process Systems Engineering: The Next Frontier\nAbstract: arXiv:2402.10977v1 Announce Type: new  Abstract: This article explores how emerging generative artificial intelligence (GenAI) models, such as large language models (LLMs), can enhance solution methodologies within process systems engineering (PSE). These cutting-edge GenAI models, particularly foundation models (FMs), which are pre-trained on extensive, general-purpose datasets, offer versatile adaptability for a broad range of tasks, including responding to queries, image generation, and complex decision-making. Given the close relationship between advancements in PSE and developments in computing and systems technologies, exploring the synergy between GenAI and PSE is essential. We begin our discussion with a compact overview of both classic and emerging GenAI models, including FMs, and then dive into their applications within key PSE domains: synthesis and design, optimization and integration, and process monitoring and control. In each domain, we explore how GenAI models could pot",
    "path": "papers/24/02/2402.10977.json",
    "total_tokens": 865,
    "translated_title": "生成人工智能与过程系统工程：下一个前沿",
    "translated_abstract": "本文探讨了新兴生成人工智能（GenAI）模型，如大型语言模型（LLMs），如何增强过程系统工程（PSE）中的解决方法。这些最前沿的GenAI模型，特别是基础模型（FMs），它们在广泛的通用数据集上预训练，为涉及查询响应、图像生成和复杂决策等广泛任务提供了多功能的适应性。鉴于PSE的进展与计算和系统技术的发展之间密切关系，探索GenAI和PSE之间的协同作用是至关重要的。我们从经典和新兴的GenAI模型，包括FMs的简要概述开始讨论，然后深入探讨它们在关键PSE领域内的应用：合成与设计、优化与集成，以及过程监控与控制。在每个领域中，我们探讨了GenAI模型如何可以促进",
    "tldr": "新兴生成人工智能模型（如基础模型）在过程系统工程中的应用，提供了多功能的适应性，对合成与设计、优化与集成以及过程监控与控制等关键领域具有重要影响。",
    "en_tdlr": "Emerging generative artificial intelligence models, such as foundation models, provide versatile adaptability within process systems engineering, significantly impacting key domains like synthesis and design, optimization and integration, and process monitoring and control."
}