{
    "title": "Rhizomes to Load Balance Skewed In-Degree Distributions",
    "abstract": "The paper aims to address load imbalance caused by high in-degree distribution in graphs by applying the idea of rhizome to vertex-centric message-driven graph processing. Rhizome construction of the graph creates multiple named vertex address for any number of single large in-degree vertices. It then allows other vertices to point to any of the named addresses thus sharing the in-degree load. The rhizomes internally communicate and remain consistent to provide a unified and correct view of the vertex. Simulated experimental results show performance speed ups for BFS graph traversal on large chip sizes for the tested input graph datasets containing highly skewed in-degree distribution. The improvements come from sharing the in-degree compute workload among memory-processing elements and also lowering contention on the network-on-chip.",
    "link": "https://arxiv.org/abs/2402.06086",
    "context": "Title: Rhizomes to Load Balance Skewed In-Degree Distributions\nAbstract: The paper aims to address load imbalance caused by high in-degree distribution in graphs by applying the idea of rhizome to vertex-centric message-driven graph processing. Rhizome construction of the graph creates multiple named vertex address for any number of single large in-degree vertices. It then allows other vertices to point to any of the named addresses thus sharing the in-degree load. The rhizomes internally communicate and remain consistent to provide a unified and correct view of the vertex. Simulated experimental results show performance speed ups for BFS graph traversal on large chip sizes for the tested input graph datasets containing highly skewed in-degree distribution. The improvements come from sharing the in-degree compute workload among memory-processing elements and also lowering contention on the network-on-chip.",
    "path": "papers/24/02/2402.06086.json",
    "total_tokens": 752,
    "translated_title": "用根茎来平衡偏斜的入度分布",
    "translated_abstract": "本文旨在通过将根茎的概念应用于基于顶点为中心的消息驱动图处理，解决由图中高入度分布引起的负载不平衡问题。图的根茎构造为任何数量的单个大入度顶点创建了多个命名顶点地址。然后，其他顶点可以指向任何一个命名地址，从而共享入度负载。根茎内部进行通信并保持一致，以提供顶点的统一和正确的视图。模拟实验结果显示，在包含高度偏斜的入度分布的输入图数据集上，对大芯片大小上的BFS图遍历性能进行了加速。改进来自于在内存处理元素之间共享入度计算工作负载，并降低网络芯片的争用。",
    "tldr": "本文通过引入根茎构造的方法来解决图中高入度分布导致的负载不平衡问题，在大规模芯片上对BFS图遍历性能进行了加速和优化。",
    "en_tdlr": "This paper addresses the problem of load imbalance caused by high in-degree distribution in graphs by introducing the method of rhizome construction, which accelerates and optimizes the BFS graph traversal performance on large-scale chips."
}