{
    "title": "Unlocking the Power of Multi-institutional Data: Integrating and Harmonizing Genomic Data Across Institutions",
    "abstract": "Cancer is a complex disease driven by genomic alterations, and tumor sequencing is becoming a mainstay of clinical care for cancer patients. The emergence of multi-institution sequencing data presents a powerful resource for learning real-world evidence to enhance precision oncology. GENIE BPC, led by the American Association for Cancer Research, establishes a unique database linking genomic data with clinical information for patients treated at multiple cancer centers. However, leveraging such multi-institutional sequencing data presents significant challenges. Variations in gene panels result in loss of information when the analysis is conducted on common gene sets. Additionally, differences in sequencing techniques and patient heterogeneity across institutions add complexity. High data dimensionality, sparse gene mutation patterns, and weak signals at the individual gene level further complicate matters. Motivated by these real-world challenges, we introduce the Bridge model. It use",
    "link": "https://arxiv.org/abs/2402.00077",
    "context": "Title: Unlocking the Power of Multi-institutional Data: Integrating and Harmonizing Genomic Data Across Institutions\nAbstract: Cancer is a complex disease driven by genomic alterations, and tumor sequencing is becoming a mainstay of clinical care for cancer patients. The emergence of multi-institution sequencing data presents a powerful resource for learning real-world evidence to enhance precision oncology. GENIE BPC, led by the American Association for Cancer Research, establishes a unique database linking genomic data with clinical information for patients treated at multiple cancer centers. However, leveraging such multi-institutional sequencing data presents significant challenges. Variations in gene panels result in loss of information when the analysis is conducted on common gene sets. Additionally, differences in sequencing techniques and patient heterogeneity across institutions add complexity. High data dimensionality, sparse gene mutation patterns, and weak signals at the individual gene level further complicate matters. Motivated by these real-world challenges, we introduce the Bridge model. It use",
    "path": "papers/24/02/2402.00077.json",
    "total_tokens": 897,
    "translated_title": "多机构数据的释放力量：整合和协调跨机构的基因组数据",
    "translated_abstract": "癌症是由基因突变驱动的复杂疾病，肿瘤测序已成为癌症患者临床护理的重要手段。出现的多机构测序数据为学习真实世界的证据以增强精准肿瘤医学提供了强大的资源。由美国癌症研究协会领导的GENIE BPC建立了一个独特的数据库，将基因组数据与多个癌症中心的临床信息联系起来。然而，利用这种多机构测序数据面临着重大挑战。基因组板块的变化导致在使用常见基因集进行分析时信息丢失。此外，不同的测序技术和机构之间的患者异质性增加了复杂性。高维数据、稀疏基因突变模式以及个体基因水平上的弱信号进一步增加了问题的复杂性。在这些现实世界的挑战的推动下，我们引入了Bridge模型。",
    "tldr": "该研究介绍了一种名为Bridge的模型，致力于解决利用多机构测序数据时面临的挑战，包括基因组板块的变化、测序技术的差异以及数据的高维度和稀疏性等。"
}