{
    "title": "Understanding Time Series Anomaly State Detection through One-Class Classification",
    "abstract": "For a long time, research on time series anomaly detection has mainly focused on finding outliers within a given time series. Admittedly, this is consistent with some practical problems, but in other practical application scenarios, people are concerned about: assuming a standard time series is given, how to judge whether another test time series deviates from the standard time series, which is more similar to the problem discussed in one-class classification (OCC). Therefore, in this article, we try to re-understand and define the time series anomaly detection problem through OCC, which we call 'time series anomaly state detection problem'. We first use stochastic processes and hypothesis testing to strictly define the 'time series anomaly state detection problem', and its corresponding anomalies. Then, we use the time series classification dataset to construct an artificial dataset corresponding to the problem. We compile 38 anomaly detection algorithms and correct some of the algori",
    "link": "https://arxiv.org/abs/2402.02007",
    "context": "Title: Understanding Time Series Anomaly State Detection through One-Class Classification\nAbstract: For a long time, research on time series anomaly detection has mainly focused on finding outliers within a given time series. Admittedly, this is consistent with some practical problems, but in other practical application scenarios, people are concerned about: assuming a standard time series is given, how to judge whether another test time series deviates from the standard time series, which is more similar to the problem discussed in one-class classification (OCC). Therefore, in this article, we try to re-understand and define the time series anomaly detection problem through OCC, which we call 'time series anomaly state detection problem'. We first use stochastic processes and hypothesis testing to strictly define the 'time series anomaly state detection problem', and its corresponding anomalies. Then, we use the time series classification dataset to construct an artificial dataset corresponding to the problem. We compile 38 anomaly detection algorithms and correct some of the algori",
    "path": "papers/24/02/2402.02007.json",
    "total_tokens": 759,
    "translated_title": "通过单类分类理解时间序列异常状态检测",
    "translated_abstract": "长期以来，时间序列异常检测的研究主要集中在发现给定时间序列中的异常值。诚然，这与一些实际问题是一致的，但在其他实际应用场景中，人们关心的是：假设给定一个标准时间序列，如何判断另一个测试时间序列是否偏离标准时间序列，这更类似于讨论的单类分类（OCC）问题。因此，在本文中，我们尝试通过OCC重新理解和定义时间序列异常检测问题，我们称之为“时间序列异常状态检测问题”。我们首先使用随机过程和假设检验严格定义了“时间序列异常状态检测问题”及其对应的异常情况。然后，我们使用时间序列分类数据集构建相应问题的人工数据集。我们编制了38种异常检测算法并纠正了其中一些算法。",
    "tldr": "本文重新定义了时间序列异常检测问题为时间序列异常状态检测问题，并使用单类分类方法进行解决。"
}