{
    "title": "Convolutional Neural Networks Towards Facial Skin Lesions Detection",
    "abstract": "Facial analysis has emerged as a prominent area of research with diverse applications, including cosmetic surgery programs, the beauty industry, photography, and entertainment. Manipulating patient images often necessitates professional image processing software. This study contributes by providing a model that facilitates the detection of blemishes and skin lesions on facial images through a convolutional neural network and machine learning approach. The proposed method offers advantages such as simple architecture, speed and suitability for image processing while avoiding the complexities associated with traditional methods. The model comprises four main steps: area selection, scanning the chosen region, lesion diagnosis, and marking the identified lesion. Raw data for this research were collected from a reputable clinic in Tehran specializing in skincare and beauty services. The dataset includes administrative information, clinical data, and facial and profile images. A total of 230",
    "link": "https://arxiv.org/abs/2402.08592",
    "context": "Title: Convolutional Neural Networks Towards Facial Skin Lesions Detection\nAbstract: Facial analysis has emerged as a prominent area of research with diverse applications, including cosmetic surgery programs, the beauty industry, photography, and entertainment. Manipulating patient images often necessitates professional image processing software. This study contributes by providing a model that facilitates the detection of blemishes and skin lesions on facial images through a convolutional neural network and machine learning approach. The proposed method offers advantages such as simple architecture, speed and suitability for image processing while avoiding the complexities associated with traditional methods. The model comprises four main steps: area selection, scanning the chosen region, lesion diagnosis, and marking the identified lesion. Raw data for this research were collected from a reputable clinic in Tehran specializing in skincare and beauty services. The dataset includes administrative information, clinical data, and facial and profile images. A total of 230",
    "path": "papers/24/02/2402.08592.json",
    "total_tokens": 866,
    "translated_title": "卷积神经网络用于面部皮肤病变检测",
    "translated_abstract": "面部分析已经成为一个重要的研究领域，具有包括美容整形、美容行业、摄影和娱乐等多种应用。操纵患者的图像通常需要专业的图像处理软件。本研究通过卷积神经网络和机器学习方法提供了一个模型，以实现对面部图像上的瑕疵和皮肤病变的检测。所提出的方法具有简单的架构、快速和适用于图像处理，并避免了传统方法的复杂性。该模型包括四个主要步骤：区域选择、所选区域的扫描、病变诊断和标记已识别的病变。该研究的原始数据是从德黑兰一家专门从事皮肤护理和美容服务的知名诊所收集的。数据集包括行政信息、临床数据和面部和侧面图像。",
    "tldr": "本研究提出了一种基于卷积神经网络和机器学习的模型，用于检测面部图像上的瑕疵和皮肤病变。该模型具有简单的架构和适用于图像处理的速度，避免了传统方法的复杂性。",
    "en_tdlr": "This study proposes a model based on convolutional neural networks and machine learning for detecting blemishes and skin lesions on facial images. The model has a simple architecture and offers speed suitable for image processing, avoiding the complexities of traditional methods."
}