{
    "title": "Neural Automated Writing Evaluation with Corrective Feedback",
    "abstract": "arXiv:2402.17613v1 Announce Type: new  Abstract: The utilization of technology in second language learning and teaching has become ubiquitous. For the assessment of writing specifically, automated writing evaluation (AWE) and grammatical error correction (GEC) have become immensely popular and effective methods for enhancing writing proficiency and delivering instant and individualized feedback to learners. By leveraging the power of natural language processing (NLP) and machine learning algorithms, AWE and GEC systems have been developed separately to provide language learners with automated corrective feedback and more accurate and unbiased scoring that would otherwise be subject to examiners. In this paper, we propose an integrated system for automated writing evaluation with corrective feedback as a means of bridging the gap between AWE and GEC results for second language learners. This system enables language learners to simulate the essay writing tests: a student writes and submi",
    "link": "https://arxiv.org/abs/2402.17613",
    "context": "Title: Neural Automated Writing Evaluation with Corrective Feedback\nAbstract: arXiv:2402.17613v1 Announce Type: new  Abstract: The utilization of technology in second language learning and teaching has become ubiquitous. For the assessment of writing specifically, automated writing evaluation (AWE) and grammatical error correction (GEC) have become immensely popular and effective methods for enhancing writing proficiency and delivering instant and individualized feedback to learners. By leveraging the power of natural language processing (NLP) and machine learning algorithms, AWE and GEC systems have been developed separately to provide language learners with automated corrective feedback and more accurate and unbiased scoring that would otherwise be subject to examiners. In this paper, we propose an integrated system for automated writing evaluation with corrective feedback as a means of bridging the gap between AWE and GEC results for second language learners. This system enables language learners to simulate the essay writing tests: a student writes and submi",
    "path": "papers/24/02/2402.17613.json",
    "total_tokens": 808,
    "translated_title": "具有纠正反馈的神经自动写作评估",
    "translated_abstract": "在第二语言学习和教学中，利用技术已变得普遍。对于写作评估，自动写作评估（AWE）和语法错误纠正（GEC）已成为增强写作能力、向学习者提供即时个性化反馈的流行和有效方法。借助自然语言处理（NLP）和机器学习算法的力量，AWE和GEC系统已分别开发，以为语言学习者提供自动校正反馈和更准确、无偏的评分，否则这些将被评审员所主观判断。本文提出了一个集成系统，用于具有纠正反馈的自动写作评估，作为填补第二语言学习者AWE和GEC结果差距的手段。该系统使语言学习者能够模拟论文写作测试：学生撰写并提交论文，系统提供评估和纠正反馈。",
    "tldr": "本文提出了一个集成系统，用于具有纠正反馈的自动写作评估，旨在填补第二语言学习者AWE和GEC结果之间的差距。"
}