{
    "title": "PreAct: Predicting Future in ReAct Enhances Agent's Planning Ability",
    "abstract": "arXiv:2402.11534v1 Announce Type: cross  Abstract: Addressing the discrepancies between predictions and actual outcomes often aids individuals in expanding their thought processes and engaging in reflection, thereby facilitating reasoning in the correct direction. In this paper, we introduce $\\textbf{PreAct}$, an agent framework that integrates $\\textbf{pre}$diction with $\\textbf{rea}$soning and $\\textbf{act}$ion. Leveraging the information provided by predictions, a large language model (LLM) based agent can offer more diversified and strategically oriented reasoning, which in turn leads to more effective actions that help the agent complete complex tasks. Our experiments demonstrate that PreAct outperforms the ReAct approach in accomplishing complex tasks and that PreAct can be co-enhanced when combined with Reflexion methods. We prompt the model with different numbers of historical predictions and find that historical predictions have a sustained positive effect on LLM planning. The",
    "link": "https://arxiv.org/abs/2402.11534",
    "context": "Title: PreAct: Predicting Future in ReAct Enhances Agent's Planning Ability\nAbstract: arXiv:2402.11534v1 Announce Type: cross  Abstract: Addressing the discrepancies between predictions and actual outcomes often aids individuals in expanding their thought processes and engaging in reflection, thereby facilitating reasoning in the correct direction. In this paper, we introduce $\\textbf{PreAct}$, an agent framework that integrates $\\textbf{pre}$diction with $\\textbf{rea}$soning and $\\textbf{act}$ion. Leveraging the information provided by predictions, a large language model (LLM) based agent can offer more diversified and strategically oriented reasoning, which in turn leads to more effective actions that help the agent complete complex tasks. Our experiments demonstrate that PreAct outperforms the ReAct approach in accomplishing complex tasks and that PreAct can be co-enhanced when combined with Reflexion methods. We prompt the model with different numbers of historical predictions and find that historical predictions have a sustained positive effect on LLM planning. The",
    "path": "papers/24/02/2402.11534.json",
    "total_tokens": 835,
    "translated_title": "PreAct: 在 ReAct 中预测未来增强智能体的规划能力",
    "translated_abstract": "处理预测与实际结果之间的差异常常有助于个体拓展思维过程并进行反思，从而促进朝正确方向推理。本文介绍了一种名为 PreAct 的智能体框架，它将预测、推理和行动整合在一起。利用预测提供的信息，基于大语言模型（LLM）的智能体能够提供更多样化和策略导向的推理，进而导致更有效的行动，帮助智能体完成复杂任务。我们的实验表明，PreAct 在完成复杂任务方面优于 ReAct 方法，并且当与反思方法结合时，PreAct 的效果可以得到提升。我们对模型提供不同数量的历史预测，并发现历史预测对LLM规划有持续积极影响。",
    "tldr": "PreAct是一个整合了预测、推理和行动的智能体框架，利用预测信息可以帮助智能体进行更多样化和策略性的推理，导致更有效的行动，提升任务完成效率。",
    "en_tdlr": "PreAct is an agent framework that integrates prediction, reasoning, and action, leveraging prediction information to help agents engage in more diversified and strategically oriented reasoning, leading to more effective actions and improved task completion efficiency."
}