{
    "title": "Deep Learning Approaches for Network Traffic Classification in the Internet of Things (IoT): A Survey",
    "abstract": "The Internet of Things (IoT) has witnessed unprecedented growth, resulting in a massive influx of diverse network traffic from interconnected devices. Effectively classifying this network traffic is crucial for optimizing resource allocation, enhancing security measures, and ensuring efficient network management in IoT systems. Deep learning has emerged as a powerful technique for network traffic classification due to its ability to automatically learn complex patterns and representations from raw data. This survey paper aims to provide a comprehensive overview of the existing deep learning approaches employed in network traffic classification specifically tailored for IoT environments. By systematically analyzing and categorizing the latest research contributions in this domain, we explore the strengths and limitations of various deep learning models in handling the unique challenges posed by IoT network traffic. Through this survey, we aim to offer researchers and practitioners valua",
    "link": "https://rss.arxiv.org/abs/2402.00920",
    "context": "Title: Deep Learning Approaches for Network Traffic Classification in the Internet of Things (IoT): A Survey\nAbstract: The Internet of Things (IoT) has witnessed unprecedented growth, resulting in a massive influx of diverse network traffic from interconnected devices. Effectively classifying this network traffic is crucial for optimizing resource allocation, enhancing security measures, and ensuring efficient network management in IoT systems. Deep learning has emerged as a powerful technique for network traffic classification due to its ability to automatically learn complex patterns and representations from raw data. This survey paper aims to provide a comprehensive overview of the existing deep learning approaches employed in network traffic classification specifically tailored for IoT environments. By systematically analyzing and categorizing the latest research contributions in this domain, we explore the strengths and limitations of various deep learning models in handling the unique challenges posed by IoT network traffic. Through this survey, we aim to offer researchers and practitioners valua",
    "path": "papers/24/02/2402.00920.json",
    "total_tokens": 897,
    "translated_title": "深度学习在物联网中的网络流量分类中的应用：一项调研",
    "translated_abstract": "物联网（IoT）目睹了空前的增长，导致来自互联设备的各种网络流量大量涌入。有效地对这些网络流量进行分类对于优化资源分配、增强安全措施和确保物联网系统的高效网络管理至关重要。由于其能够从原始数据中自动学习复杂模式和表示，深度学习已成为网络流量分类的强大技术。本调研论文旨在全面概述针对物联网环境特别定制的网络流量分类中所采用的现有深度学习方法。通过系统分析和分类领域内最新的研究贡献，我们探讨了各种深度学习模型在处理物联网网络流量所带来的独特挑战方面的优势和局限性。通过本调研，我们旨在为研究人员和从业者提供有价值的指导和参考。",
    "tldr": "本调研论文通过系统分析和分类现有的研究贡献，提供了针对物联网环境中网络流量分类的深度学习方法的全面概述，探讨了各种模型的优势和局限性，为研究人员和从业者提供有价值的指导和参考。",
    "en_tdlr": "This survey paper provides a comprehensive overview of existing deep learning approaches employed in network traffic classification specifically tailored for IoT environments. By systematically analyzing and categorizing the latest research contributions in this domain, the strengths and limitations of various deep learning models in handling the unique challenges posed by IoT network traffic are explored. It aims to offer researchers and practitioners valuable guidance and references."
}