{
    "title": "Molecule Generation and Optimization for Efficient Fragrance Creation",
    "abstract": "arXiv:2402.12134v1 Announce Type: cross  Abstract: This research introduces a Machine Learning-centric approach to replicate olfactory experiences, validated through experimental quantification of perfume perception. Key contributions encompass a hybrid model connecting perfume molecular structure to human olfactory perception. This model includes an AI-driven molecule generator (utilizing Graph and Generative Neural Networks), quantification and prediction of odor intensity, and refinery of optimal solvent and molecule combinations for desired fragrances. Additionally, a thermodynamic-based model establishes a link between olfactory perception and liquid-phase concentrations. The methodology employs Transfer Learning and selects the most suitable molecules based on vapor pressure and fragrance notes. Ultimately, a mathematical optimization problem is formulated to minimize discrepancies between new and target olfactory experiences. The methodology is validated by reproducing two disti",
    "link": "https://arxiv.org/abs/2402.12134",
    "context": "Title: Molecule Generation and Optimization for Efficient Fragrance Creation\nAbstract: arXiv:2402.12134v1 Announce Type: cross  Abstract: This research introduces a Machine Learning-centric approach to replicate olfactory experiences, validated through experimental quantification of perfume perception. Key contributions encompass a hybrid model connecting perfume molecular structure to human olfactory perception. This model includes an AI-driven molecule generator (utilizing Graph and Generative Neural Networks), quantification and prediction of odor intensity, and refinery of optimal solvent and molecule combinations for desired fragrances. Additionally, a thermodynamic-based model establishes a link between olfactory perception and liquid-phase concentrations. The methodology employs Transfer Learning and selects the most suitable molecules based on vapor pressure and fragrance notes. Ultimately, a mathematical optimization problem is formulated to minimize discrepancies between new and target olfactory experiences. The methodology is validated by reproducing two disti",
    "path": "papers/24/02/2402.12134.json",
    "total_tokens": 875,
    "translated_title": "分子生成和优化，用于高效香氛创造",
    "translated_abstract": "这项研究介绍了一种以机器学习为中心的方法，通过实验量化香水感知来复制嗅觉体验。关键贡献包括一个将香水分子结构与人类嗅觉感知相连的混合模型。该模型包括一个利用图形和生成式神经网络的人工智能驱动的分子生成器，对气味强度进行量化和预测，以及为期望香氛优化的最佳溶剂和分子组合。此外，基于热力学的模型建立了嗅觉感知与液相浓度之间的联系。该方法利用迁移学习，基于蒸汽压和香味音符选择最合适的分子。最终，建立了一个数学优化问题，以最小化新旧嗅觉体验之间的差异。该方法通过重现两种独特香水的嗅觉体验来进行验证。",
    "tldr": "通过机器学习中心的方法，建立了一个将香水分子结构与人类嗅觉感知相连的混合模型，利用AI驱动的分子生成器和热力学模型，优化溶剂和分子组合，最终通过数学优化问题最小化新旧嗅觉体验之间的差异。",
    "en_tdlr": "A hybrid model connecting perfume molecular structure to human olfactory perception was established using a machine learning-centric approach, incorporating an AI-driven molecule generator and a thermodynamic model to optimize solvent and molecule combinations, ultimately minimizing differences between new and target olfactory experiences through a mathematical optimization problem."
}