{
    "title": "PolypNextLSTM: A lightweight and fast polyp video segmentation network using ConvNext and ConvLSTM",
    "abstract": "arXiv:2402.11585v1 Announce Type: cross  Abstract: Commonly employed in polyp segmentation, single image UNet architectures lack the temporal insight clinicians gain from video data in diagnosing polyps. To mirror clinical practices more faithfully, our proposed solution, PolypNextLSTM, leverages video-based deep learning, harnessing temporal information for superior segmentation performance with the least parameter overhead, making it possibly suitable for edge devices. PolypNextLSTM employs a UNet-like structure with ConvNext-Tiny as its backbone, strategically omitting the last two layers to reduce parameter overhead. Our temporal fusion module, a Convolutional Long Short Term Memory (ConvLSTM), effectively exploits temporal features. Our primary novelty lies in PolypNextLSTM, which stands out as the leanest in parameters and the fastest model, surpassing the performance of five state-of-the-art image and video-based deep learning models. The evaluation of the SUN-SEG dataset spans ",
    "link": "https://arxiv.org/abs/2402.11585",
    "context": "Title: PolypNextLSTM: A lightweight and fast polyp video segmentation network using ConvNext and ConvLSTM\nAbstract: arXiv:2402.11585v1 Announce Type: cross  Abstract: Commonly employed in polyp segmentation, single image UNet architectures lack the temporal insight clinicians gain from video data in diagnosing polyps. To mirror clinical practices more faithfully, our proposed solution, PolypNextLSTM, leverages video-based deep learning, harnessing temporal information for superior segmentation performance with the least parameter overhead, making it possibly suitable for edge devices. PolypNextLSTM employs a UNet-like structure with ConvNext-Tiny as its backbone, strategically omitting the last two layers to reduce parameter overhead. Our temporal fusion module, a Convolutional Long Short Term Memory (ConvLSTM), effectively exploits temporal features. Our primary novelty lies in PolypNextLSTM, which stands out as the leanest in parameters and the fastest model, surpassing the performance of five state-of-the-art image and video-based deep learning models. The evaluation of the SUN-SEG dataset spans ",
    "path": "papers/24/02/2402.11585.json",
    "total_tokens": 915,
    "translated_title": "PolypNextLSTM：使用ConvNext和ConvLSTM的轻量级快速息肉视频分割网络",
    "translated_abstract": "通常用于息肉分割的单图像UNet架构缺乏临床医生在诊断息肉时从视频数据中获得的时间洞察。为了更忠实地反映临床实践，我们提出的解决方案PolypNextLSTM利用基于视频的深度学习，利用时间信息实现了卓越的分割性能，参数开销最小，可能适用于边缘设备。PolypNextLSTM采用类似UNet的结构，ConvNext-Tiny作为其主干，策略性地省略最后两层以减少参数开销。我们的时间融合模块，一个卷积长短期记忆（ConvLSTM），有效地利用时间特征。我们的主要创新在于PolypNextLSTM，在参数上最瘦且速度最快，超越了五种最先进的基于图像和视频的深度学习模型的性能。SUN-SEG数据集的评估跨越了",
    "tldr": "PolypNextLSTM是一个轻量且快速的息肉视频分割网络，使用ConvNext和ConvLSTM，最大的创新在于参数最少且速度最快，性能超越了五种先进的基于图像和视频的深度学习模型。"
}