{
    "title": "ISPA: Inter-Species Phonetic Alphabet for Transcribing Animal Sounds",
    "abstract": "Traditionally, bioacoustics has relied on spectrograms and continuous, per-frame audio representations for the analysis of animal sounds, also serving as input to machine learning models. Meanwhile, the International Phonetic Alphabet (IPA) system has provided an interpretable, language-independent method for transcribing human speech sounds. In this paper, we introduce ISPA (Inter-Species Phonetic Alphabet), a precise, concise, and interpretable system designed for transcribing animal sounds into text. We compare acoustics-based and feature-based methods for transcribing and classifying animal sounds, demonstrating their comparable performance with baseline methods utilizing continuous, dense audio representations. By representing animal sounds with text, we effectively treat them as a \"foreign language,\" and we show that established human language ML paradigms and models, such as language models, can be successfully applied to improve performance.",
    "link": "https://arxiv.org/abs/2402.03269",
    "context": "Title: ISPA: Inter-Species Phonetic Alphabet for Transcribing Animal Sounds\nAbstract: Traditionally, bioacoustics has relied on spectrograms and continuous, per-frame audio representations for the analysis of animal sounds, also serving as input to machine learning models. Meanwhile, the International Phonetic Alphabet (IPA) system has provided an interpretable, language-independent method for transcribing human speech sounds. In this paper, we introduce ISPA (Inter-Species Phonetic Alphabet), a precise, concise, and interpretable system designed for transcribing animal sounds into text. We compare acoustics-based and feature-based methods for transcribing and classifying animal sounds, demonstrating their comparable performance with baseline methods utilizing continuous, dense audio representations. By representing animal sounds with text, we effectively treat them as a \"foreign language,\" and we show that established human language ML paradigms and models, such as language models, can be successfully applied to improve performance.",
    "path": "papers/24/02/2402.03269.json",
    "total_tokens": 888,
    "translated_title": "ISPA: 用于转录动物声音的跨物种语音音标",
    "translated_abstract": "传统上，生物声学依赖谱图和连续的每帧音频表示来分析动物声音，并作为机器学习模型的输入。与此同时，国际音标（IPA）系统提供了一种可解释的、与语言无关的方法来转录人类语音声音。本文介绍了ISPA（跨物种语音音标），这是一种精确、简洁、可解释的系统，用于将动物声音转录为文本。我们比较了基于声学和基于特征的方法来转录和分类动物声音，并证明了它们与使用连续、稠密音频表示的基准方法具有可比性的性能。通过将动物声音表示为文本，我们有效地将其视为一种“外语”，并展示了已建立的人类语言机器学习范例和模型（如语言模型）能够成功应用于提高性能。",
    "tldr": "本文介绍了ISPA（跨物种语音音标），这是一种精确、简洁、可解释的系统，用于将动物声音转录为文本。通过将动物声音表示为文本，我们有效地将其视为一种“外语”，并展示了已建立的人类语言机器学习范例和模型（如语言模型）能够成功应用于提高性能。"
}