{
    "title": "Network Inversion of Binarised Neural Nets",
    "abstract": "arXiv:2402.11995v1 Announce Type: new  Abstract: While the deployment of neural networks, yielding impressive results, becomes more prevalent in various applications, their interpretability and understanding remain a critical challenge. Network inversion, a technique that aims to reconstruct the input space from the model's learned internal representations, plays a pivotal role in unraveling the black-box nature of input to output mappings in neural networks. In safety-critical scenarios, where model outputs may influence pivotal decisions, the integrity of the corresponding input space is paramount, necessitating the elimination of any extraneous \"garbage\" to ensure the trustworthiness of the network. Binarised Neural Networks (BNNs), characterized by binary weights and activations, offer computational efficiency and reduced memory requirements, making them suitable for resource-constrained environments. This paper introduces a novel approach to invert a trained BNN by encoding it int",
    "link": "https://arxiv.org/abs/2402.11995",
    "context": "Title: Network Inversion of Binarised Neural Nets\nAbstract: arXiv:2402.11995v1 Announce Type: new  Abstract: While the deployment of neural networks, yielding impressive results, becomes more prevalent in various applications, their interpretability and understanding remain a critical challenge. Network inversion, a technique that aims to reconstruct the input space from the model's learned internal representations, plays a pivotal role in unraveling the black-box nature of input to output mappings in neural networks. In safety-critical scenarios, where model outputs may influence pivotal decisions, the integrity of the corresponding input space is paramount, necessitating the elimination of any extraneous \"garbage\" to ensure the trustworthiness of the network. Binarised Neural Networks (BNNs), characterized by binary weights and activations, offer computational efficiency and reduced memory requirements, making them suitable for resource-constrained environments. This paper introduces a novel approach to invert a trained BNN by encoding it int",
    "path": "papers/24/02/2402.11995.json",
    "total_tokens": 782,
    "translated_title": "二值化神经网络的网络反漂",
    "translated_abstract": "虽然神经网络的部署在各种应用中产生了令人印象深刻的结果，但它们的可解释性和理解依然是一个关键挑战。网络反漂是一种旨在从模型学习的内部表示中重建输入空间的技术，在揭示神经网络中输入到输出映射的黑匣子特性方面发挥着关键作用。在安全关键场景中，模型输出可能影响重要决策，相应输入空间的完整性至关重要，必须消除任何多余的“垃圾”以确保网络的可信度。二值神经网络（BNNs）以二值权重和激活为特征，提供了计算效率和减少内存需求，使它们适用于资源受限环境。本文介绍了一种通过将训练后的BNN编码来反漂的新方法",
    "tldr": "本文提出了一种新颖的方法，通过将训练后的二值化神经网络编码，实现了对其进行反漂的目的",
    "en_tdlr": "This paper introduces a novel approach to invert a trained Binarised Neural Network by encoding it, achieving the purpose of network inversion."
}