{
    "title": "A Generative Pre-Training Framework for Spatio-Temporal Graph Transfer Learning",
    "abstract": "arXiv:2402.11922v1 Announce Type: new  Abstract: Spatio-temporal graph (STG) learning is foundational for smart city applications, yet it is often hindered by data scarcity in many cities and regions. To bridge this gap, we propose a novel generative pre-training framework, GPDiff, for STG transfer learning. Unlike conventional approaches that heavily rely on common feature extraction or intricate transfer learning designs, our solution takes a novel approach by performing generative pre-training on a collection of model parameters optimized with data from source cities. We recast STG transfer learning as pre-training a generative hypernetwork, which generates tailored model parameters guided by prompts, allowing for adaptability to diverse data distributions and city-specific characteristics. GPDiff employs a diffusion model with a transformer-based denoising network, which is model-agnostic to integrate with powerful STG models. By addressing challenges arising from data gaps and the",
    "link": "https://arxiv.org/abs/2402.11922",
    "context": "Title: A Generative Pre-Training Framework for Spatio-Temporal Graph Transfer Learning\nAbstract: arXiv:2402.11922v1 Announce Type: new  Abstract: Spatio-temporal graph (STG) learning is foundational for smart city applications, yet it is often hindered by data scarcity in many cities and regions. To bridge this gap, we propose a novel generative pre-training framework, GPDiff, for STG transfer learning. Unlike conventional approaches that heavily rely on common feature extraction or intricate transfer learning designs, our solution takes a novel approach by performing generative pre-training on a collection of model parameters optimized with data from source cities. We recast STG transfer learning as pre-training a generative hypernetwork, which generates tailored model parameters guided by prompts, allowing for adaptability to diverse data distributions and city-specific characteristics. GPDiff employs a diffusion model with a transformer-based denoising network, which is model-agnostic to integrate with powerful STG models. By addressing challenges arising from data gaps and the",
    "path": "papers/24/02/2402.11922.json",
    "total_tokens": 755,
    "translated_title": "一种用于时空图迁移学习的生成式预训练框架",
    "translated_abstract": "时空图（STG）学习对于智慧城市应用至关重要，然而在许多城市和地区往往存在数据稀缺问题。为了弥补这一差距，我们提出了一种新颖的生成式预训练框架 GPDiff，用于STG迁移学习。与传统方法不同，我们的解决方案采用了一种新颖的方法，通过在经过源城市数据优化的一系列模型参数上进行生成式预训练来执行STG迁移学习。",
    "tldr": "提出了一种生成式预训练框架 GPDiff，通过在源城市数据优化的模型参数上进行预训练，将STG迁移学习转化为预训练生成式超网络，实现了对不同数据分布和特定城市特征的适应性。",
    "en_tdlr": "Introduced a generative pre-training framework GPDiff, transforming STG transfer learning into pre-training a generative hypernetwork on model parameters optimized with data from source cities, enabling adaptability to diverse data distributions and city-specific characteristics."
}