{
    "title": "Non-Parametric Estimation of Multi-dimensional Marked Hawkes Processes",
    "abstract": "An extension of the Hawkes process, the Marked Hawkes process distinguishes itself by featuring variable jump size across each event, in contrast to the constant jump size observed in a Hawkes process without marks. While extensive literature has been dedicated to the non-parametric estimation of both the linear and non-linear Hawkes process, there remains a significant gap in the literature regarding the marked Hawkes process. In response to this, we propose a methodology for estimating the conditional intensity of the marked Hawkes process. We introduce two distinct models: \\textit{Shallow Neural Hawkes with marks}- for Hawkes processes with excitatory kernels and \\textit{Neural Network for Non-Linear Hawkes with Marks}- for non-linear Hawkes processes. Both these approaches take the past arrival times and their corresponding marks as the input to obtain the arrival intensity. This approach is entirely non-parametric, preserving the interpretability associated with the marked Hawkes ",
    "link": "https://arxiv.org/abs/2402.04740",
    "context": "Title: Non-Parametric Estimation of Multi-dimensional Marked Hawkes Processes\nAbstract: An extension of the Hawkes process, the Marked Hawkes process distinguishes itself by featuring variable jump size across each event, in contrast to the constant jump size observed in a Hawkes process without marks. While extensive literature has been dedicated to the non-parametric estimation of both the linear and non-linear Hawkes process, there remains a significant gap in the literature regarding the marked Hawkes process. In response to this, we propose a methodology for estimating the conditional intensity of the marked Hawkes process. We introduce two distinct models: \\textit{Shallow Neural Hawkes with marks}- for Hawkes processes with excitatory kernels and \\textit{Neural Network for Non-Linear Hawkes with Marks}- for non-linear Hawkes processes. Both these approaches take the past arrival times and their corresponding marks as the input to obtain the arrival intensity. This approach is entirely non-parametric, preserving the interpretability associated with the marked Hawkes ",
    "path": "papers/24/02/2402.04740.json",
    "total_tokens": 874,
    "translated_title": "多维标记Hawkes过程的非参数估计",
    "translated_abstract": "标记Hawkes过程是Hawkes过程的一个扩展，其特点是每个事件的跳跃大小不同，与没有标记的Hawkes过程中观察到的恒定跳跃大小不同。尽管在线性和非线性Hawkes过程的非参数估计上已经有了广泛的文献，但在标记Hawkes过程方面的文献仍存在重大空白。为此，我们提出了估计标记Hawkes过程条件强度的方法。我们引入了两个不同的模型：“具有标记的浅层神经Hawkes模型”-用于具有兴奋性内核的Hawkes过程，以及“非线性Hawkes具有标记的神经网络模型”-用于非线性Hawkes过程。这两种方法将过去的到达时间及其相应的标记作为输入，以获取到达强度。这种方法是完全非参数的，保持了标记Hawkes过程的可解释性。",
    "tldr": "这篇论文提出了一种非参数估计标记Hawkes过程条件强度的方法，引入了两种模型来处理具有不同内核和非线性特征的Hawkes过程，通过将过去的到达时间和标记作为输入，获得到达强度。",
    "en_tdlr": "This paper proposes a non-parametric estimation method for the conditional intensity of the marked Hawkes process, introducing two models for handling Hawkes processes with different kernels and non-linear features, obtaining the arrival intensity by taking past arrival times and marks as input."
}