{
    "title": "Ultra Fast Transformers on FPGAs for Particle Physics Experiments",
    "abstract": "This work introduces a highly efficient implementation of the transformer architecture on a Field-Programmable Gate Array (FPGA) by using the \\texttt{hls4ml} tool. Given the demonstrated effectiveness of transformer models in addressing a wide range of problems, their application in experimental triggers within particle physics becomes a subject of significant interest. In this work, we have implemented critical components of a transformer model, such as multi-head attention and softmax layers. To evaluate the effectiveness of our implementation, we have focused on a particle physics jet flavor tagging problem, employing a public dataset. We recorded latency under 2 $\\mu$s on the Xilinx UltraScale+ FPGA, which is compatible with hardware trigger requirements at the CERN Large Hadron Collider experiments.",
    "link": "https://rss.arxiv.org/abs/2402.01047",
    "context": "Title: Ultra Fast Transformers on FPGAs for Particle Physics Experiments\nAbstract: This work introduces a highly efficient implementation of the transformer architecture on a Field-Programmable Gate Array (FPGA) by using the \\texttt{hls4ml} tool. Given the demonstrated effectiveness of transformer models in addressing a wide range of problems, their application in experimental triggers within particle physics becomes a subject of significant interest. In this work, we have implemented critical components of a transformer model, such as multi-head attention and softmax layers. To evaluate the effectiveness of our implementation, we have focused on a particle physics jet flavor tagging problem, employing a public dataset. We recorded latency under 2 $\\mu$s on the Xilinx UltraScale+ FPGA, which is compatible with hardware trigger requirements at the CERN Large Hadron Collider experiments.",
    "path": "papers/24/02/2402.01047.json",
    "total_tokens": 792,
    "translated_title": "基于FPGA的超快速变压器用于粒子物理实验",
    "translated_abstract": "本研究通过使用\"hls4ml\"工具在Field-Programmable Gate Array（FPGA）上实现了变压器架构的高效实现。鉴于变压器模型在解决各种问题方面的有效性已经得到证明，它们在粒子物理实验中实验触发器的应用成为一个非常感兴趣的话题。在这项工作中，我们实现了变压器模型的关键组件，如多头注意力和softmax层。为了评估我们实现的有效性，我们专注于粒子物理学喷注风味标记问题，使用了一个公共数据集。我们记录下了在Xilinx UltraScale+ FPGA上低于2微秒的延迟，这符合欧洲核子研究中心大型强子对撞机实验的硬件触发要求。",
    "tldr": "本研究介绍了一种在FPGA上高效实现变压器架构的方法，并在粒子物理实验中的触发器应用中取得了非常好的效果，实现了低于2微秒的延迟，符合大型强子对撞机实验的要求。",
    "en_tdlr": "This study presents a highly efficient implementation of the transformer architecture on an FPGA, which achieves latency of under 2 microseconds and meets the requirements of hardware triggers in large-scale particle physics experiments."
}