{
    "title": "Discriminant Distance-Aware Representation on Deterministic Uncertainty Quantification Methods",
    "abstract": "arXiv:2402.12664v1 Announce Type: new  Abstract: Uncertainty estimation is a crucial aspect of deploying dependable deep learning models in safety-critical systems. In this study, we introduce a novel and efficient method for deterministic uncertainty estimation called Discriminant Distance-Awareness Representation (DDAR). Our approach involves constructing a DNN model that incorporates a set of prototypes in its latent representations, enabling us to analyze valuable feature information from the input data. By leveraging a distinction maximization layer over optimal trainable prototypes, DDAR can learn a discriminant distance-awareness representation. We demonstrate that DDAR overcomes feature collapse by relaxing the Lipschitz constraint that hinders the practicality of deterministic uncertainty methods (DUMs) architectures. Our experiments show that DDAR is a flexible and architecture-agnostic method that can be easily integrated as a pluggable layer with distance-sensitive metrics,",
    "link": "https://arxiv.org/abs/2402.12664",
    "context": "Title: Discriminant Distance-Aware Representation on Deterministic Uncertainty Quantification Methods\nAbstract: arXiv:2402.12664v1 Announce Type: new  Abstract: Uncertainty estimation is a crucial aspect of deploying dependable deep learning models in safety-critical systems. In this study, we introduce a novel and efficient method for deterministic uncertainty estimation called Discriminant Distance-Awareness Representation (DDAR). Our approach involves constructing a DNN model that incorporates a set of prototypes in its latent representations, enabling us to analyze valuable feature information from the input data. By leveraging a distinction maximization layer over optimal trainable prototypes, DDAR can learn a discriminant distance-awareness representation. We demonstrate that DDAR overcomes feature collapse by relaxing the Lipschitz constraint that hinders the practicality of deterministic uncertainty methods (DUMs) architectures. Our experiments show that DDAR is a flexible and architecture-agnostic method that can be easily integrated as a pluggable layer with distance-sensitive metrics,",
    "path": "papers/24/02/2402.12664.json",
    "total_tokens": 866,
    "translated_title": "判别距离感知表示在确定性不确定性量化方法上的研究",
    "translated_abstract": "不确定性估计是在部署可靠的深度学习模型到安全关键系统中的一个关键方面。本研究引入了一种新颖高效的确定性不确定性估计方法，称为判别距离感知表示（DDAR）。我们的方法涉及构建一个深度神经网络模型，在其潜在表示中包含一组原型，使我们能够从输入数据中分析有价值的特征信息。通过在最优可训练原型上应用区分最大化层，DDAR能够学习到判别距离感知表示。我们证明了DDAR通过放宽束缚确定性不确定性方法（DUMs）架构的实用性所阻碍的李普希茨约束，克服了特征塌缩问题。我们的实验表明，DDAR是一种灵活的、与架构无关的方法，可以作为一个可插入的层轻松集成到具有距离敏感度量的模型中。",
    "tldr": "提出了一种新颖高效的确定性不确定性估计方法DDAR，通过引入判别距离感知表示和最优可训练原型，克服了特征塌缩问题，证明了其灵活性和架构无关性",
    "en_tdlr": "Proposed a novel and efficient deterministic uncertainty estimation method DDAR, overcame feature collapse issue by introducing discriminant distance-aware representation and optimal trainable prototypes, demonstrating its flexibility and architecture-agnostic nature."
}