{
    "title": "IndiVec: An Exploration of Leveraging Large Language Models for Media Bias Detection with Fine-Grained Bias Indicators",
    "abstract": "This study focuses on media bias detection, crucial in today's era of influential social media platforms shaping individual attitudes and opinions. In contrast to prior work that primarily relies on training specific models tailored to particular datasets, resulting in limited adaptability and subpar performance on out-of-domain data, we introduce a general bias detection framework, IndiVec, built upon large language models. IndiVec begins by constructing a fine-grained media bias database, leveraging the robust instruction-following capabilities of large language models and vector database techniques. When confronted with new input for bias detection, our framework automatically selects the most relevant indicator from the vector database and employs majority voting to determine the input's bias label. IndiVec excels compared to previous methods due to its adaptability (demonstrating consistent performance across diverse datasets from various sources) and explainability (providing exp",
    "link": "https://arxiv.org/abs/2402.00345",
    "context": "Title: IndiVec: An Exploration of Leveraging Large Language Models for Media Bias Detection with Fine-Grained Bias Indicators\nAbstract: This study focuses on media bias detection, crucial in today's era of influential social media platforms shaping individual attitudes and opinions. In contrast to prior work that primarily relies on training specific models tailored to particular datasets, resulting in limited adaptability and subpar performance on out-of-domain data, we introduce a general bias detection framework, IndiVec, built upon large language models. IndiVec begins by constructing a fine-grained media bias database, leveraging the robust instruction-following capabilities of large language models and vector database techniques. When confronted with new input for bias detection, our framework automatically selects the most relevant indicator from the vector database and employs majority voting to determine the input's bias label. IndiVec excels compared to previous methods due to its adaptability (demonstrating consistent performance across diverse datasets from various sources) and explainability (providing exp",
    "path": "papers/24/02/2402.00345.json",
    "total_tokens": 942,
    "translated_title": "IndiVec: 利用大型语言模型进行细粒度偏见指标的媒体偏见检测的探索",
    "translated_abstract": "本研究侧重于媒体偏见检测，在当今影响力巨大的社交媒体平台塑造个人态度和观点的时代，这是至关重要的。与主要依赖训练特定模型针对特定数据集的先前工作相比，这导致了有限的适应性和在领域外数据上的次优性能，我们引入了一个通用的偏见检测框架IndiVec，建立在大型语言模型上。IndiVec首先通过利用大型语言模型的强大指令遵循能力和向量数据库技术构建一个细粒度媒体偏见数据库。当面对新的输入进行偏见检测时，我们的框架会自动从向量数据库中选择最相关的指标，并采用多数投票确定输入的偏见标签。与以前的方法相比，IndiVec在适应性（在来自各种来源的不同数据集上展现出一致的性能）和可解释性（提供易于理解的解释）方面表现出色。",
    "tldr": "这项研究引入了一个通用的偏见检测框架IndiVec，利用大型语言模型构建细粒度媒体偏见数据库，并通过多数投票确定输入的偏见标签。这一框架具有适应性和可解释性，在各种数据集上表现出一致的性能。"
}