{
    "title": "HiMAP: Learning Heuristics-Informed Policies for Large-Scale Multi-Agent Pathfinding",
    "abstract": "arXiv:2402.15546v1 Announce Type: cross  Abstract: Large-scale multi-agent pathfinding (MAPF) presents significant challenges in several areas. As systems grow in complexity with a multitude of autonomous agents operating simultaneously, efficient and collision-free coordination becomes paramount. Traditional algorithms often fall short in scalability, especially in intricate scenarios. Reinforcement Learning (RL) has shown potential to address the intricacies of MAPF; however, it has also been shown to struggle with scalability, demanding intricate implementation, lengthy training, and often exhibiting unstable convergence, limiting its practical application. In this paper, we introduce Heuristics-Informed Multi-Agent Pathfinding (HiMAP), a novel scalable approach that employs imitation learning with heuristic guidance in a decentralized manner. We train on small-scale instances using a heuristic policy as a teacher that maps each single agent observation information to an action prob",
    "link": "https://arxiv.org/abs/2402.15546",
    "context": "Title: HiMAP: Learning Heuristics-Informed Policies for Large-Scale Multi-Agent Pathfinding\nAbstract: arXiv:2402.15546v1 Announce Type: cross  Abstract: Large-scale multi-agent pathfinding (MAPF) presents significant challenges in several areas. As systems grow in complexity with a multitude of autonomous agents operating simultaneously, efficient and collision-free coordination becomes paramount. Traditional algorithms often fall short in scalability, especially in intricate scenarios. Reinforcement Learning (RL) has shown potential to address the intricacies of MAPF; however, it has also been shown to struggle with scalability, demanding intricate implementation, lengthy training, and often exhibiting unstable convergence, limiting its practical application. In this paper, we introduce Heuristics-Informed Multi-Agent Pathfinding (HiMAP), a novel scalable approach that employs imitation learning with heuristic guidance in a decentralized manner. We train on small-scale instances using a heuristic policy as a teacher that maps each single agent observation information to an action prob",
    "path": "papers/24/02/2402.15546.json",
    "total_tokens": 870,
    "translated_title": "HiMAP：用于大规模多智体路径规划的学习启发式策略",
    "translated_abstract": "大规模多智体路径规划（MAPF）在多个领域都存在着重大挑战。随着系统的复杂性随着大量自治体同时操作而增长，高效和避免碰撞的协调变得至关重要。传统算法在可伸缩性方面通常表现不佳，特别是在复杂场景中。强化学习（RL）已经显示出潜力来解决MAPF的复杂性；然而，它也被发现在可伸缩性方面遇到困难，需要精细的实施、漫长的训练，而且通常表现出不稳定的收敛性，限制了其实际应用。在本文中，我们介绍了Heuristics-Informed Multi-Agent Pathfinding（HiMAP），这是一种新颖的可伸缩方法，采用以启发式引导的模仿学习方式来进行分散式训练。我们在小规模实例上进行训练，使用一个启发式策略作为教师，将每个单个智体观测信息映射到行动概率",
    "tldr": "HiMAP 是一种新颖的可伸缩方法，使用启发式引导的模仿学习在分散式训练中对用户智体路径规划进行了改进",
    "en_tdlr": "HiMAP is a novel scalable approach that introduces improvement to multi-agent pathfinding by utilizing imitation learning with heuristic guidance in decentralized training."
}