{
    "title": "PRIME: Protect Your Videos From Malicious Editing",
    "abstract": "With the development of generative models, the quality of generated content keeps increasing. Recently, open-source models have made it surprisingly easy to manipulate and edit photos and videos, with just a few simple prompts. While these cutting-edge technologies have gained popularity, they have also given rise to concerns regarding the privacy and portrait rights of individuals. Malicious users can exploit these tools for deceptive or illegal purposes. Although some previous works focus on protecting photos against generative models, we find there are still gaps between protecting videos and images in the aspects of efficiency and effectiveness. Therefore, we introduce our protection method, PRIME, to significantly reduce the time cost and improve the protection performance. Moreover, to evaluate our proposed protection method, we consider both objective metrics and human subjective metrics. Our evaluation results indicate that PRIME only costs 8.3% GPU hours of the cost of the pre",
    "link": "https://rss.arxiv.org/abs/2402.01239",
    "context": "Title: PRIME: Protect Your Videos From Malicious Editing\nAbstract: With the development of generative models, the quality of generated content keeps increasing. Recently, open-source models have made it surprisingly easy to manipulate and edit photos and videos, with just a few simple prompts. While these cutting-edge technologies have gained popularity, they have also given rise to concerns regarding the privacy and portrait rights of individuals. Malicious users can exploit these tools for deceptive or illegal purposes. Although some previous works focus on protecting photos against generative models, we find there are still gaps between protecting videos and images in the aspects of efficiency and effectiveness. Therefore, we introduce our protection method, PRIME, to significantly reduce the time cost and improve the protection performance. Moreover, to evaluate our proposed protection method, we consider both objective metrics and human subjective metrics. Our evaluation results indicate that PRIME only costs 8.3% GPU hours of the cost of the pre",
    "path": "papers/24/02/2402.01239.json",
    "total_tokens": 852,
    "translated_title": "PRIME: 保护您的视频免受恶意编辑的影响",
    "translated_abstract": "随着生成模型的发展，生成内容的质量不断提高。最近，开源模型使得操纵和编辑照片和视频变得非常容易，只需要几个简单的提示。虽然这些尖端技术变得越来越受欢迎，但它们也引发了人们对个人隐私和肖像权的担忧。恶意用户可以利用这些工具进行欺骗或非法行为。虽然一些之前的工作关注保护照片免受生成模型的影响，但我们发现在效率和效果方面，保护视频和图像之间仍存在差距。因此，我们引入了我们的保护方法PRIME，以显著降低时间成本并改善保护性能。此外，为了评估我们提出的保护方法，我们同时考虑了客观指标和人类主观指标。我们的评估结果表明，PRIME仅占了先前方案所需GPU时间的8.3%。",
    "tldr": "提出了一种名为PRIME的保护方法，旨在显著降低保护视频的时间成本，并提高保护性能。评估结果表明，PRIME仅需8.3%的GPU时间成本。",
    "en_tdlr": "A protection method called PRIME is proposed to significantly reduce the time cost for protecting videos and improve the protection performance. Evaluation results show that PRIME only costs 8.3% of the GPU time compared to previous methods."
}