{
    "title": "Evaluation of Country Dietary Habits Using Machine Learning Techniques in Relation to Deaths from COVID-19",
    "abstract": "arXiv:2402.12558v1 Announce Type: new  Abstract: COVID-19 disease has affected almost every country in the world. The large number of infected people and the different mortality rates between countries has given rise to many hypotheses about the key points that make the virus so lethal in some places. In this study, the eating habits of 170 countries were evaluated in order to find correlations between these habits and mortality rates caused by COVID-19 using machine learning techniques that group the countries together according to the different distribution of fat, energy, and protein across 23 different types of food, as well as the amount ingested in kilograms. Results shown how obesity and the high consumption of fats appear in countries with the highest death rates, whereas countries with a lower rate have a higher level of cereal consumption accompanied by a lower total average intake of kilocalories.",
    "link": "https://arxiv.org/abs/2402.12558",
    "context": "Title: Evaluation of Country Dietary Habits Using Machine Learning Techniques in Relation to Deaths from COVID-19\nAbstract: arXiv:2402.12558v1 Announce Type: new  Abstract: COVID-19 disease has affected almost every country in the world. The large number of infected people and the different mortality rates between countries has given rise to many hypotheses about the key points that make the virus so lethal in some places. In this study, the eating habits of 170 countries were evaluated in order to find correlations between these habits and mortality rates caused by COVID-19 using machine learning techniques that group the countries together according to the different distribution of fat, energy, and protein across 23 different types of food, as well as the amount ingested in kilograms. Results shown how obesity and the high consumption of fats appear in countries with the highest death rates, whereas countries with a lower rate have a higher level of cereal consumption accompanied by a lower total average intake of kilocalories.",
    "path": "papers/24/02/2402.12558.json",
    "total_tokens": 886,
    "translated_title": "利用机器学习技术评估与COVID-19死亡率相关的国家饮食习惯",
    "translated_abstract": "COVID-19疾病已经影响了世界上几乎每个国家。大量感染者和不同国家之间的死亡率差异引发了许多关于使病毒在某些地方如此致命的关键因素的假设。本研究评估了170个国家的饮食习惯，以找出这些习惯与COVID-19引起的死亡率之间的相关性，使用机器学习技术根据23种不同食物的脂肪、能量和蛋白质的不同分布，以及以千克为单位的摄入量，将国家进行分组。结果表明，肥胖和高脂肪摄入在死亡率最高的国家中出现，而死亡率较低的国家则伴随着更高的谷物消费水平以及较低的总体平均千卡摄入量。",
    "tldr": "该研究利用机器学习技术评估了170个国家的饮食习惯，发现肥胖和高脂肪摄入与COVID-19死亡率较高的国家相关，而谷物消费水平较高的国家则有较低的死亡率。"
}