{
    "title": "Towards Explainable LiDAR Point Cloud Semantic Segmentation via Gradient Based Target Localization",
    "abstract": "arXiv:2402.12098v1 Announce Type: cross  Abstract: Semantic Segmentation (SS) of LiDAR point clouds is essential for many applications, such as urban planning and autonomous driving. While much progress has been made in interpreting SS predictions for images, interpreting point cloud SS predictions remains a challenge. This paper introduces pGS-CAM, a novel gradient-based method for generating saliency maps in neural network activation layers. Inspired by Grad-CAM, which uses gradients to highlight local importance, pGS-CAM is robust and effective on a variety of datasets (SemanticKITTI, Paris-Lille3D, DALES) and 3D deep learning architectures (KPConv, RandLANet). Our experiments show that pGS-CAM effectively accentuates the feature learning in intermediate activations of SS architectures by highlighting the contribution of each point. This allows us to better understand how SS models make their predictions and identify potential areas for improvement. Relevant codes are available at h",
    "link": "https://arxiv.org/abs/2402.12098",
    "context": "Title: Towards Explainable LiDAR Point Cloud Semantic Segmentation via Gradient Based Target Localization\nAbstract: arXiv:2402.12098v1 Announce Type: cross  Abstract: Semantic Segmentation (SS) of LiDAR point clouds is essential for many applications, such as urban planning and autonomous driving. While much progress has been made in interpreting SS predictions for images, interpreting point cloud SS predictions remains a challenge. This paper introduces pGS-CAM, a novel gradient-based method for generating saliency maps in neural network activation layers. Inspired by Grad-CAM, which uses gradients to highlight local importance, pGS-CAM is robust and effective on a variety of datasets (SemanticKITTI, Paris-Lille3D, DALES) and 3D deep learning architectures (KPConv, RandLANet). Our experiments show that pGS-CAM effectively accentuates the feature learning in intermediate activations of SS architectures by highlighting the contribution of each point. This allows us to better understand how SS models make their predictions and identify potential areas for improvement. Relevant codes are available at h",
    "path": "papers/24/02/2402.12098.json",
    "total_tokens": 928,
    "translated_title": "通过基于梯度的目标定位实现可解释的LiDAR点云语义分割",
    "translated_abstract": "LiDAR点云的语义分割对城市规划和自动驾驶等许多应用至关重要。尽管在解释图像的语义分割预测方面取得了很大进展，但解释点云语义分割预测仍然是一个挑战。本文介绍了一种名为pGS-CAM的新型基于梯度的方法，用于在神经网络激活层中生成显著性图。受Grad-CAM启发，该方法利用梯度突出显示局部重要性，在多个数据集（如SemanticKITTI、Paris-Lille3D、DALES）和3D深度学习架构（如KPConv、RandLANet）上表现出稳健和有效性。我们的实验证明，pGS-CAM通过突出显示每个点的贡献，有效地强调了SS架构中的中间激活中的特征学习。这使我们能够更好地理解SS模型是如何进行预测的并确定潜在的改进方向。",
    "tldr": "通过pGS-CAM方法，本研究提出了一种基于梯度的目标定位方法，可以有效地生成LiDAR点云语义分割模型中每个点的贡献，帮助我们更好地理解模型预测过程并识别改进的潜在区域。",
    "en_tdlr": "This paper introduces a novel gradient-based method called pGS-CAM for generating saliency maps in neural network activation layers, effectively highlighting the contribution of each point in LiDAR point cloud semantic segmentation models to aid in understanding the prediction process and identifying potential areas for improvement."
}