{
    "title": "Evaluating LLM - Generated Multimodal Diagnosis from Medical Images and Symptom Analysis",
    "abstract": "Large language models (LLMs) constitute a breakthrough state-of-the-art Artificial Intelligence technology which is rapidly evolving and promises to aid in medical diagnosis. However, the correctness and the accuracy of their returns has not yet been properly evaluated. In this work, we propose an LLM evaluation paradigm that incorporates two independent steps of a novel methodology, namely (1) multimodal LLM evaluation via structured interactions and (2) follow-up, domain-specific analysis based on data extracted via the previous interactions. Using this paradigm, (1) we evaluate the correctness and accuracy of LLM-generated medical diagnosis with publicly available multimodal multiple-choice questions(MCQs) in the domain of Pathology and (2) proceed to a systemic and comprehensive analysis of extracted results. We used GPT-4-Vision-Preview as the LLM to respond to complex, medical questions consisting of both images and text, and we explored a wide range of diseases, conditions, chem",
    "link": "https://arxiv.org/abs/2402.01730",
    "context": "Title: Evaluating LLM - Generated Multimodal Diagnosis from Medical Images and Symptom Analysis\nAbstract: Large language models (LLMs) constitute a breakthrough state-of-the-art Artificial Intelligence technology which is rapidly evolving and promises to aid in medical diagnosis. However, the correctness and the accuracy of their returns has not yet been properly evaluated. In this work, we propose an LLM evaluation paradigm that incorporates two independent steps of a novel methodology, namely (1) multimodal LLM evaluation via structured interactions and (2) follow-up, domain-specific analysis based on data extracted via the previous interactions. Using this paradigm, (1) we evaluate the correctness and accuracy of LLM-generated medical diagnosis with publicly available multimodal multiple-choice questions(MCQs) in the domain of Pathology and (2) proceed to a systemic and comprehensive analysis of extracted results. We used GPT-4-Vision-Preview as the LLM to respond to complex, medical questions consisting of both images and text, and we explored a wide range of diseases, conditions, chem",
    "path": "papers/24/02/2402.01730.json",
    "total_tokens": 934,
    "translated_title": "评估LLM生成的医学图像和症状分析的多模态诊断",
    "translated_abstract": "大型语言模型（LLM）是一种突破性的人工智能技术，正在快速发展，并承诺帮助医学诊断。然而，它们的返回结果的正确性和准确性尚未得到适当评估。在这项工作中，我们提出了一种LLM评估范式，它包含两个独立步骤的新方法，即（1）通过结构化交互进行多模态LLM评估和（2）基于之前交互提取的数据进行后续的领域特定分析。使用这种范式，（1）我们通过公开的多模态多项选择题（MCQs）在病理学领域评估LLM生成的医学诊断的正确性和准确性，（2）然后对提取的结果进行系统和全面的分析。我们将GPT-4-Vision-Preview作为LLM，回答由图像和文本组成的复杂医学问题，并探索了一系列的疾病、病况、化学状况。",
    "tldr": "本文提出了一种评估LLM生成医学诊断的方法，通过结构化交互和领域特定分析来评估其正确性和准确性。我们使用GPT-4-Vision-Preview作为LLM，并使用多模态多项选择题评估其在病理学领域的表现。",
    "en_tdlr": "This paper proposes a method for evaluating LLM-generated medical diagnosis by incorporating structured interactions and domain-specific analysis to assess their correctness and accuracy. The LLM used in this study is GPT-4-Vision-Preview, and its performance in the field of pathology is evaluated using multimodal multiple-choice questions."
}