{
    "title": "Context-aware Multi-Model Object Detection for Diversely Heterogeneous Compute Systems",
    "abstract": "In recent years, deep neural networks (DNNs) have gained widespread adoption for continuous mobile object detection (OD) tasks, particularly in autonomous systems. However, a prevalent issue in their deployment is the one-size-fits-all approach, where a single DNN is used, resulting in inefficient utilization of computational resources. This inefficiency is particularly detrimental in energy-constrained systems, as it degrades overall system efficiency. We identify that, the contextual information embedded in the input data stream (e.g. the frames in the camera feed that the OD models are run on) could be exploited to allow a more efficient multi-model-based OD process. In this paper, we propose SHIFT which continuously selects from a variety of DNN-based OD models depending on the dynamically changing contextual information and computational constraints. During this selection, SHIFT uniquely considers multi-accelerator execution to better optimize the energy-efficiency while satisfyin",
    "link": "https://arxiv.org/abs/2402.07415",
    "context": "Title: Context-aware Multi-Model Object Detection for Diversely Heterogeneous Compute Systems\nAbstract: In recent years, deep neural networks (DNNs) have gained widespread adoption for continuous mobile object detection (OD) tasks, particularly in autonomous systems. However, a prevalent issue in their deployment is the one-size-fits-all approach, where a single DNN is used, resulting in inefficient utilization of computational resources. This inefficiency is particularly detrimental in energy-constrained systems, as it degrades overall system efficiency. We identify that, the contextual information embedded in the input data stream (e.g. the frames in the camera feed that the OD models are run on) could be exploited to allow a more efficient multi-model-based OD process. In this paper, we propose SHIFT which continuously selects from a variety of DNN-based OD models depending on the dynamically changing contextual information and computational constraints. During this selection, SHIFT uniquely considers multi-accelerator execution to better optimize the energy-efficiency while satisfyin",
    "path": "papers/24/02/2402.07415.json",
    "total_tokens": 847,
    "translated_title": "面向异构计算系统的上下文感知多模型目标检测",
    "translated_abstract": "近年来，深度神经网络（DNN）在连续移动目标检测（OD）任务中得到了广泛的应用，特别是在自主系统中。然而，它们部署中的一个普遍问题是采用的单一DNN的通用方法，这导致了计算资源的低效利用。这种低效特别在能量受限的系统中会造成整体系统效率的降低。我们认为，嵌入在输入数据流中的上下文信息（例如摄像头数据流中的帧）可以被利用来实现更高效的基于多模型的OD过程。在本文中，我们提出了SHIFT，它根据动态变化的上下文信息和计算约束不断从各种基于DNN的OD模型中选择。在选择过程中，SHIFT独特地考虑多加速器执行，以更好地优化能量效率同时满足要求。",
    "tldr": "本文研究了面向异构计算系统的上下文感知多模型目标检测，通过利用嵌入在输入数据流中的上下文信息实现更高效的基于多模型的目标检测过程，并考虑多加速器执行以优化能量效率。",
    "en_tdlr": "This paper investigates context-aware multi-model object detection for diversely heterogeneous compute systems, achieving more efficient detection process by utilizing contextual information embedded in the input data stream, while considering multi-accelerator execution for optimizing energy efficiency."
}