{
    "title": "Convergence Analysis of Blurring Mean Shift",
    "abstract": "arXiv:2402.15146v1 Announce Type: new  Abstract: Blurring mean shift (BMS) algorithm, a variant of the mean shift algorithm, is a kernel-based iterative method for data clustering, where data points are clustered according to their convergent points via iterative blurring. In this paper, we analyze convergence properties of the BMS algorithm by leveraging its interpretation as an optimization procedure, which is known but has been underutilized in existing convergence studies. Whereas existing results on convergence properties applicable to multi-dimensional data only cover the case where all the blurred data point sequences converge to a single point, this study provides a convergence guarantee even when those sequences can converge to multiple points, yielding multiple clusters. This study also shows that the convergence of the BMS algorithm is fast by further leveraging geometrical characterization of the convergent points.",
    "link": "https://arxiv.org/abs/2402.15146",
    "context": "Title: Convergence Analysis of Blurring Mean Shift\nAbstract: arXiv:2402.15146v1 Announce Type: new  Abstract: Blurring mean shift (BMS) algorithm, a variant of the mean shift algorithm, is a kernel-based iterative method for data clustering, where data points are clustered according to their convergent points via iterative blurring. In this paper, we analyze convergence properties of the BMS algorithm by leveraging its interpretation as an optimization procedure, which is known but has been underutilized in existing convergence studies. Whereas existing results on convergence properties applicable to multi-dimensional data only cover the case where all the blurred data point sequences converge to a single point, this study provides a convergence guarantee even when those sequences can converge to multiple points, yielding multiple clusters. This study also shows that the convergence of the BMS algorithm is fast by further leveraging geometrical characterization of the convergent points.",
    "path": "papers/24/02/2402.15146.json",
    "total_tokens": 847,
    "translated_title": "模糊均值漂移的收敛分析",
    "translated_abstract": "模糊均值漂移（BMS）算法是均值漂移算法的一种变体，是一种基于核的迭代方法，用于数据聚类，数据点根据它们通过迭代模糊的收敛点进行聚类。本文通过利用将BMS算法解释为优化过程来分析BMS算法的收敛性质，这在现有的收敛研究中是已知的，但却被少有利用。现有结果仅适用于多维数据的收敛性质，只涵盖了所有模糊数据点序列收敛到单一点的情况，而本研究提供了一个收敛保证，即使这些序列可以收敛到多个点，从而产生多个簇。该研究还通过进一步利用收敛点的几何特征表明，BMS算法的收敛速度快。",
    "tldr": "本文通过将BMS算法解释为优化过程，提供了模糊均值漂移算法的收敛性质分析，相较于现有结果，本研究不仅覆盖数据收敛到单一点的情况，还提供了多点收敛的收敛保证，展示了算法收敛速度快。",
    "en_tdlr": "This study provides convergence analysis of the blurring mean shift (BMS) algorithm by interpreting it as an optimization procedure, offering convergence guarantee of multiple points convergence in addition to single point convergence and showcasing fast convergence speed."
}