{
    "title": "Analyzing Currency Fluctuations: A Comparative Study of GARCH, EWMA, and IV Models for GBP/USD and EUR/GBP Pairs",
    "abstract": "In this study, we examine the fluctuation in the value of the Great Britain Pound (GBP). We focus particularly on its relationship with the United States Dollar (USD) and the Euro (EUR) currency pairs. Utilizing data from June 15, 2018, to June 15, 2023, we apply various mathematical models to assess their effectiveness in predicting the 20-day variation in the pairs' daily returns. Our analysis involves the implementation of Exponentially Weighted Moving Average (EWMA), Generalized Autoregressive Conditional Heteroskedasticity (GARCH) models, and Implied Volatility (IV) models. To evaluate their performance, we compare the accuracy of their predictions using Root Mean Square Error (RMSE) and Mean Absolute Error (MAE) metrics. We delve into the intricacies of GARCH models, examining their statistical characteristics when applied to the provided dataset. Our findings suggest the existence of asymmetric returns in the EUR/GBP pair, while such evidence is inconclusive for the GBP/USD pair",
    "link": "https://arxiv.org/abs/2402.07435",
    "context": "Title: Analyzing Currency Fluctuations: A Comparative Study of GARCH, EWMA, and IV Models for GBP/USD and EUR/GBP Pairs\nAbstract: In this study, we examine the fluctuation in the value of the Great Britain Pound (GBP). We focus particularly on its relationship with the United States Dollar (USD) and the Euro (EUR) currency pairs. Utilizing data from June 15, 2018, to June 15, 2023, we apply various mathematical models to assess their effectiveness in predicting the 20-day variation in the pairs' daily returns. Our analysis involves the implementation of Exponentially Weighted Moving Average (EWMA), Generalized Autoregressive Conditional Heteroskedasticity (GARCH) models, and Implied Volatility (IV) models. To evaluate their performance, we compare the accuracy of their predictions using Root Mean Square Error (RMSE) and Mean Absolute Error (MAE) metrics. We delve into the intricacies of GARCH models, examining their statistical characteristics when applied to the provided dataset. Our findings suggest the existence of asymmetric returns in the EUR/GBP pair, while such evidence is inconclusive for the GBP/USD pair",
    "path": "papers/24/02/2402.07435.json",
    "total_tokens": 977,
    "translated_title": "分析货币波动：GBP/USD和EUR/GBP货币对的GARCH、EWMA和IV模型的比较研究",
    "translated_abstract": "本研究探讨了英镑（GBP）价值的波动情况，特别关注其与美元（USD）和欧元（EUR）货币对的关系。利用2018年6月15日至2023年6月15日的数据，我们应用不同的数学模型来评估它们在预测货币对每日回报的20天变动方面的效果。我们的分析涉及指数加权移动平均（EWMA）、广义自回归条件异方差（GARCH）模型和隐含波动率（IV）模型的实施。为了评估它们的性能，我们使用均方根误差（RMSE）和平均绝对误差（MAE）指标比较它们的预测准确性。我们深入研究了GARCH模型的复杂性，检查了将其应用于所提供数据集时的统计特性。我们的研究发现，EUR/GBP货币对存在非对称回报的证据，而GBP/USD货币对的证据并不一致。",
    "tldr": "本研究比较了GARCH、EWMA和IV模型在预测GBP/USD和EUR/GBP货币对每日回报的20天变动方面的效果。研究发现EUR/GBP货币对存在非对称回报的证据，而GBP/USD货币对的证据并不一致。"
}