{
    "title": "Digits micro-model for accurate and secure transactions",
    "abstract": "Automatic Speech Recognition (ASR) systems are used in the financial domain to enhance the caller experience by enabling natural language understanding and facilitating efficient and intuitive interactions. Increasing use of ASR systems requires that such systems exhibit very low error rates. The predominant ASR models to collect numeric data are large, general-purpose commercial models -- Google Speech-to-text (STT), or Amazon Transcribe -- or open source (OpenAI's Whisper). Such ASR models are trained on hundreds of thousands of hours of audio data and require considerable resources to run. Despite recent progress large speech recognition models, we highlight the potential of smaller, specialized \"micro\" models. Such light models can be trained perform well on number recognition specific tasks, competing with general models like Whisper or Google STT while using less than 80 minutes of training time and occupying at least an order of less memory resources. Also, unlike larger speech ",
    "link": "https://arxiv.org/abs/2402.01931",
    "context": "Title: Digits micro-model for accurate and secure transactions\nAbstract: Automatic Speech Recognition (ASR) systems are used in the financial domain to enhance the caller experience by enabling natural language understanding and facilitating efficient and intuitive interactions. Increasing use of ASR systems requires that such systems exhibit very low error rates. The predominant ASR models to collect numeric data are large, general-purpose commercial models -- Google Speech-to-text (STT), or Amazon Transcribe -- or open source (OpenAI's Whisper). Such ASR models are trained on hundreds of thousands of hours of audio data and require considerable resources to run. Despite recent progress large speech recognition models, we highlight the potential of smaller, specialized \"micro\" models. Such light models can be trained perform well on number recognition specific tasks, competing with general models like Whisper or Google STT while using less than 80 minutes of training time and occupying at least an order of less memory resources. Also, unlike larger speech ",
    "path": "papers/24/02/2402.01931.json",
    "total_tokens": 844,
    "translated_title": "准确和安全交易的数字微模型",
    "translated_abstract": "自动语音识别（ASR）系统在金融领域中被用于提升呼叫者体验，通过实现自然语言理解和实现高效直观的互动。ASR系统的增加使用要求这些系统具有非常低的错误率。目前主要的ASR模型用于数字数据收集是大型通用商用模型- Google语音转文字（STT）或亚马逊转录-或开源（OpenAI的Whisper）。这些ASR模型通过数十万小时的音频数据进行训练，需要大量资源运行。尽管最近大型语音识别模型取得了进展，我们强调了小型专门的“微”模型的潜力。这样的轻量级模型可以通过少于80分钟的训练时间表现良好于数字识别特定任务中，与Whisper或Google STT等通用模型竞争，同时使用至少一个数量级更少的内存资源。另外，不同于更大的语音模型，这些数字微模型可以提供更准确和安全的交易。",
    "tldr": "本研究展示了数字微模型在准确和安全交易中的潜力，这些轻量级模型在数字识别特定任务上表现良好，并使用较少的训练时间和内存资源。"
}