{
    "title": "Transolver: A Fast Transformer Solver for PDEs on General Geometries",
    "abstract": "Transformers have empowered many milestones across various fields and have recently been applied to solve partial differential equations (PDEs). However, since PDEs are typically discretized into large-scale meshes with complex geometries, it is challenging for Transformers to capture intricate physical correlations directly from massive individual points. Going beyond superficial and unwieldy meshes, we present Transolver based on a more foundational idea, which is learning intrinsic physical states hidden behind discretized geometries. Specifically, we propose a new Physics-Attention to adaptively split the discretized domain into a series of learnable slices of flexible shapes, where mesh points under similar physical states will be ascribed to the same slice. By calculating attention to physics-aware tokens encoded from slices, Transovler can effectively capture intricate physical correlations under complex geometrics, which also empowers the solver with endogenetic geometry-genera",
    "link": "https://arxiv.org/abs/2402.02366",
    "context": "Title: Transolver: A Fast Transformer Solver for PDEs on General Geometries\nAbstract: Transformers have empowered many milestones across various fields and have recently been applied to solve partial differential equations (PDEs). However, since PDEs are typically discretized into large-scale meshes with complex geometries, it is challenging for Transformers to capture intricate physical correlations directly from massive individual points. Going beyond superficial and unwieldy meshes, we present Transolver based on a more foundational idea, which is learning intrinsic physical states hidden behind discretized geometries. Specifically, we propose a new Physics-Attention to adaptively split the discretized domain into a series of learnable slices of flexible shapes, where mesh points under similar physical states will be ascribed to the same slice. By calculating attention to physics-aware tokens encoded from slices, Transovler can effectively capture intricate physical correlations under complex geometrics, which also empowers the solver with endogenetic geometry-genera",
    "path": "papers/24/02/2402.02366.json",
    "total_tokens": 939,
    "translated_title": "Transolver：一种用于一般几何体上求解偏微分方程的快速Transformer求解器",
    "translated_abstract": "Transformer已在各个领域实现了很多里程碑式的成就，最近开始应用于求解偏微分方程（PDEs）。然而，由于PDEs通常被离散化成具有复杂几何形状的大规模网格，对Transformer来说直接从大量单个点中捕捉复杂的物理相关性是具有挑战性的。为了超越肤浅而笨重的网格，我们基于一个更基础的思想提出了Transolver，即学习离散化几何形状背后隐藏的内在物理状态。具体来说，我们提出了一种新的物理注意力机制，将离散化的域自适应地划分为一系列可学习的灵活形状的片段，具有相似物理状态的网格点将被归属于同一个片段。通过计算从片段编码的具有物理意识的记号的注意力，Transovler能够有效地捕捉复杂几何形状下的复杂物理相关性，从而使求解器具备内生几何生成的能力。",
    "tldr": "Transolver是一种快速的Transformer求解器，通过使用物理注意力和灵活形状的片段来学习离散化几何形状背后隐藏的内在物理状态。它能够有效地捕捉复杂几何形状下的复杂物理相关性，从而提供了具备内生几何生成能力的求解器。"
}