{
    "title": "Graph Convolutional Neural Networks for Automated Echocardiography View Recognition: A Holistic Approach",
    "abstract": "arXiv:2402.19062v1 Announce Type: cross  Abstract: To facilitate diagnosis on cardiac ultrasound (US), clinical practice has established several standard views of the heart, which serve as reference points for diagnostic measurements and define viewports from which images are acquired. Automatic view recognition involves grouping those images into classes of standard views. Although deep learning techniques have been successful in achieving this, they still struggle with fully verifying the suitability of an image for specific measurements due to factors like the correct location, pose, and potential occlusions of cardiac structures. Our approach goes beyond view classification and incorporates a 3D mesh reconstruction of the heart that enables several more downstream tasks, like segmentation and pose estimation. In this work, we explore learning 3D heart meshes via graph convolutions, using similar techniques to learn 3D meshes in natural images, such as human pose estimation. As the ",
    "link": "https://arxiv.org/abs/2402.19062",
    "context": "Title: Graph Convolutional Neural Networks for Automated Echocardiography View Recognition: A Holistic Approach\nAbstract: arXiv:2402.19062v1 Announce Type: cross  Abstract: To facilitate diagnosis on cardiac ultrasound (US), clinical practice has established several standard views of the heart, which serve as reference points for diagnostic measurements and define viewports from which images are acquired. Automatic view recognition involves grouping those images into classes of standard views. Although deep learning techniques have been successful in achieving this, they still struggle with fully verifying the suitability of an image for specific measurements due to factors like the correct location, pose, and potential occlusions of cardiac structures. Our approach goes beyond view classification and incorporates a 3D mesh reconstruction of the heart that enables several more downstream tasks, like segmentation and pose estimation. In this work, we explore learning 3D heart meshes via graph convolutions, using similar techniques to learn 3D meshes in natural images, such as human pose estimation. As the ",
    "path": "papers/24/02/2402.19062.json",
    "total_tokens": 875,
    "translated_title": "自动超声心动图视图识别的图卷积神经网络：一种全面方法",
    "translated_abstract": "为了促进对心脏超声波（US）的诊断，临床实践已经建立了心脏的几种标准视图，这些视图作为诊断测量的参考点，并定义了图像获取的视口。自动视图识别涉及将这些图像分组为标准视图的类别。尽管深度学习技术在实现这一点方面取得了成功，但仍然存在在验证图像是否适合特定测量方面的困难，原因包括心脏结构的正确位置、姿势和可能的遮挡。我们的方法超越了视图分类，并融合了对心脏的三维网格重建，从而实现了更多后续任务，如分割和姿势估计。在这项工作中，我们探讨了通过图卷积学习3D心脏网格，使用类似的技术来学习自然图像中的3D网格，例如人体姿势估计。",
    "tldr": "该研究提出了一种全面的方法，通过图卷积神经网络实现了自动超声心动图视图识别，结合了3D心脏网格重建和后续任务如分割和姿势估计。",
    "en_tdlr": "This study presents a holistic approach for automated echocardiography view recognition using graph convolutional neural networks, which integrates 3D heart mesh reconstruction and downstream tasks like segmentation and pose estimation."
}