{
    "title": "CasCast: Skillful High-resolution Precipitation Nowcasting via Cascaded Modelling",
    "abstract": "Precipitation nowcasting based on radar data plays a crucial role in extreme weather prediction and has broad implications for disaster management. Despite progresses have been made based on deep learning, two key challenges of precipitation nowcasting are not well-solved: (i) the modeling of complex precipitation system evolutions with different scales, and (ii) accurate forecasts for extreme precipitation. In this work, we propose CasCast, a cascaded framework composed of a deterministic and a probabilistic part to decouple the predictions for mesoscale precipitation distributions and small-scale patterns. Then, we explore training the cascaded framework at the high resolution and conducting the probabilistic modeling in a low dimensional latent space with a frame-wise-guided diffusion transformer for enhancing the optimization of extreme events while reducing computational costs. Extensive experiments on three benchmark radar precipitation datasets show that CasCast achieves competi",
    "link": "https://arxiv.org/abs/2402.04290",
    "context": "Title: CasCast: Skillful High-resolution Precipitation Nowcasting via Cascaded Modelling\nAbstract: Precipitation nowcasting based on radar data plays a crucial role in extreme weather prediction and has broad implications for disaster management. Despite progresses have been made based on deep learning, two key challenges of precipitation nowcasting are not well-solved: (i) the modeling of complex precipitation system evolutions with different scales, and (ii) accurate forecasts for extreme precipitation. In this work, we propose CasCast, a cascaded framework composed of a deterministic and a probabilistic part to decouple the predictions for mesoscale precipitation distributions and small-scale patterns. Then, we explore training the cascaded framework at the high resolution and conducting the probabilistic modeling in a low dimensional latent space with a frame-wise-guided diffusion transformer for enhancing the optimization of extreme events while reducing computational costs. Extensive experiments on three benchmark radar precipitation datasets show that CasCast achieves competi",
    "path": "papers/24/02/2402.04290.json",
    "total_tokens": 873,
    "translated_title": "CasCast: 高分辨率降水即时预报的熟练级联建模",
    "translated_abstract": "基于雷达数据的降水即时预报在极端天气预测和灾害管理中起着关键作用，并具有广泛的影响。尽管基于深度学习已经取得了进展，但降水即时预报面临两个关键挑战尚未得到很好解决：（i）对具有不同尺度的复杂降水系统演变进行建模，以及（ii）对极端降水进行准确预测。在这项工作中，我们提出了CasCast，一个由确定性部分和概率性部分组成的级联框架，将中尺度降水分布和小尺度模式的预测解耦。然后，我们探索在高分辨率下训练级联框架，并在低维潜在空间中进行概率性建模，利用面向帧的引导扩散变换器增强极端事件的优化，并减少计算成本。在三个基准雷达降水数据集上的大量实验证明，CasCast取得了竞争性的效果。",
    "tldr": "CasCast是一个高分辨率降水即时预测框架，通过熟练的级联建模解决了复杂降水系统演化和极端降水预测两个关键挑战。",
    "en_tdlr": "CasCast is a high-resolution precipitation nowcasting framework that addresses the two key challenges of modeling complex precipitation system evolutions and accurate forecasting of extreme precipitation through skillful cascaded modeling."
}