{
    "title": "Radio Map Estimation -- An Open Dataset with Directive Transmitter Antennas and Initial Experiments",
    "abstract": "Over the last years, several works have explored the application of deep learning algorithms to determine the large-scale signal fading (also referred to as ``path loss'') between transmitter and receiver pairs in urban communication networks. The central idea is to replace costly measurement campaigns, inaccurate statistical models or computationally expensive ray-tracing simulations by machine learning models which, once trained, produce accurate predictions almost instantly. Although the topic has attracted attention from many researchers, there are few open benchmark datasets and codebases that would allow everyone to test and compare the developed methods and algorithms. We take a step towards filling this gap by releasing a publicly available dataset of simulated path loss radio maps together with realistic city maps from real-world locations and aerial images from open datasources. Initial experiments regarding model architectures, input feature design and estimation of radio ma",
    "link": "https://rss.arxiv.org/abs/2402.00878",
    "context": "Title: Radio Map Estimation -- An Open Dataset with Directive Transmitter Antennas and Initial Experiments\nAbstract: Over the last years, several works have explored the application of deep learning algorithms to determine the large-scale signal fading (also referred to as ``path loss'') between transmitter and receiver pairs in urban communication networks. The central idea is to replace costly measurement campaigns, inaccurate statistical models or computationally expensive ray-tracing simulations by machine learning models which, once trained, produce accurate predictions almost instantly. Although the topic has attracted attention from many researchers, there are few open benchmark datasets and codebases that would allow everyone to test and compare the developed methods and algorithms. We take a step towards filling this gap by releasing a publicly available dataset of simulated path loss radio maps together with realistic city maps from real-world locations and aerial images from open datasources. Initial experiments regarding model architectures, input feature design and estimation of radio ma",
    "path": "papers/24/02/2402.00878.json",
    "total_tokens": 861,
    "translated_title": "无方向性发射天线的无线电地图估计——包含数据集和初步实验的开放资源",
    "translated_abstract": "在过去的几年里，一些研究已经探索应用深度学习算法来确定城市通信网络中发射机和接收机之间的大尺度信号衰落（也称为“路径损耗”）。中心思想是通过机器学习模型替代昂贵的测量活动，不准确的统计模型或计算量大的光线追踪模拟，这些模型一旦训练，几乎能即时生成准确的预测。虽然该主题引起了许多研究人员的关注，但缺乏开放的基准数据集和代码库使得每个人都可以测试和比较已开发的方法和算法。我们通过发布一组公开可用的数据集，其中包括模拟的路径损耗无线电地图、真实城市地图和来自开放数据源的航拍影像，来填补这一空白。关于模型架构、输入特征设计和无线电地图估计的初始实验也已进行。",
    "tldr": "本文通过发布包含模拟的路径损耗无线电地图、真实城市地图和航拍影像的公开数据集，以及初步实验，填补了开放基准数据集和代码库的空白。",
    "en_tdlr": "This paper fills the gap of open benchmark datasets and codebases by releasing a publicly available dataset of simulated path loss radio maps, realistic city maps, and aerial images, along with initial experiments."
}