{
    "title": "EasyFS: an Efficient Model-free Feature Selection Framework via Elastic Transformation of Features",
    "abstract": "Traditional model-free feature selection methods treat each feature independently while disregarding the interrelationships among features, which leads to relatively poor performance compared with the model-aware methods. To address this challenge, we propose an efficient model-free feature selection framework via elastic expansion and compression of the features, namely EasyFS, to achieve better performance than state-of-the-art model-aware methods while sharing the characters of efficiency and flexibility with the existing model-free methods. In particular, EasyFS expands the feature space by using the random non-linear projection network to achieve the non-linear combinations of the original features, so as to model the interrelationships among the features and discover most correlated features. Meanwhile, a novel redundancy measurement based on the change of coding rate is proposed for efficient filtering of redundant features. Comprehensive experiments on 21 different datasets sho",
    "link": "https://arxiv.org/abs/2402.05954",
    "context": "Title: EasyFS: an Efficient Model-free Feature Selection Framework via Elastic Transformation of Features\nAbstract: Traditional model-free feature selection methods treat each feature independently while disregarding the interrelationships among features, which leads to relatively poor performance compared with the model-aware methods. To address this challenge, we propose an efficient model-free feature selection framework via elastic expansion and compression of the features, namely EasyFS, to achieve better performance than state-of-the-art model-aware methods while sharing the characters of efficiency and flexibility with the existing model-free methods. In particular, EasyFS expands the feature space by using the random non-linear projection network to achieve the non-linear combinations of the original features, so as to model the interrelationships among the features and discover most correlated features. Meanwhile, a novel redundancy measurement based on the change of coding rate is proposed for efficient filtering of redundant features. Comprehensive experiments on 21 different datasets sho",
    "path": "papers/24/02/2402.05954.json",
    "total_tokens": 850,
    "translated_title": "EasyFS:一种通过特征的弹性变换实现高效的无模型特征选择框架",
    "translated_abstract": "传统的无模型特征选择方法将每个特征独立处理，忽视了特征之间的相互关系，这导致其性能相对较差，与模型感知方法相比。为了解决这个挑战，我们提出了一种通过对特征进行弹性扩展和压缩的高效无模型特征选择框架——EasyFS，以实现比最先进的模型感知方法更好的性能，同时具备现有无模型方法的效率和灵活性。具体而言，EasyFS采用随机非线性投影网络扩展特征空间，实现原始特征的非线性组合，以建模特征之间的相互关系并发现最相关的特征。同时，提出了一种基于编码率变化的新型冗余度度量方法，用于高效过滤冗余特征。在21个不同数据集上进行了全面的实验，",
    "tldr": "EasyFS是一种高效的无模型特征选择框架，通过对特征进行弹性扩展和压缩，实现了对特征之间相互关系的建模，并发现最相关的特征。同时，通过新的冗余度度量方法实现了对冗余特征的高效过滤。"
}