{
    "title": "BagStacking: An Integrated Ensemble Learning Approach for Freezing of Gait Detection in Parkinson's Disease",
    "abstract": "arXiv:2402.17783v1 Announce Type: cross  Abstract: This paper introduces BagStacking, a novel ensemble learning method designed to enhance the detection of Freezing of Gait (FOG) in Parkinson's Disease (PD) by using a lower-back sensor to track acceleration. Building on the principles of bagging and stacking, BagStacking aims to achieve the variance reduction benefit of bagging's bootstrap sampling while also learning sophisticated blending through stacking. The method involves training a set of base models on bootstrap samples from the training data, followed by a meta-learner trained on the base model outputs and true labels to find an optimal aggregation scheme. The experimental evaluation demonstrates significant improvements over other state-of-the-art machine learning methods on the validation set. Specifically, BagStacking achieved a MAP score of 0.306, outperforming LightGBM (0.234) and classic Stacking (0.286). Additionally, the run-time of BagStacking was measured at 3828 sec",
    "link": "https://arxiv.org/abs/2402.17783",
    "context": "Title: BagStacking: An Integrated Ensemble Learning Approach for Freezing of Gait Detection in Parkinson's Disease\nAbstract: arXiv:2402.17783v1 Announce Type: cross  Abstract: This paper introduces BagStacking, a novel ensemble learning method designed to enhance the detection of Freezing of Gait (FOG) in Parkinson's Disease (PD) by using a lower-back sensor to track acceleration. Building on the principles of bagging and stacking, BagStacking aims to achieve the variance reduction benefit of bagging's bootstrap sampling while also learning sophisticated blending through stacking. The method involves training a set of base models on bootstrap samples from the training data, followed by a meta-learner trained on the base model outputs and true labels to find an optimal aggregation scheme. The experimental evaluation demonstrates significant improvements over other state-of-the-art machine learning methods on the validation set. Specifically, BagStacking achieved a MAP score of 0.306, outperforming LightGBM (0.234) and classic Stacking (0.286). Additionally, the run-time of BagStacking was measured at 3828 sec",
    "path": "papers/24/02/2402.17783.json",
    "total_tokens": 801,
    "translated_title": "BagStacking：一种集成学习方法，用于帕金森病患者的步态冻结检测",
    "translated_abstract": "本文介绍了BagStacking，一种新颖的集成学习方法，旨在通过使用下背传感器跟踪加速度来增强对帕金森病患者步态冻结（FOG）的检测。BagStacking建立在装袋和堆叠的原则之上，旨在实现装袋的自举采样的方差减少好处，同时通过堆叠学习复杂的混合。",
    "tldr": "BagStacking是一种集成学习方法，通过在训练数据的自举样本上训练一组基础模型，然后在基础模型输出和真实标签上训练元学习器，以找到最佳的聚合方案，实现了对帕金森病患者步态冻结检测的显着改进",
    "en_tdlr": "BagStacking is an ensemble learning method that significantly improves the detection of Freezing of Gait in Parkinson's Disease by training a set of base models on bootstrap samples from the training data, followed by a meta-learner trained on the base model outputs and true labels to find an optimal aggregation scheme."
}