{
    "title": "Can machine learning predict citizen-reported angler behavior?",
    "abstract": "Prediction of angler behaviors, such as catch rates and angler pressure, is essential to maintaining fish populations and ensuring angler satisfaction. Angler behavior can partly be tracked by online platforms and mobile phone applications that provide fishing activities reported by recreational anglers. Moreover, angler behavior is known to be driven by local site attributes. Here, the prediction of citizen-reported angler behavior was investigated by machine-learning methods using auxiliary data on the environment, socioeconomics, fisheries management objectives, and events at a freshwater body. The goal was to determine whether auxiliary data alone could predict the reported behavior. Different spatial and temporal extents and temporal resolutions were considered. Accuracy scores averaged 88% for monthly predictions at single water bodies and 86% for spatial predictions on a day in a specific region across Canada. At other resolutions and scales, the models only achieved low predict",
    "link": "https://arxiv.org/abs/2402.06678",
    "context": "Title: Can machine learning predict citizen-reported angler behavior?\nAbstract: Prediction of angler behaviors, such as catch rates and angler pressure, is essential to maintaining fish populations and ensuring angler satisfaction. Angler behavior can partly be tracked by online platforms and mobile phone applications that provide fishing activities reported by recreational anglers. Moreover, angler behavior is known to be driven by local site attributes. Here, the prediction of citizen-reported angler behavior was investigated by machine-learning methods using auxiliary data on the environment, socioeconomics, fisheries management objectives, and events at a freshwater body. The goal was to determine whether auxiliary data alone could predict the reported behavior. Different spatial and temporal extents and temporal resolutions were considered. Accuracy scores averaged 88% for monthly predictions at single water bodies and 86% for spatial predictions on a day in a specific region across Canada. At other resolutions and scales, the models only achieved low predict",
    "path": "papers/24/02/2402.06678.json",
    "total_tokens": 932,
    "translated_title": "机器学习能否预测公民报告的钓鱼者行为？",
    "translated_abstract": "预测钓鱼者行为，例如捕获率和钓鱼压力，对于保持鱼类种群和确保钓鱼者满意度至关重要。钓鱼者行为可以部分通过在线平台和手机应用程序进行跟踪，这些平台和应用程序提供了休闲钓鱼者报告的钓鱼活动。此外，已知钓鱼者行为受到当地站点特征的影响。本研究使用机器学习方法，利用环境、社会经济、渔业管理目标和淡水体的事件等辅助数据，研究了公民报告的钓鱼者行为的预测。目标是确定仅凭辅助数据是否能够预测报告的行为。考虑了不同的空间和时间范围以及时间分辨率。在加拿大单个水域的月度预测中，准确度得分平均为88%，在特定地区的一天内进行的空间预测的准确度得分为86%。在其他分辨率和尺度上，模型只能达到很低的预测准确度。",
    "tldr": "本研究利用机器学习方法，使用环境、社会经济、渔业管理目标和事件等辅助数据，预测公民报告的钓鱼者行为。结果表明，辅助数据能够以较高准确度预测特定地区和单个水域的钓鱼者行为。",
    "en_tdlr": "This study investigates the prediction of citizen-reported angler behavior using machine learning methods and auxiliary data. The results indicate that auxiliary data can accurately predict angler behavior in specific regions and individual water bodies."
}