{
    "title": "Food Recommendation as Language Processing (F-RLP): A Personalized and Contextual Paradigm",
    "abstract": "State-of-the-art rule-based and classification-based food recommendation systems face significant challenges in becoming practical and useful. This difficulty arises primarily because most machine learning models struggle with problems characterized by an almost infinite number of classes and a limited number of samples within an unbalanced dataset. Conversely, the emergence of Large Language Models (LLMs) as recommendation engines offers a promising avenue. However, a general-purpose Recommendation as Language Processing (RLP) approach lacks the critical components necessary for effective food recommendations. To address this gap, we introduce Food Recommendation as Language Processing (F-RLP), a novel framework that offers a food-specific, tailored infrastructure. F-RLP leverages the capabilities of LLMs to maximize their potential, thereby paving the way for more accurate, personalized food recommendations.",
    "link": "https://arxiv.org/abs/2402.07477",
    "context": "Title: Food Recommendation as Language Processing (F-RLP): A Personalized and Contextual Paradigm\nAbstract: State-of-the-art rule-based and classification-based food recommendation systems face significant challenges in becoming practical and useful. This difficulty arises primarily because most machine learning models struggle with problems characterized by an almost infinite number of classes and a limited number of samples within an unbalanced dataset. Conversely, the emergence of Large Language Models (LLMs) as recommendation engines offers a promising avenue. However, a general-purpose Recommendation as Language Processing (RLP) approach lacks the critical components necessary for effective food recommendations. To address this gap, we introduce Food Recommendation as Language Processing (F-RLP), a novel framework that offers a food-specific, tailored infrastructure. F-RLP leverages the capabilities of LLMs to maximize their potential, thereby paving the way for more accurate, personalized food recommendations.",
    "path": "papers/24/02/2402.07477.json",
    "total_tokens": 833,
    "translated_title": "食物推荐作为语言处理（F-RLP）：个性化和情境化范式",
    "translated_abstract": "目前最先进的基于规则和分类的食物推荐系统在实际应用和实用性方面面临着重大挑战。主要原因是大多数机器学习模型在一个几乎无限数量的类别和一个不平衡数据集中的有限样本问题上很难应对。相反，大型语言模型（LLM）作为推荐引擎的出现提供了一个有希望的途径。然而，一个通用的“作为语言处理的推荐”（RLP）方法缺乏有效的食物推荐所必需的关键组件。为了填补这一空白，我们引入了食物推荐作为语言处理（F-RLP），这是一个新颖的框架，提供了一个针对食物的定制基础设施。F-RLP利用LLMs的能力来最大化其潜力，从而为更准确、个性化的食物推荐铺平了道路。",
    "tldr": "食物推荐作为语言处理（F-RLP）是一个针对食物的个性化、情境化的框架，利用大型语言模型的能力来实现更准确、个性化的食物推荐。"
}