{
    "title": "Enhancing Hyperspectral Images via Diffusion Model and Group-Autoencoder Super-resolution Network",
    "abstract": "arXiv:2402.17285v1 Announce Type: cross  Abstract: Existing hyperspectral image (HSI) super-resolution (SR) methods struggle to effectively capture the complex spectral-spatial relationships and low-level details, while diffusion models represent a promising generative model known for their exceptional performance in modeling complex relations and learning high and low-level visual features. The direct application of diffusion models to HSI SR is hampered by challenges such as difficulties in model convergence and protracted inference time. In this work, we introduce a novel Group-Autoencoder (GAE) framework that synergistically combines with the diffusion model to construct a highly effective HSI SR model (DMGASR). Our proposed GAE framework encodes high-dimensional HSI data into low-dimensional latent space where the diffusion model works, thereby alleviating the difficulty of training the diffusion model while maintaining band correlation and considerably reducing inference time. Ex",
    "link": "https://arxiv.org/abs/2402.17285",
    "context": "Title: Enhancing Hyperspectral Images via Diffusion Model and Group-Autoencoder Super-resolution Network\nAbstract: arXiv:2402.17285v1 Announce Type: cross  Abstract: Existing hyperspectral image (HSI) super-resolution (SR) methods struggle to effectively capture the complex spectral-spatial relationships and low-level details, while diffusion models represent a promising generative model known for their exceptional performance in modeling complex relations and learning high and low-level visual features. The direct application of diffusion models to HSI SR is hampered by challenges such as difficulties in model convergence and protracted inference time. In this work, we introduce a novel Group-Autoencoder (GAE) framework that synergistically combines with the diffusion model to construct a highly effective HSI SR model (DMGASR). Our proposed GAE framework encodes high-dimensional HSI data into low-dimensional latent space where the diffusion model works, thereby alleviating the difficulty of training the diffusion model while maintaining band correlation and considerably reducing inference time. Ex",
    "path": "papers/24/02/2402.17285.json",
    "total_tokens": 847,
    "translated_title": "通过扩散模型和组-自编码器超分辨网络增强高光谱图像",
    "translated_abstract": "现有的高光谱图像（HSI）超分辨（SR）方法在有效捕捉复杂的光谱-空间关系和低级细节方面存在困难，而扩散模型以其在建模复杂关系和学习高低级视觉特征方面的卓越表现而闻名。将扩散模型直接应用于HSI SR受到挑战，例如模型收敛困难和推理时间延长。在本文中，我们引入了一种新颖的组-自编码器（GAE）框架，与扩散模型协同组合构建了一个高效的HSI SR模型（DMGASR）。我们提出的GAE框架将高维HSI数据编码为扩散模型可以运行的低维潜在空间，从而减轻了训练扩散模型的困难，同时保持波段相关性并显著减少推理时间。",
    "tldr": "该论文提出了一种新颖的Group-Autoencoder框架，与扩散模型协同组合，构建了一个高效的HSI超分辨模型（DMGASR）。",
    "en_tdlr": "This paper introduces a novel Group-Autoencoder framework that synergistically combines with the diffusion model to construct a highly effective HSI super-resolution model (DMGASR)."
}