{
    "title": "Knowledge Graph-based Session Recommendation with Adaptive Propagation",
    "abstract": "arXiv:2402.11302v1 Announce Type: new  Abstract: Session-based recommender systems (SBRSs) predict users' next interacted items based on their historical activities. While most SBRSs capture purchasing intentions locally within each session, capturing items' global information across different sessions is crucial in characterizing their general properties. Previous works capture this cross-session information by constructing graphs and incorporating neighbor information. However, this incorporation cannot vary adaptively according to the unique intention of each session, and the constructed graphs consist of only one type of user-item interaction. To address these limitations, we propose knowledge graph-based session recommendation with session-adaptive propagation. Specifically, we build a knowledge graph by connecting items with multi-typed edges to characterize various user-item interactions. Then, we adaptively aggregate items' neighbor information considering user intention within",
    "link": "https://arxiv.org/abs/2402.11302",
    "context": "Title: Knowledge Graph-based Session Recommendation with Adaptive Propagation\nAbstract: arXiv:2402.11302v1 Announce Type: new  Abstract: Session-based recommender systems (SBRSs) predict users' next interacted items based on their historical activities. While most SBRSs capture purchasing intentions locally within each session, capturing items' global information across different sessions is crucial in characterizing their general properties. Previous works capture this cross-session information by constructing graphs and incorporating neighbor information. However, this incorporation cannot vary adaptively according to the unique intention of each session, and the constructed graphs consist of only one type of user-item interaction. To address these limitations, we propose knowledge graph-based session recommendation with session-adaptive propagation. Specifically, we build a knowledge graph by connecting items with multi-typed edges to characterize various user-item interactions. Then, we adaptively aggregate items' neighbor information considering user intention within",
    "path": "papers/24/02/2402.11302.json",
    "total_tokens": 642,
    "translated_title": "基于知识图的自适应传播会话推荐",
    "translated_abstract": "会话型推荐系统（SBRSs）根据用户的历史活动预测用户的下一个互动项目。虽然大多数SBRSs在每个会话中仅局部捕获购买意图，但跨不同会话捕获项目的全局信息对于表征其一般特性至关重要。我们提出了一种基于知识图的会话推荐方法，采用会话自适应传播，以解决先前方法中存在的一些局限性。",
    "tldr": "提出了一种基于知识图的会话推荐方法，通过会话自适应传播来跨不同会话捕获全局信息。",
    "en_tdlr": "Proposed a knowledge graph-based session recommendation method that captures global information across different sessions through session-adaptive propagation."
}