{
    "title": "Implementations of Cooperative Games Under Non-Cooperative Solution Concepts",
    "abstract": "arXiv:2402.14952v1 Announce Type: new  Abstract: Cooperative games can be distinguished as non-cooperative games in which players can freely sign binding agreements to form coalitions. These coalitions inherit a joint strategy set and seek to maximize collective payoffs. When the payoffs to each coalition under some non-cooperative solution concept coincide with their value in the cooperative game, the cooperative game is said to be implementable and the non-cooperative game its implementation. This paper proves that all strictly superadditive partition function form games are implementable under Nash equilibrium and rationalizability; that all weakly superadditive characteristic function form games are implementable under Nash equilibrium; and that all weakly superadditive partition function form games are implementable under trembling hand perfect equilibrium. Discussion then proceeds on the appropriate choice of non-cooperative solution concept for the implementation.",
    "link": "https://arxiv.org/abs/2402.14952",
    "context": "Title: Implementations of Cooperative Games Under Non-Cooperative Solution Concepts\nAbstract: arXiv:2402.14952v1 Announce Type: new  Abstract: Cooperative games can be distinguished as non-cooperative games in which players can freely sign binding agreements to form coalitions. These coalitions inherit a joint strategy set and seek to maximize collective payoffs. When the payoffs to each coalition under some non-cooperative solution concept coincide with their value in the cooperative game, the cooperative game is said to be implementable and the non-cooperative game its implementation. This paper proves that all strictly superadditive partition function form games are implementable under Nash equilibrium and rationalizability; that all weakly superadditive characteristic function form games are implementable under Nash equilibrium; and that all weakly superadditive partition function form games are implementable under trembling hand perfect equilibrium. Discussion then proceeds on the appropriate choice of non-cooperative solution concept for the implementation.",
    "path": "papers/24/02/2402.14952.json",
    "total_tokens": 891,
    "translated_title": "在非合作解概念下的合作博弈的实现",
    "translated_abstract": "合作游戏可以被区分为非合作游戏，其中玩家可以自由签署有约束力的协议以形成联盟。这些联盟继承一个联合策略集，并寻求最大化集体回报。当某些非合作解概念下每个联盟的回报与他们在合作游戏中的价值一致时，该合作游戏被称为可实现，非合作游戏则是其实施。本文证明了所有严格超添加分配函数形式游戏在Nash均衡和合理性下都是可实现的；所有弱超添加特征函数形式游戏在Nash均衡下都是可实现的；以及所有弱超添加分配函数形式游戏在颤抖手完美均衡下都是可实现的。随后讨论了实现中非合作解概念的适当选择。",
    "tldr": "本文证明了所有严格超添加分配函数形式游戏在Nash均衡和合理性下都是可实现的；所有弱超添加特征函数形式游戏在Nash均衡下都是可实现的；以及所有弱超添加分配函数形式游戏在颤抖手完美均衡下都是可实现的。",
    "en_tdlr": "The paper proves that all strictly superadditive partition function form games are implementable under Nash equilibrium and rationalizability; that all weakly superadditive characteristic function form games are implementable under Nash equilibrium; and that all weakly superadditive partition function form games are implementable under trembling hand perfect equilibrium. Discussion then proceeds on the appropriate choice of non-cooperative solution concept for the implementation."
}