{
    "title": "MLSTL-WSN: Machine Learning-based Intrusion Detection using SMOTETomek in WSNs",
    "abstract": "arXiv:2402.13277v1 Announce Type: cross  Abstract: Wireless Sensor Networks (WSNs) play a pivotal role as infrastructures, encompassing both stationary and mobile sensors. These sensors self-organize and establish multi-hop connections for communication, collectively sensing, gathering, processing, and transmitting data about their surroundings. Despite their significance, WSNs face rapid and detrimental attacks that can disrupt functionality. Existing intrusion detection methods for WSNs encounter challenges such as low detection rates, computational overhead, and false alarms. These issues stem from sensor node resource constraints, data redundancy, and high correlation within the network. To address these challenges, we propose an innovative intrusion detection approach that integrates Machine Learning (ML) techniques with the Synthetic Minority Oversampling Technique Tomek Link (SMOTE-TomekLink) algorithm. This blend synthesizes minority instances and eliminates Tomek links, result",
    "link": "https://arxiv.org/abs/2402.13277",
    "context": "Title: MLSTL-WSN: Machine Learning-based Intrusion Detection using SMOTETomek in WSNs\nAbstract: arXiv:2402.13277v1 Announce Type: cross  Abstract: Wireless Sensor Networks (WSNs) play a pivotal role as infrastructures, encompassing both stationary and mobile sensors. These sensors self-organize and establish multi-hop connections for communication, collectively sensing, gathering, processing, and transmitting data about their surroundings. Despite their significance, WSNs face rapid and detrimental attacks that can disrupt functionality. Existing intrusion detection methods for WSNs encounter challenges such as low detection rates, computational overhead, and false alarms. These issues stem from sensor node resource constraints, data redundancy, and high correlation within the network. To address these challenges, we propose an innovative intrusion detection approach that integrates Machine Learning (ML) techniques with the Synthetic Minority Oversampling Technique Tomek Link (SMOTE-TomekLink) algorithm. This blend synthesizes minority instances and eliminates Tomek links, result",
    "path": "papers/24/02/2402.13277.json",
    "total_tokens": 820,
    "translated_title": "使用SMOTETomek在WSNs中基于机器学习的入侵检测",
    "translated_abstract": "无线传感器网络(WSNs)在基础设施中发挥着关键作用，包括固定和移动传感器。这些传感器自组织并建立多跳连接进行通信，共同感知、收集、处理和传输有关周围环境的数据。尽管它们的重要性，WSNs面临着可能破坏功能的快速和有害的攻击。现有的WSN入侵检测方法遇到了低检测率、计算开销和误报警的挑战。这些问题源于传感器节点资源约束、数据冗余以及网络内高相关性。为了解决这些挑战，我们提出了一种创新的入侵检测方法，该方法将机器学习技术与Synthetic Minority Oversampling Technique Tomek Link (SMOTE-TomekLink)算法相结合。这种融合合成了少数实例并消除了Tomek链接，结果",
    "tldr": "提出了一种将机器学习技术与Synthetic Minority Oversampling Technique Tomek Link (SMOTE-TomekLink)算法相结合的创新入侵检测方法",
    "en_tdlr": "Proposed an innovative intrusion detection approach that integrates Machine Learning (ML) techniques with the Synthetic Minority Oversampling Technique Tomek Link (SMOTE-TomekLink) algorithm."
}