{
    "title": "Score-Based Physics-Informed Neural Networks for High-Dimensional Fokker-Planck Equations",
    "abstract": "The Fokker-Planck (FP) equation is a foundational PDE in stochastic processes. However, curse of dimensionality (CoD) poses challenge when dealing with high-dimensional FP PDEs. Although Monte Carlo and vanilla Physics-Informed Neural Networks (PINNs) have shown the potential to tackle CoD, both methods exhibit numerical errors in high dimensions when dealing with the probability density function (PDF) associated with Brownian motion. The point-wise PDF values tend to decrease exponentially as dimension increases, surpassing the precision of numerical simulations and resulting in substantial errors. Moreover, due to its massive sampling, Monte Carlo fails to offer fast sampling. Modeling the logarithm likelihood (LL) via vanilla PINNs transforms the FP equation into a difficult HJB equation, whose error grows rapidly with dimension. To this end, we propose a novel approach utilizing a score-based solver to fit the score function in SDEs. The score function, defined as the gradient of t",
    "link": "https://arxiv.org/abs/2402.07465",
    "context": "Title: Score-Based Physics-Informed Neural Networks for High-Dimensional Fokker-Planck Equations\nAbstract: The Fokker-Planck (FP) equation is a foundational PDE in stochastic processes. However, curse of dimensionality (CoD) poses challenge when dealing with high-dimensional FP PDEs. Although Monte Carlo and vanilla Physics-Informed Neural Networks (PINNs) have shown the potential to tackle CoD, both methods exhibit numerical errors in high dimensions when dealing with the probability density function (PDF) associated with Brownian motion. The point-wise PDF values tend to decrease exponentially as dimension increases, surpassing the precision of numerical simulations and resulting in substantial errors. Moreover, due to its massive sampling, Monte Carlo fails to offer fast sampling. Modeling the logarithm likelihood (LL) via vanilla PINNs transforms the FP equation into a difficult HJB equation, whose error grows rapidly with dimension. To this end, we propose a novel approach utilizing a score-based solver to fit the score function in SDEs. The score function, defined as the gradient of t",
    "path": "papers/24/02/2402.07465.json",
    "total_tokens": 968,
    "translated_title": "基于得分的物理信息神经网络用于高维福克-普朗克方程",
    "translated_abstract": "福克-普朗克（FP）方程是随机过程中的基础偏微分方程（PDE）。然而，当处理高维FP PDE时，维数灾难（CoD）会带来挑战。尽管蒙特卡洛和普通物理信息神经网络（PINN）已经显示出应对CoD的潜力，但在处理与布朗运动相关的概率密度函数（PDF）时，两种方法都在高维度上显示出数值误差。点值PDF随着维度增加呈指数级下降，超过了数值模拟的精度，导致了相当大的误差。此外，由于其大规模采样，蒙特卡洛无法提供快速采样。通过对普通PINNs模拟对数似然（LL），将FP方程转化为一个困难的HJB方程，其误差随维数增长迅速。为此，我们提出了一种新方法，利用基于得分的求解器来拟合SDE中的得分函数。得分函数定义为概率密度函数的梯度。",
    "tldr": "这项研究提出了一种基于得分函数的求解器来解决高维福克-普朗克方程中的维数灾难问题。与蒙特卡洛和普通PINN相比，该方法能够更准确地处理与布朗运动相关的概率密度函数，并提供快速采样。"
}