{
    "title": "SumRec: A Framework for Recommendation using Open-Domain Dialogue",
    "abstract": "Chat dialogues contain considerable useful information about a speaker's interests, preferences, and experiences.Thus, knowledge from open-domain chat dialogue can be used to personalize various systems and offer recommendations for advanced information.This study proposed a novel framework SumRec for recommending information from open-domain chat dialogue.The study also examined the framework using ChatRec, a newly constructed dataset for training and evaluation. To extract the speaker and item characteristics, the SumRec framework employs a large language model (LLM) to generate a summary of the speaker information from a dialogue and to recommend information about an item according to the type of user.The speaker and item information are then input into a score estimation model, generating a recommendation score.Experimental results show that the SumRec framework provides better recommendations than the baseline method of using dialogues and item descriptions in their original form.",
    "link": "https://arxiv.org/abs/2402.04523",
    "context": "Title: SumRec: A Framework for Recommendation using Open-Domain Dialogue\nAbstract: Chat dialogues contain considerable useful information about a speaker's interests, preferences, and experiences.Thus, knowledge from open-domain chat dialogue can be used to personalize various systems and offer recommendations for advanced information.This study proposed a novel framework SumRec for recommending information from open-domain chat dialogue.The study also examined the framework using ChatRec, a newly constructed dataset for training and evaluation. To extract the speaker and item characteristics, the SumRec framework employs a large language model (LLM) to generate a summary of the speaker information from a dialogue and to recommend information about an item according to the type of user.The speaker and item information are then input into a score estimation model, generating a recommendation score.Experimental results show that the SumRec framework provides better recommendations than the baseline method of using dialogues and item descriptions in their original form.",
    "path": "papers/24/02/2402.04523.json",
    "total_tokens": 856,
    "translated_title": "SumRec: 使用开放领域对话进行推荐的框架",
    "translated_abstract": "聊天对话包含着关于说话者兴趣、偏好和经验的大量有用信息。因此，可以利用开放领域聊天对话中的知识来个性化各种系统并为高级信息提供推荐。本研究提出了一种用于从开放领域聊天对话中推荐信息的新颖框架SumRec。该研究还使用ChatRec这个新构建的数据集来检验该框架的性能。为了提取说话者和物品的特征，SumRec框架使用大型语言模型（LLM）从对话中生成说话者信息的摘要，并根据用户类型推荐物品信息。然后将说话者和物品信息输入到评分估计模型中，生成推荐分数。实验结果表明，SumRec框架比使用对话和原始物品描述的基准方法提供更好的推荐。",
    "tldr": "本研究提出了一个新的框架SumRec，用于从开放领域的对话中推荐个性化信息。该框架利用大型语言模型生成对话中说话者信息的摘要，并根据用户类型推荐物品信息，实验证明SumRec框架比基准方法提供更好的推荐。",
    "en_tdlr": "This study proposes a novel framework, SumRec, for recommending personalized information from open-domain dialogues. The framework utilizes a large language model to generate a summary of speaker information and recommends item information based on the user type. Experimental results show that SumRec provides better recommendations than the baseline method."
}