{
    "title": "On Automating Video Game Testing by Planning and Learning",
    "abstract": "arXiv:2402.12393v1 Announce Type: cross  Abstract: In this paper, we propose a method and workflow for automating the testing of certain video game aspects using automated planning and planning action model learning techniques. The basic idea is to generate detailed gameplay logs and apply action model learning to obtain a formal model in the planning domain description language (PDDL). The workflow enables efficient cooperation of game developers without any experience with PDDL or other formal systems and a person experienced with PDDL modeling but no game development skills. We describe the method and workflow in general and then demonstrate it on a concrete proof-of-concept example -- a simple role-playing game provided as one of the tutorial projects in the popular game development engine Unity. This paper presents the first step towards minimizing or even eliminating the need for a modeling expert in the workflow, thus making automated planning accessible to a broader audience.",
    "link": "https://arxiv.org/abs/2402.12393",
    "context": "Title: On Automating Video Game Testing by Planning and Learning\nAbstract: arXiv:2402.12393v1 Announce Type: cross  Abstract: In this paper, we propose a method and workflow for automating the testing of certain video game aspects using automated planning and planning action model learning techniques. The basic idea is to generate detailed gameplay logs and apply action model learning to obtain a formal model in the planning domain description language (PDDL). The workflow enables efficient cooperation of game developers without any experience with PDDL or other formal systems and a person experienced with PDDL modeling but no game development skills. We describe the method and workflow in general and then demonstrate it on a concrete proof-of-concept example -- a simple role-playing game provided as one of the tutorial projects in the popular game development engine Unity. This paper presents the first step towards minimizing or even eliminating the need for a modeling expert in the workflow, thus making automated planning accessible to a broader audience.",
    "path": "papers/24/02/2402.12393.json",
    "total_tokens": 818,
    "translated_title": "关于通过规划和学习自动化视频游戏测试",
    "translated_abstract": "在本文中，我们提出了一种使用自动规划和规划行为模型学习技术自动化测试特定视频游戏方面的方法和工作流程。基本想法是生成详细的游戏日志，并应用行动模型学习来获得规划领域描述语言（PDDL）中的形式模型。该工作流程实现了游戏开发人员与具有PDDL建模经验但无游戏开发技能的人员之间的高效合作，并且无需任何PDDL或其他正式系统经验。我们总体描述了该方法和工作流程，然后在一个具体的概念证明示例上进行演示 -- 这是一个简单的角色扮演游戏，作为流行游戏开发引擎Unity中的教程项目之一。本文是朝着减少甚至消除工作流程中对建模专家需求的第一步，从而使自动规划可供更广泛的人群使用。",
    "tldr": "提出了一种通过自动规划和学习技术自动化测试视频游戏的方法和工作流程，使得自动规划变得更容易接触到更广泛的受众。"
}