{
    "title": "GCOF: Self-iterative Text Generation for Copywriting Using Large Language Model",
    "abstract": "arXiv:2402.13667v1 Announce Type: new  Abstract: Large language models(LLM) such as ChatGPT have substantially simplified the generation of marketing copy, yet producing content satisfying domain specific requirements, such as effectively engaging customers, remains a significant challenge. In this work, we introduce the Genetic Copy Optimization Framework (GCOF) designed to enhance both efficiency and engagememnt of marketing copy creation. We conduct explicit feature engineering within the prompts of LLM. Additionally, we modify the crossover operator in Genetic Algorithm (GA), integrating it into the GCOF to enable automatic feature engineering. This integration facilitates a self-iterative refinement of the marketing copy. Compared to human curated copy, Online results indicate that copy produced by our framework achieves an average increase in click-through rate (CTR) of over $50\\%$.",
    "link": "https://arxiv.org/abs/2402.13667",
    "context": "Title: GCOF: Self-iterative Text Generation for Copywriting Using Large Language Model\nAbstract: arXiv:2402.13667v1 Announce Type: new  Abstract: Large language models(LLM) such as ChatGPT have substantially simplified the generation of marketing copy, yet producing content satisfying domain specific requirements, such as effectively engaging customers, remains a significant challenge. In this work, we introduce the Genetic Copy Optimization Framework (GCOF) designed to enhance both efficiency and engagememnt of marketing copy creation. We conduct explicit feature engineering within the prompts of LLM. Additionally, we modify the crossover operator in Genetic Algorithm (GA), integrating it into the GCOF to enable automatic feature engineering. This integration facilitates a self-iterative refinement of the marketing copy. Compared to human curated copy, Online results indicate that copy produced by our framework achieves an average increase in click-through rate (CTR) of over $50\\%$.",
    "path": "papers/24/02/2402.13667.json",
    "total_tokens": 787,
    "translated_title": "GCOF：使用大型语言模型进行自我迭代文本生成以进行文案撰写",
    "translated_abstract": "大型语言模型（LLM）如ChatGPT极大地简化了市场文案的生成，但产生满足特定领域要求的内容，比如有效地吸引客户，仍然是一个重大挑战。本文介绍了旨在增强市场文案创作效率和吸引力的遗传文案优化框架（GCOF）。我们在LLM提示的显式特征工程中进行操作。此外，我们修改了遗传算法（GA）中的交叉操作符，并将其整合到GCOF中，以实现自动特征工程。这种整合促进了市场文案的自我迭代优化。在线结果表明，我们框架生成的文案相对于人工编辑的文案，在点击率（CTR）上平均增加了50%以上。",
    "tldr": "GCOF框架结合遗传算法和大型语言模型，实现了自我迭代优化，生成的文案在点击率上相比人工编辑的文案平均提高了50%以上。"
}