{
    "title": "Generative AI in Vision: A Survey on Models, Metrics and Applications",
    "abstract": "arXiv:2402.16369v1 Announce Type: cross  Abstract: Generative AI models have revolutionized various fields by enabling the creation of realistic and diverse data samples. Among these models, diffusion models have emerged as a powerful approach for generating high-quality images, text, and audio. This survey paper provides a comprehensive overview of generative AI diffusion and legacy models, focusing on their underlying techniques, applications across different domains, and their challenges. We delve into the theoretical foundations of diffusion models, including concepts such as denoising diffusion probabilistic models (DDPM) and score-based generative modeling. Furthermore, we explore the diverse applications of these models in text-to-image, image inpainting, and image super-resolution, along with others, showcasing their potential in creative tasks and data augmentation. By synthesizing existing research and highlighting critical advancements in this field, this survey aims to prov",
    "link": "https://arxiv.org/abs/2402.16369",
    "context": "Title: Generative AI in Vision: A Survey on Models, Metrics and Applications\nAbstract: arXiv:2402.16369v1 Announce Type: cross  Abstract: Generative AI models have revolutionized various fields by enabling the creation of realistic and diverse data samples. Among these models, diffusion models have emerged as a powerful approach for generating high-quality images, text, and audio. This survey paper provides a comprehensive overview of generative AI diffusion and legacy models, focusing on their underlying techniques, applications across different domains, and their challenges. We delve into the theoretical foundations of diffusion models, including concepts such as denoising diffusion probabilistic models (DDPM) and score-based generative modeling. Furthermore, we explore the diverse applications of these models in text-to-image, image inpainting, and image super-resolution, along with others, showcasing their potential in creative tasks and data augmentation. By synthesizing existing research and highlighting critical advancements in this field, this survey aims to prov",
    "path": "papers/24/02/2402.16369.json",
    "total_tokens": 834,
    "translated_title": "视觉中的生成人工智能：模型、度量和应用的调查",
    "translated_abstract": "生成AI模型通过实现逼真和多样化的数据样本的创建，已经在各个领域引起了革命。在这些模型中，扩散模型已经成为生成高质量图像、文本和音频的强大方法。这篇调查论文全面概述了生成AI扩散和传统模型，重点关注它们的基本技术、在不同领域的应用以及它们所面临的挑战。我们深入探讨了扩散模型的理论基础，包括去噪扩散概率模型（DDPM）和基于得分的生成建模等概念。此外，我们探讨了这些模型在文本到图像、图像修补和图像超分辨率等多样化应用中的潜力，展示了它们在创造性任务和数据增强中的潜力。通过综合现有研究并突出这一领域的关键进展，本调查旨在提供一份关于生成AI在视觉中的综述。",
    "tldr": "扩散模型作为一种强大的方法正在生成高质量图像、文本和音频，而此调查论文旨在全面概述生成AI扩散和传统模型的基本技术、应用和挑战。"
}