{
    "title": "Multimodal Interpretable Data-Driven Models for Early Prediction of Antimicrobial Multidrug Resistance Using Multivariate Time-Series",
    "abstract": "Electronic health records (EHR) is an inherently multimodal register of the patient's health status characterized by static data and multivariate time series (MTS). While MTS are a valuable tool for clinical prediction, their fusion with other data modalities can possibly result in more thorough insights and more accurate results. Deep neural networks (DNNs) have emerged as fundamental tools for identifying and defining underlying patterns in the healthcare domain. However, fundamental improvements in interpretability are needed for DNN models to be widely used in the clinical setting. In this study, we present an approach built on a collection of interpretable multimodal data-driven models that may anticipate and understand the emergence of antimicrobial multidrug resistance (AMR) germs in the intensive care unit (ICU) of the University Hospital of Fuenlabrada (Madrid, Spain). The profile and initial health status of the patient are modeled using static variables, while the evolution ",
    "link": "https://arxiv.org/abs/2402.06295",
    "context": "Title: Multimodal Interpretable Data-Driven Models for Early Prediction of Antimicrobial Multidrug Resistance Using Multivariate Time-Series\nAbstract: Electronic health records (EHR) is an inherently multimodal register of the patient's health status characterized by static data and multivariate time series (MTS). While MTS are a valuable tool for clinical prediction, their fusion with other data modalities can possibly result in more thorough insights and more accurate results. Deep neural networks (DNNs) have emerged as fundamental tools for identifying and defining underlying patterns in the healthcare domain. However, fundamental improvements in interpretability are needed for DNN models to be widely used in the clinical setting. In this study, we present an approach built on a collection of interpretable multimodal data-driven models that may anticipate and understand the emergence of antimicrobial multidrug resistance (AMR) germs in the intensive care unit (ICU) of the University Hospital of Fuenlabrada (Madrid, Spain). The profile and initial health status of the patient are modeled using static variables, while the evolution ",
    "path": "papers/24/02/2402.06295.json",
    "total_tokens": 952,
    "translated_title": "多模态可解释的数据驱动模型用于预测多重抗菌药物耐药性的早期预测的研究",
    "translated_abstract": "电子健康记录（EHR）是患者健康状况的多模态注册，包括静态数据和多元时间序列（MTS）。虽然MTS是临床预测的有价值工具，但将其与其他数据模态融合可能会带来更深入的洞察和更准确的结果。深度神经网络（DNNs）已成为识别和定义医疗领域潜在模式的基本工具。然而，DNN模型在临床环境中广泛应用还需要基本改进的可解释性。在这项研究中，我们提出了一种建立在可解释的多模态数据驱动模型集合上的方法，可以预测和理解马德里训拉布拉达大学医院（西班牙）的重症监护病房（ICU）中抗菌药物多重耐药性（AMR）细菌的出现。患者的个人资料和初始健康状况使用静态变量进行建模，而演变过程使用MTS进行建模。",
    "tldr": "本研究提出了一种基于可解释的多模态数据驱动模型的方法，通过静态数据和多元时间序列模型预测和理解重症监护病房中抗菌药物多重耐药性细菌的出现。"
}