{
    "title": "German Text Simplification: Finetuning Large Language Models with Semi-Synthetic Data",
    "abstract": "arXiv:2402.10675v1 Announce Type: new  Abstract: This study pioneers the use of synthetically generated data for training generative models in document-level text simplification of German texts. We demonstrate the effectiveness of our approach with real-world online texts. Addressing the challenge of data scarcity in language simplification, we crawled professionally simplified German texts and synthesized a corpus using GPT-4. We finetune Large Language Models with up to 13 billion parameters on this data and evaluate their performance. This paper employs various methodologies for evaluation and demonstrates the limitations of currently used rule-based metrics. Both automatic and manual evaluations reveal that our models can significantly simplify real-world online texts, indicating the potential of synthetic data in improving text simplification.",
    "link": "https://arxiv.org/abs/2402.10675",
    "context": "Title: German Text Simplification: Finetuning Large Language Models with Semi-Synthetic Data\nAbstract: arXiv:2402.10675v1 Announce Type: new  Abstract: This study pioneers the use of synthetically generated data for training generative models in document-level text simplification of German texts. We demonstrate the effectiveness of our approach with real-world online texts. Addressing the challenge of data scarcity in language simplification, we crawled professionally simplified German texts and synthesized a corpus using GPT-4. We finetune Large Language Models with up to 13 billion parameters on this data and evaluate their performance. This paper employs various methodologies for evaluation and demonstrates the limitations of currently used rule-based metrics. Both automatic and manual evaluations reveal that our models can significantly simplify real-world online texts, indicating the potential of synthetic data in improving text simplification.",
    "path": "papers/24/02/2402.10675.json",
    "total_tokens": 763,
    "translated_title": "德语文本简化：使用半合成数据微调大型语言模型",
    "translated_abstract": "这项研究首次利用合成生成的数据来训练生成模型，完成了德语文本的文档级简化。我们通过真实世界在线文本展示了我们方法的有效性。为解决语言简化中的数据稀缺挑战，我们爬取了经过专业简化的德语文本，并使用GPT-4合成了一个语料库。我们在这些数据上微调了拥有多达130亿参数的大型语言模型，并评估了它们的性能。本文采用了各种方法进行评估，并展示了目前使用的基于规则的评估指标的局限性。自动和手动评估均表明我们的模型能够显著简化真实世界在线文本，表明了合成数据在改善文本简化中的潜力。",
    "tldr": "该研究利用半合成数据对大型语言模型进行微调，成功完成德语文本的文档级简化，并展示了合成数据在改善文本简化方面的潜力。"
}