{
    "title": "Towards a Foundation Model for Brain Age Prediction using coVariance Neural Networks",
    "abstract": "Brain age is the estimate of biological age derived from neuroimaging datasets using machine learning algorithms. Increasing brain age with respect to chronological age can reflect increased vulnerability to neurodegeneration and cognitive decline. In this paper, we study NeuroVNN, based on coVariance neural networks, as a paradigm for foundation model for the brain age prediction application. NeuroVNN is pre-trained as a regression model on healthy population to predict chronological age using cortical thickness features and fine-tuned to estimate brain age in different neurological contexts. Importantly, NeuroVNN adds anatomical interpretability to brain age and has a `scale-free' characteristic that allows its transference to datasets curated according to any arbitrary brain atlas. Our results demonstrate that NeuroVNN can extract biologically plausible brain age estimates in different populations, as well as transfer successfully to datasets of dimensionalities distinct from that f",
    "link": "https://arxiv.org/abs/2402.07684",
    "context": "Title: Towards a Foundation Model for Brain Age Prediction using coVariance Neural Networks\nAbstract: Brain age is the estimate of biological age derived from neuroimaging datasets using machine learning algorithms. Increasing brain age with respect to chronological age can reflect increased vulnerability to neurodegeneration and cognitive decline. In this paper, we study NeuroVNN, based on coVariance neural networks, as a paradigm for foundation model for the brain age prediction application. NeuroVNN is pre-trained as a regression model on healthy population to predict chronological age using cortical thickness features and fine-tuned to estimate brain age in different neurological contexts. Importantly, NeuroVNN adds anatomical interpretability to brain age and has a `scale-free' characteristic that allows its transference to datasets curated according to any arbitrary brain atlas. Our results demonstrate that NeuroVNN can extract biologically plausible brain age estimates in different populations, as well as transfer successfully to datasets of dimensionalities distinct from that f",
    "path": "papers/24/02/2402.07684.json",
    "total_tokens": 945,
    "translated_title": "基于协方差神经网络的大脑年龄预测的基础模型研究",
    "translated_abstract": "大脑年龄是通过使用机器学习算法从神经影像数据集中得出的生物年龄估计。相对于实际年龄，大脑年龄的增长可以反映出神经退行性和认知衰退的增加脆弱性。本文研究了基于协方差神经网络的神经年龄预测应用的基础模型-NeuroVNN。NeuroVNN是在健康人群上作为回归模型预训练的，使用皮层厚度特征进行预测实际年龄，并通过微调对不同神经学背景下的大脑年龄进行估计。重要的是，NeuroVNN为大脑年龄增加了解剖学解释性，并具有“无标度”的特性，使其能够迁移到按任意大脑图谱策划的数据集。我们的结果表明，NeuroVNN可以在不同人群中提取与生物相关的合理大脑年龄估计，并成功迁移到与之不同维度的数据集。",
    "tldr": "本文研究了基于协方差神经网络的基础模型NeuroVNN，该模型可以通过解析解剖学特征进行大脑年龄预测，具有可迁移性。这对于理解神经退行性疾病和认知衰退的增加风险具有重要意义。"
}