{
    "title": "VATr++: Choose Your Words Wisely for Handwritten Text Generation",
    "abstract": "arXiv:2402.10798v1 Announce Type: cross  Abstract: Styled Handwritten Text Generation (HTG) has received significant attention in recent years, propelled by the success of learning-based solutions employing GANs, Transformers, and, preliminarily, Diffusion Models. Despite this surge in interest, there remains a critical yet understudied aspect - the impact of the input, both visual and textual, on the HTG model training and its subsequent influence on performance. This study delves deeper into a cutting-edge Styled-HTG approach, proposing strategies for input preparation and training regularization that allow the model to achieve better performance and generalize better. These aspects are validated through extensive analysis on several different settings and datasets. Moreover, in this work, we go beyond performance optimization and address a significant hurdle in HTG research - the lack of a standardized evaluation protocol. In particular, we propose a standardization of the evaluatio",
    "link": "https://arxiv.org/abs/2402.10798",
    "context": "Title: VATr++: Choose Your Words Wisely for Handwritten Text Generation\nAbstract: arXiv:2402.10798v1 Announce Type: cross  Abstract: Styled Handwritten Text Generation (HTG) has received significant attention in recent years, propelled by the success of learning-based solutions employing GANs, Transformers, and, preliminarily, Diffusion Models. Despite this surge in interest, there remains a critical yet understudied aspect - the impact of the input, both visual and textual, on the HTG model training and its subsequent influence on performance. This study delves deeper into a cutting-edge Styled-HTG approach, proposing strategies for input preparation and training regularization that allow the model to achieve better performance and generalize better. These aspects are validated through extensive analysis on several different settings and datasets. Moreover, in this work, we go beyond performance optimization and address a significant hurdle in HTG research - the lack of a standardized evaluation protocol. In particular, we propose a standardization of the evaluatio",
    "path": "papers/24/02/2402.10798.json",
    "total_tokens": 970,
    "translated_title": "VATr++：明智地选择您的字词进行手写文本生成",
    "translated_abstract": "arXiv:2402.10798v1 公告类型: 跨领域 摘要: 近年来，基于学习的解决方案，如GANs、Transformers和初步的Diffusion模型的成功推动了风格化手写文本生成（HTG）引起了极大关注。尽管对此趋势产生了浓厚兴趣，但一个关键且尚未得到充分研究的方面是输入（包括视觉和文本）对HTG模型训练的影响及其对性能的后续影响。本研究深入探讨了先进的风格化HTG方法，提出了关于输入准备和训练正则化的策略，使模型能够实现更好的性能和更好的泛化。这些方面通过在多种不同设置和数据集上进行广泛分析进行了验证。此外，在这项工作中，我们不仅致力于性能优化，还解决了HTG研究中的一个重要障碍 - 缺乏标准化评估协议。特别是，我们提出了一个评估标准化的方案。",
    "tldr": "该研究探讨了风格化手写文本生成中输入对模型训练的影响，提出了改善性能和泛化能力的准备和训练规范化策略，并通过广泛的分析验证了这些方面。此外，还针对HTG研究中的标准化评估协议不足问题提出了解决方案。",
    "en_tdlr": "This study explores the impact of input on the training of a styled handwritten text generation model, proposing strategies for improving performance and generalization through input preparation and training regularization, validated through extensive analysis. Additionally, it addresses the lack of standardized evaluation protocols in HTG research."
}