{
    "title": "Segmentation-free Connectionist Temporal Classification loss based OCR Model for Text Captcha Classification",
    "abstract": "Captcha are widely used to secure systems from automatic responses by distinguishing computer responses from human responses. Text, audio, video, picture picture-based Optical Character Recognition (OCR) are used for creating captcha. Text-based OCR captcha are the most often used captcha which faces issues namely, complex and distorted contents. There are attempts to build captcha detection and classification-based systems using machine learning and neural networks, which need to be tuned for accuracy. The existing systems face challenges in the recognition of distorted characters, handling variable-length captcha and finding sequential dependencies in captcha. In this work, we propose a segmentation-free OCR model for text captcha classification based on the connectionist temporal classification loss technique. The proposed model is trained and tested on a publicly available captcha dataset. The proposed model gives 99.80\\% character level accuracy, while 95\\% word level accuracy. Th",
    "link": "https://arxiv.org/abs/2402.05417",
    "context": "Title: Segmentation-free Connectionist Temporal Classification loss based OCR Model for Text Captcha Classification\nAbstract: Captcha are widely used to secure systems from automatic responses by distinguishing computer responses from human responses. Text, audio, video, picture picture-based Optical Character Recognition (OCR) are used for creating captcha. Text-based OCR captcha are the most often used captcha which faces issues namely, complex and distorted contents. There are attempts to build captcha detection and classification-based systems using machine learning and neural networks, which need to be tuned for accuracy. The existing systems face challenges in the recognition of distorted characters, handling variable-length captcha and finding sequential dependencies in captcha. In this work, we propose a segmentation-free OCR model for text captcha classification based on the connectionist temporal classification loss technique. The proposed model is trained and tested on a publicly available captcha dataset. The proposed model gives 99.80\\% character level accuracy, while 95\\% word level accuracy. Th",
    "path": "papers/24/02/2402.05417.json",
    "total_tokens": 855,
    "translated_title": "不依靠分词的基于连接主义时间分类损失的文本验证码分类OCR模型",
    "translated_abstract": "验证码被广泛用于通过区分计算机响应和人类响应来保护系统免受自动响应。文本、音频、视频、图片等基于光学字符识别（OCR）的验证码用于创建验证码。基于文本的OCR验证码是最常用的验证码，但面临复杂和扭曲内容的问题。目前有尝试使用机器学习和神经网络构建基于验证码检测和分类的系统，需要进行准确性调整。现有系统在识别扭曲字符、处理可变长度验证码和找到验证码中的顺序依赖方面存在挑战。在这项工作中，我们提出了一种基于连接主义时间分类损失技术的文本验证码分类OCR模型，该模型不依赖分词。该模型在公开数据集上进行了训练和测试。在字符级别上，该模型达到了99.80\\%的准确率，而在词级别上达到了95\\%的准确率。",
    "tldr": "本研究提出了一种不依靠分词的基于连接主义时间分类损失的文本验证码分类OCR模型，该模型在处理复杂和扭曲内容方面具有优势，并在公开数据集上取得了很高的准确率。"
}