{
    "title": "Uncertainty Quantification for Forward and Inverse Problems of PDEs via Latent Global Evolution",
    "abstract": "Deep learning-based surrogate models have demonstrated remarkable advantages over classical solvers in terms of speed, often achieving speedups of 10 to 1000 times over traditional partial differential equation (PDE) solvers. However, a significant challenge hindering their widespread adoption in both scientific and industrial domains is the lack of understanding about their prediction uncertainties, particularly in scenarios that involve critical decision making. To address this limitation, we propose a method that integrates efficient and precise uncertainty quantification into a deep learning-based surrogate model. Our method, termed Latent Evolution of PDEs with Uncertainty Quantification (LE-PDE-UQ), endows deep learning-based surrogate models with robust and efficient uncertainty quantification capabilities for both forward and inverse problems. LE-PDE-UQ leverages latent vectors within a latent space to evolve both the system's state and its corresponding uncertainty estimation.",
    "link": "https://arxiv.org/abs/2402.08383",
    "context": "Title: Uncertainty Quantification for Forward and Inverse Problems of PDEs via Latent Global Evolution\nAbstract: Deep learning-based surrogate models have demonstrated remarkable advantages over classical solvers in terms of speed, often achieving speedups of 10 to 1000 times over traditional partial differential equation (PDE) solvers. However, a significant challenge hindering their widespread adoption in both scientific and industrial domains is the lack of understanding about their prediction uncertainties, particularly in scenarios that involve critical decision making. To address this limitation, we propose a method that integrates efficient and precise uncertainty quantification into a deep learning-based surrogate model. Our method, termed Latent Evolution of PDEs with Uncertainty Quantification (LE-PDE-UQ), endows deep learning-based surrogate models with robust and efficient uncertainty quantification capabilities for both forward and inverse problems. LE-PDE-UQ leverages latent vectors within a latent space to evolve both the system's state and its corresponding uncertainty estimation.",
    "path": "papers/24/02/2402.08383.json",
    "total_tokens": 893,
    "translated_title": "通过潜在全局演化实现偏微分方程的正逆问题的不确定性量化",
    "translated_abstract": "基于深度学习的替代模型在速度方面相对于传统的偏微分方程求解器表现出了显著的优势，往往能够实现10到1000倍的加速。然而，一个重要的挑战阻碍了它们在科学和工业领域的广泛应用，即缺乏对其预测不确定性的理解，特别是在涉及关键决策的情况下。为了解决这个限制，我们提出了一种将高效和精确的不确定性量化集成到基于深度学习的替代模型中的方法。我们的方法称为带不确定性量化的偏微分方程的潜在演化（LE-PDE-UQ），为前向和反向问题赋予了深度学习替代模型强大而高效的不确定性量化能力。LE-PDE-UQ利用潜在空间中的潜在向量来演化系统的状态和相应的不确定性估计。",
    "tldr": "本论文提出了一种将高效和精确的不确定性量化集成到基于深度学习的替代模型中的方法，称为LE-PDE-UQ。该方法利用潜在空间中的潜在向量来演化系统的状态和相应的不确定性估计。",
    "en_tdlr": "This paper proposes a method, called LE-PDE-UQ, that integrates efficient and precise uncertainty quantification into deep learning-based surrogate models. It leverages latent vectors within a latent space to evolve both the system's state and its corresponding uncertainty estimation."
}