{
    "title": "Inference for Two-Stage Extremum Estimators",
    "abstract": "We present a simulation-based approach to approximate the asymptotic variance and asymptotic distribution function of two-stage estimators. We focus on extremum estimators in the second stage and consider a large class of estimators in the first stage. This class includes extremum estimators, high-dimensional estimators, and other types of estimators (e.g., Bayesian estimators). We accommodate scenarios where the asymptotic distributions of both the first- and second-stage estimators are non-normal. We also allow for the second-stage estimator to exhibit a significant bias due to the first-stage sampling error. We introduce a debiased plug-in estimator and establish its limiting distribution. Our method is readily implementable with complex models. Unlike resampling methods, we eliminate the need for multiple computations of the plug-in estimator. Monte Carlo simulations confirm the effectiveness of our approach in finite samples. We present an empirical application with peer effects o",
    "link": "https://arxiv.org/abs/2402.05030",
    "context": "Title: Inference for Two-Stage Extremum Estimators\nAbstract: We present a simulation-based approach to approximate the asymptotic variance and asymptotic distribution function of two-stage estimators. We focus on extremum estimators in the second stage and consider a large class of estimators in the first stage. This class includes extremum estimators, high-dimensional estimators, and other types of estimators (e.g., Bayesian estimators). We accommodate scenarios where the asymptotic distributions of both the first- and second-stage estimators are non-normal. We also allow for the second-stage estimator to exhibit a significant bias due to the first-stage sampling error. We introduce a debiased plug-in estimator and establish its limiting distribution. Our method is readily implementable with complex models. Unlike resampling methods, we eliminate the need for multiple computations of the plug-in estimator. Monte Carlo simulations confirm the effectiveness of our approach in finite samples. We present an empirical application with peer effects o",
    "path": "papers/24/02/2402.05030.json",
    "total_tokens": 901,
    "translated_title": "两阶段极值估计的推理",
    "translated_abstract": "我们提出了一种基于模拟的方法，用于近似计算两阶段估计量的渐近方差和渐近分布函数。我们着眼于第二阶段的极值估计器，并考虑了第一阶段的大类估计器，包括极值估计器、高维估计器和其他类型的估计器（例如贝叶斯估计器）。我们适应了第一和第二阶段估计器的渐近分布均为非正态分布的情况。我们还允许第二阶段估计器因第一阶段抽样误差而存在显著偏差。我们引入了一种无偏的插值估计器，并建立了其极限分布。我们的方法适用于复杂模型。与重采样方法不同，我们消除了多次计算插值估计器的需要。蒙特卡洛模拟验证了我们方法在有限样本中的有效性。我们还展示了一个关于同侪效应的实证应用。",
    "tldr": "本文介绍了一种针对两阶段估计量的模拟逼近方法，能够计算极值估计器的渐近方差和渐近分布函数。该方法适用于各类估计器，并且能解决渐近分布非正态和第二阶段估计器偏差的问题。",
    "en_tdlr": "This paper presents a simulation-based approach to approximate the asymptotic variance and asymptotic distribution function of two-stage estimators. The method accommodates various types of estimators and addresses the issues of non-normal asymptotic distributions and bias in the second-stage estimator."
}