{
    "title": "Towards Eliminating Hard Label Constraints in Gradient Inversion Attacks",
    "abstract": "Gradient inversion attacks aim to reconstruct local training data from intermediate gradients exposed in the federated learning framework. Despite successful attacks, all previous methods, starting from reconstructing a single data point and then relaxing the single-image limit to batch level, are only tested under hard label constraints. Even for single-image reconstruction, we still lack an analysis-based algorithm to recover augmented soft labels. In this work, we change the focus from enlarging batchsize to investigating the hard label constraints, considering a more realistic circumstance where label smoothing and mixup techniques are used in the training process. In particular, we are the first to initiate a novel algorithm to simultaneously recover the ground-truth augmented label and the input feature of the last fully-connected layer from single-input gradients, and provide a necessary condition for any analytical-based label recovery methods. Extensive experiments testify to ",
    "link": "https://arxiv.org/abs/2402.03124",
    "context": "Title: Towards Eliminating Hard Label Constraints in Gradient Inversion Attacks\nAbstract: Gradient inversion attacks aim to reconstruct local training data from intermediate gradients exposed in the federated learning framework. Despite successful attacks, all previous methods, starting from reconstructing a single data point and then relaxing the single-image limit to batch level, are only tested under hard label constraints. Even for single-image reconstruction, we still lack an analysis-based algorithm to recover augmented soft labels. In this work, we change the focus from enlarging batchsize to investigating the hard label constraints, considering a more realistic circumstance where label smoothing and mixup techniques are used in the training process. In particular, we are the first to initiate a novel algorithm to simultaneously recover the ground-truth augmented label and the input feature of the last fully-connected layer from single-input gradients, and provide a necessary condition for any analytical-based label recovery methods. Extensive experiments testify to ",
    "path": "papers/24/02/2402.03124.json",
    "total_tokens": 864,
    "translated_title": "在梯度反转攻击中消除硬标签约束的研究",
    "translated_abstract": "梯度反转攻击旨在从联邦学习框架中暴露的中间梯度中重构本地训练数据。尽管攻击成功，但以往的所有方法，从重构单个数据点，然后放宽到批处理级别的单图像限制，都只在硬标签约束下进行测试。即使对于单图像重建，我们仍然缺乏一种基于分析的算法来恢复增强的软标签。在这项工作中，我们将重点从扩大批量大小转向研究硬标签约束，考虑到在训练过程中使用标签平滑和mixup技术的更现实的情况。特别地，我们首次提出了一种新算法，同时从单输入梯度中恢复真实的增强标签和最后一个全连接层的输入特征，并为任何基于分析的标签恢复方法提供了必要条件。大量实验证实了...",
    "tldr": "本研究旨在研究梯度反转攻击中消除硬标签约束，考虑到标签平滑和mixup技术的实际情况。我们提出了一种算法，可以同时恢复增强标签和输入特征，并为标签恢复方法提供了必要条件。",
    "en_tdlr": "This research aims to eliminate hard label constraints in gradient inversion attacks, considering the practical scenario of label smoothing and mixup techniques. A novel algorithm is proposed to recover augmented labels and input features simultaneously, providing necessary conditions for label recovery methods."
}