{
    "title": "PACE: A Pragmatic Agent for Enhancing Communication Efficiency Using Large Language Models",
    "abstract": "Current communication technologies face limitations in terms of theoretical capacity, spectrum availability, and power resources. Pragmatic communication, leveraging terminal intelligence for selective data transmission, offers resource conservation. Existing research lacks universal intention resolution tools, limiting applicability to specific tasks. This paper proposes an image pragmatic communication framework based on a Pragmatic Agent for Communication Efficiency (PACE) using Large Language Models (LLM). In this framework, PACE sequentially performs semantic perception, intention resolution, and intention-oriented coding. To ensure the effective utilization of LLM in communication, a knowledge base is designed to supplement the necessary knowledge, dedicated prompts are introduced to facilitate understanding of pragmatic communication scenarios and task requirements, and a chain of thought is designed to assist in making reasonable trade-offs between transmission efficiency and c",
    "link": "https://arxiv.org/abs/2402.01750",
    "context": "Title: PACE: A Pragmatic Agent for Enhancing Communication Efficiency Using Large Language Models\nAbstract: Current communication technologies face limitations in terms of theoretical capacity, spectrum availability, and power resources. Pragmatic communication, leveraging terminal intelligence for selective data transmission, offers resource conservation. Existing research lacks universal intention resolution tools, limiting applicability to specific tasks. This paper proposes an image pragmatic communication framework based on a Pragmatic Agent for Communication Efficiency (PACE) using Large Language Models (LLM). In this framework, PACE sequentially performs semantic perception, intention resolution, and intention-oriented coding. To ensure the effective utilization of LLM in communication, a knowledge base is designed to supplement the necessary knowledge, dedicated prompts are introduced to facilitate understanding of pragmatic communication scenarios and task requirements, and a chain of thought is designed to assist in making reasonable trade-offs between transmission efficiency and c",
    "path": "papers/24/02/2402.01750.json",
    "total_tokens": 888,
    "translated_title": "PACE：利用大型语言模型增强通信效率的实用智能体",
    "translated_abstract": "当前通信技术在理论容量、频谱可用性和功耗资源方面存在限制。实用通信利用终端智能进行选择性数据传输，提供资源节约。现有研究缺乏通用意图解析工具，限制了其适用性。本文提出了一种基于大型语言模型的实用智能体（PACE）的图像实用通信框架。在该框架下，PACE依次执行语义感知、意图解析和以意图为导向的编码。为了确保在通信中有效使用大型语言模型，设计了一个知识库来补充所需的知识，引入了专用提示来促进对实用通信场景和任务要求的理解，并设计了一条思维链以帮助在传输效率和质量之间进行合理的权衡。",
    "tldr": "PACE是一种利用大型语言模型的实用智能体，提供了基于图像的实用通信框架。它通过语义感知、意图解析和以意图为导向的编码来增强通信效率。为了有效利用语言模型，它使用知识库补充所需知识，引入专用提示来促进对实用通信场景和任务要求的理解，并设计思维链以帮助权衡传输效率和质量。"
}