{
    "title": "Code-Switched Language Identification is Harder Than You Think",
    "abstract": "Code switching (CS) is a very common phenomenon in written and spoken communication but one that is handled poorly by many natural language processing applications. Looking to the application of building CS corpora, we explore CS language identification (LID) for corpus building. We make the task more realistic by scaling it to more languages and considering models with simpler architectures for faster inference. We also reformulate the task as a sentence-level multi-label tagging problem to make it more tractable. Having defined the task, we investigate three reasonable models for this task and define metrics which better reflect desired performance. We present empirical evidence that no current approach is adequate and finally provide recommendations for future work in this area.",
    "link": "https://rss.arxiv.org/abs/2402.01505",
    "context": "Title: Code-Switched Language Identification is Harder Than You Think\nAbstract: Code switching (CS) is a very common phenomenon in written and spoken communication but one that is handled poorly by many natural language processing applications. Looking to the application of building CS corpora, we explore CS language identification (LID) for corpus building. We make the task more realistic by scaling it to more languages and considering models with simpler architectures for faster inference. We also reformulate the task as a sentence-level multi-label tagging problem to make it more tractable. Having defined the task, we investigate three reasonable models for this task and define metrics which better reflect desired performance. We present empirical evidence that no current approach is adequate and finally provide recommendations for future work in this area.",
    "path": "papers/24/02/2402.01505.json",
    "total_tokens": 787,
    "translated_title": "代码转换语言识别比你想的更困难",
    "translated_abstract": "代码转换（CS）是一种在书面和口语交流中非常常见的现象，但是许多自然语言处理应用程序对其处理不佳。在构建CS语料库的应用中，我们探索了用于语料库构建的CS语言识别（LID）。我们通过扩展到更多的语言并考虑采用简单架构的模型进行更快的推理来使任务更加真实。我们还将任务重新定义为句子级多标签标记问题，以使其更加可行。在定义了任务之后，我们研究了三个合理的模型，并定义了更能反映所需性能的指标。我们提出了实证证据表明当前的方法都不足够，并最终提供了对未来工作在这个领域的建议。",
    "tldr": "代码转换语言识别是一个常见且应用广泛的问题，但目前的方法都不够理想。本研究通过扩展语言范围、采用简单架构的模型以及重新定义任务，提出了一种更加可行的解决方案，并对未来的工作提出了建议。",
    "en_tdlr": "Language identification for code-switched text is a challenging task due to its common occurrence and poor handling in natural language processing applications. This study addresses the task by exploring multiple languages, simpler architectures, and a sentence-level tagging approach, highlighting the inadequacy of current approaches and providing recommendations for future work."
}