{
    "title": "Stuck-at Faults in ReRAM Neuromorphic Circuit Array and their Correction through Machine Learning",
    "abstract": "arXiv:2402.10981v1 Announce Type: cross  Abstract: In this paper, we study the inference accuracy of the Resistive Random Access Memory (ReRAM) neuromorphic circuit due to stuck-at faults (stuck-on, stuck-off, and stuck at a certain resistive value). A simulation framework using Python is used to perform supervised machine learning (neural network with 3 hidden layers, 1 input layer, and 1 output layer) of handwritten digits and construct a corresponding fully analog neuromorphic circuit (4 synaptic arrays) simulated by Spectre. A generic 45nm Process Development Kit (PDK) was used. We study the difference in the inference accuracy degradation due to stuck-on and stuck-off defects. Various defect patterns are studied including circular, ring, row, column, and circular-complement defects. It is found that stuck-on and stuck-off defects have a similar effect on inference accuracy. However, it is also found that if there is a spatial defect variation across the columns, the inference accu",
    "link": "https://arxiv.org/abs/2402.10981",
    "context": "Title: Stuck-at Faults in ReRAM Neuromorphic Circuit Array and their Correction through Machine Learning\nAbstract: arXiv:2402.10981v1 Announce Type: cross  Abstract: In this paper, we study the inference accuracy of the Resistive Random Access Memory (ReRAM) neuromorphic circuit due to stuck-at faults (stuck-on, stuck-off, and stuck at a certain resistive value). A simulation framework using Python is used to perform supervised machine learning (neural network with 3 hidden layers, 1 input layer, and 1 output layer) of handwritten digits and construct a corresponding fully analog neuromorphic circuit (4 synaptic arrays) simulated by Spectre. A generic 45nm Process Development Kit (PDK) was used. We study the difference in the inference accuracy degradation due to stuck-on and stuck-off defects. Various defect patterns are studied including circular, ring, row, column, and circular-complement defects. It is found that stuck-on and stuck-off defects have a similar effect on inference accuracy. However, it is also found that if there is a spatial defect variation across the columns, the inference accu",
    "path": "papers/24/02/2402.10981.json",
    "total_tokens": 990,
    "translated_title": "ReRAM神经形态电路阵列中的卡住故障及其通过机器学习的纠正",
    "translated_abstract": "本文研究了由于卡住故障（卡住、卡住和卡住在某一电阻值）导致的可编程阻性随机存取内存（ReRAM）神经形态电路的推理准确性。 使用Python执行了一个模拟框架，进行监督式机器学习（具有3个隐藏层、1个输入层和1个输出层的神经网络）来识别手写数字，并构建相应的完全模拟神经形态电路（由Spectre模拟的4个突触阵列）。 使用了一个通用的45nm工艺开发套件（PDK）。 研究了卡住和卡住缺陷导致的推理准确性降级的差异。 研究了各种缺陷模式，包括圆形、环形、行、列和圆形互补缺陷。 发现卡住和卡住缺陷对推理准确性具有类似的影响。 但还发现，如果在列之间存在空间缺陷变化，则推理准确性将受到影响。",
    "tldr": "本文研究了ReRAM神经形态电路中卡住故障对推理准确性的影响，并发现卡住和卡住缺陷对推理准确性有类似的影响，但如果在列之间存在空间缺陷变化，则推理准确性会受到影响。",
    "en_tdlr": "This paper investigates the impact of stuck-at faults in ReRAM neuromorphic circuit on inference accuracy, finding that stuck-on and stuck-off defects have similar effects on inference accuracy, but inference accuracy would also be affected if there is spatial defect variation across the columns."
}