{
    "title": "Adversarial Perturbations of Physical Signals",
    "abstract": "arXiv:2402.17104v1 Announce Type: new  Abstract: We investigate the vulnerability of computer-vision-based signal classifiers to adversarial perturbations of their inputs, where the signals and perturbations are subject to physical constraints. We consider a scenario in which a source and interferer emit signals that propagate as waves to a detector, which attempts to classify the source by analyzing the spectrogram of the signal it receives using a pre-trained neural network. By solving PDE-constrained optimization problems, we construct interfering signals that cause the detector to misclassify the source even though the perturbations to the spectrogram of the received signal are nearly imperceptible. Though such problems can have millions of decision variables, we introduce methods to solve them efficiently. Our experiments demonstrate that one can compute effective and physically realizable adversarial perturbations for a variety of machine learning models under various physical co",
    "link": "https://arxiv.org/abs/2402.17104",
    "context": "Title: Adversarial Perturbations of Physical Signals\nAbstract: arXiv:2402.17104v1 Announce Type: new  Abstract: We investigate the vulnerability of computer-vision-based signal classifiers to adversarial perturbations of their inputs, where the signals and perturbations are subject to physical constraints. We consider a scenario in which a source and interferer emit signals that propagate as waves to a detector, which attempts to classify the source by analyzing the spectrogram of the signal it receives using a pre-trained neural network. By solving PDE-constrained optimization problems, we construct interfering signals that cause the detector to misclassify the source even though the perturbations to the spectrogram of the received signal are nearly imperceptible. Though such problems can have millions of decision variables, we introduce methods to solve them efficiently. Our experiments demonstrate that one can compute effective and physically realizable adversarial perturbations for a variety of machine learning models under various physical co",
    "path": "papers/24/02/2402.17104.json",
    "total_tokens": 881,
    "translated_title": "物理信号的对抗扰动",
    "translated_abstract": "我们研究了基于计算机视觉的信号分类器对其输入的对抗扰动的脆弱性，其中信号和扰动受物理约束。我们考虑了这样一个情景：一个源和干扰器发出信号作为波传播到检测器，检测器试图通过分析接收到的信号的频谱图来分类源，使用一个预训练的神经网络。通过求解PDE约束优化问题，我们构造干扰信号，即使对接收到的信号的频谱图的扰动几乎不可察觉，也会导致检测器对源进行错误分类。虽然这类问题可能包含数百万个决策变量，但我们引入了有效求解它们的方法。我们的实验证明，可以为各种机器学习模型在不同的物理约束下计算出有效且物理可实现的对抗扰动。",
    "tldr": "研究了基于计算机视觉的信号分类器对物理信号的对抗扰动的脆弱性，通过引入PDE约束优化问题构造干扰信号，成功实现对检测器的误分类，对解决这些问题提出了高效方法，实验证明可以计算出各种机器学习模型的对抗扰动。",
    "en_tdlr": "Investigated the vulnerability of computer-vision-based signal classifiers to adversarial perturbations of physical signals, constructed interfering signals through PDE-constrained optimization problems to induce misclassification, introduced efficient methods for solving these problems, and demonstrated the computation of effective adversarial perturbations for various machine learning models."
}