{
    "title": "DeepForge: Leveraging AI for Microstructural Control in Metal Forming via Model Predictive Control",
    "abstract": "arXiv:2402.16119v1 Announce Type: new  Abstract: This study presents a novel method for microstructure control in closed die hot forging that combines Model Predictive Control (MPC) with a developed machine learning model called DeepForge. DeepForge uses an architecture that combines 1D convolutional neural networks and gated recurrent units. It uses surface temperature measurements of a workpiece as input to predict microstructure changes during forging. The paper also details DeepForge's architecture and the finite element simulation model used to generate the data set, using a three-stroke forging process. The results demonstrate DeepForge's ability to predict microstructure with a mean absolute error of 0.4$\\pm$0.3%. In addition, the study explores the use of MPC to adjust inter-stroke wait times, effectively counteracting temperature disturbances to achieve a target grain size of less than 35 microns within a specific 2D region of the workpiece. These results are then verified exp",
    "link": "https://arxiv.org/abs/2402.16119",
    "context": "Title: DeepForge: Leveraging AI for Microstructural Control in Metal Forming via Model Predictive Control\nAbstract: arXiv:2402.16119v1 Announce Type: new  Abstract: This study presents a novel method for microstructure control in closed die hot forging that combines Model Predictive Control (MPC) with a developed machine learning model called DeepForge. DeepForge uses an architecture that combines 1D convolutional neural networks and gated recurrent units. It uses surface temperature measurements of a workpiece as input to predict microstructure changes during forging. The paper also details DeepForge's architecture and the finite element simulation model used to generate the data set, using a three-stroke forging process. The results demonstrate DeepForge's ability to predict microstructure with a mean absolute error of 0.4$\\pm$0.3%. In addition, the study explores the use of MPC to adjust inter-stroke wait times, effectively counteracting temperature disturbances to achieve a target grain size of less than 35 microns within a specific 2D region of the workpiece. These results are then verified exp",
    "path": "papers/24/02/2402.16119.json",
    "total_tokens": 1032,
    "translated_title": "利用模型预测控制的深度锻造：在金属成形中利用人工智能实现微观组织控制",
    "translated_abstract": "这项研究提出了一种新颖的方法，用于在闭模热锻造中实现微观组织控制，将模型预测控制（MPC）与一种名为DeepForge的开发的机器学习模型相结合。DeepForge使用结合了1D卷积神经网络和门控循环单元的架构。它使用工件表面温度测量作为输入，以预测锻造过程中的微观组织变化。论文还详细介绍了DeepForge的架构以及用于生成数据集的有限元模拟模型，使用了三行程锻造工艺。研究结果表明，DeepForge能够以0.4±0.3%的平均绝对误差预测微观组织。此外，该研究探讨了使用MPC调整行程之间的等待时间，有效地抵消温度扰动，实现在工件的特定2D区域内将晶粒尺寸控制在35微米以下的目标。然后，这些结果经过验证。",
    "tldr": "该研究提出了一种结合模型预测控制和名为DeepForge的机器学习模型的方法，用于在闭模热锻造过程中通过使用表面温度测量预测微观组织的变化。研究结果显示，DeepForge能够以极低的平均绝对误差预测微观组织，并探索了使用MPC调整等待时间来实现在特定工件区域内达到目标晶粒尺寸的可能性。",
    "en_tdlr": "This study introduces a method that combines Model Predictive Control with a machine learning model called DeepForge for microstructure control in closed die hot forging, demonstrating DeepForge's ability to predict microstructure changes with low error and exploring the potential of using MPC to achieve target grain sizes within specific regions of the workpiece."
}