{
    "title": "Representing Online Handwriting for Recognition in Large Vision-Language Models",
    "abstract": "arXiv:2402.15307v1 Announce Type: cross  Abstract: The adoption of tablets with touchscreens and styluses is increasing, and a key feature is converting handwriting to text, enabling search, indexing, and AI assistance. Meanwhile, vision-language models (VLMs) are now the go-to solution for image understanding, thanks to both their state-of-the-art performance across a variety of tasks and the simplicity of a unified approach to training, fine-tuning, and inference. While VLMs obtain high performance on image-based tasks, they perform poorly on handwriting recognition when applied naively, i.e., by rendering handwriting as an image and performing optical character recognition (OCR). In this paper, we study online handwriting recognition with VLMs, going beyond naive OCR. We propose a novel tokenized representation of digital ink (online handwriting) that includes both a time-ordered sequence of strokes as text, and as image. We show that this representation yields results comparable to",
    "link": "https://arxiv.org/abs/2402.15307",
    "context": "Title: Representing Online Handwriting for Recognition in Large Vision-Language Models\nAbstract: arXiv:2402.15307v1 Announce Type: cross  Abstract: The adoption of tablets with touchscreens and styluses is increasing, and a key feature is converting handwriting to text, enabling search, indexing, and AI assistance. Meanwhile, vision-language models (VLMs) are now the go-to solution for image understanding, thanks to both their state-of-the-art performance across a variety of tasks and the simplicity of a unified approach to training, fine-tuning, and inference. While VLMs obtain high performance on image-based tasks, they perform poorly on handwriting recognition when applied naively, i.e., by rendering handwriting as an image and performing optical character recognition (OCR). In this paper, we study online handwriting recognition with VLMs, going beyond naive OCR. We propose a novel tokenized representation of digital ink (online handwriting) that includes both a time-ordered sequence of strokes as text, and as image. We show that this representation yields results comparable to",
    "path": "papers/24/02/2402.15307.json",
    "total_tokens": 898,
    "translated_title": "在大型视觉语言模型中表示在线手写识别",
    "translated_abstract": "随着带有触摸屏和触控笔的平板电脑的普及，将手写转换为文本的关键功能得以实现，实现了搜索、索引和人工智能辅助。与此同时，视觉语言模型(VLMs)现在已成为图像理解的首选解决方案，这要归功于它们在各种任务上的最先进性能，以及训练、微调和推理的统一方法的简洁性。虽然VLMs在基于图像的任务上表现出色，但在朴素应用时(即将手写呈现为图像并执行光学字符识别(OCR))在手写识别方面效果不佳。在本文中，我们研究了VLMs中的在线手写识别，超越了朴素的OCR。我们提出了一种将数字墨水(在线手写)的新型标记化表示，其中包括作为文本的一系列按时间顺序排列的笔画，以及作为图像。我们展示了这种表示得到的结果与",
    "tldr": "本文研究了在大型视觉语言模型中进行在线手写识别，提出了一种新颖的数字墨水(tokenized representation)表示方法，将手写呈现为文本序列和图像，取得了可与现有方法媲美的结果。",
    "en_tdlr": "This paper investigates online handwriting recognition in large vision-language models, proposing a novel tokenized representation of digital ink that includes both a time-ordered sequence of strokes as text and as an image, achieving results comparable to existing methods."
}