{
    "title": "PBADet: A One-Stage Anchor-Free Approach for Part-Body Association",
    "abstract": "The detection of human parts (e.g., hands, face) and their correct association with individuals is an essential task, e.g., for ubiquitous human-machine interfaces and action recognition. Traditional methods often employ multi-stage processes, rely on cumbersome anchor-based systems, or do not scale well to larger part sets. This paper presents PBADet, a novel one-stage, anchor-free approach for part-body association detection. Building upon the anchor-free object representation across multi-scale feature maps, we introduce a singular part-to-body center offset that effectively encapsulates the relationship between parts and their parent bodies. Our design is inherently versatile and capable of managing multiple parts-to-body associations without compromising on detection accuracy or robustness. Comprehensive experiments on various datasets underscore the efficacy of our approach, which not only outperforms existing state-of-the-art techniques but also offers a more streamlined and eff",
    "link": "https://arxiv.org/abs/2402.07814",
    "context": "Title: PBADet: A One-Stage Anchor-Free Approach for Part-Body Association\nAbstract: The detection of human parts (e.g., hands, face) and their correct association with individuals is an essential task, e.g., for ubiquitous human-machine interfaces and action recognition. Traditional methods often employ multi-stage processes, rely on cumbersome anchor-based systems, or do not scale well to larger part sets. This paper presents PBADet, a novel one-stage, anchor-free approach for part-body association detection. Building upon the anchor-free object representation across multi-scale feature maps, we introduce a singular part-to-body center offset that effectively encapsulates the relationship between parts and their parent bodies. Our design is inherently versatile and capable of managing multiple parts-to-body associations without compromising on detection accuracy or robustness. Comprehensive experiments on various datasets underscore the efficacy of our approach, which not only outperforms existing state-of-the-art techniques but also offers a more streamlined and eff",
    "path": "papers/24/02/2402.07814.json",
    "total_tokens": 896,
    "translated_title": "PBADet：一种用于部件-身体关联的单阶段无锚点方法",
    "translated_abstract": "人体部件（如手、脸）的检测及其与个人的正确关联是一项重要任务，例如用于普适人机界面和动作识别。传统方法通常采用多阶段流程，依赖繁琐的基于锚点的系统，或者在处理较大的部分集时扩展性差。本文提出了一种名为PBADet的新型单阶段、无锚点的部件-身体关联检测方法。基于多尺度特征图的无锚点物体表示，我们引入了一个单一的部件-身体中心偏移量，有效地表达了部件与其父身体之间的关系。我们的设计具有很强的通用性，能够处理多个部件-身体关联，同时不影响检测准确性和稳健性。在各种数据集上的全面实验证明了我们方法的有效性，不仅超越了现有的最先进技术，而且还提供了更加简化和高效的解决方案。",
    "tldr": "PBADet是一种用于部件-身体关联的单阶段无锚点方法，通过引入部件-身体中心偏移量来有效表达部件与身体之间的关系，具有高效、准确和稳健的特点，相比现有技术具有更好的性能。",
    "en_tdlr": "PBADet is a one-stage anchor-free approach for part-body association detection. It introduces a singular part-to-body center offset to effectively capture the relationship between parts and their parent bodies. The approach is versatile, accurate, and robust, outperforming existing techniques in terms of performance and efficiency."
}