{
    "title": "An end-to-end deep learning pipeline to derive blood input with partial volume corrections for automated parametric brain PET mapping",
    "abstract": "Dynamic 2-[18F] fluoro-2-deoxy-D-glucose positron emission tomography (dFDG-PET) for human brain imaging has considerable clinical potential, yet its utilization remains limited. A key challenge in the quantitative analysis of dFDG-PET is characterizing a patient-specific blood input function, traditionally reliant on invasive arterial blood sampling. This research introduces a novel approach employing non-invasive deep learning model-based computations from the internal carotid arteries (ICA) with partial volume (PV) corrections, thereby eliminating the need for invasive arterial sampling. We present an end-to-end pipeline incorporating a 3D U-Net based ICA-net for ICA segmentation, alongside a Recurrent Neural Network (RNN) based MCIF-net for the derivation of a model-corrected blood input function (MCIF) with PV corrections. The developed 3D U-Net and RNN was trained and validated using a 5-fold cross-validation approach on 50 human brain FDG PET datasets. The ICA-net achieved an av",
    "link": "https://arxiv.org/abs/2402.03414",
    "context": "Title: An end-to-end deep learning pipeline to derive blood input with partial volume corrections for automated parametric brain PET mapping\nAbstract: Dynamic 2-[18F] fluoro-2-deoxy-D-glucose positron emission tomography (dFDG-PET) for human brain imaging has considerable clinical potential, yet its utilization remains limited. A key challenge in the quantitative analysis of dFDG-PET is characterizing a patient-specific blood input function, traditionally reliant on invasive arterial blood sampling. This research introduces a novel approach employing non-invasive deep learning model-based computations from the internal carotid arteries (ICA) with partial volume (PV) corrections, thereby eliminating the need for invasive arterial sampling. We present an end-to-end pipeline incorporating a 3D U-Net based ICA-net for ICA segmentation, alongside a Recurrent Neural Network (RNN) based MCIF-net for the derivation of a model-corrected blood input function (MCIF) with PV corrections. The developed 3D U-Net and RNN was trained and validated using a 5-fold cross-validation approach on 50 human brain FDG PET datasets. The ICA-net achieved an av",
    "path": "papers/24/02/2402.03414.json",
    "total_tokens": 1007,
    "translated_title": "一个端到端的深度学习流水线用于血液输入的计算，包括局部体积校正以便进行自动化的参数化脑PET映射",
    "translated_abstract": "动态2-[18F]氟-2-脱氧-D-葡萄糖正电子发射断层扫描（dFDG-PET）对人类脑部成像具有相当大的临床潜力，但其利用仍受限制。在对dFDG-PET的定量分析中，一个关键挑战是表征特定于患者的血液输入功能，传统上依赖侵入性动脉采血。本研究引入了一种新方法，利用非侵入性深度学习模型计算来自颈内动脉的局部体积（PV）校正，从而消除了侵入性动脉采血的需要。我们提出了一个端到端流程，其中包括基于3D U-Net的颈内动脉（ICA）分割和基于循环神经网络（RNN）的MCIF-net用于计算具有PV校正的模型修正血液输入函数（MCIF）。所开发的3D U-Net和RNN是使用5倍交叉验证方法在50个人类脑FDG PET数据集上进行训练和验证的。ICA-net在平均Dice系数上达到了...",
    "tldr": "该论文介绍了一个端到端的深度学习流水线，利用局部体积校正和非侵入性动脉采样模型，自动推导血液输入函数，从而解决了动态FDG-PET定量分析中的关键挑战。",
    "en_tdlr": "This paper introduces an end-to-end deep learning pipeline that utilizes partial volume corrections and a non-invasive arterial sampling model to derive a blood input function automatically, addressing a key challenge in quantitative analysis of dynamic FDG-PET."
}