{
    "title": "Investigating Reproducibility in Deep Learning-Based Software Fault Prediction",
    "abstract": "Over the past few years, deep learning methods have been applied for a wide range of Software Engineering (SE) tasks, including in particular for the important task of automatically predicting and localizing faults in software. With the rapid adoption of increasingly complex machine learning models, it however becomes more and more difficult for scholars to reproduce the results that are reported in the literature. This is in particular the case when the applied deep learning models and the evaluation methodology are not properly documented and when code and data are not shared. Given some recent -- and very worrying -- findings regarding reproducibility and progress in other areas of applied machine learning, the goal of this work is to analyze to what extent the field of software engineering, in particular in the area of software fault prediction, is plagued by similar problems. We have therefore conducted a systematic review of the current literature and examined the level of reprod",
    "link": "https://arxiv.org/abs/2402.05645",
    "context": "Title: Investigating Reproducibility in Deep Learning-Based Software Fault Prediction\nAbstract: Over the past few years, deep learning methods have been applied for a wide range of Software Engineering (SE) tasks, including in particular for the important task of automatically predicting and localizing faults in software. With the rapid adoption of increasingly complex machine learning models, it however becomes more and more difficult for scholars to reproduce the results that are reported in the literature. This is in particular the case when the applied deep learning models and the evaluation methodology are not properly documented and when code and data are not shared. Given some recent -- and very worrying -- findings regarding reproducibility and progress in other areas of applied machine learning, the goal of this work is to analyze to what extent the field of software engineering, in particular in the area of software fault prediction, is plagued by similar problems. We have therefore conducted a systematic review of the current literature and examined the level of reprod",
    "path": "papers/24/02/2402.05645.json",
    "total_tokens": 795,
    "translated_title": "深度学习在软件错误预测中的可再现性研究",
    "translated_abstract": "过去几年，深度学习方法已经应用于软件工程领域的各种任务，特别是自动预测和定位软件错误的重要任务。然而，随着越来越复杂的机器学习模型的快速采用，学者们越来越难以复现文献中报道的结果。特别是在深度学习模型和评估方法未正确记录、代码和数据未分享的情况下更加困难。鉴于其他应用机器学习领域可再现性的最近且非常令人担忧的发现，本研究的目标是分析软件工程领域，特别是软件错误预测领域是否存在类似问题的程度。因此，我们对当前文献进行了系统回顾，并检查了可再现性的水平。",
    "tldr": "本研究通过系统回顾当前文献，分析了深度学习在软件错误预测领域的可再现性问题，并发现了一些令人担忧的情况。",
    "en_tdlr": "This study investigates the reproducibility issues in the field of software fault prediction using deep learning methods, highlighting the worrying findings and the need for proper documentation and data sharing."
}