{
    "title": "CoRelation: Boosting Automatic ICD Coding Through Contextualized Code Relation Learning",
    "abstract": "arXiv:2402.15700v1 Announce Type: cross  Abstract: Automatic International Classification of Diseases (ICD) coding plays a crucial role in the extraction of relevant information from clinical notes for proper recording and billing. One of the most important directions for boosting the performance of automatic ICD coding is modeling ICD code relations. However, current methods insufficiently model the intricate relationships among ICD codes and often overlook the importance of context in clinical notes. In this paper, we propose a novel approach, a contextualized and flexible framework, to enhance the learning of ICD code representations. Our approach, unlike existing methods, employs a dependent learning paradigm that considers the context of clinical notes in modeling all possible code relations. We evaluate our approach on six public ICD coding datasets and the experimental results demonstrate the effectiveness of our approach compared to state-of-the-art baselines.",
    "link": "https://arxiv.org/abs/2402.15700",
    "context": "Title: CoRelation: Boosting Automatic ICD Coding Through Contextualized Code Relation Learning\nAbstract: arXiv:2402.15700v1 Announce Type: cross  Abstract: Automatic International Classification of Diseases (ICD) coding plays a crucial role in the extraction of relevant information from clinical notes for proper recording and billing. One of the most important directions for boosting the performance of automatic ICD coding is modeling ICD code relations. However, current methods insufficiently model the intricate relationships among ICD codes and often overlook the importance of context in clinical notes. In this paper, we propose a novel approach, a contextualized and flexible framework, to enhance the learning of ICD code representations. Our approach, unlike existing methods, employs a dependent learning paradigm that considers the context of clinical notes in modeling all possible code relations. We evaluate our approach on six public ICD coding datasets and the experimental results demonstrate the effectiveness of our approach compared to state-of-the-art baselines.",
    "path": "papers/24/02/2402.15700.json",
    "total_tokens": 812,
    "translated_title": "《CoRelation: 通过上下文化的编码关系学习提升自动ICD编码》",
    "translated_abstract": "自动国际疾病分类（ICD）编码在从临床记录中提取相关信息以便正确记录和计费方面起着至关重要的作用。提升自动ICD编码性能的一个重要方向是对ICD编码关系进行建模。然而，当前方法对ICD编码之间错综复杂的关系建模不足，通常忽视了临床记录中上下文的重要性。本文提出了一种新颖方法，即一种上下文化和灵活的框架，以增强ICD编码表示的学习。与现有方法不同，我们的方法采用了考虑临床记录上下文的依赖学习范式，对建模所有可能的编码关系。我们在六个公共ICD编码数据集上评估了我们的方法，实验结果表明与最先进基线方法相比，我们的方法的有效性。",
    "tldr": "通过上下文化的编码关系学习，提出了一种新的框架来增强ICD编码表示的学习，实验结果表明其相比最先进基线方法的有效性。",
    "en_tdlr": "A novel framework is proposed to enhance the learning of ICD code representations through contextualized code relation learning, with experimental results demonstrating its effectiveness compared to state-of-the-art baselines."
}