{
    "title": "Intergenerational Preferences and Continuity: Reconciling Order and Topology",
    "abstract": "In this paper we focus our efforts on studying how a preorder and topology can be made compatible. Thus we provide a characterization of those that are continuous-compatible. Such a characterization states that such topologies must be finer than the so-called upper topology induced by the preorder and, thus, it clarifies which topology is the smallest one among those that make the preorder continuous. Moreover, we provide sufficient conditions that allows us to discard in an easy way the continuity of a preference. In the light of the obtained results, we provide possibility counterparts of the a few celebrate impossibility theorems for continuous social social intergenerational preferences due to P. Diamond, L.G. Svensson and T. Sakai. Furthermore, we suggest quasi-pseudo-metrics as appropriate quantitative tool for reconciling topology and social intergenerational preferences. Thus, we develop a metric type method which is able to guarantee possibility counterparts of the aforesaid i",
    "link": "https://arxiv.org/abs/2402.01699",
    "context": "Title: Intergenerational Preferences and Continuity: Reconciling Order and Topology\nAbstract: In this paper we focus our efforts on studying how a preorder and topology can be made compatible. Thus we provide a characterization of those that are continuous-compatible. Such a characterization states that such topologies must be finer than the so-called upper topology induced by the preorder and, thus, it clarifies which topology is the smallest one among those that make the preorder continuous. Moreover, we provide sufficient conditions that allows us to discard in an easy way the continuity of a preference. In the light of the obtained results, we provide possibility counterparts of the a few celebrate impossibility theorems for continuous social social intergenerational preferences due to P. Diamond, L.G. Svensson and T. Sakai. Furthermore, we suggest quasi-pseudo-metrics as appropriate quantitative tool for reconciling topology and social intergenerational preferences. Thus, we develop a metric type method which is able to guarantee possibility counterparts of the aforesaid i",
    "path": "papers/24/02/2402.01699.json",
    "total_tokens": 907,
    "translated_title": "跨代偏好与连续性：调和序和拓扑的研究",
    "translated_abstract": "本文主要研究如何使一个预序和拓扑相容。我们提供了与连续性相容的一个特征化。这个特征化说明这样的拓扑必须比预序诱导的上层拓扑更精细，从而澄清了在使预序连续的拓扑中最小的是哪一个。此外，我们还提供了足够的条件，可以轻松排除偏好的连续性。根据所得结果，我们提供了与P. Diamond、L.G. Svensson和T. Sakai的连续社会跨代偏好的一些著名不可能定理相对应的可能性对照。此外，我们还建议使用准伪度量作为调和拓扑和社会跨代偏好的适当定量工具。因此，我们开发了一种能够保证所述可能性对照的度量方法。",
    "tldr": "本文研究了如何使预序和拓扑相容，提供了相容的特征化和排除偏好连续性的条件。根据结果，提供了与连续社会跨代偏好的一些不可能定理相对应的可能性对照。使用准伪度量作为调和拓扑和社会跨代偏好的定量工具。"
}