{
    "title": "Spatial-temporal-demand clustering for solving large-scale vehicle routing problems with time windows",
    "abstract": "Several metaheuristics use decomposition and pruning strategies to solve large-scale instances of the vehicle routing problem (VRP). Those complexity reduction techniques often rely on simple, problem-specific rules. However, the growth in available data and advances in computer hardware enable data-based approaches that use machine learning (ML) to improve scalability of solution algorithms. We propose a decompose-route-improve (DRI) framework that groups customers using clustering. Its similarity metric incorporates customers' spatial, temporal, and demand data and is formulated to reflect the problem's objective function and constraints. The resulting sub-routing problems can independently be solved using any suitable algorithm. We apply pruned local search (LS) between solved subproblems to improve the overall solution. Pruning is based on customers' similarity information obtained in the decomposition phase. In a computational study, we parameterize and compare existing clustering",
    "link": "https://arxiv.org/abs/2402.00041",
    "context": "Title: Spatial-temporal-demand clustering for solving large-scale vehicle routing problems with time windows\nAbstract: Several metaheuristics use decomposition and pruning strategies to solve large-scale instances of the vehicle routing problem (VRP). Those complexity reduction techniques often rely on simple, problem-specific rules. However, the growth in available data and advances in computer hardware enable data-based approaches that use machine learning (ML) to improve scalability of solution algorithms. We propose a decompose-route-improve (DRI) framework that groups customers using clustering. Its similarity metric incorporates customers' spatial, temporal, and demand data and is formulated to reflect the problem's objective function and constraints. The resulting sub-routing problems can independently be solved using any suitable algorithm. We apply pruned local search (LS) between solved subproblems to improve the overall solution. Pruning is based on customers' similarity information obtained in the decomposition phase. In a computational study, we parameterize and compare existing clustering",
    "path": "papers/24/02/2402.00041.json",
    "total_tokens": 872,
    "translated_title": "空间-时间-需求聚类用于解决具有时间窗口的大规模车辆路径问题",
    "translated_abstract": "几种元启发式方法使用分解和修剪策略来解决车辆路径问题（VRP）的大规模实例。这些复杂性减少技术通常依赖于简单的、问题特定的规则。然而，可用数据的增长和计算机硬件的进步使得可以使用机器学习（ML）的基于数据的方法来改善解决方案算法的可扩展性。我们提出了一个分解-路径改进（DRI）框架，使用聚类将客户分组。其相似度度量指标包括客户的空间、时间和需求数据，并且被制定成反映问题目标函数和约束的形式。导致的子路径问题可以使用任何合适的算法独立地解决。我们在解决的子问题之间应用修剪的局部搜索（LS）来改进整体解。修剪基于在分解阶段获得的客户相似度信息。在计算研究中，我们参数化并比较现有的聚类方法。",
    "tldr": "该论文提出了一种基于聚类的解决大规模车辆路径问题的方法，通过结合空间、时间、需求数据，将问题分解为子路径问题，然后分别解决，并通过局部搜索来改进整体解决方案。",
    "en_tdlr": "This paper proposes a clustering-based approach to solve large-scale vehicle routing problems by decomposing the problem into sub-routing problems using spatial, temporal, and demand data, solving them independently, and improving the overall solution through local search."
}