{
    "title": "Emergency Caching: Coded Caching-based Reliable Map Transmission in Emergency Networks",
    "abstract": "arXiv:2402.17550v1 Announce Type: cross  Abstract: Many rescue missions demand effective perception and real-time decision making, which highly rely on effective data collection and processing. In this study, we propose a three-layer architecture of emergency caching networks focusing on data collection and reliable transmission, by leveraging efficient perception and edge caching technologies. Based on this architecture, we propose a disaster map collection framework that integrates coded caching technologies. Our framework strategically caches coded fragments of maps across unmanned aerial vehicles (UAVs), fostering collaborative uploading for augmented transmission reliability. Additionally, we establish a comprehensive probability model to assess the effective recovery area of disaster maps. Towards the goal of utility maximization, we propose a deep reinforcement learning (DRL) based algorithm that jointly makes decisions about cooperative UAVs selection, bandwidth allocation and ",
    "link": "https://arxiv.org/abs/2402.17550",
    "context": "Title: Emergency Caching: Coded Caching-based Reliable Map Transmission in Emergency Networks\nAbstract: arXiv:2402.17550v1 Announce Type: cross  Abstract: Many rescue missions demand effective perception and real-time decision making, which highly rely on effective data collection and processing. In this study, we propose a three-layer architecture of emergency caching networks focusing on data collection and reliable transmission, by leveraging efficient perception and edge caching technologies. Based on this architecture, we propose a disaster map collection framework that integrates coded caching technologies. Our framework strategically caches coded fragments of maps across unmanned aerial vehicles (UAVs), fostering collaborative uploading for augmented transmission reliability. Additionally, we establish a comprehensive probability model to assess the effective recovery area of disaster maps. Towards the goal of utility maximization, we propose a deep reinforcement learning (DRL) based algorithm that jointly makes decisions about cooperative UAVs selection, bandwidth allocation and ",
    "path": "papers/24/02/2402.17550.json",
    "total_tokens": 840,
    "translated_title": "紧急缓存：基于编码缓存的紧急网络可靠地图传输",
    "translated_abstract": "许多救援任务需要高效的感知和实时决策，这在很大程度上依赖于有效的数据收集和处理。本研究提出了一个侧重于数据收集和可靠传输的紧急缓存网络的三层架构，利用高效感知和边缘缓存技术。基于这个架构，我们提出了一个整合编码缓存技术的灾难地图收集框架。我们的框架在无人机之间策略性地缓存地图的编码片段，促进协同上传以增强传输的可靠性。此外，我们建立了一个全面的概率模型来评估灾难地图的有效恢复区域。为了实现效用最大化的目标，我们提出了一个基于深度强化学习（DRL）的算法，共同决策协作无人机选择、带宽分配等方面。",
    "tldr": "提出了一个三层架构的紧急缓存网络，结合了编码缓存技术，通过无人机之间协同上传实现灾难地图的可靠传输，同时引入了深度强化学习算法优化决策。"
}