{
    "title": "Text-Guided Molecule Generation with Diffusion Language Model",
    "abstract": "arXiv:2402.13040v1 Announce Type: cross  Abstract: Text-guided molecule generation is a task where molecules are generated to match specific textual descriptions. Recently, most existing SMILES-based molecule generation methods rely on an autoregressive architecture. In this work, we propose the Text-Guided Molecule Generation with Diffusion Language Model (TGM-DLM), a novel approach that leverages diffusion models to address the limitations of autoregressive methods. TGM-DLM updates token embeddings within the SMILES string collectively and iteratively, using a two-phase diffusion generation process. The first phase optimizes embeddings from random noise, guided by the text description, while the second phase corrects invalid SMILES strings to form valid molecular representations. We demonstrate that TGM-DLM outperforms MolT5-Base, an autoregressive model, without the need for additional data resources. Our findings underscore the remarkable effectiveness of TGM-DLM in generating cohe",
    "link": "https://arxiv.org/abs/2402.13040",
    "context": "Title: Text-Guided Molecule Generation with Diffusion Language Model\nAbstract: arXiv:2402.13040v1 Announce Type: cross  Abstract: Text-guided molecule generation is a task where molecules are generated to match specific textual descriptions. Recently, most existing SMILES-based molecule generation methods rely on an autoregressive architecture. In this work, we propose the Text-Guided Molecule Generation with Diffusion Language Model (TGM-DLM), a novel approach that leverages diffusion models to address the limitations of autoregressive methods. TGM-DLM updates token embeddings within the SMILES string collectively and iteratively, using a two-phase diffusion generation process. The first phase optimizes embeddings from random noise, guided by the text description, while the second phase corrects invalid SMILES strings to form valid molecular representations. We demonstrate that TGM-DLM outperforms MolT5-Base, an autoregressive model, without the need for additional data resources. Our findings underscore the remarkable effectiveness of TGM-DLM in generating cohe",
    "path": "papers/24/02/2402.13040.json",
    "total_tokens": 873,
    "translated_title": "用扩散语言模型进行文本引导的分子生成",
    "translated_abstract": "文本引导的分子生成是一个任务，其中生成的分子与特定的文本描述相匹配。最近，大多数现有基于SMILES的分子生成方法依赖于自回归架构。在这项工作中，我们提出了一种名为Text-Guided Molecule Generation with Diffusion Language Model（TGM-DLM）的新方法，它利用扩散模型来解决自回归方法的局限性。TGM-DLM集体和迭代地更新SMILES字符串中的标记嵌入，使用两阶段扩散生成过程。第一阶段通过随机噪声从文本描述中引导来优化嵌入，而第二阶段纠正无效的SMILES字符串以形成有效的分子表示。我们证明，TGM-DLM在不需要额外数据资源的情况下，胜过了自回归模型MolT5-Base。我们的研究结果强调了TGM-DLM在生成连贯性方面的显著有效性。",
    "tldr": "提出了一种名为Text-Guided Molecule Generation with Diffusion Language Model（TGM-DLM）的新方法，通过扩散模型进行文本引导的分子生成，在生成有效分子表示方面表现出显著的效果优于自回归模型MolT5-Base。",
    "en_tdlr": "Introduced a novel approach called Text-Guided Molecule Generation with Diffusion Language Model (TGM-DLM) for text-guided molecule generation, which outperforms autoregressive model MolT5-Base in generating effective molecular representations."
}