{
    "title": "UniVS: Unified and Universal Video Segmentation with Prompts as Queries",
    "abstract": "arXiv:2402.18115v1 Announce Type: cross  Abstract: Despite the recent advances in unified image segmentation (IS), developing a unified video segmentation (VS) model remains a challenge. This is mainly because generic category-specified VS tasks need to detect all objects and track them across consecutive frames, while prompt-guided VS tasks require re-identifying the target with visual/text prompts throughout the entire video, making it hard to handle the different tasks with the same architecture. We make an attempt to address these issues and present a novel unified VS architecture, namely UniVS, by using prompts as queries. UniVS averages the prompt features of the target from previous frames as its initial query to explicitly decode masks, and introduces a target-wise prompt cross-attention layer in the mask decoder to integrate prompt features in the memory pool. By taking the predicted masks of entities from previous frames as their visual prompts, UniVS converts different VS ta",
    "link": "https://arxiv.org/abs/2402.18115",
    "context": "Title: UniVS: Unified and Universal Video Segmentation with Prompts as Queries\nAbstract: arXiv:2402.18115v1 Announce Type: cross  Abstract: Despite the recent advances in unified image segmentation (IS), developing a unified video segmentation (VS) model remains a challenge. This is mainly because generic category-specified VS tasks need to detect all objects and track them across consecutive frames, while prompt-guided VS tasks require re-identifying the target with visual/text prompts throughout the entire video, making it hard to handle the different tasks with the same architecture. We make an attempt to address these issues and present a novel unified VS architecture, namely UniVS, by using prompts as queries. UniVS averages the prompt features of the target from previous frames as its initial query to explicitly decode masks, and introduces a target-wise prompt cross-attention layer in the mask decoder to integrate prompt features in the memory pool. By taking the predicted masks of entities from previous frames as their visual prompts, UniVS converts different VS ta",
    "path": "papers/24/02/2402.18115.json",
    "total_tokens": 878,
    "translated_title": "UniVS：使用提示作为查询的统一和通用视频分割",
    "translated_abstract": "尽管统一图像分割（IS）取得了最新进展，但开发统一的视频分割（VS）模型仍然是一项挑战。这主要是因为通用类别指定的VS任务需要检测所有对象并跟踪它们跨连续帧，而由提示引导的VS任务需要在整个视频中重新识别目标并使用视觉/文本提示，使得用相同架构处理不同任务变得困难。我们试图解决这些问题，并提出了一种新颖的统一VS架构，即UniVS，通过使用提示作为查询。UniVS将前一帧中目标的提示特征作为其初始查询平均化，以明确解码掩码，并在掩码解码器中引入基于目标的提示交叉注意层，以在内存池中整合提示特征。通过将先前帧中的实体的预测掩码作为它们的视觉提示，UniVS将不同的VS任务转换成通用的VS问题。",
    "tldr": "UniVS提出了使用提示作为查询的统一视频分割架构，通过平均化前一帧中目标的提示特征来解码掩码，并引入了基于目标的提示交叉注意层，从而解决了统一视频分割模型的挑战。",
    "en_tdlr": "UniVS introduces a unified video segmentation architecture that uses prompts as queries, decoding masks by averaging the prompt features of the target from previous frames and integrating prompt features with a target-wise prompt cross-attention layer, thus addressing the challenge of developing a unified video segmentation model."
}