{
    "title": "XAI for Skin Cancer Detection with Prototypes and Non-Expert Supervision",
    "abstract": "Skin cancer detection through dermoscopy image analysis is a critical task. However, existing models used for this purpose often lack interpretability and reliability, raising the concern of physicians due to their black-box nature. In this paper, we propose a novel approach for the diagnosis of melanoma using an interpretable prototypical-part model. We introduce a guided supervision based on non-expert feedback through the incorporation of: 1) binary masks, obtained automatically using a segmentation network; and 2) user-refined prototypes. These two distinct information pathways aim to ensure that the learned prototypes correspond to relevant areas within the skin lesion, excluding confounding factors beyond its boundaries. Experimental results demonstrate that, even without expert supervision, our approach achieves superior performance and generalization compared to non-interpretable models.",
    "link": "https://rss.arxiv.org/abs/2402.01410",
    "context": "Title: XAI for Skin Cancer Detection with Prototypes and Non-Expert Supervision\nAbstract: Skin cancer detection through dermoscopy image analysis is a critical task. However, existing models used for this purpose often lack interpretability and reliability, raising the concern of physicians due to their black-box nature. In this paper, we propose a novel approach for the diagnosis of melanoma using an interpretable prototypical-part model. We introduce a guided supervision based on non-expert feedback through the incorporation of: 1) binary masks, obtained automatically using a segmentation network; and 2) user-refined prototypes. These two distinct information pathways aim to ensure that the learned prototypes correspond to relevant areas within the skin lesion, excluding confounding factors beyond its boundaries. Experimental results demonstrate that, even without expert supervision, our approach achieves superior performance and generalization compared to non-interpretable models.",
    "path": "papers/24/02/2402.01410.json",
    "total_tokens": 779,
    "translated_title": "使用原型和非专家监督的XAI对皮肤癌的检测",
    "translated_abstract": "通过皮肤镜图像分析进行皮肤癌检测是一个关键的任务。然而，现有用于此目的的模型往往缺乏解释性和可靠性，由于它们的黑盒性质引起了医生的担忧。在本文中，我们提出了一种新颖的方法，利用可解释的原型-部分模型进行黑素瘤诊断。我们通过结合两种不同的信息路径引入了基于非专家反馈的引导性监督：1) 使用分割网络自动获取的二进制掩模；2) 用户优化的原型。这两个不同的信息路径旨在确保学习到的原型与皮肤病变的相关区域相对应，排除其边界之外的混淆因素。实验结果表明，即使没有专家监督，我们的方法在性能和泛化能力上都优于不可解释的模型。",
    "tldr": "本研究提出了一种用于黑素瘤诊断的新方法，通过使用可解释的原型-部分模型以及结合基于非专家反馈的引导性监督，实现了优于不可解释的模型的性能和泛化能力。"
}