{
    "title": "Hybrid Square Neural ODE Causal Modeling",
    "abstract": "arXiv:2402.17233v1 Announce Type: new  Abstract: Hybrid models combine mechanistic ODE-based dynamics with flexible and expressive neural network components. Such models have grown rapidly in popularity, especially in scientific domains where such ODE-based modeling offers important interpretability and validated causal grounding (e.g., for counterfactual reasoning). The incorporation of mechanistic models also provides inductive bias in standard blackbox modeling approaches, critical when learning from small datasets or partially observed, complex systems. Unfortunately, as hybrid models become more flexible, the causal grounding provided by the mechanistic model can quickly be lost. We address this problem by leveraging another common source of domain knowledge: ranking of treatment effects for a set of interventions, even if the precise treatment effect is unknown. We encode this information in a causal loss that we combine with the standard predictive loss to arrive at a hybrid los",
    "link": "https://arxiv.org/abs/2402.17233",
    "context": "Title: Hybrid Square Neural ODE Causal Modeling\nAbstract: arXiv:2402.17233v1 Announce Type: new  Abstract: Hybrid models combine mechanistic ODE-based dynamics with flexible and expressive neural network components. Such models have grown rapidly in popularity, especially in scientific domains where such ODE-based modeling offers important interpretability and validated causal grounding (e.g., for counterfactual reasoning). The incorporation of mechanistic models also provides inductive bias in standard blackbox modeling approaches, critical when learning from small datasets or partially observed, complex systems. Unfortunately, as hybrid models become more flexible, the causal grounding provided by the mechanistic model can quickly be lost. We address this problem by leveraging another common source of domain knowledge: ranking of treatment effects for a set of interventions, even if the precise treatment effect is unknown. We encode this information in a causal loss that we combine with the standard predictive loss to arrive at a hybrid los",
    "path": "papers/24/02/2402.17233.json",
    "total_tokens": 874,
    "translated_title": "混合方块神经ODE因果建模",
    "translated_abstract": "混合模型将基于ODE的机械动力学与灵活且表达力强的神经网络组件结合起来。这种模型在科学领域越来越受欢迎，特别是在ODE-based建模提供重要解释性和经过验证的因果基础（例如，用于反事实推理）的领域。将机械模型纳入也为标准黑箱建模方法提供了归纳偏差，这在从小型数据集或部分观察到的复杂系统中学习时至关重要。不幸的是，随着混合模型变得更加灵活，机械模型提供的因果基础很快会丢失。我们通过利用另一个常见的领域知识来源来解决这个问题：对一组干预的治疗效果进行排名，即使准确的治疗效果不知道。我们在因果损失中编码这些信息，将其与标准预测损失相结合，得出混合损失。",
    "tldr": "混合模型将基于ODE的机械动力学与神经网络组件结合，在解释性和因果基础的同时，利用领域知识对治疗效果进行排名，从而解决灵活性增加带来的因果基础丢失问题。",
    "en_tdlr": "Hybrid models combine mechanistic ODE-based dynamics with neural network components to maintain interpretability and causal grounding, while leveraging domain knowledge to rank treatment effects and address the issue of causal grounding loss with increased flexibility."
}