{
    "title": "It's Never Too Late: Fusing Acoustic Information into Large Language Models for Automatic Speech Recognition",
    "abstract": "Recent studies have successfully shown that large language models (LLMs) can be successfully used for generative error correction (GER) on top of the automatic speech recognition (ASR) output. Specifically, an LLM is utilized to carry out a direct mapping from the N-best hypotheses list generated by an ASR system to the predicted output transcription. However, despite its effectiveness, GER introduces extra data uncertainty since the LLM is trained without taking into account acoustic information available in the speech signal. In this work, we aim to overcome such a limitation by infusing acoustic information before generating the predicted transcription through a novel late fusion solution termed Uncertainty-Aware Dynamic Fusion (UADF). UADF is a multimodal fusion approach implemented into an auto-regressive decoding process and works in two stages: (i) It first analyzes and calibrates the token-level LLM decision, and (ii) it then dynamically assimilates the information from the aco",
    "link": "https://arxiv.org/abs/2402.05457",
    "context": "Title: It's Never Too Late: Fusing Acoustic Information into Large Language Models for Automatic Speech Recognition\nAbstract: Recent studies have successfully shown that large language models (LLMs) can be successfully used for generative error correction (GER) on top of the automatic speech recognition (ASR) output. Specifically, an LLM is utilized to carry out a direct mapping from the N-best hypotheses list generated by an ASR system to the predicted output transcription. However, despite its effectiveness, GER introduces extra data uncertainty since the LLM is trained without taking into account acoustic information available in the speech signal. In this work, we aim to overcome such a limitation by infusing acoustic information before generating the predicted transcription through a novel late fusion solution termed Uncertainty-Aware Dynamic Fusion (UADF). UADF is a multimodal fusion approach implemented into an auto-regressive decoding process and works in two stages: (i) It first analyzes and calibrates the token-level LLM decision, and (ii) it then dynamically assimilates the information from the aco",
    "path": "papers/24/02/2402.05457.json",
    "total_tokens": 1014,
    "translated_title": "永远不嫌晚：将声学信息融入大型语言模型以进行自动语音识别",
    "translated_abstract": "最近的研究成功地表明，大型语言模型（LLM）可以成功用于在自动语音识别（ASR）输出之上进行生成性错误纠正（GER）。具体而言，LLM被用于对由ASR系统生成的N最佳假设列表进行直接映射，生成预测的输出转录。然而，尽管其有效性，GER引入了额外的数据不确定性，因为LLM在训练时没有考虑到语音信号中可用的声学信息。在这项工作中，我们旨在通过一种名为不确定性感知动态融合（UADF）的新型后期融合解决方案，通过注入声学信息以生成预测转录来克服这种限制。UADF是一种多模态融合方法，实现在自回归解码过程中，并分为两个阶段：（i）它首先分析和校准标记级LLM决策，然后（ii）它动态地吸收声学信息。",
    "tldr": "本论文通过将声学信息融入大型语言模型（LLM）中，提出了一种名为不确定性感知动态融合（UADF）的后期融合解决方案，以克服生成性错误纠正（GER）中存在的数据不确定性问题，并应用于自动语音识别（ASR）任务。通过在自回归解码过程中实施UADF方法，在LLM决策的标记级分析和校准的基础上，动态地融合声学信息，从而提高了ASR的准确性。",
    "en_tdlr": "This paper proposes a late fusion solution called Uncertainty-Aware Dynamic Fusion (UADF) for generative error correction (GER) in automatic speech recognition (ASR) by incorporating acoustic information into large language models (LLMs) to overcome the uncertainty introduced by GER. The UADF method improves ASR accuracy by dynamically fusing acoustic information based on token-level LLM analysis and calibration during the auto-regressive decoding process."
}