{
    "title": "Reconstructing the Geometry of Random Geometric Graphs",
    "abstract": "arXiv:2402.09591v1 Announce Type: new  Abstract: Random geometric graphs are random graph models defined on metric spaces. Such a model is defined by first sampling points from a metric space and then connecting each pair of sampled points with probability that depends on their distance, independently among pairs. In this work, we show how to efficiently reconstruct the geometry of the underlying space from the sampled graph under the manifold assumption, i.e., assuming that the underlying space is a low dimensional manifold and that the connection probability is a strictly decreasing function of the Euclidean distance between the points in a given embedding of the manifold in $\\mathbb{R}^N$. Our work complements a large body of work on manifold learning, where the goal is to recover a manifold from sampled points sampled in the manifold along with their (approximate) distances.",
    "link": "https://arxiv.org/abs/2402.09591",
    "context": "Title: Reconstructing the Geometry of Random Geometric Graphs\nAbstract: arXiv:2402.09591v1 Announce Type: new  Abstract: Random geometric graphs are random graph models defined on metric spaces. Such a model is defined by first sampling points from a metric space and then connecting each pair of sampled points with probability that depends on their distance, independently among pairs. In this work, we show how to efficiently reconstruct the geometry of the underlying space from the sampled graph under the manifold assumption, i.e., assuming that the underlying space is a low dimensional manifold and that the connection probability is a strictly decreasing function of the Euclidean distance between the points in a given embedding of the manifold in $\\mathbb{R}^N$. Our work complements a large body of work on manifold learning, where the goal is to recover a manifold from sampled points sampled in the manifold along with their (approximate) distances.",
    "path": "papers/24/02/2402.09591.json",
    "total_tokens": 862,
    "translated_title": "重构随机几何图的几何形状",
    "translated_abstract": "随机几何图是在度量空间上定义的随机图模型。该模型首先从度量空间中采样点，然后以依赖于它们之间距离的概率独立地连接每对采样点。在本工作中，我们展示了如何在流形假设下有效地从采样的图中重构底层空间的几何形状，即假设底层空间是低维流形，并且连接概率是嵌入在$\\mathbb{R}^N$中的流形中点之间欧几里德距离的严格递减函数。我们的工作补充了大量关于流形学习的工作，其目标是从在流形中采样的点及其（近似的）距离中恢复出流形。",
    "tldr": "该论文通过在底层空间中采样的图来有效地重构随机几何图的几何形状。该方法基于流形假设，即底层空间是低维流形，并且连接概率是嵌入在$\\mathbb{R}^N$中的流形中点之间欧几里德距离的严格递减函数。"
}