{
    "title": "Oracle-Efficient Differentially Private Learning with Public Data",
    "abstract": "arXiv:2402.09483v1 Announce Type: cross  Abstract: Due to statistical lower bounds on the learnability of many function classes under privacy constraints, there has been recent interest in leveraging public data to improve the performance of private learning algorithms. In this model, algorithms must always guarantee differential privacy with respect to the private samples while also ensuring learning guarantees when the private data distribution is sufficiently close to that of the public data. Previous work has demonstrated that when sufficient public, unlabelled data is available, private learning can be made statistically tractable, but the resulting algorithms have all been computationally inefficient. In this work, we present the first computationally efficient, algorithms to provably leverage public data to learn privately whenever a function class is learnable non-privately, where our notion of computational efficiency is with respect to the number of calls to an optimization o",
    "link": "https://arxiv.org/abs/2402.09483",
    "context": "Title: Oracle-Efficient Differentially Private Learning with Public Data\nAbstract: arXiv:2402.09483v1 Announce Type: cross  Abstract: Due to statistical lower bounds on the learnability of many function classes under privacy constraints, there has been recent interest in leveraging public data to improve the performance of private learning algorithms. In this model, algorithms must always guarantee differential privacy with respect to the private samples while also ensuring learning guarantees when the private data distribution is sufficiently close to that of the public data. Previous work has demonstrated that when sufficient public, unlabelled data is available, private learning can be made statistically tractable, but the resulting algorithms have all been computationally inefficient. In this work, we present the first computationally efficient, algorithms to provably leverage public data to learn privately whenever a function class is learnable non-privately, where our notion of computational efficiency is with respect to the number of calls to an optimization o",
    "path": "papers/24/02/2402.09483.json",
    "total_tokens": 775,
    "translated_title": "具有公共数据的Oracle-Efficient差分隐私学习",
    "translated_abstract": "由于在隐私约束下许多函数类的可学习性的统计下限，最近出现了利用公共数据提高私有学习算法性能的兴趣。在这种模型中，算法必须始终保证相对于私有样本的差分隐私，并在私有数据分布与公共数据分布足够接近时确保学习保证。先前的研究表明，当有足够的公共非标记数据时，可以使私有学习在统计上可以处理，但得到的算法都是计算效率低下的。在这项工作中，我们提出了第一种可计算高效的算法，可以在函数类可非私有学习时明确利用公共数据进行私有学习，其中我们对计算效率的概念是相对于优化调用次数的。",
    "tldr": "这项研究提出了一种具有公共数据的计算高效算法，可以在满足差分隐私条件的情况下学习私有数据，以提高学习算法性能。",
    "en_tdlr": "This study presents a computationally efficient algorithm that leverages public data to improve the performance of private learning algorithms while ensuring differential privacy constraints."
}