{
    "title": "VEC-SBM: Optimal Community Detection with Vectorial Edges Covariates",
    "abstract": "arXiv:2402.18805v1 Announce Type: cross  Abstract: Social networks are often associated with rich side information, such as texts and images. While numerous methods have been developed to identify communities from pairwise interactions, they usually ignore such side information. In this work, we study an extension of the Stochastic Block Model (SBM), a widely used statistical framework for community detection, that integrates vectorial edges covariates: the Vectorial Edges Covariates Stochastic Block Model (VEC-SBM). We propose a novel algorithm based on iterative refinement techniques and show that it optimally recovers the latent communities under the VEC-SBM. Furthermore, we rigorously assess the added value of leveraging edge's side information in the community detection process. We complement our theoretical results with numerical experiments on synthetic and semi-synthetic data.",
    "link": "https://arxiv.org/abs/2402.18805",
    "context": "Title: VEC-SBM: Optimal Community Detection with Vectorial Edges Covariates\nAbstract: arXiv:2402.18805v1 Announce Type: cross  Abstract: Social networks are often associated with rich side information, such as texts and images. While numerous methods have been developed to identify communities from pairwise interactions, they usually ignore such side information. In this work, we study an extension of the Stochastic Block Model (SBM), a widely used statistical framework for community detection, that integrates vectorial edges covariates: the Vectorial Edges Covariates Stochastic Block Model (VEC-SBM). We propose a novel algorithm based on iterative refinement techniques and show that it optimally recovers the latent communities under the VEC-SBM. Furthermore, we rigorously assess the added value of leveraging edge's side information in the community detection process. We complement our theoretical results with numerical experiments on synthetic and semi-synthetic data.",
    "path": "papers/24/02/2402.18805.json",
    "total_tokens": 834,
    "translated_title": "VEC-SBM：具有向量边缘协变量的最优社区检测",
    "translated_abstract": "社交网络通常与丰富的边缘信息相关联，例如文本和图像。虽然已经开发了许多方法来从成对互动中识别社区，但它们通常忽略了这种边缘信息。在这项工作中，我们研究了随机块模型（SBM）的扩展，这是一种广泛用于社区检测的统计框架，它集成了向量边缘协变量：向量边缘协变量随机块模型（VEC-SBM）。我们提出了一种基于迭代细化技术的新算法，并展示了它在VEC-SBM下的最优恢复潜在社区的能力。此外，我们严格评估了在社区检测过程中利用边缘信息的附加价值。我们通过对合成和半合成数据进行数值实验来补充我们的理论结果。",
    "tldr": "该论文介绍了一种名为VEC-SBM的算法，可以在社交网络中使用向量边缘协变量来最优地检测社区，证明了在社区检测过程中利用边缘信息的附加价值。",
    "en_tdlr": "This paper presents an algorithm called VEC-SBM which optimally detects communities in social networks using vectorial edges covariates, demonstrating the added value of leveraging edge's side information in the community detection process."
}