{
    "title": "AMOR: A Recipe for Building Adaptable Modular Knowledge Agents Through Process Feedback",
    "abstract": "The notable success of large language models (LLMs) has sparked an upsurge in building language agents to complete various complex tasks. We present AMOR, an agent framework based on open-source LLMs, which reasons with external knowledge bases and adapts to specific domains through human supervision to the reasoning process. AMOR builds reasoning logic over a finite state machine (FSM) that solves problems through autonomous executions and transitions over disentangled modules. This allows humans to provide direct feedback to the individual modules, and thus naturally forms process supervision. Based on this reasoning and feedback framework, we develop AMOR through two-stage fine-tuning: warm-up and adaptation. The former fine-tunes the LLM with examples automatically constructed from various public datasets and enables AMOR to generalize across different knowledge environments, while the latter tailors AMOR to specific domains using process feedback. Extensive experiments across mult",
    "link": "https://rss.arxiv.org/abs/2402.01469",
    "context": "Title: AMOR: A Recipe for Building Adaptable Modular Knowledge Agents Through Process Feedback\nAbstract: The notable success of large language models (LLMs) has sparked an upsurge in building language agents to complete various complex tasks. We present AMOR, an agent framework based on open-source LLMs, which reasons with external knowledge bases and adapts to specific domains through human supervision to the reasoning process. AMOR builds reasoning logic over a finite state machine (FSM) that solves problems through autonomous executions and transitions over disentangled modules. This allows humans to provide direct feedback to the individual modules, and thus naturally forms process supervision. Based on this reasoning and feedback framework, we develop AMOR through two-stage fine-tuning: warm-up and adaptation. The former fine-tunes the LLM with examples automatically constructed from various public datasets and enables AMOR to generalize across different knowledge environments, while the latter tailors AMOR to specific domains using process feedback. Extensive experiments across mult",
    "path": "papers/24/02/2402.01469.json",
    "total_tokens": 899,
    "translated_title": "AMOR:通过进程反馈构建适应性模块化知识代理的方法",
    "translated_abstract": "大型语言模型（LLM）的显著成功引发了构建语言代理完成各种复杂任务的高潮。我们提出了基于开源LLM的代理框架AMOR，通过与外部知识库进行推理并通过人类监督来适应特定领域的推理过程。AMOR在有限状态机（FSM）上构建推理逻辑，通过自主执行和模块间转换解决问题。这使人们能够直接为单个模块提供反馈，从而自然形成了过程监督。基于这个推理和反馈框架，我们通过两阶段的微调开发了AMOR：预热和适应。前者使用从各种公共数据集自动构建的示例对LLM进行微调，使AMOR能够在不同的知识环境中泛化，后者使用过程反馈将AMOR量身定制到特定领域。在多个领域上进行了广泛的实验。",
    "tldr": "AMOR是一个基于开源LLM的代理框架，通过与外部知识库进行推理和人类监督来适应特定领域的推理过程。通过两阶段的微调，AMOR能够在不同知识环境中泛化，并且可以根据过程反馈进行领域定制。",
    "en_tdlr": "AMOR is an agent framework based on open-source LLMs, which adapts to specific domains through reasoning with external knowledge bases and human supervision. Through two-stage fine-tuning, AMOR can generalize across different knowledge environments and be tailored to specific domains based on process feedback."
}