{
    "title": "Exploring higher-order neural network node interactions with total correlation",
    "abstract": "In domains such as ecological systems, collaborations, and the human brain the variables interact in complex ways. Yet accurately characterizing higher-order variable interactions (HOIs) is a difficult problem that is further exacerbated when the HOIs change across the data. To solve this problem we propose a new method called Local Correlation Explanation (CorEx) to capture HOIs at a local scale by first clustering data points based on their proximity on the data manifold. We then use a multivariate version of the mutual information called the total correlation, to construct a latent factor representation of the data within each cluster to learn the local HOIs. We use Local CorEx to explore HOIs in synthetic and real world data to extract hidden insights about the data structure. Lastly, we demonstrate Local CorEx's suitability to explore and interpret the inner workings of trained neural networks.",
    "link": "https://arxiv.org/abs/2402.04440",
    "context": "Title: Exploring higher-order neural network node interactions with total correlation\nAbstract: In domains such as ecological systems, collaborations, and the human brain the variables interact in complex ways. Yet accurately characterizing higher-order variable interactions (HOIs) is a difficult problem that is further exacerbated when the HOIs change across the data. To solve this problem we propose a new method called Local Correlation Explanation (CorEx) to capture HOIs at a local scale by first clustering data points based on their proximity on the data manifold. We then use a multivariate version of the mutual information called the total correlation, to construct a latent factor representation of the data within each cluster to learn the local HOIs. We use Local CorEx to explore HOIs in synthetic and real world data to extract hidden insights about the data structure. Lastly, we demonstrate Local CorEx's suitability to explore and interpret the inner workings of trained neural networks.",
    "path": "papers/24/02/2402.04440.json",
    "total_tokens": 903,
    "translated_title": "探索具有总相关性的高阶神经网络节点交互",
    "translated_abstract": "在生态系统、协作和人脑等领域中，变量以复杂的方式相互作用。然而，准确地描述高阶变量之间的交互是一个困难的问题，尤其是当这些交互随着数据的变化而改变时。为了解决这个问题，我们提出了一种名为局部相关性解释（CorEx）的新方法，通过首先基于数据流形上的距离来对数据点进行聚类，从而在局部尺度上捕获高阶交互。然后，我们使用一种称为总相关性的多元互信息的变体来构建数据在每个聚类中的潜在因子表示，以学习局部的交互。我们使用局部相关性解释来探索合成和真实世界数据中的高阶交互，以提取关于数据结构的隐藏洞察力。最后，我们展示了局部相关性解释的适用性，用于探索和解释训练好的神经网络的内部运作。",
    "tldr": "本文提出了一种名为局部相关性解释的新方法，通过基于数据流形上的距离进行聚类，并使用总相关性来捕获高阶变量之间的交互。通过在合成和真实世界数据中应用该方法，可以提取关于数据结构的隐藏洞察力，并用于探索和解释神经网络的内部运作。",
    "en_tdlr": "This paper proposes a new method called Local Correlation Explanation (CorEx) to capture higher-order variable interactions by clustering data points based on their proximity on the data manifold and using total correlation. It extracts hidden insights about the data structure and can be used to explore and interpret the inner workings of neural networks."
}