{
    "title": "Multi-Hierarchical Surrogate Learning for Structural Dynamics of Automotive Crashworthiness Using Graph Convolutional Neural Networks",
    "abstract": "arXiv:2402.09234v1 Announce Type: new Abstract: Crash simulations play an essential role in improving vehicle safety, design optimization, and injury risk estimation. Unfortunately, numerical solutions of such problems using state-of-the-art high-fidelity models require significant computational effort. Conventional data-driven surrogate modeling approaches create low-dimensional embeddings for evolving the dynamics in order to circumvent this computational effort. Most approaches directly operate on high-resolution data obtained from numerical discretization, which is both costly and complicated for mapping the flow of information over large spatial distances. Furthermore, working with a fixed resolution prevents the adaptation of surrogate models to environments with variable computing capacities, different visualization resolutions, and different accuracy requirements. We thus propose a multi-hierarchical framework for structurally creating a series of surrogate models for a kart fr",
    "link": "https://arxiv.org/abs/2402.09234",
    "context": "Title: Multi-Hierarchical Surrogate Learning for Structural Dynamics of Automotive Crashworthiness Using Graph Convolutional Neural Networks\nAbstract: arXiv:2402.09234v1 Announce Type: new Abstract: Crash simulations play an essential role in improving vehicle safety, design optimization, and injury risk estimation. Unfortunately, numerical solutions of such problems using state-of-the-art high-fidelity models require significant computational effort. Conventional data-driven surrogate modeling approaches create low-dimensional embeddings for evolving the dynamics in order to circumvent this computational effort. Most approaches directly operate on high-resolution data obtained from numerical discretization, which is both costly and complicated for mapping the flow of information over large spatial distances. Furthermore, working with a fixed resolution prevents the adaptation of surrogate models to environments with variable computing capacities, different visualization resolutions, and different accuracy requirements. We thus propose a multi-hierarchical framework for structurally creating a series of surrogate models for a kart fr",
    "path": "papers/24/02/2402.09234.json",
    "total_tokens": 896,
    "translated_title": "使用图卷积神经网络的汽车碰撞安全结构动力学的多层次代理学习",
    "translated_abstract": "碰撞仿真在提高车辆安全性、设计优化和伤害风险估计方面发挥着重要作用。然而，使用最先进的高保真模型进行这类问题的数值解需要大量的计算工作。传统的数据驱动代理建模方法通过创建低维嵌入来演化动力学，以规避这种计算工作。大多数方法直接在从数值离散化获取的高分辨率数据上操作，这既昂贵又复杂，无法在大范围的空间距离上映射信息流动。此外，使用固定分辨率的方法阻止了代理模型对计算能力环境、不同的可视化分辨率和不同的精确度要求进行自适应。因此，我们提出了一个多层次框架，用于结构化地创建一系列用于卡丁车碰撞安全性的代理模型。",
    "tldr": "该论文提出了使用图卷积神经网络的多层次代理学习框架，用于汽车碰撞安全结构动力学研究。该框架能够通过创建一系列适应不同计算环境和准确度要求的代理模型，从而提高碰撞仿真的效率和精确度。",
    "en_tdlr": "This paper introduces a multi-hierarchical surrogate learning framework using graph convolutional neural networks for studying the structural dynamics of automotive crashworthiness. The framework improves the efficiency and accuracy of crash simulations by creating a series of surrogate models that adapt to different computing environments and accuracy requirements."
}