{
    "title": "Spiking CenterNet: A Distillation-boosted Spiking Neural Network for Object Detection",
    "abstract": "In the era of AI at the edge, self-driving cars, and climate change, the need for energy-efficient, small, embedded AI is growing. Spiking Neural Networks (SNNs) are a promising approach to address this challenge, with their event-driven information flow and sparse activations. We propose Spiking CenterNet for object detection on event data. It combines an SNN CenterNet adaptation with an efficient M2U-Net-based decoder. Our model significantly outperforms comparable previous work on Prophesee's challenging GEN1 Automotive Detection Dataset while using less than half the energy. Distilling the knowledge of a non-spiking teacher into our SNN further increases performance. To the best of our knowledge, our work is the first approach that takes advantage of knowledge distillation in the field of spiking object detection.",
    "link": "https://rss.arxiv.org/abs/2402.01287",
    "context": "Title: Spiking CenterNet: A Distillation-boosted Spiking Neural Network for Object Detection\nAbstract: In the era of AI at the edge, self-driving cars, and climate change, the need for energy-efficient, small, embedded AI is growing. Spiking Neural Networks (SNNs) are a promising approach to address this challenge, with their event-driven information flow and sparse activations. We propose Spiking CenterNet for object detection on event data. It combines an SNN CenterNet adaptation with an efficient M2U-Net-based decoder. Our model significantly outperforms comparable previous work on Prophesee's challenging GEN1 Automotive Detection Dataset while using less than half the energy. Distilling the knowledge of a non-spiking teacher into our SNN further increases performance. To the best of our knowledge, our work is the first approach that takes advantage of knowledge distillation in the field of spiking object detection.",
    "path": "papers/24/02/2402.01287.json",
    "total_tokens": 897,
    "translated_title": "Spiking CenterNet:一种用于目标检测的蒸馏增强脉冲神经网络",
    "translated_abstract": "在边缘人工智能、自动驾驶汽车和气候变化时代，对于高效能量、小型化嵌入式人工智能的需求正在增长。脉冲神经网络（SNN）是一种解决这一挑战的有希望的方法，其具有事件驱动的信息流和稀疏激活的特点。我们提出了一种用于事件数据的目标检测的Spiking CenterNet。它将SNN CenterNet适应和高效的基于M2U-Net的解码器结合起来。我们的模型在Prophesee的具有挑战性的GEN1汽车检测数据集上表现优于可比较的先前工作，并且使用的能量不到一半。将非脉冲老师的知识蒸馏到我们的SNN中进一步提高了性能。据我们所知，我们的工作是脉冲目标检测领域首个利用知识蒸馏的方法。",
    "tldr": "Spiking CenterNet是一种利用脉冲神经网络和知识蒸馏相结合的新方法，用于高效能量、小型化嵌入式人工智能的目标检测。在挑战性的GEN1汽车检测数据集上，我们的模型使用的能量不到一半，表现超过了可比较的先前工作。",
    "en_tdlr": "Spiking CenterNet is a new approach that combines spiking neural networks and knowledge distillation for energy-efficient and small embedded AI object detection. Our model outperforms comparable previous work on challenging dataset while using less than half the energy."
}