{
    "title": "Intelligent Known and Novel Aircraft Recognition -- A Shift from Classification to Similarity Learning for Combat Identification",
    "abstract": "arXiv:2402.16486v1 Announce Type: cross  Abstract: Precise aircraft recognition in low-resolution remote sensing imagery is a challenging yet crucial task in aviation, especially combat identification. This research addresses this problem with a novel, scalable, and AI-driven solution. The primary hurdle in combat identification in remote sensing imagery is the accurate recognition of Novel/Unknown types of aircraft in addition to Known types. Traditional methods, human expert-driven combat identification and image classification, fall short in identifying Novel classes. Our methodology employs similarity learning to discern features of a broad spectrum of military and civilian aircraft. It discerns both Known and Novel aircraft types, leveraging metric learning for the identification and supervised few-shot learning for aircraft type classification. To counter the challenge of limited low-resolution remote sensing data, we propose an end-to-end framework that adapts to the diverse and",
    "link": "https://arxiv.org/abs/2402.16486",
    "context": "Title: Intelligent Known and Novel Aircraft Recognition -- A Shift from Classification to Similarity Learning for Combat Identification\nAbstract: arXiv:2402.16486v1 Announce Type: cross  Abstract: Precise aircraft recognition in low-resolution remote sensing imagery is a challenging yet crucial task in aviation, especially combat identification. This research addresses this problem with a novel, scalable, and AI-driven solution. The primary hurdle in combat identification in remote sensing imagery is the accurate recognition of Novel/Unknown types of aircraft in addition to Known types. Traditional methods, human expert-driven combat identification and image classification, fall short in identifying Novel classes. Our methodology employs similarity learning to discern features of a broad spectrum of military and civilian aircraft. It discerns both Known and Novel aircraft types, leveraging metric learning for the identification and supervised few-shot learning for aircraft type classification. To counter the challenge of limited low-resolution remote sensing data, we propose an end-to-end framework that adapts to the diverse and",
    "path": "papers/24/02/2402.16486.json",
    "total_tokens": 916,
    "translated_title": "智能飞机识别：从分类到相似度学习的转变，以用于作战识别",
    "translated_abstract": "在低分辨率遥感图像中精确识别飞机是航空领域面临的一项具有挑战性但至关重要的任务，尤其是在作战识别中。本研究提出了一种新颖、可扩展且基于人工智能的解决方案来解决这一问题。在遥感图像中进行作战识别的主要障碍是准确识别已知类型以及新颖/未知类型的飞机。传统方法、人类专家驱动的作战识别和图像分类在识别新颖类别方面存在不足。我们的方法利用相似度学习来区分广泛范围的军用和民用飞机的特征。它可以区分已知和新颖的飞机类型，利用度量学习进行识别和监督式少样本学习进行飞机类型分类。为了应对低分辨率遥感数据有限的挑战，我们提出了一个端到端的框架，以适应多样性和",
    "tldr": "这项研究提出了一种新颖、可扩展且基于人工智能的解决方案，采用相似度学习来区分广泛范围的军用和民用飞机特征，实现在遥感图像中准确识别已知和新颖飞机类型。",
    "en_tdlr": "This study proposes a novel, scalable, AI-driven solution that utilizes similarity learning to distinguish features of a wide range of military and civilian aircraft, enabling accurate recognition of both Known and Novel aircraft types in remote sensing imagery."
}