{
    "title": "Investigating Consistency in Query-Based Meeting Summarization: A Comparative Study of Different Embedding Methods",
    "abstract": "With more and more advanced data analysis techniques emerging, people will expect these techniques to be applied in more complex tasks and solve problems in our daily lives. Text Summarization is one of famous applications in Natural Language Processing (NLP) field. It aims to automatically generate summary with important information based on a given context, which is important when you have to deal with piles of documents. Summarization techniques can help capture key points in a short time and bring convenience in works. One of applicable situation is meeting summarization, especially for important meeting that tend to be long, complicated, multi-topic and multi-person. Therefore, when people want to review specific content from a meeting, it will be hard and time-consuming to find the related spans in the meeting transcript. However, most of previous works focus on doing summarization for newsletters, scientific articles...etc, which have a clear document structure and an official f",
    "link": "https://arxiv.org/abs/2402.06907",
    "context": "Title: Investigating Consistency in Query-Based Meeting Summarization: A Comparative Study of Different Embedding Methods\nAbstract: With more and more advanced data analysis techniques emerging, people will expect these techniques to be applied in more complex tasks and solve problems in our daily lives. Text Summarization is one of famous applications in Natural Language Processing (NLP) field. It aims to automatically generate summary with important information based on a given context, which is important when you have to deal with piles of documents. Summarization techniques can help capture key points in a short time and bring convenience in works. One of applicable situation is meeting summarization, especially for important meeting that tend to be long, complicated, multi-topic and multi-person. Therefore, when people want to review specific content from a meeting, it will be hard and time-consuming to find the related spans in the meeting transcript. However, most of previous works focus on doing summarization for newsletters, scientific articles...etc, which have a clear document structure and an official f",
    "path": "papers/24/02/2402.06907.json",
    "total_tokens": 875,
    "translated_title": "调查查询导向的会议摘要的一致性：不同嵌入方法的比较研究",
    "translated_abstract": "随着越来越多的先进数据分析技术的出现，人们希望这些技术能在更复杂的任务中应用，并解决我们日常生活中的问题。文本摘要是自然语言处理（NLP）领域中的一种著名应用，其旨在根据给定的上下文自动生成重要信息的摘要，当您必须处理大量文档时，这点尤为重要。摘要技术可以帮助快速捕捉关键点，并在工作中提供便利。其中一个适用的情况是会议摘要，特别是针对较长、复杂、多主题和多人参与的重要会议。因此，当人们想要从会议中审查特定内容时，将很难且耗时找到会议记录中的相关片段。然而，大部分先前的工作都集中在为新闻稿、科学文章等做摘要，这些文档具有明确的结构和官方的摘要。",
    "tldr": "本研究比较了不同嵌入方法在查询导向的会议摘要中的一致性，旨在解决复杂、多主题和多人参与的重要会议记录中的信息查找问题。",
    "en_tdlr": "This comparative study investigates the consistency of different embedding methods in query-based meeting summarization, aiming to address the information retrieval problem in complex, multi-topic, and multi-participant meeting transcripts."
}