{
    "title": "HIP Network: Historical Information Passing Network for Extrapolation Reasoning on Temporal Knowledge Graph",
    "abstract": "arXiv:2402.12074v1 Announce Type: new  Abstract: In recent years, temporal knowledge graph (TKG) reasoning has received significant attention. Most existing methods assume that all timestamps and corresponding graphs are available during training, which makes it difficult to predict future events. To address this issue, recent works learn to infer future events based on historical information. However, these methods do not comprehensively consider the latent patterns behind temporal changes, to pass historical information selectively, update representations appropriately and predict events accurately. In this paper, we propose the Historical Information Passing (HIP) network to predict future events. HIP network passes information from temporal, structural and repetitive perspectives, which are used to model the temporal evolution of events, the interactions of events at the same time step, and the known events respectively. In particular, our method considers the updating of relation ",
    "link": "https://arxiv.org/abs/2402.12074",
    "context": "Title: HIP Network: Historical Information Passing Network for Extrapolation Reasoning on Temporal Knowledge Graph\nAbstract: arXiv:2402.12074v1 Announce Type: new  Abstract: In recent years, temporal knowledge graph (TKG) reasoning has received significant attention. Most existing methods assume that all timestamps and corresponding graphs are available during training, which makes it difficult to predict future events. To address this issue, recent works learn to infer future events based on historical information. However, these methods do not comprehensively consider the latent patterns behind temporal changes, to pass historical information selectively, update representations appropriately and predict events accurately. In this paper, we propose the Historical Information Passing (HIP) network to predict future events. HIP network passes information from temporal, structural and repetitive perspectives, which are used to model the temporal evolution of events, the interactions of events at the same time step, and the known events respectively. In particular, our method considers the updating of relation ",
    "path": "papers/24/02/2402.12074.json",
    "total_tokens": 800,
    "translated_title": "HIP网络：用于时间知识图外推推理的历史信息传递网络",
    "translated_abstract": "近年来，时间知识图（TKG）推理受到了广泛关注。大多数现有方法假设在训练期间所有时间戳和相应的图形都是可用的，这使得难以预测未来事件。为了解决这个问题，最近的研究学习根据历史信息推断未来事件。然而，这些方法并未全面考虑时间变化背后的潜在模式，以选择性地传递历史信息，适当更新表示并准确预测事件。在本文中，我们提出了历史信息传递（HIP）网络来预测未来事件。HIP网络从时间、结构和重复的角度传递信息，用于模拟事件的时间演变、同一时间步中事件的相互作用以及已知事件。特别地，我们的方法考虑了关系的更新。",
    "tldr": "该论文提出了HIP网络，通过从时间性、结构性和重复性角度传递信息，综合考虑了时间变化背后的潜在模式，更新表示并准确预测未来事件。",
    "en_tdlr": "The paper introduces the HIP network, which passes information from temporal, structural, and repetitive perspectives, comprehensively considering the latent patterns behind temporal changes, updating representations, and accurately predicting future events."
}