{
    "title": "Multi-Fidelity Methods for Optimization: A Survey",
    "abstract": "arXiv:2402.09638v1 Announce Type: new  Abstract: Real-world black-box optimization often involves time-consuming or costly experiments and simulations. Multi-fidelity optimization (MFO) stands out as a cost-effective strategy that balances high-fidelity accuracy with computational efficiency through a hierarchical fidelity approach. This survey presents a systematic exploration of MFO, underpinned by a novel text mining framework based on a pre-trained language model. We delve deep into the foundational principles and methodologies of MFO, focusing on three core components -- multi-fidelity surrogate models, fidelity management strategies, and optimization techniques. Additionally, this survey highlights the diverse applications of MFO across several key domains, including machine learning, engineering design optimization, and scientific discovery, showcasing the adaptability and effectiveness of MFO in tackling complex computational challenges. Furthermore, we also envision several em",
    "link": "https://arxiv.org/abs/2402.09638",
    "context": "Title: Multi-Fidelity Methods for Optimization: A Survey\nAbstract: arXiv:2402.09638v1 Announce Type: new  Abstract: Real-world black-box optimization often involves time-consuming or costly experiments and simulations. Multi-fidelity optimization (MFO) stands out as a cost-effective strategy that balances high-fidelity accuracy with computational efficiency through a hierarchical fidelity approach. This survey presents a systematic exploration of MFO, underpinned by a novel text mining framework based on a pre-trained language model. We delve deep into the foundational principles and methodologies of MFO, focusing on three core components -- multi-fidelity surrogate models, fidelity management strategies, and optimization techniques. Additionally, this survey highlights the diverse applications of MFO across several key domains, including machine learning, engineering design optimization, and scientific discovery, showcasing the adaptability and effectiveness of MFO in tackling complex computational challenges. Furthermore, we also envision several em",
    "path": "papers/24/02/2402.09638.json",
    "total_tokens": 914,
    "translated_title": "多模态优化方法：一项调查",
    "translated_abstract": "真实世界中的黑盒优化往往涉及耗时或昂贵的实验和模拟。多模态优化(MFO)通过一种分层的忠诚度方法，以高模态准确性和计算效率平衡的成本效益策略而脱颖而出。本调查以一个基于预训练语言模型的新颖文本挖掘框架为基础，对 MFO 进行了系统的探索。我们深入研究了 MFO 的基本原理和方法，重点关注三个核心组成部分——多模态代理模型、忠诚度管理策略和优化技术。此外，本调查还突出了 MFO 在机器学习、工程设计优化和科学发现等多个关键领域的不同应用，展示了 MFO 在解决复杂计算挑战方面的适应性和效果。此外，我们还展望了几种应用 MFO 的未来研究方向。",
    "tldr": "多模态优化(MFO)是一种以高模态准确性和计算效率平衡的成本效益策略，通过多模态替代模型、忠诚度管理策略和优化技术来解决复杂计算挑战的方法。MFO在机器学习、工程设计优化和科学发现等多个关键领域有广泛应用的潜力。",
    "en_tdlr": "Multi-Fidelity Optimization (MFO) is a cost-effective strategy that balances high-fidelity accuracy with computational efficiency through multi-fidelity surrogate models, fidelity management strategies, and optimization techniques, addressing complex computational challenges. MFO has potential applications in various key domains such as machine learning, engineering design optimization, and scientific discovery."
}