{
    "title": "On Computationally Efficient Multi-Class Calibration",
    "abstract": "Consider a multi-class labelling problem, where the labels can take values in $[k]$, and a predictor predicts a distribution over the labels. In this work, we study the following foundational question: Are there notions of multi-class calibration that give strong guarantees of meaningful predictions and can be achieved in time and sample complexities polynomial in $k$? Prior notions of calibration exhibit a tradeoff between computational efficiency and expressivity: they either suffer from having sample complexity exponential in $k$, or needing to solve computationally intractable problems, or give rather weak guarantees.   Our main contribution is a notion of calibration that achieves all these desiderata: we formulate a robust notion of projected smooth calibration for multi-class predictions, and give new recalibration algorithms for efficiently calibrating predictors under this definition with complexity polynomial in $k$. Projected smooth calibration gives strong guarantees for al",
    "link": "https://arxiv.org/abs/2402.07821",
    "context": "Title: On Computationally Efficient Multi-Class Calibration\nAbstract: Consider a multi-class labelling problem, where the labels can take values in $[k]$, and a predictor predicts a distribution over the labels. In this work, we study the following foundational question: Are there notions of multi-class calibration that give strong guarantees of meaningful predictions and can be achieved in time and sample complexities polynomial in $k$? Prior notions of calibration exhibit a tradeoff between computational efficiency and expressivity: they either suffer from having sample complexity exponential in $k$, or needing to solve computationally intractable problems, or give rather weak guarantees.   Our main contribution is a notion of calibration that achieves all these desiderata: we formulate a robust notion of projected smooth calibration for multi-class predictions, and give new recalibration algorithms for efficiently calibrating predictors under this definition with complexity polynomial in $k$. Projected smooth calibration gives strong guarantees for al",
    "path": "papers/24/02/2402.07821.json",
    "total_tokens": 870,
    "translated_title": "论计算有效的多类别校准问题",
    "translated_abstract": "考虑一个多类别标记问题，其中标记可以在[1,k]范围内取值，而预测器预测的是标记的分布。在这项工作中，我们研究了以下基础问题：是否存在多类别校准的概念，可以给出对有意义的预测的强大保证，并且可以在多项式时间和样本复杂度下实现？先前的校准概念在计算效率和表达能力之间存在着权衡：它们要么在k的样本复杂度上呈指数级增长，要么需要求解计算难题，要么给出的保证相当弱。我们的主要贡献是提出了一种能够实现所有这些期望的校准概念：我们在多类别预测中制定了一个稳健的投影平滑校准概念，并给出了新的重新校准算法，以在这个定义下以多项式时间复杂度校准预测器。投影平滑校准为多类别预测提供了强大的保证。",
    "tldr": "提出了一种在多类别预测问题中多样化的投影平滑校准概念，并且给出了多项式时间复杂度的重新校准算法，从而实现了计算效率和强大的预测保证之间的权衡。",
    "en_tdlr": "Proposed a diversified notion of projected smooth calibration in multi-class predictions and presented recalibration algorithms with polynomial time complexity, achieving a tradeoff between computational efficiency and strong prediction guarantees."
}