{
    "title": "On Designing Features for Condition Monitoring of Rotating Machines",
    "abstract": "arXiv:2402.09957v1 Announce Type: new  Abstract: Various methods for designing input features have been proposed for fault recognition in rotating machines using one-dimensional raw sensor data. The available methods are complex, rely on empirical approaches, and may differ depending on the condition monitoring data used. Therefore, this article proposes a novel algorithm to design input features that unifies the feature extraction process for different time-series sensor data. This new insight for designing/extracting input features is obtained through the lens of histogram theory. The proposed algorithm extracts discriminative input features, which are suitable for a simple classifier to deep neural network-based classifiers. The designed input features are given as input to the classifier with end-to-end training in a single framework for machine conditions recognition. The proposed scheme has been validated through three real-time datasets: a) acoustic dataset, b) CWRU vibration da",
    "link": "https://arxiv.org/abs/2402.09957",
    "context": "Title: On Designing Features for Condition Monitoring of Rotating Machines\nAbstract: arXiv:2402.09957v1 Announce Type: new  Abstract: Various methods for designing input features have been proposed for fault recognition in rotating machines using one-dimensional raw sensor data. The available methods are complex, rely on empirical approaches, and may differ depending on the condition monitoring data used. Therefore, this article proposes a novel algorithm to design input features that unifies the feature extraction process for different time-series sensor data. This new insight for designing/extracting input features is obtained through the lens of histogram theory. The proposed algorithm extracts discriminative input features, which are suitable for a simple classifier to deep neural network-based classifiers. The designed input features are given as input to the classifier with end-to-end training in a single framework for machine conditions recognition. The proposed scheme has been validated through three real-time datasets: a) acoustic dataset, b) CWRU vibration da",
    "path": "papers/24/02/2402.09957.json",
    "total_tokens": 837,
    "translated_title": "设计旋转机械状态监测特征的研究",
    "translated_abstract": "有关使用一维原始传感器数据进行旋转机械故障识别，已经提出了各种设计输入特征的方法。现有方法复杂，依赖经验方法，并且可能因使用的条件监测数据而不同。因此，本文提出了一种新的算法，用于设计适用于不同时间序列传感器数据的输入特征抽取方法。这种新的特征设计/抽取方法是通过直方图理论获得的。所提出的算法提取具有鉴别性的输入特征，适用于简单分类器和深度神经网络分类器。设计的输入特征作为输入传递给端到端训练的分类器，用于单一框架下的机械状态识别。通过三个实时数据集验证了该方案：a) 声学数据集，b) CWRU振动数据集。",
    "tldr": "本文提出了一种新的算法，通过直方图理论设计出适用于不同时间序列传感器数据的输入特征抽取方法，为机械状态识别提供了一种统一的特征提取过程。",
    "en_tdlr": "This paper proposes a novel algorithm for designing input feature extraction methods for different time-series sensor data in the context of fault recognition in rotating machines. The algorithm, based on histogram theory, extracts discriminative input features suitable for both simple classifiers and deep neural network-based classifiers. This provides a unified feature extraction process for machine condition recognition."
}