{
    "title": "Extending Interactive Science Exhibits into the Classroom using Anthropomorphized Chatbots and Bloom's Taxonomy",
    "abstract": "This study explores the use of Generative AI chatbots for transforming public science exhibits into virtual experiences that can extend the engagement of exhibits into the classroom. The broader goal is to increase accessibility of science exhibits, especially for those marginalized in STEM due to various factors, including cultural barriers. We hypothesize that turning exhibits into first-person anthropomorphized chatbots with a personality, like quirky-talking asteroids or comets, can increase engagement and learning. The paper mainly explores if such techniques are possible using Generative AI (e.g. GPT) via prompt engineering alone. The research includes an investigation into the possibility of integrating interactive assessment via question-generation using Bloom's Taxonomy. Initial results indicate that it is possible to combine these techniques. As such, it lays a foundation for future classroom evaluations of such chatbots to gauge their overall efficacy in extending the reach ",
    "link": "https://arxiv.org/abs/2402.01770",
    "context": "Title: Extending Interactive Science Exhibits into the Classroom using Anthropomorphized Chatbots and Bloom's Taxonomy\nAbstract: This study explores the use of Generative AI chatbots for transforming public science exhibits into virtual experiences that can extend the engagement of exhibits into the classroom. The broader goal is to increase accessibility of science exhibits, especially for those marginalized in STEM due to various factors, including cultural barriers. We hypothesize that turning exhibits into first-person anthropomorphized chatbots with a personality, like quirky-talking asteroids or comets, can increase engagement and learning. The paper mainly explores if such techniques are possible using Generative AI (e.g. GPT) via prompt engineering alone. The research includes an investigation into the possibility of integrating interactive assessment via question-generation using Bloom's Taxonomy. Initial results indicate that it is possible to combine these techniques. As such, it lays a foundation for future classroom evaluations of such chatbots to gauge their overall efficacy in extending the reach ",
    "path": "papers/24/02/2402.01770.json",
    "total_tokens": 872,
    "translated_title": "将人格化聊天机器人和布鲁姆税目扩展到课堂上的互动科学展品",
    "translated_abstract": "本研究探讨了使用生成型人工智能聊天机器人将公共科学展品转化为虚拟体验，以扩展展品在课堂上的参与度。更广泛的目标是增加科学展品的可访问性，尤其是对那些由于各种因素，包括文化壁垒而边缘化在STEM领域的人群。我们假设将展品转化为第一人称人格化聊天机器人，具有个性，如古怪的对话小行星或彗星，可增加参与度和学习。本文主要探讨了仅通过提示工程使用生成型人工智能（如GPT）是否可能实现这些技术。研究包括对使用布鲁姆税目生成问题进行交互式评估的可能性的调查。初步结果表明，结合这些技术是可能的。因此，它为将来在课堂上评估这种聊天机器人的整体效力奠定了基础。",
    "tldr": "本研究探索了使用生成型人工智能聊天机器人将公共科学展品转化为虚拟体验，以提高展品在课堂上的可访问性和参与度。研究还发现使用布鲁姆税目生成问题的交互式评估可能与这些聊天机器人结合使用。"
}