{
    "title": "Estimation of Spectral Risk Measure for Left Truncated and Right Censored Data",
    "abstract": "arXiv:2402.14322v1 Announce Type: cross  Abstract: Left truncated and right censored data are encountered frequently in insurance loss data due to deductibles and policy limits. Risk estimation is an important task in insurance as it is a necessary step for determining premiums under various policy terms. Spectral risk measures are inherently coherent and have the benefit of connecting the risk measure to the user's risk aversion. In this paper we study the estimation of spectral risk measure based on left truncated and right censored data. We propose a non parametric estimator of spectral risk measure using the product limit estimator and establish the asymptotic normality for our proposed estimator. We also develop an Edgeworth expansion of our proposed estimator. The bootstrap is employed to approximate the distribution of our proposed estimator and shown to be second order ``accurate''. Monte Carlo studies are conducted to compare the proposed spectral risk measure estimator with t",
    "link": "https://arxiv.org/abs/2402.14322",
    "context": "Title: Estimation of Spectral Risk Measure for Left Truncated and Right Censored Data\nAbstract: arXiv:2402.14322v1 Announce Type: cross  Abstract: Left truncated and right censored data are encountered frequently in insurance loss data due to deductibles and policy limits. Risk estimation is an important task in insurance as it is a necessary step for determining premiums under various policy terms. Spectral risk measures are inherently coherent and have the benefit of connecting the risk measure to the user's risk aversion. In this paper we study the estimation of spectral risk measure based on left truncated and right censored data. We propose a non parametric estimator of spectral risk measure using the product limit estimator and establish the asymptotic normality for our proposed estimator. We also develop an Edgeworth expansion of our proposed estimator. The bootstrap is employed to approximate the distribution of our proposed estimator and shown to be second order ``accurate''. Monte Carlo studies are conducted to compare the proposed spectral risk measure estimator with t",
    "path": "papers/24/02/2402.14322.json",
    "total_tokens": 913,
    "translated_title": "对左截尾和右截尾数据的谱风险度量估计",
    "translated_abstract": "左截尾和右截尾数据在保险损失数据中经常遇到，这是由于免赔额和政策限额造成的。风险估计在保险业中是一项重要任务，因为它是确定各种政策条款下的保费的必要步骤。谱风险度量天生具有一致性，并且将风险度量与用户的风险厌恶联系起来。本文研究了基于左截尾和右截尾数据的谱风险度量的估计。我们提出了一个基于产品极限估计的谱风险度量的非参数估计，并为我们提出的估计量建立了渐近正态性。我们还开发了我们提出的估计量的Edgeworth展开。引入自举法来近似我们提出的估计量的分布，并显示其为二阶“准确”。进行蒙特卡洛研究来比较所提出的谱风险度量估计与t",
    "tldr": "本文提出了基于左截尾和右截尾数据的谱风险度量的估计方法，并建立了相应非参数估计的渐近正态性和Edgeworth展开，对估计量进行了自举法近似分布，并展示具有二阶“准确性”。",
    "en_tdlr": "This paper proposes an estimation method for spectral risk measure based on left truncated and right censored data, establishing asymptotic normality and Edgeworth expansion for the non-parametric estimator, employing bootstrap for distribution approximation with second order accuracy, and conducting Monte Carlo studies for comparison."
}