{
    "title": "Causal Learning for Trustworthy Recommender Systems: A Survey",
    "abstract": "Recommender Systems (RS) have significantly advanced online content discovery and personalized decision-making. However, emerging vulnerabilities in RS have catalyzed a paradigm shift towards Trustworthy RS (TRS). Despite numerous progress on TRS, most of them focus on data correlations while overlooking the fundamental causal nature in recommendation. This drawback hinders TRS from identifying the cause in addressing trustworthiness issues, leading to limited fairness, robustness, and explainability. To bridge this gap, causal learning emerges as a class of promising methods to augment TRS. These methods, grounded in reliable causality, excel in mitigating various biases and noises while offering insightful explanations for TRS. However, there lacks a timely survey in this vibrant area. This paper creates an overview of TRS from the perspective of causal learning. We begin by presenting the advantages and common procedures of Causality-oriented TRS (CTRS). Then, we identify potential ",
    "link": "https://arxiv.org/abs/2402.08241",
    "context": "Title: Causal Learning for Trustworthy Recommender Systems: A Survey\nAbstract: Recommender Systems (RS) have significantly advanced online content discovery and personalized decision-making. However, emerging vulnerabilities in RS have catalyzed a paradigm shift towards Trustworthy RS (TRS). Despite numerous progress on TRS, most of them focus on data correlations while overlooking the fundamental causal nature in recommendation. This drawback hinders TRS from identifying the cause in addressing trustworthiness issues, leading to limited fairness, robustness, and explainability. To bridge this gap, causal learning emerges as a class of promising methods to augment TRS. These methods, grounded in reliable causality, excel in mitigating various biases and noises while offering insightful explanations for TRS. However, there lacks a timely survey in this vibrant area. This paper creates an overview of TRS from the perspective of causal learning. We begin by presenting the advantages and common procedures of Causality-oriented TRS (CTRS). Then, we identify potential ",
    "path": "papers/24/02/2402.08241.json",
    "total_tokens": 962,
    "translated_title": "可信赖的推荐系统的因果推理技术：一项调查的综述",
    "translated_abstract": "推荐系统（RS）在在线内容发现和个性化决策方面取得了显著进展。然而，RS中出现的漏洞促使了向可信赖的推荐系统（TRS）的范式转变。尽管TRS取得了许多进展，但大部分都集中在数据相关性上，而忽视了推荐中的基本因果关系。这个缺点阻碍了TRS在解决可信赖性问题时识别原因，导致公平性、鲁棒性和可解释性受到限制。为了弥补这一差距，因果学习作为一类有前途的方法出现，以增强TRS。这些方法以可靠的因果关系为基础，在减轻各种偏见和噪声的同时，为TRS提供了深入的解释。然而，在这个充满活力的领域中，缺乏一个及时的调查。本文从因果学习的角度对TRS进行了概述。我们首先介绍了因果导向TRS（CTRS）的优势和常见程序。接下来，我们确定了潜在的因果学习方法在TRS中的应用领域。",
    "tldr": "本文概述了从因果学习的角度对可信赖的推荐系统进行调查。因果学习提供了一种解决TRS中潜在偏见和噪声的方法，同时提供了深入的解释。然而，在这个充满活力的领域中，缺乏一个及时的调查。"
}