{
    "title": "Use of Multi-CNNs for Section Analysis in Static Malware Detection",
    "abstract": "Existing research on malware detection focuses almost exclusively on the detection rate. However, in some cases, it is also important to understand the results of our algorithm, or to obtain more information, such as where to investigate in the file for an analyst. In this aim, we propose a new model to analyze Portable Executable files. Our method consists in splitting the files in different sections, then transform each section into an image, in order to train convolutional neural networks to treat specifically each identified section. Then we use all these scores returned by CNNs to compute a final detection score, using models that enable us to improve our analysis of the importance of each section in the final score.",
    "link": "https://arxiv.org/abs/2402.04102",
    "context": "Title: Use of Multi-CNNs for Section Analysis in Static Malware Detection\nAbstract: Existing research on malware detection focuses almost exclusively on the detection rate. However, in some cases, it is also important to understand the results of our algorithm, or to obtain more information, such as where to investigate in the file for an analyst. In this aim, we propose a new model to analyze Portable Executable files. Our method consists in splitting the files in different sections, then transform each section into an image, in order to train convolutional neural networks to treat specifically each identified section. Then we use all these scores returned by CNNs to compute a final detection score, using models that enable us to improve our analysis of the importance of each section in the final score.",
    "path": "papers/24/02/2402.04102.json",
    "total_tokens": 815,
    "translated_title": "使用多卷积神经网络进行静态恶意软件检测中的分析",
    "translated_abstract": "现有的恶意软件检测研究几乎完全集中在检测率上。然而，在某些情况下，了解算法的结果或获取更多信息也很重要，比如对于分析员来说，在文件中要调查的位置。为此，我们提出了一种新的模型来分析可移植可执行文件。我们的方法是将文件分割成不同的部分，然后将每个部分转化为图像，以便训练卷积神经网络专门处理每个被识别的部分。然后我们使用CNN返回的所有这些分数计算最终检测分数，使用模型来改进我们对每个部分在最终分数中的重要性的分析。",
    "tldr": "本论文提出了一种使用多卷积神经网络对静态恶意软件检测中的分析进行分析的新模型，该模型将可执行文件分成不同部分，并将每个部分转化为图像，通过训练卷积神经网络对每个部分进行处理，最终得到恶意软件检测分数，并提供对每个部分重要性的分析。",
    "en_tdlr": "This paper proposes a new model for analyzing section in static malware detection, using multi-convolutional neural networks. The model splits executable files into different sections and transforms each section into an image, training CNNs specifically for each identified section. By computing the scores returned by these CNNs, the model improves the analysis of the importance of each section in the final detection score."
}