{
    "title": "Learning method for S4 with Diagonal State Space Layers using Balanced Truncation",
    "abstract": "arXiv:2402.15993v1 Announce Type: new  Abstract: We introduce a novel learning method for Structured State Space Sequence (S4) models incorporating Diagonal State Space (DSS) layers, tailored for processing long-sequence data in edge intelligence applications, including sensor data analysis and real-time analytics. This method utilizes the balanced truncation technique, prevalent in control theory, applied specifically to DSS layers to reduce computational costs during inference. By leveraging parameters from the reduced model, we refine the initialization process of S4 models, outperforming the widely used Skew-HiPPo initialization in terms of performance. Numerical experiments demonstrate that our trained S4 models with DSS layers surpass conventionally trained models in accuracy and efficiency metrics. Furthermore, our observations reveal a positive correlation: higher accuracy in the original model consistently leads to increased accuracy in models trained using our method, suggest",
    "link": "https://arxiv.org/abs/2402.15993",
    "context": "Title: Learning method for S4 with Diagonal State Space Layers using Balanced Truncation\nAbstract: arXiv:2402.15993v1 Announce Type: new  Abstract: We introduce a novel learning method for Structured State Space Sequence (S4) models incorporating Diagonal State Space (DSS) layers, tailored for processing long-sequence data in edge intelligence applications, including sensor data analysis and real-time analytics. This method utilizes the balanced truncation technique, prevalent in control theory, applied specifically to DSS layers to reduce computational costs during inference. By leveraging parameters from the reduced model, we refine the initialization process of S4 models, outperforming the widely used Skew-HiPPo initialization in terms of performance. Numerical experiments demonstrate that our trained S4 models with DSS layers surpass conventionally trained models in accuracy and efficiency metrics. Furthermore, our observations reveal a positive correlation: higher accuracy in the original model consistently leads to increased accuracy in models trained using our method, suggest",
    "path": "papers/24/02/2402.15993.json",
    "total_tokens": 882,
    "translated_title": "使用平衡截断技术学习带有对角状态空间层的S4模型的方法",
    "translated_abstract": "我们引入了一种新颖的学习方法，用于结构化状态空间序列（S4）模型并且加入了对角状态空间（DSS）层，这种方法专门设计用于处理边缘智能应用中的长序列数据，包括传感器数据分析和实时分析。该方法利用平衡截断技术，在控制理论中很常见，特别应用于DSS层以降低推断过程中的计算成本。通过利用减少模型的参数，我们改进了S4模型的初始化过程，在性能方面优于广泛使用的Skew-HiPPo初始化。数值实验表明，我们训练的带有DSS层的S4模型在准确度和效率指标上超越了传统训练的模型。此外，我们的观察结果显示一个积极的相关性：原始模型中的更高准确度一致导致使用我们方法训练的模型的准确度增加，这表明",
    "tldr": "一种用于处理长序列数据的边缘智能应用的S4模型的学习方法，利用平衡截断技术降低计算成本，并通过改进初始化过程和优化准确度和效率指标来超越传统训练模型。",
    "en_tdlr": "A learning method for S4 models in edge intelligence applications processing long-sequence data, utilizing balanced truncation technique to reduce computational costs and outperform traditional training models by refining initialization process and optimizing accuracy and efficiency metrics."
}