{
    "title": "Object Detection in Thermal Images Using Deep Learning for Unmanned Aerial Vehicles",
    "abstract": "This work presents a neural network model capable of recognizing small and tiny objects in thermal images collected by unmanned aerial vehicles. Our model consists of three parts, the backbone, the neck, and the prediction head. The backbone is developed based on the structure of YOLOv5 combined with the use of a transformer encoder at the end. The neck includes a BI-FPN block combined with the use of a sliding window and a transformer to increase the information fed into the prediction head. The prediction head carries out the detection by evaluating feature maps with the Sigmoid function. The use of transformers with attention and sliding windows increases recognition accuracy while keeping the model at a reasonable number of parameters and computation requirements for embedded systems. Experiments conducted on public dataset VEDAI and our collected datasets show that our model has a higher accuracy than state-of-the-art methods such as ResNet, Faster RCNN, ComNet, ViT, YOLOv5, SMPNe",
    "link": "https://arxiv.org/abs/2402.08251",
    "context": "Title: Object Detection in Thermal Images Using Deep Learning for Unmanned Aerial Vehicles\nAbstract: This work presents a neural network model capable of recognizing small and tiny objects in thermal images collected by unmanned aerial vehicles. Our model consists of three parts, the backbone, the neck, and the prediction head. The backbone is developed based on the structure of YOLOv5 combined with the use of a transformer encoder at the end. The neck includes a BI-FPN block combined with the use of a sliding window and a transformer to increase the information fed into the prediction head. The prediction head carries out the detection by evaluating feature maps with the Sigmoid function. The use of transformers with attention and sliding windows increases recognition accuracy while keeping the model at a reasonable number of parameters and computation requirements for embedded systems. Experiments conducted on public dataset VEDAI and our collected datasets show that our model has a higher accuracy than state-of-the-art methods such as ResNet, Faster RCNN, ComNet, ViT, YOLOv5, SMPNe",
    "path": "papers/24/02/2402.08251.json",
    "total_tokens": 911,
    "translated_title": "无人机热像中基于深度学习的目标检测",
    "translated_abstract": "本文提出了一种神经网络模型，能够识别无人机收集的热像中的小型和微小物体。我们的模型由三个部分组成，即骨干网络，脖子和预测头。骨干网络基于YOLOv5的结构，并在末尾使用了一个Transformer编码器。脖子包括一个BI-FPN块，结合滑动窗口和Transformer，增加了输入到预测头的信息。预测头通过评估特征图使用Sigmoid函数进行检测。Transformer与注意力和滑动窗口的使用提高了识别准确性，并且使模型在嵌入式系统中保持了合理的参数和计算需求。在公共数据集VEDAI和我们收集的数据集上进行的实验表明，我们的模型比ResNet、Faster RCNN、ComNet、ViT、YOLOv5、SMPNe等最先进的方法具有更高的准确性。",
    "tldr": "本文提出了一种基于深度学习的神经网络模型，用于在无人机收集的热像中识别小型和微小物体。通过使用YOLOv5结构的骨干网络、Transformer编码器和滑动窗口，以及Sigmoid函数进行检测，我们的模型在识别准确性上超过了其他最先进的方法。",
    "en_tdlr": "This paper presents a neural network model based on deep learning for detecting small and tiny objects in thermal images collected by unmanned aerial vehicles. By utilizing a combination of YOLOv5 backbone, Transformer encoder, sliding window, and Sigmoid function, our model achieves higher accuracy in object detection compared to state-of-the-art methods."
}