{
    "title": "Controlled Text Generation for Large Language Model with Dynamic Attribute Graphs",
    "abstract": "arXiv:2402.11218v1 Announce Type: new  Abstract: Controlled Text Generation (CTG) aims to produce texts that exhibit specific desired attributes. In this study, we introduce a pluggable CTG framework for Large Language Models (LLMs) named Dynamic Attribute Graphs-based controlled text generation (DATG). This framework utilizes an attribute scorer to evaluate the attributes of sentences generated by LLMs and constructs dynamic attribute graphs. DATG modulates the occurrence of key attribute words and key anti-attribute words, achieving effective attribute control without compromising the original capabilities of the model. We conduct experiments across four datasets in two tasks: toxicity mitigation and sentiment transformation, employing five LLMs as foundational models. Our findings highlight a remarkable enhancement in control accuracy, achieving a peak improvement of 19.29% over baseline methods in the most favorable task across four datasets. Additionally, we observe a significant ",
    "link": "https://arxiv.org/abs/2402.11218",
    "context": "Title: Controlled Text Generation for Large Language Model with Dynamic Attribute Graphs\nAbstract: arXiv:2402.11218v1 Announce Type: new  Abstract: Controlled Text Generation (CTG) aims to produce texts that exhibit specific desired attributes. In this study, we introduce a pluggable CTG framework for Large Language Models (LLMs) named Dynamic Attribute Graphs-based controlled text generation (DATG). This framework utilizes an attribute scorer to evaluate the attributes of sentences generated by LLMs and constructs dynamic attribute graphs. DATG modulates the occurrence of key attribute words and key anti-attribute words, achieving effective attribute control without compromising the original capabilities of the model. We conduct experiments across four datasets in two tasks: toxicity mitigation and sentiment transformation, employing five LLMs as foundational models. Our findings highlight a remarkable enhancement in control accuracy, achieving a peak improvement of 19.29% over baseline methods in the most favorable task across four datasets. Additionally, we observe a significant ",
    "path": "papers/24/02/2402.11218.json",
    "total_tokens": 864,
    "translated_title": "使用动态属性图控制大型语言模型的文本生成",
    "translated_abstract": "控制文本生成（CTG）旨在生成具有特定所需属性的文本。在本研究中，我们引入了一个可插拔的CTG框架，用于大型语言模型（LLMs），名为基于动态属性图的控制文本生成（DATG）。该框架利用属性评分器评估由LLMs生成的句子的属性，并构建动态属性图。DATG调节关键属性词和关键反属性词的发生，实现了有效的属性控制，而不影响模型的原始能力。我们在两个任务中跨四个数据集进行实验：毒性缓解和情感转化，利用五个LLMs作为基础模型。我们的发现突出了在控制准确性方面的显着提高，实现了在四个数据集中最有利的任务中对基线方法的峰值改进为19.29％。此外，我们观察到显着",
    "tldr": "该研究提出了一个名为DATG的框架，利用动态属性图调节关键属性词和关键反属性词的发生，实现了有效的属性控制，在毒性缓解和情感转化任务中表现出19.29%的控制准确性增强。",
    "en_tdlr": "This study introduces a framework named DATG, which utilizes dynamic attribute graphs to modulate the occurrence of key attribute words and key anti-attribute words, achieving effective attribute control and showing a 19.29% enhancement in control accuracy in toxicity mitigation and sentiment transformation tasks."
}