{
    "title": "Threads of Subtlety: Detecting Machine-Generated Texts Through Discourse Motifs",
    "abstract": "arXiv:2402.10586v1 Announce Type: new  Abstract: With the advent of large language models (LLM), the line between human-crafted and machine-generated texts has become increasingly blurred. This paper delves into the inquiry of identifying discernible and unique linguistic properties in texts that were written by humans, particularly uncovering the underlying discourse structures of texts beyond their surface structures. Introducing a novel methodology, we leverage hierarchical parse trees and recursive hypergraphs to unveil distinctive discourse patterns in texts produced by both LLMs and humans. Empirical findings demonstrate that, although both LLMs and humans generate distinct discourse patterns influenced by specific domains, human-written texts exhibit more structural variability, reflecting the nuanced nature of human writing in different domains. Notably, incorporating hierarchical discourse features enhances binary classifiers' overall performance in distinguishing between huma",
    "link": "https://arxiv.org/abs/2402.10586",
    "context": "Title: Threads of Subtlety: Detecting Machine-Generated Texts Through Discourse Motifs\nAbstract: arXiv:2402.10586v1 Announce Type: new  Abstract: With the advent of large language models (LLM), the line between human-crafted and machine-generated texts has become increasingly blurred. This paper delves into the inquiry of identifying discernible and unique linguistic properties in texts that were written by humans, particularly uncovering the underlying discourse structures of texts beyond their surface structures. Introducing a novel methodology, we leverage hierarchical parse trees and recursive hypergraphs to unveil distinctive discourse patterns in texts produced by both LLMs and humans. Empirical findings demonstrate that, although both LLMs and humans generate distinct discourse patterns influenced by specific domains, human-written texts exhibit more structural variability, reflecting the nuanced nature of human writing in different domains. Notably, incorporating hierarchical discourse features enhances binary classifiers' overall performance in distinguishing between huma",
    "path": "papers/24/02/2402.10586.json",
    "total_tokens": 857,
    "translated_title": "细微之线：通过话语主题识别机器生成的文本",
    "translated_abstract": "随着大型语言模型（LLM）的出现，人类创作和机器生成的文本之间的界限变得日益模糊。本文探讨了识别人类撰写的文本中可辨识和独特的语言特性的研究，特别是揭示文本在表面结构之外的潜在话语结构。引入了一种新颖的方法论，我们利用层次化解析树和递归超图来揭示LLM和人类生成的文本中的独特话语模式。实证研究结果表明，尽管LLM和人类生成的文本都受特定领域的影响而产生不同的话语模式，但人类撰写的文本表现出更多的结构变异性，反映了不同领域人类写作的微妙性质。值得注意的是，引入层次话语特征可以增强二元分类器在区分人类生成和机器生成文本方面的整体性能。",
    "tldr": "本文探讨了如何通过研究文本中的话语特征来区分人类创作和机器生成的文本，引入了一种新颖的方法来揭示这些特征，并发现人类写作在结构上更为多样化。",
    "en_tdlr": "This paper discusses identifying discernible and unique linguistic properties in texts written by humans, introduces a novel methodology to unveil these features, and finds that human writing exhibits more structural variability."
}