{
    "title": "Cross-Market Mergers with Common Customers: When (and Why) Do They Increase Negotiated Prices?",
    "abstract": "arXiv:2402.12575v1 Announce Type: new  Abstract: I examine the implications of cross-market mergers of suppliers to intermediaries that bundle products for consumers. These mergers are controversial. Some argue that suppliers' products will be substitutes for intermediaries, despite not being substitutes for consumers. Others contend that because bundling makes products complements for consumers, products must be complements for intermediaries. I contribute to this debate by showing that two products can be complements for consumers but substitutes for intermediaries when the products serve a similar role in attracting consumers to purchase the bundle. This result leads to new recommendations and helps explain why cross-market hospital mergers raise prices.",
    "link": "https://arxiv.org/abs/2402.12575",
    "context": "Title: Cross-Market Mergers with Common Customers: When (and Why) Do They Increase Negotiated Prices?\nAbstract: arXiv:2402.12575v1 Announce Type: new  Abstract: I examine the implications of cross-market mergers of suppliers to intermediaries that bundle products for consumers. These mergers are controversial. Some argue that suppliers' products will be substitutes for intermediaries, despite not being substitutes for consumers. Others contend that because bundling makes products complements for consumers, products must be complements for intermediaries. I contribute to this debate by showing that two products can be complements for consumers but substitutes for intermediaries when the products serve a similar role in attracting consumers to purchase the bundle. This result leads to new recommendations and helps explain why cross-market hospital mergers raise prices.",
    "path": "papers/24/02/2402.12575.json",
    "total_tokens": 723,
    "translated_title": "共同顾客的跨市场并购：何时（以及为什么）会增加谈判价格？",
    "translated_abstract": "我研究了供应商到中间商的跨市场并购对为消费者捆绑产品的影响。这些并购备受争议。一些人认为供应商的产品会成为中间商的替代品，尽管不是消费者的替代品。其他人认为，由于捆绑使产品成为消费者的互补产品，产品必须成为中间商的互补产品。我通过展示当产品在吸引消费者购买捆绑包时发挥类似作用时，两种产品可以成为消费者的互补品但对中间商来说是替代品，为这一辩论做出了贡献。这一结果带来了新的建议，并有助于解释为什么跨市场医院并购会提高价格。",
    "tldr": "两种产品可以成为消费者的互补品但对中间商来说是替代品，从而导致价格上涨。"
}