{
    "title": "Modelling Political Coalition Negotiations Using LLM-based Agents",
    "abstract": "arXiv:2402.11712v1 Announce Type: new  Abstract: Coalition negotiations are a cornerstone of parliamentary democracies, characterised by complex interactions and strategic communications among political parties. Despite its significance, the modelling of these negotiations has remained unexplored with the domain of Natural Language Processing (NLP), mostly due to lack of proper data. In this paper, we introduce coalition negotiations as a novel NLP task, and model it as a negotiation between large language model-based agents. We introduce a multilingual dataset, POLCA, comprising manifestos of European political parties and coalition agreements over a number of elections in these countries. This dataset addresses the challenge of the current scope limitations in political negotiation modelling by providing a diverse, real-world basis for simulation. Additionally, we propose a hierarchical Markov decision process designed to simulate the process of coalition negotiation between politica",
    "link": "https://arxiv.org/abs/2402.11712",
    "context": "Title: Modelling Political Coalition Negotiations Using LLM-based Agents\nAbstract: arXiv:2402.11712v1 Announce Type: new  Abstract: Coalition negotiations are a cornerstone of parliamentary democracies, characterised by complex interactions and strategic communications among political parties. Despite its significance, the modelling of these negotiations has remained unexplored with the domain of Natural Language Processing (NLP), mostly due to lack of proper data. In this paper, we introduce coalition negotiations as a novel NLP task, and model it as a negotiation between large language model-based agents. We introduce a multilingual dataset, POLCA, comprising manifestos of European political parties and coalition agreements over a number of elections in these countries. This dataset addresses the challenge of the current scope limitations in political negotiation modelling by providing a diverse, real-world basis for simulation. Additionally, we propose a hierarchical Markov decision process designed to simulate the process of coalition negotiation between politica",
    "path": "papers/24/02/2402.11712.json",
    "total_tokens": 860,
    "translated_title": "使用基于LLM的代理模拟政治联盟谈判",
    "translated_abstract": "联盟谈判是议会民主制度的基石，以政党间复杂互动和战略沟通为特征。尽管具有重要意义，但由于缺乏合适数据，对这些谈判的建模在自然语言处理（NLP）领域中尚未得到探索。本文将联盟谈判作为一项新颖的NLP任务引入，并将其建模为基于大型语言模型代理之间的谈判。我们引入了一个多语种数据集POLCA，包括欧洲政党宣言和这些国家若干选举中的联盟协议。该数据集通过提供多样化的真实基础模拟解决了当前政治谈判建模的范围限制挑战。此外，我们提出了一个设计用于模拟政治联盟谈判过程的分层马尔可夫决策过程。",
    "tldr": "本文引入联盟谈判作为一项新颖的自然语言处理任务，建模为基于大型语言模型代理之间的谈判，并提出了一个多语种数据集POLCA以及用于模拟政治谈判过程的分层马尔可夫决策过程。",
    "en_tdlr": "This paper introduces coalition negotiations as a novel NLP task, models it as negotiations between large language model-based agents, introduces a multilingual dataset POLCA, and proposes a hierarchical Markov decision process to simulate the process of political coalition negotiations."
}