{
    "title": "A Multispectral Automated Transfer Technique (MATT) for machine-driven image labeling utilizing the Segment Anything Model (SAM)",
    "abstract": "arXiv:2402.11413v1 Announce Type: cross  Abstract: Segment Anything Model (SAM) is drastically accelerating the speed and accuracy of automatically segmenting and labeling large Red-Green-Blue (RGB) imagery datasets. However, SAM is unable to segment and label images outside of the visible light spectrum, for example, for multispectral or hyperspectral imagery. Therefore, this paper outlines a method we call the Multispectral Automated Transfer Technique (MATT). By transposing SAM segmentation masks from RGB images we can automatically segment and label multispectral imagery with high precision and efficiency. For example, the results demonstrate that segmenting and labeling a 2,400-image dataset utilizing MATT achieves a time reduction of 87.8% in developing a trained model, reducing roughly 20 hours of manual labeling, to only 2.4 hours. This efficiency gain is associated with only a 6.7% decrease in overall mean average precision (mAP) when training multispectral models via MATT, co",
    "link": "https://arxiv.org/abs/2402.11413",
    "context": "Title: A Multispectral Automated Transfer Technique (MATT) for machine-driven image labeling utilizing the Segment Anything Model (SAM)\nAbstract: arXiv:2402.11413v1 Announce Type: cross  Abstract: Segment Anything Model (SAM) is drastically accelerating the speed and accuracy of automatically segmenting and labeling large Red-Green-Blue (RGB) imagery datasets. However, SAM is unable to segment and label images outside of the visible light spectrum, for example, for multispectral or hyperspectral imagery. Therefore, this paper outlines a method we call the Multispectral Automated Transfer Technique (MATT). By transposing SAM segmentation masks from RGB images we can automatically segment and label multispectral imagery with high precision and efficiency. For example, the results demonstrate that segmenting and labeling a 2,400-image dataset utilizing MATT achieves a time reduction of 87.8% in developing a trained model, reducing roughly 20 hours of manual labeling, to only 2.4 hours. This efficiency gain is associated with only a 6.7% decrease in overall mean average precision (mAP) when training multispectral models via MATT, co",
    "path": "papers/24/02/2402.11413.json",
    "total_tokens": 925,
    "translated_title": "一种用于利用“Segment Anything Model (SAM)”进行自动图像分割的多光谱自动转移技术（MATT）",
    "translated_abstract": "arXiv:2402.11413v1 公告类型: 跨领域  摘要: Segment Anything Model (SAM)大大加快了自动分割和标记大型红绿蓝（RGB）图像数据集的速度和准确性。然而，SAM无法对可见光谱之外的图像进行分割和标记，例如，对于多光谱或高光谱图像。因此，本文概述了一种我们称之为多光谱自动转移技术（MATT）的方法。通过从RGB图像中转置SAM分割掩模，我们可以高精度和高效地自动分割和标记多光谱图像。例如，结果表明，利用MATT对一个2,400张图像数据集进行分割和标记，在开发训练模型方面节省了87.8%的时间，将大约20小时的手动标注减少到仅2.4小时。在通过MATT训练多光谱模型时，这种效率提高仅与整体平均精度（mAP）降低了6.7%有关。",
    "tldr": "介绍了一种名为多光谱自动转移技术（MATT）的方法，通过从RGB图像转置SAM分割掩模，实现了对多光谱图像的高精度和高效自动分割标记。"
}