{
    "title": "PlanGPT: Enhancing Urban Planning with Tailored Language Model and Efficient Retrieval",
    "abstract": "arXiv:2402.19273v1 Announce Type: new  Abstract: In the field of urban planning, general-purpose large language models often struggle to meet the specific needs of planners. Tasks like generating urban planning texts, retrieving related information, and evaluating planning documents pose unique challenges. To enhance the efficiency of urban professionals and overcome these obstacles, we introduce PlanGPT, the first specialized Large Language Model tailored for urban and spatial planning. Developed through collaborative efforts with institutions like the Chinese Academy of Urban Planning, PlanGPT leverages a customized local database retrieval framework, domain-specific fine-tuning of base models, and advanced tooling capabilities. Empirical tests demonstrate that PlanGPT has achieved advanced performance, delivering responses of superior quality precisely tailored to the intricacies of urban planning.",
    "link": "https://arxiv.org/abs/2402.19273",
    "context": "Title: PlanGPT: Enhancing Urban Planning with Tailored Language Model and Efficient Retrieval\nAbstract: arXiv:2402.19273v1 Announce Type: new  Abstract: In the field of urban planning, general-purpose large language models often struggle to meet the specific needs of planners. Tasks like generating urban planning texts, retrieving related information, and evaluating planning documents pose unique challenges. To enhance the efficiency of urban professionals and overcome these obstacles, we introduce PlanGPT, the first specialized Large Language Model tailored for urban and spatial planning. Developed through collaborative efforts with institutions like the Chinese Academy of Urban Planning, PlanGPT leverages a customized local database retrieval framework, domain-specific fine-tuning of base models, and advanced tooling capabilities. Empirical tests demonstrate that PlanGPT has achieved advanced performance, delivering responses of superior quality precisely tailored to the intricacies of urban planning.",
    "path": "papers/24/02/2402.19273.json",
    "total_tokens": 799,
    "translated_title": "PlanGPT: 用定制语言模型和高效检索增强城市规划",
    "translated_abstract": "在城市规划领域，通用大型语言模型往往难以满足规划者的特定需求。生成城市规划文本、检索相关信息和评估规划文件等任务都存在独特挑战。为提高城市专业人员的效率并克服这些障碍，我们引入了PlanGPT，第一个专为城市和空间规划量身定制的大型语言模型。通过与中国城市规划研究院等机构的合作努力开发，PlanGPT利用定制的本地数据库检索框架、基础模型的领域特定微调和先进的工具功能。实证测试表明，PlanGPT取得了先进性能，提供了精确适应城市规划复杂性的高质量响应。",
    "tldr": "PlanGPT是第一个专为城市和空间规划量身定制的大型语言模型，通过定制数据库检索框架、领域特定微调和先进工具功能，实现了高效的性能表现和提供高质量规划响应。",
    "en_tdlr": "PlanGPT is the first specialized Large Language Model tailored for urban and spatial planning. It achieves advanced performance through a customized database retrieval framework, domain-specific fine-tuning, and advanced tooling capabilities, delivering high-quality planning responses efficiently."
}