{
    "title": "A Reinforcement Learning Approach for Dynamic Rebalancing in Bike-Sharing System",
    "abstract": "Bike-Sharing Systems provide eco-friendly urban mobility, contributing to the alleviation of traffic congestion and to healthier lifestyles. Efficiently operating such systems and maintaining high customer satisfaction is challenging due to the stochastic nature of trip demand, leading to full or empty stations. Devising effective rebalancing strategies using vehicles to redistribute bikes among stations is therefore of uttermost importance for operators. As a promising alternative to classical mathematical optimization, reinforcement learning is gaining ground to solve sequential decision-making problems. This paper introduces a spatio-temporal reinforcement learning algorithm for the dynamic rebalancing problem with multiple vehicles. We first formulate the problem as a Multi-agent Markov Decision Process in a continuous time framework. This allows for independent and cooperative vehicle rebalancing, eliminating the impractical restriction of time-discretized models where vehicle dep",
    "link": "https://arxiv.org/abs/2402.03589",
    "context": "Title: A Reinforcement Learning Approach for Dynamic Rebalancing in Bike-Sharing System\nAbstract: Bike-Sharing Systems provide eco-friendly urban mobility, contributing to the alleviation of traffic congestion and to healthier lifestyles. Efficiently operating such systems and maintaining high customer satisfaction is challenging due to the stochastic nature of trip demand, leading to full or empty stations. Devising effective rebalancing strategies using vehicles to redistribute bikes among stations is therefore of uttermost importance for operators. As a promising alternative to classical mathematical optimization, reinforcement learning is gaining ground to solve sequential decision-making problems. This paper introduces a spatio-temporal reinforcement learning algorithm for the dynamic rebalancing problem with multiple vehicles. We first formulate the problem as a Multi-agent Markov Decision Process in a continuous time framework. This allows for independent and cooperative vehicle rebalancing, eliminating the impractical restriction of time-discretized models where vehicle dep",
    "path": "papers/24/02/2402.03589.json",
    "total_tokens": 834,
    "translated_title": "自行车共享系统中动态再平衡的强化学习方法",
    "translated_abstract": "自行车共享系统提供环保的城市出行方式，有助于缓解交通拥堵，促进健康生活方式。由于行程需求的随机性，这些系统的有效运营和保持高客户满意度具有挑战性，常常出现满站或空站现象。为了解决这个问题，使用车辆重新分配自行车到不同站点的再平衡策略至关重要。本文引入了一种时空强化学习算法，用于解决带有多辆车辆的动态再平衡问题。首先，在连续时间框架中将问题建模为多智能体马尔可夫决策过程。这允许独立和协作的车辆再平衡，消除了基于时间离散化模型的不切实际的限制。",
    "tldr": "本研究介绍了一种针对自行车共享系统中动态再平衡问题的时空强化学习算法，通过多智能体马尔可夫决策过程实现独立和协作的车辆再平衡，解决了传统数学优化方法的不实际限制。",
    "en_tdlr": "This study presents a spatio-temporal reinforcement learning algorithm for the dynamic rebalancing problem in bike-sharing system, allowing for independent and cooperative vehicle rebalancing using a Multi-agent Markov Decision Process. It overcomes the limitations of traditional mathematical optimization methods."
}