{
    "title": "Jointly Learning Representations for Map Entities via Heterogeneous Graph Contrastive Learning",
    "abstract": "The electronic map plays a crucial role in geographic information systems, serving various urban managerial scenarios and daily life services. Developing effective Map Entity Representation Learning (MERL) methods is crucial to extracting embedding information from electronic maps and converting map entities into representation vectors for downstream applications. However, existing MERL methods typically focus on one specific category of map entities, such as POIs, road segments, or land parcels, which is insufficient for real-world diverse map-based applications and might lose latent structural and semantic information interacting between entities of different types. Moreover, using representations generated by separate models for different map entities can introduce inconsistencies. Motivated by this, we propose a novel method named HOME-GCL for learning representations of multiple categories of map entities. Our approach utilizes a heterogeneous map entity graph (HOME graph) that in",
    "link": "https://arxiv.org/abs/2402.06135",
    "context": "Title: Jointly Learning Representations for Map Entities via Heterogeneous Graph Contrastive Learning\nAbstract: The electronic map plays a crucial role in geographic information systems, serving various urban managerial scenarios and daily life services. Developing effective Map Entity Representation Learning (MERL) methods is crucial to extracting embedding information from electronic maps and converting map entities into representation vectors for downstream applications. However, existing MERL methods typically focus on one specific category of map entities, such as POIs, road segments, or land parcels, which is insufficient for real-world diverse map-based applications and might lose latent structural and semantic information interacting between entities of different types. Moreover, using representations generated by separate models for different map entities can introduce inconsistencies. Motivated by this, we propose a novel method named HOME-GCL for learning representations of multiple categories of map entities. Our approach utilizes a heterogeneous map entity graph (HOME graph) that in",
    "path": "papers/24/02/2402.06135.json",
    "total_tokens": 815,
    "translated_title": "通过异构图对比学习共同学习地图实体的表示",
    "translated_abstract": "电子地图在地理信息系统中起着至关重要的作用，为各种城市管理场景和日常生活服务提供支持。开发有效的地图实体表示学习（MERL）方法对于从电子地图中提取嵌入信息并将地图实体转化为表示向量以供下游应用非常重要。然而，现有的MERL方法通常只关注一种特定类别的地图实体，如兴趣点（POIs）、道路段或土地分块，这对于真实世界中多样化的基于地图的应用来说是不充分的，可能会丢失不同类型实体之间的潜在结构和语义信息。此外，使用不同地图实体的分别生成的表示可能会引入不一致性。受此启发，我们提出了一种名为HOME-GCL的新方法，用于学习多种类别地图实体的表示。我们的方法利用了一个异构地图实体图（HOME图），其中包括了地图实体之间的交互的潜在结构和语义信息。",
    "tldr": "通过异构图对比学习方法能够共同学习多个类别的地图实体的表示，提取潜在的结构和语义信息。"
}