{
    "title": "Detection Latencies of Anomaly Detectors: An Overlooked Perspective ?",
    "abstract": "arXiv:2402.09082v1 Announce Type: cross Abstract: The ever-evolving landscape of attacks, coupled with the growing complexity of ICT systems, makes crafting anomaly-based intrusion detectors (ID) and error detectors (ED) a difficult task: they must accurately detect attacks, and they should promptly perform detections. Although improving and comparing the detection capability is the focus of most research works, the timeliness of the detection is less considered and often insufficiently evaluated or discussed. In this paper, we argue the relevance of measuring the temporal latency of attacks and errors, and we propose an evaluation approach for detectors to ensure a pragmatic trade-off between correct and in-time detection. Briefly, the approach relates the false positive rate with the temporal latency of attacks and errors, and this ultimately leads to guidelines for configuring a detector. We apply our approach by evaluating different ED and ID solutions in two industrial cases: i) a",
    "link": "https://arxiv.org/abs/2402.09082",
    "context": "Title: Detection Latencies of Anomaly Detectors: An Overlooked Perspective ?\nAbstract: arXiv:2402.09082v1 Announce Type: cross Abstract: The ever-evolving landscape of attacks, coupled with the growing complexity of ICT systems, makes crafting anomaly-based intrusion detectors (ID) and error detectors (ED) a difficult task: they must accurately detect attacks, and they should promptly perform detections. Although improving and comparing the detection capability is the focus of most research works, the timeliness of the detection is less considered and often insufficiently evaluated or discussed. In this paper, we argue the relevance of measuring the temporal latency of attacks and errors, and we propose an evaluation approach for detectors to ensure a pragmatic trade-off between correct and in-time detection. Briefly, the approach relates the false positive rate with the temporal latency of attacks and errors, and this ultimately leads to guidelines for configuring a detector. We apply our approach by evaluating different ED and ID solutions in two industrial cases: i) a",
    "path": "papers/24/02/2402.09082.json",
    "total_tokens": 875,
    "translated_title": "异常检测器的检测延迟：一个被忽视的视角？",
    "translated_abstract": "攻击方式不断变化，与此同时ICT系统的复杂性也在增加，这使得构建基于异常的入侵检测器(ID)和错误检测器(ED)变得困难：它们必须准确地检测攻击，并且应该及时进行检测。尽管大多数研究工作侧重于改进和比较检测能力，但检测的及时性往往不被考虑或不够充分地进行评估或讨论。本文论述了测量攻击和错误的时间延迟的相关性，并提出了对检测器进行评估的方法，以确保正确和及时检测之间的实用性权衡。简要地说，该方法将误报率与攻击和错误的时间延迟相关联，最终提供了配置检测器的指导原则。我们通过评估不同的ED和ID解决方案在两个工业案例中应用了我们的方法：i) 一个案例是...",
    "tldr": "本文提出了检测延迟的重要性，并提出了一种评估方法，以确保准确和及时的检测之间的权衡。研究通过将误报率与攻击和错误的时间延迟相关联，并提供了配置检测器的指导原则。"
}