{
    "title": "Analysis of Persian News Agencies on Instagram, A Words Co-occurrence Graph-based Approach",
    "abstract": "arXiv:2402.12272v1 Announce Type: cross  Abstract: The rise of the Internet and the exponential increase in data have made manual data summarization and analysis a challenging task. Instagram social network is a prominent social network widely utilized in Iran for information sharing and communication across various age groups. The inherent structure of Instagram, characterized by its text-rich content and graph-like data representation, enables the utilization of text and graph processing techniques for data analysis purposes. The degree distributions of these networks exhibit scale-free characteristics, indicating non-random growth patterns. Recently, word co-occurrence has gained attention from researchers across multiple disciplines due to its simplicity and practicality. Keyword extraction is a crucial task in natural language processing. In this study, we demonstrated that high-precision extraction of keywords from Instagram posts in the Persian language can be achieved using uns",
    "link": "https://arxiv.org/abs/2402.12272",
    "context": "Title: Analysis of Persian News Agencies on Instagram, A Words Co-occurrence Graph-based Approach\nAbstract: arXiv:2402.12272v1 Announce Type: cross  Abstract: The rise of the Internet and the exponential increase in data have made manual data summarization and analysis a challenging task. Instagram social network is a prominent social network widely utilized in Iran for information sharing and communication across various age groups. The inherent structure of Instagram, characterized by its text-rich content and graph-like data representation, enables the utilization of text and graph processing techniques for data analysis purposes. The degree distributions of these networks exhibit scale-free characteristics, indicating non-random growth patterns. Recently, word co-occurrence has gained attention from researchers across multiple disciplines due to its simplicity and practicality. Keyword extraction is a crucial task in natural language processing. In this study, we demonstrated that high-precision extraction of keywords from Instagram posts in the Persian language can be achieved using uns",
    "path": "papers/24/02/2402.12272.json",
    "total_tokens": 822,
    "translated_title": "对Instagram上波斯新闻机构的分析，基于词共现图的方法",
    "translated_abstract": "互联网的崛起和数据的指数增长使得手动数据摘要和分析变得具有挑战性。 Instagram社交网络是伊朗广泛利用的一种重要社交网络，用于各个年龄段之间的信息共享和交流。 Instagram的固有结构，以其文本丰富的内容和类似图形的数据表示为特征，使得可以利用文本和图形处理技术进行数据分析。这些网络的度分布表现出无标度特征，表明了非随机的增长模式。最近，词共现吸引了多个学科的研究人员的注意，因为它的简单性和实用性。关键词提取是自然语言处理中的关键任务。在这项研究中，我们证明了可以使用无监督方法实现对波斯语Instagram帖子的高精度关键词提取。",
    "tldr": "本研究通过对Instagram上波斯新闻机构的分析，基于词共现图的方法，展示了可以使用无监督方法实现对波斯语Instagram帖子的高精度关键词提取。",
    "en_tdlr": "This study demonstrates high-precision keyword extraction from Persian language Instagram posts can be achieved using an unsupervised approach, based on the analysis of Persian news agencies on Instagram with a word co-occurrence graph-based method."
}