{
    "title": "Automated detection of motion artifacts in brain MR images using deep learning and explainable artificial intelligence",
    "abstract": "arXiv:2402.08749v1 Announce Type: cross Abstract: Quality assessment, including inspecting the images for artifacts, is a critical step during MRI data acquisition to ensure data quality and downstream analysis or interpretation success. This study demonstrates a deep learning model to detect rigid motion in T1-weighted brain images. We leveraged a 2D CNN for three-class classification and tested it on publicly available retrospective and prospective datasets. Grad-CAM heatmaps enabled the identification of failure modes and provided an interpretation of the model's results. The model achieved average precision and recall metrics of 85% and 80% on six motion-simulated retrospective datasets. Additionally, the model's classifications on the prospective dataset showed a strong inverse correlation (-0.84) compared to average edge strength, an image quality metric indicative of motion. This model is part of the ArtifactID tool, aimed at inline automatic detection of Gibbs ringing, wrap-aro",
    "link": "https://arxiv.org/abs/2402.08749",
    "context": "Title: Automated detection of motion artifacts in brain MR images using deep learning and explainable artificial intelligence\nAbstract: arXiv:2402.08749v1 Announce Type: cross Abstract: Quality assessment, including inspecting the images for artifacts, is a critical step during MRI data acquisition to ensure data quality and downstream analysis or interpretation success. This study demonstrates a deep learning model to detect rigid motion in T1-weighted brain images. We leveraged a 2D CNN for three-class classification and tested it on publicly available retrospective and prospective datasets. Grad-CAM heatmaps enabled the identification of failure modes and provided an interpretation of the model's results. The model achieved average precision and recall metrics of 85% and 80% on six motion-simulated retrospective datasets. Additionally, the model's classifications on the prospective dataset showed a strong inverse correlation (-0.84) compared to average edge strength, an image quality metric indicative of motion. This model is part of the ArtifactID tool, aimed at inline automatic detection of Gibbs ringing, wrap-aro",
    "path": "papers/24/02/2402.08749.json",
    "total_tokens": 983,
    "translated_title": "使用深度学习和可解释人工智能自动检测脑MR图像中的运动伪影",
    "translated_abstract": "质量评估，包括对图像进行伪影检查，是MRI数据采集过程中的关键步骤，以确保数据质量和下游分析或解释的成功。本研究展示了一种利用深度学习模型检测T1加权脑图像中的刚性运动的方法。我们利用2D CNN进行三类分类，并在公开可获取的回顾性和前瞻性数据集上进行了测试。Grad-CAM热图可以识别失败模式，并对模型结果提供解释。该模型在六个运动模拟回顾性数据集上实现了平均精度和召回率分别为85%和80%的指标。此外，与平均边缘强度相关的图像质量指标相比，该模型在前瞻性数据集上的分类表现显示了强烈的负相关性（-0.84），该指标可以表示运动伪影。该模型是ArtifactID工具的一部分，旨在内联自动检测Gibbs环状伪影、包围伪影等等。",
    "tldr": "本研究使用深度学习模型和可解释人工智能，实现了对脑MR图像中刚性运动的自动检测。通过对公开数据集的测试，模型展示了良好的性能，能够识别运动伪影并提供解释。该模型的结果在实验数据集上具有高的准确率和召回率，并与图像质量指标呈现强烈的负相关性。",
    "en_tdlr": "This study presents an automated method using deep learning and explainable artificial intelligence for detecting rigid motion in brain MR images. The model achieved high accuracy and recall on retrospective datasets and demonstrated a strong inverse correlation with an image quality metric. The results provide interpretable insights into motion artifacts in MRI data."
}