{
    "title": "Cluster Metric Sensitivity to Irrelevant Features",
    "abstract": "arXiv:2402.12008v1 Announce Type: cross  Abstract: Clustering algorithms are used extensively in data analysis for data exploration and discovery. Technological advancements lead to continually growth of data in terms of volume, dimensionality and complexity. This provides great opportunities in data analytics as the data can be interrogated for many different purposes. This however leads challenges, such as identification of relevant features for a given task. In supervised tasks, one can utilise a number of methods to optimise the input features for the task objective (e.g. classification accuracy). In unsupervised problems, such tools are not readily available, in part due to an inability to quantify feature relevance in unlabeled tasks. In this paper, we investigate the sensitivity of clustering performance noisy uncorrelated variables iteratively added to baseline datasets with well defined clusters. We show how different types of irrelevant variables can impact the outcome of a c",
    "link": "https://arxiv.org/abs/2402.12008",
    "context": "Title: Cluster Metric Sensitivity to Irrelevant Features\nAbstract: arXiv:2402.12008v1 Announce Type: cross  Abstract: Clustering algorithms are used extensively in data analysis for data exploration and discovery. Technological advancements lead to continually growth of data in terms of volume, dimensionality and complexity. This provides great opportunities in data analytics as the data can be interrogated for many different purposes. This however leads challenges, such as identification of relevant features for a given task. In supervised tasks, one can utilise a number of methods to optimise the input features for the task objective (e.g. classification accuracy). In unsupervised problems, such tools are not readily available, in part due to an inability to quantify feature relevance in unlabeled tasks. In this paper, we investigate the sensitivity of clustering performance noisy uncorrelated variables iteratively added to baseline datasets with well defined clusters. We show how different types of irrelevant variables can impact the outcome of a c",
    "path": "papers/24/02/2402.12008.json",
    "total_tokens": 766,
    "translated_title": "群集度量对无关特征的敏感度",
    "translated_abstract": "聚类算法在数据分析中被广泛使用，用于数据探索和发现。技术进步导致数据在容量、维度和复杂性方面不断增长。这为数据分析提供了巨大机会，因为数据可以用于许多不同目的的询问。然而，这也带来了挑战，比如在给定任务中识别相关特征。在监督任务中，可以利用各种方法优化任务目标（例如分类准确性）的输入特征。在无监督问题中，这些工具并不readily available，部分原因是无法定量地衡量无标签任务中特征的相关性。本文研究了群集性能对嘈杂的不相关变量进行迭代添加到具有明确定义群集的基线数据集的敏感度。我们展示了不同类型的无关变量如何影响结果。",
    "tldr": "本文研究群集性能对添加到基线数据集中的嘈杂不相关变量的敏感度。",
    "en_tdlr": "This paper investigates the sensitivity of clustering performance to iteratively added noisy uncorrelated variables to baseline datasets with well defined clusters."
}