{
    "title": "Large Language Model for Participatory Urban Planning",
    "abstract": "arXiv:2402.17161v1 Announce Type: new  Abstract: Participatory urban planning is the mainstream of modern urban planning that involves the active engagement of residents. However, the traditional participatory paradigm requires experienced planning experts and is often time-consuming and costly. Fortunately, the emerging Large Language Models (LLMs) have shown considerable ability to simulate human-like agents, which can be used to emulate the participatory process easily. In this work, we introduce an LLM-based multi-agent collaboration framework for participatory urban planning, which can generate land-use plans for urban regions considering the diverse needs of residents. Specifically, we construct LLM agents to simulate a planner and thousands of residents with diverse profiles and backgrounds. We first ask the planner to carry out an initial land-use plan. To deal with the different facilities needs of residents, we initiate a discussion among the residents in each community about",
    "link": "https://arxiv.org/abs/2402.17161",
    "context": "Title: Large Language Model for Participatory Urban Planning\nAbstract: arXiv:2402.17161v1 Announce Type: new  Abstract: Participatory urban planning is the mainstream of modern urban planning that involves the active engagement of residents. However, the traditional participatory paradigm requires experienced planning experts and is often time-consuming and costly. Fortunately, the emerging Large Language Models (LLMs) have shown considerable ability to simulate human-like agents, which can be used to emulate the participatory process easily. In this work, we introduce an LLM-based multi-agent collaboration framework for participatory urban planning, which can generate land-use plans for urban regions considering the diverse needs of residents. Specifically, we construct LLM agents to simulate a planner and thousands of residents with diverse profiles and backgrounds. We first ask the planner to carry out an initial land-use plan. To deal with the different facilities needs of residents, we initiate a discussion among the residents in each community about",
    "path": "papers/24/02/2402.17161.json",
    "total_tokens": 832,
    "translated_title": "大语言模型在参与式城市规划中的应用",
    "translated_abstract": "参与式城市规划是现代城市规划的主流，涉及居民的积极参与。然而，传统的参与式范式需要经验丰富的规划专家，通常耗时且昂贵。幸运的是，新兴的大语言模型(LLMs)已经显示出相当大的能力来模拟类人代理，可以用于轻松模拟参与性过程。在这项工作中，我们引入了一个基于LLM的多代理协作框架，用于参与式城市规划，可以考虑居民的多样化需求生成城市地区的土地利用规划。具体来说，我们构建了LLM代理来模拟规划者和成千上万具有不同背景和特点的居民。我们首先要求规划者制定一项初步土地利用规划。为了解决居民对不同设施需求的问题，我们在每个社区中让居民展开讨论...",
    "tldr": "本研究引入了基于大语言模型的多代理协作框架，用于参与式城市规划，可以生成考虑居民多样化需求的城市土地利用规划。"
}