{
    "title": "Withdrawal Success Optimization in a Pooled Annuity Fund",
    "abstract": "arXiv:2402.17164v1 Announce Type: new  Abstract: Consider a closed pooled annuity fund investing in n assets with discrete-time rebalancing. At time 0, each annuitant makes an initial contribution to the fund, committing to a predetermined schedule of withdrawals. Require annuitants to be homogeneous in the sense that their initial contributions and predetermined withdrawal schedules are identical, and their mortality distributions are identical and independent. Under the forementioned setup, the probability for a particular annuitant to complete the prescribed withdrawals until death is maximized over progressively measurable portfolio weight functions. Applications consider fund portfolios that mix two assets: the S&P Composite Index and an inflation-protected bond. The maximum probability is computed for annually rebalanced schedules consisting of an initial investment and then equal annual withdrawals until death. A considerable increase in the maximum probability is achieved by in",
    "link": "https://arxiv.org/abs/2402.17164",
    "context": "Title: Withdrawal Success Optimization in a Pooled Annuity Fund\nAbstract: arXiv:2402.17164v1 Announce Type: new  Abstract: Consider a closed pooled annuity fund investing in n assets with discrete-time rebalancing. At time 0, each annuitant makes an initial contribution to the fund, committing to a predetermined schedule of withdrawals. Require annuitants to be homogeneous in the sense that their initial contributions and predetermined withdrawal schedules are identical, and their mortality distributions are identical and independent. Under the forementioned setup, the probability for a particular annuitant to complete the prescribed withdrawals until death is maximized over progressively measurable portfolio weight functions. Applications consider fund portfolios that mix two assets: the S&P Composite Index and an inflation-protected bond. The maximum probability is computed for annually rebalanced schedules consisting of an initial investment and then equal annual withdrawals until death. A considerable increase in the maximum probability is achieved by in",
    "path": "papers/24/02/2402.17164.json",
    "total_tokens": 805,
    "translated_title": "在合并年金基金中优化提取成功",
    "translated_abstract": "考虑一个投资于n种资产且具有离散时间再平衡的封闭型合并年金基金。在时间0，每位年金购买者向基金做出初始投资，并承诺按照预定的提取时间表提取。要求年金购买者在初始投资和预定提取时间表上是同质的，他们的死亡分布是相同且独立的。在上述设置下，最大化特定年金购买者直至死亡完成规定提取的概率，逐步可度量的组合权重函数。具有两种资产混合的基金组合的应用考虑了标准普尔综合指数和一种通胀保护债券。为初始投资和随后年均提取直至死亡的调整时间表计算了最大概率。通过调整组合权重函数进一步提高了最大概率。",
    "tldr": "在合并年金基金中，通过优化投资组合权重函数，最大化特定年金购买者完成规定提取直至死亡的概率，并且得到明显增加的最大概率。",
    "en_tdlr": "Maximizing the probability for specific annuitants to complete prescribed withdrawals until death by optimizing portfolio weight functions in pooled annuity fund leads to a significant increase in maximum probability."
}