{
    "title": "Quantitative causality, causality-guided scientific discovery, and causal machine learning",
    "abstract": "arXiv:2402.13427v1 Announce Type: new  Abstract: It has been said, arguably, that causality analysis should pave a promising way to interpretable deep learning and generalization. Incorporation of causality into artificial intelligence (AI) algorithms, however, is challenged with its vagueness, non-quantitiveness, computational inefficiency, etc. During the past 18 years, these challenges have been essentially resolved, with the establishment of a rigorous formalism of causality analysis initially motivated from atmospheric predictability. This not only opens a new field in the atmosphere-ocean science, namely, information flow, but also has led to scientific discoveries in other disciplines, such as quantum mechanics, neuroscience, financial economics, etc., through various applications. This note provides a brief review of the decade-long effort, including a list of major theoretical results, a sketch of the causal deep learning framework, and some representative real-world applicati",
    "link": "https://arxiv.org/abs/2402.13427",
    "context": "Title: Quantitative causality, causality-guided scientific discovery, and causal machine learning\nAbstract: arXiv:2402.13427v1 Announce Type: new  Abstract: It has been said, arguably, that causality analysis should pave a promising way to interpretable deep learning and generalization. Incorporation of causality into artificial intelligence (AI) algorithms, however, is challenged with its vagueness, non-quantitiveness, computational inefficiency, etc. During the past 18 years, these challenges have been essentially resolved, with the establishment of a rigorous formalism of causality analysis initially motivated from atmospheric predictability. This not only opens a new field in the atmosphere-ocean science, namely, information flow, but also has led to scientific discoveries in other disciplines, such as quantum mechanics, neuroscience, financial economics, etc., through various applications. This note provides a brief review of the decade-long effort, including a list of major theoretical results, a sketch of the causal deep learning framework, and some representative real-world applicati",
    "path": "papers/24/02/2402.13427.json",
    "total_tokens": 915,
    "translated_title": "定量因果关系、因果引导的科学发现和因果机器学习",
    "translated_abstract": "人们曾说，因果分析应该为可解释的深度学习和泛化铺平一条充满希望的道路。然而，将因果性纳入人工智能（AI）算法中面临着其模糊性、非定量性、计算效率低等挑战。在过去的18年中，这些挑战已基本得到解决，建立了一个严格的因果分析形式主义，最初是受大气可预测性启发而建立的。这不仅开启了大气海洋科学中的一个新领域，即信息流，还通过各种应用在其他学科中取得了科学发现，如量子力学、神经科学、金融经济等。本文提供了对过去十年努力的简要回顾，包括主要理论结果的列表、因果深度学习框架的概述以及一些代表性的实际应用。",
    "tldr": "因果分析在人工智能领域中的应用挑战已得到基本解决，建立了严格的因果分析形式主义，推动了因果深度学习框架的建立，促进了从大气海洋科学到量子力学、神经科学、金融经济等领域的科学发现。",
    "en_tdlr": "The challenges of applying causality analysis in artificial intelligence have been essentially resolved with the establishment of a rigorous formalism, leading to the development of a causal deep learning framework and scientific discoveries in various fields from atmospheric science to quantum mechanics, neuroscience, and financial economics."
}