{
    "title": "Towards MLOps: A DevOps Tools Recommender System for Machine Learning System",
    "abstract": "arXiv:2402.12867v1 Announce Type: cross  Abstract: Applying DevOps practices to machine learning system is termed as MLOps and machine learning systems evolve on new data unlike traditional systems on requirements. The objective of MLOps is to establish a connection between different open-source tools to construct a pipeline that can automatically perform steps to construct a dataset, train the machine learning model and deploy the model to the production as well as store different versions of model and dataset. Benefits of MLOps is to make sure the fast delivery of the new trained models to the production to have accurate results. Furthermore, MLOps practice impacts the overall quality of the software products and is completely dependent on open-source tools and selection of relevant open-source tools is considered as challenged while a generalized method to select an appropriate open-source tools is desirable. In this paper, we present a framework for recommendation system that proce",
    "link": "https://arxiv.org/abs/2402.12867",
    "context": "Title: Towards MLOps: A DevOps Tools Recommender System for Machine Learning System\nAbstract: arXiv:2402.12867v1 Announce Type: cross  Abstract: Applying DevOps practices to machine learning system is termed as MLOps and machine learning systems evolve on new data unlike traditional systems on requirements. The objective of MLOps is to establish a connection between different open-source tools to construct a pipeline that can automatically perform steps to construct a dataset, train the machine learning model and deploy the model to the production as well as store different versions of model and dataset. Benefits of MLOps is to make sure the fast delivery of the new trained models to the production to have accurate results. Furthermore, MLOps practice impacts the overall quality of the software products and is completely dependent on open-source tools and selection of relevant open-source tools is considered as challenged while a generalized method to select an appropriate open-source tools is desirable. In this paper, we present a framework for recommendation system that proce",
    "path": "papers/24/02/2402.12867.json",
    "total_tokens": 875,
    "translated_title": "朝着MLOps的方向：面向机器学习系统的DevOps工具推荐系统",
    "translated_abstract": "将DevOps实践应用于机器学习系统被称为MLOps，机器学习系统会随着新数据的出现而不断发展，与传统系统基于需求的方式不同。MLOps的目标是建立不同开源工具之间的连接，构建一个可以自动执行构建数据集、训练机器学习模型、部署模型到生产环境以及存储不同版本模型和数据集步骤的流水线。MLOps的好处在于确保将新训练好的模型快速交付到生产环境，以获得准确的结果。此外，MLOps实践会影响软件产品的整体质量，并且完全依赖于开源工具，选择相关开源工具被视为一项挑战，因此期望有一种通用方法来选择合适的开源工具。本文提出了一个推荐系统框架，该框架可以...",
    "tldr": "本研究提出了一个用于机器学习系统的DevOps工具推荐系统，旨在建立一个可以自动构建数据集、训练模型、部署模型以及存储模型和数据集的流水线，以提高模型交付的速度和结果准确性。"
}