{
    "title": "A Condensed Transition Graph Framework for Zero-shot Link Prediction with Large Language Models",
    "abstract": "arXiv:2402.10779v1 Announce Type: new  Abstract: Zero-shot link prediction (ZSLP) on knowledge graphs aims at automatically identifying relations between given entities. Existing methods primarily employ auxiliary information to predict tail entity given head entity and its relation, yet face challenges due to the occasional unavailability of such detailed information and the inherent simplicity of predicting tail entities based on semantic similarities. Even though Large Language Models (LLMs) offer a promising solution to predict unobserved relations between the head and tail entity in a zero-shot manner, their performance is still restricted due to the inability to leverage all the (exponentially many) paths' information between two entities, which are critical in collectively indicating their relation types. To address this, in this work, we introduce a Condensed Transition Graph Framework for Zero-Shot Link Prediction (CTLP), which encodes all the paths' information in linear time",
    "link": "https://arxiv.org/abs/2402.10779",
    "context": "Title: A Condensed Transition Graph Framework for Zero-shot Link Prediction with Large Language Models\nAbstract: arXiv:2402.10779v1 Announce Type: new  Abstract: Zero-shot link prediction (ZSLP) on knowledge graphs aims at automatically identifying relations between given entities. Existing methods primarily employ auxiliary information to predict tail entity given head entity and its relation, yet face challenges due to the occasional unavailability of such detailed information and the inherent simplicity of predicting tail entities based on semantic similarities. Even though Large Language Models (LLMs) offer a promising solution to predict unobserved relations between the head and tail entity in a zero-shot manner, their performance is still restricted due to the inability to leverage all the (exponentially many) paths' information between two entities, which are critical in collectively indicating their relation types. To address this, in this work, we introduce a Condensed Transition Graph Framework for Zero-Shot Link Prediction (CTLP), which encodes all the paths' information in linear time",
    "path": "papers/24/02/2402.10779.json",
    "total_tokens": 849,
    "translated_title": "一种用于零样本链接预测的紧凑转换图框架与大型语言模型",
    "translated_abstract": "零样本链接预测（ZSLP）旨在自动识别给定实体之间的关系。现有方法主要利用辅助信息来预测给定头实体和其关系时的尾实体，然而面临挑战，原因是有时缺乏这些详细信息，并且基于语义相似性来预测尾实体的固有简单性。尽管大型语言模型（LLMs）为以零样本方式预测头实体和尾实体之间的未观察到的关系提供了有前途的解决方案，但其性能仍受限于无法利用两个实体之间所有（指数多）路径信息的能力，这些信息对于共同指示它们的关系类型至关重要。为了解决这个问题，在这项工作中，我们引入了一种用于零样本链接预测的紧凑转换图框架（CTLP），它以线性时间编码了所有路径的信息。",
    "tldr": "提出了一种用于零样本链接预测的紧凑转换图框架，能够在线性时间内编码所有路径的信息，并可解决大型语言模型性能受限的问题。",
    "en_tdlr": "Introducing a Condensed Transition Graph Framework for Zero-Shot Link Prediction that encodes all paths' information in linear time, addressing the performance limitations of Large Language Models."
}