{
    "title": "Predicting machine failures from multivariate time series: an industrial case study",
    "abstract": "arXiv:2402.17804v1 Announce Type: new  Abstract: Non-neural Machine Learning (ML) and Deep Learning (DL) models are often used to predict system failures in the context of industrial maintenance. However, only a few researches jointly assess the effect of varying the amount of past data used to make a prediction and the extension in the future of the forecast. This study evaluates the impact of the size of the reading window and of the prediction window on the performances of models trained to forecast failures in three data sets concerning the operation of (1) an industrial wrapping machine working in discrete sessions, (2) an industrial blood refrigerator working continuously, and (3) a nitrogen generator working continuously. The problem is formulated as a binary classification task that assigns the positive label to the prediction window based on the probability of a failure to occur in such an interval. Six algorithms (logistic regression, random forest, support vector machine, LS",
    "link": "https://arxiv.org/abs/2402.17804",
    "context": "Title: Predicting machine failures from multivariate time series: an industrial case study\nAbstract: arXiv:2402.17804v1 Announce Type: new  Abstract: Non-neural Machine Learning (ML) and Deep Learning (DL) models are often used to predict system failures in the context of industrial maintenance. However, only a few researches jointly assess the effect of varying the amount of past data used to make a prediction and the extension in the future of the forecast. This study evaluates the impact of the size of the reading window and of the prediction window on the performances of models trained to forecast failures in three data sets concerning the operation of (1) an industrial wrapping machine working in discrete sessions, (2) an industrial blood refrigerator working continuously, and (3) a nitrogen generator working continuously. The problem is formulated as a binary classification task that assigns the positive label to the prediction window based on the probability of a failure to occur in such an interval. Six algorithms (logistic regression, random forest, support vector machine, LS",
    "path": "papers/24/02/2402.17804.json",
    "total_tokens": 824,
    "translated_title": "从多变量时间序列预测机器故障: 一个工业案例研究",
    "translated_abstract": "非神经机器学习（ML）和深度学习（DL）模型通常用于预测工业维护背景下系统故障。然而，仅有少数研究同时评估了用于做出预测的过去数据量和对未来预测的延伸的影响。本研究评估了训练模型以预测在(1)工业包装机器在离散会话中运行、(2)工业血液冰箱持续运行和(3)氮气发生器持续运行的三个数据集中故障的性能的读取窗口大小和预测窗口对其的影响。该问题被制定为一个二元分类任务，根据失败在该间隔内可能发生的概率将正标签分配给预测窗口。六种算法（逻辑回归、随机森林、支持向量机、LS",
    "tldr": "该研究评估了不同大小的历史数据窗口和预测窗口对工业设备故障预测模型性能的影响。",
    "en_tdlr": "This study evaluates the impact of varying the size of historical data window and prediction window on the performance of models predicting industrial equipment failures."
}