{
    "title": "J-UniMorph: Japanese Morphological Annotation through the Universal Feature Schema",
    "abstract": "arXiv:2402.14411v1 Announce Type: new  Abstract: We introduce a Japanese Morphology dataset, J-UniMorph, developed based on the UniMorph feature schema. This dataset addresses the unique and rich verb forms characteristic of the language's agglutinative nature. J-UniMorph distinguishes itself from the existing Japanese subset of UniMorph, which is automatically extracted from Wiktionary. On average, the Wiktionary Edition features around 12 inflected forms for each word and is primarily dominated by denominal verbs (i.e., [noun] +suru (do-PRS)). Morphologically, this form is equivalent to the verb suru (do). In contrast, J-UniMorph explores a much broader and more frequently used range of verb forms, offering 118 inflected forms for each word on average. It includes honorifics, a range of politeness levels, and other linguistic nuances, emphasizing the distinctive characteristics of the Japanese language. This paper presents detailed statistics and characteristics of J-UniMorph, compar",
    "link": "https://arxiv.org/abs/2402.14411",
    "context": "Title: J-UniMorph: Japanese Morphological Annotation through the Universal Feature Schema\nAbstract: arXiv:2402.14411v1 Announce Type: new  Abstract: We introduce a Japanese Morphology dataset, J-UniMorph, developed based on the UniMorph feature schema. This dataset addresses the unique and rich verb forms characteristic of the language's agglutinative nature. J-UniMorph distinguishes itself from the existing Japanese subset of UniMorph, which is automatically extracted from Wiktionary. On average, the Wiktionary Edition features around 12 inflected forms for each word and is primarily dominated by denominal verbs (i.e., [noun] +suru (do-PRS)). Morphologically, this form is equivalent to the verb suru (do). In contrast, J-UniMorph explores a much broader and more frequently used range of verb forms, offering 118 inflected forms for each word on average. It includes honorifics, a range of politeness levels, and other linguistic nuances, emphasizing the distinctive characteristics of the Japanese language. This paper presents detailed statistics and characteristics of J-UniMorph, compar",
    "path": "papers/24/02/2402.14411.json",
    "total_tokens": 926,
    "translated_title": "J-UniMorph: 通过通用特征模式对日语进行形态学标注",
    "translated_abstract": "我们介绍了一种基于UniMorph特征模式开发的日语形态学数据集J-UniMorph。该数据集解决了这种词语凝聚性语言特有的独特和丰富的动词形式。J-UniMorph与现有的从维基词典自动提取的UniMorph日语子集有所不同。通常，维基词典版本每个单词平均包含约12个屈折形式，并且主要以[名词]+する(做-现在时)的名词性动词为主导。从形态学上讲，这种形式等同于动词する(做)。相比之下，J-UniMorph探索了更广泛且更常用的动词形式范围，平均为每个单词提供了118个屈折形式。它包括敬语、一系列礼貌水平以及其他语言细微差别，强调了日语的独特特点。本文呈现了J-UniMorph的详细统计数据和特征，进行了比较。",
    "tldr": "J-UniMorph通过提供更广泛且更频繁使用的动词形式，包括敬语、一系列礼貌水平和其他语言细微差别，强调了日语的独特特点。",
    "en_tdlr": "J-UniMorph emphasizes the unique characteristics of the Japanese language by offering a broader and more frequently used range of verb forms, including honorifics, a range of politeness levels, and other linguistic nuances."
}