{
    "title": "Novi jezi\\v{c}ki modeli za srpski jezik",
    "abstract": "arXiv:2402.14379v1 Announce Type: new  Abstract: The paper will briefly present the development history of transformer-based language models for the Serbian language. Several new models for text generation and vectorization, trained on the resources of the Society for Language Resources and Technologies, will also be presented. Ten selected vectorization models for Serbian, including two new ones, will be compared on four natural language processing tasks. Paper will analyze which models are the best for each selected task, how does their size and the size of their training sets affect the performance on those tasks, and what is the optimal setting to train the best language models for the Serbian language.",
    "link": "https://arxiv.org/abs/2402.14379",
    "context": "Title: Novi jezi\\v{c}ki modeli za srpski jezik\nAbstract: arXiv:2402.14379v1 Announce Type: new  Abstract: The paper will briefly present the development history of transformer-based language models for the Serbian language. Several new models for text generation and vectorization, trained on the resources of the Society for Language Resources and Technologies, will also be presented. Ten selected vectorization models for Serbian, including two new ones, will be compared on four natural language processing tasks. Paper will analyze which models are the best for each selected task, how does their size and the size of their training sets affect the performance on those tasks, and what is the optimal setting to train the best language models for the Serbian language.",
    "path": "papers/24/02/2402.14379.json",
    "total_tokens": 762,
    "translated_title": "Novi jezički modeli za srpski jezik",
    "translated_abstract": "Rad će ukratko predstaviti istoriju razvoja modela jezika zasnovanih na transformatorima za srpski jezik. Takođe će biti predstavljeni novi modeli za generisanje teksta i vektorizaciju, obučeni na resursima Društva za jezičke resurse i tehnologije. Biće upoređeno deset izabranih modela vektorizacije za srpski jezik, uključujući dva nova, na četiri zadatka obrade prirodnog jezika. Rad će analizirati koji modeli su najbolji za svaki izabrani zadatak, kako njihova veličina i veličina skupova za obuku utiču na performanse na tim zadacima, i koji je optimalni skup za obuku najboljih jezičkih modela za srpski jezik.",
    "tldr": "Rad predstavlja novi jezički model za srpski jezik zasnovan na transformerima, obučen na resursima Društva za jezičke resurse i tehnologije, koji će biti upoređen sa deset odabranih modela vektorizacije na četiri zadatka obrade prirodnog jezika.",
    "en_tdlr": "The paper introduces a new language model for the Serbian language based on transformers, trained on the resources of the Society for Language Resources and Technologies, which will be compared with ten selected vectorization models on four natural language processing tasks."
}