{
    "title": "2AFC Prompting of Large Multimodal Models for Image Quality Assessment",
    "abstract": "While abundant research has been conducted on improving high-level visual understanding and reasoning capabilities of large multimodal models~(LMMs), their visual quality assessment~(IQA) ability has been relatively under-explored. Here we take initial steps towards this goal by employing the two-alternative forced choice~(2AFC) prompting, as 2AFC is widely regarded as the most reliable way of collecting human opinions of visual quality. Subsequently, the global quality score of each image estimated by a particular LMM can be efficiently aggregated using the maximum a posterior estimation. Meanwhile, we introduce three evaluation criteria: consistency, accuracy, and correlation, to provide comprehensive quantifications and deeper insights into the IQA capability of five LMMs. Extensive experiments show that existing LMMs exhibit remarkable IQA ability on coarse-grained quality comparison, but there is room for improvement on fine-grained quality discrimination. The proposed dataset she",
    "link": "https://rss.arxiv.org/abs/2402.01162",
    "context": "Title: 2AFC Prompting of Large Multimodal Models for Image Quality Assessment\nAbstract: While abundant research has been conducted on improving high-level visual understanding and reasoning capabilities of large multimodal models~(LMMs), their visual quality assessment~(IQA) ability has been relatively under-explored. Here we take initial steps towards this goal by employing the two-alternative forced choice~(2AFC) prompting, as 2AFC is widely regarded as the most reliable way of collecting human opinions of visual quality. Subsequently, the global quality score of each image estimated by a particular LMM can be efficiently aggregated using the maximum a posterior estimation. Meanwhile, we introduce three evaluation criteria: consistency, accuracy, and correlation, to provide comprehensive quantifications and deeper insights into the IQA capability of five LMMs. Extensive experiments show that existing LMMs exhibit remarkable IQA ability on coarse-grained quality comparison, but there is room for improvement on fine-grained quality discrimination. The proposed dataset she",
    "path": "papers/24/02/2402.01162.json",
    "total_tokens": 897,
    "translated_title": "2AFC调控大型多模态模型用于图像质量评估",
    "tldr": "本研究使用2AFC提示方法，以提高大型多模态模型在图像质量评估方面的能力。实验结果表明现有模型在粗粒度质量比较上表现出色，但在细粒度质量判别上还有改进的空间。",
    "en_tdlr": "This study explores the use of 2AFC prompting to improve the image quality assessment capabilities of large multimodal models. The experiments show that existing models perform well in coarse-grained quality comparison but can be improved in fine-grained quality discrimination."
}