{
    "title": "Decentralized Blockchain-based Robust Multi-agent Multi-armed Bandit",
    "abstract": "We study a robust multi-agent multi-armed bandit problem where multiple clients or participants are distributed on a fully decentralized blockchain, with the possibility of some being malicious. The rewards of arms are homogeneous among the clients, following time-invariant stochastic distributions that are revealed to the participants only when the system is secure enough. The system's objective is to efficiently ensure the cumulative rewards gained by the honest participants. To this end and to the best of our knowledge, we are the first to incorporate advanced techniques from blockchains, as well as novel mechanisms, into the system to design optimal strategies for honest participants. This allows various malicious behaviors and the maintenance of participant privacy. More specifically, we randomly select a pool of validators who have access to all participants, design a brand-new consensus mechanism based on digital signatures for these validators, invent a UCB-based strategy that ",
    "link": "https://arxiv.org/abs/2402.04417",
    "context": "Title: Decentralized Blockchain-based Robust Multi-agent Multi-armed Bandit\nAbstract: We study a robust multi-agent multi-armed bandit problem where multiple clients or participants are distributed on a fully decentralized blockchain, with the possibility of some being malicious. The rewards of arms are homogeneous among the clients, following time-invariant stochastic distributions that are revealed to the participants only when the system is secure enough. The system's objective is to efficiently ensure the cumulative rewards gained by the honest participants. To this end and to the best of our knowledge, we are the first to incorporate advanced techniques from blockchains, as well as novel mechanisms, into the system to design optimal strategies for honest participants. This allows various malicious behaviors and the maintenance of participant privacy. More specifically, we randomly select a pool of validators who have access to all participants, design a brand-new consensus mechanism based on digital signatures for these validators, invent a UCB-based strategy that ",
    "path": "papers/24/02/2402.04417.json",
    "total_tokens": 884,
    "translated_title": "基于分散区块链的稳健多智能体多臂赌博问题研究",
    "translated_abstract": "我们研究了一种稳健的多智能体多臂赌博问题，在这个问题中，多个客户或参与者分布在一个完全分散的区块链上，其中一些可能是恶意的。臂的奖励在参与者之间是均匀的，遵循时间不变的随机分布，只有在系统足够安全时才向参与者透露。系统的目标是有效地确保诚实参与者获得的累积奖励。为此，我们是第一个将区块链的先进技术和新颖的机制结合到系统中，为诚实参与者设计最佳策略。这样可以应对各种恶意行为并保护参与者的隐私。具体来说，我们随机选择了一组可以访问所有参与者的验证者池，为这些验证者设计了一种基于数字签名的全新共识机制，并发明了一种基于UCB的策略。",
    "tldr": "本研究通过将分散区块链技术与新颖机制结合，设计了一种稳健的多智能体多臂赌博问题解决方案，以确保诚实参与者获得的累积奖励，并应对恶意行为和保护参与者隐私的需求。",
    "en_tdlr": "This research proposes a robust solution to the multi-agent multi-armed bandit problem by integrating decentralized blockchain technology with novel mechanisms, aiming to ensure cumulative rewards for honest participants, address malicious behaviors, and protect participant privacy."
}