{
    "title": "Construction and application of artificial intelligence crowdsourcing map based on multi-track GPS data",
    "abstract": "arXiv:2402.15796v1 Announce Type: new  Abstract: In recent years, the rapid development of high-precision map technology combined with artificial intelligence has ushered in a new development opportunity in the field of intelligent vehicles. High-precision map technology is an important guarantee for intelligent vehicles to achieve autonomous driving. However, due to the lack of research on high-precision map technology, it is difficult to rationally use this technology in the field of intelligent vehicles. Therefore, relevant researchers studied a fast and effective algorithm to generate high-precision GPS data from a large number of low-precision GPS trajectory data fusion, and generated several key data points to simplify the description of GPS trajectory, and realized the \"crowdsourced update\" model based on a large number of social vehicles for map data collection came into being. This kind of algorithm has the important significance to improve the data accuracy, reduce the measur",
    "link": "https://arxiv.org/abs/2402.15796",
    "context": "Title: Construction and application of artificial intelligence crowdsourcing map based on multi-track GPS data\nAbstract: arXiv:2402.15796v1 Announce Type: new  Abstract: In recent years, the rapid development of high-precision map technology combined with artificial intelligence has ushered in a new development opportunity in the field of intelligent vehicles. High-precision map technology is an important guarantee for intelligent vehicles to achieve autonomous driving. However, due to the lack of research on high-precision map technology, it is difficult to rationally use this technology in the field of intelligent vehicles. Therefore, relevant researchers studied a fast and effective algorithm to generate high-precision GPS data from a large number of low-precision GPS trajectory data fusion, and generated several key data points to simplify the description of GPS trajectory, and realized the \"crowdsourced update\" model based on a large number of social vehicles for map data collection came into being. This kind of algorithm has the important significance to improve the data accuracy, reduce the measur",
    "path": "papers/24/02/2402.15796.json",
    "total_tokens": 856,
    "translated_title": "基于多轨GPS数据构建和应用人工智能众包地图",
    "translated_abstract": "近年来，高精度地图技术和人工智能的快速发展为智能车辆领域带来了新的发展机遇。高精度地图技术是智能车辆实现自动驾驶的重要保障。然而，由于对高精度地图技术的研究不足，难以在智能车辆领域合理使用这一技术。因此，相关研究人员研究了一种快速有效的算法，从大量低精度GPS轨迹数据融合生成高精度GPS数据，并生成了若干关键数据点简化GPS轨迹描述，实现了基于大量社交车辆的地图数据收集的“众包更新”模型。这种算法对提高数据准确性、降低测量具有重要意义。",
    "tldr": "研究人员提出了一种快速有效的算法，从大量低精度GPS轨迹数据融合生成高精度GPS数据，实现了基于社交车辆的地图数据收集的“众包更新”模型，对提高数据准确性具有重要意义。",
    "en_tdlr": "Researchers proposed a fast and effective algorithm to generate high-precision GPS data from a large number of low-precision GPS trajectory data fusion, enabling a \"crowdsourced update\" model based on social vehicles for map data collection, which is of significant importance in improving data accuracy."
}