{
    "title": "With a Little Help from my (Linguistic) Friends: Topic Segmentation of Multi-party Casual Conversations",
    "abstract": "Topics play an important role in the global organisation of a conversation as what is currently discussed constrains the possible contributions of the participant. Understanding the way topics are organised in interaction would provide insight on the structure of dialogue beyond the sequence of utterances. However, studying this high-level structure is a complex task that we try to approach by first segmenting dialogues into smaller topically coherent sets of utterances. Understanding the interactions between these segments would then enable us to propose a model of topic organisation at a dialogue level. In this paper we work with open-domain conversations and try to reach a comparable level of accuracy as recent machine learning based topic segmentation models but with a formal approach. The features we identify as meaningful for this task help us understand better the topical structure of a conversation.",
    "link": "https://arxiv.org/abs/2402.02837",
    "context": "Title: With a Little Help from my (Linguistic) Friends: Topic Segmentation of Multi-party Casual Conversations\nAbstract: Topics play an important role in the global organisation of a conversation as what is currently discussed constrains the possible contributions of the participant. Understanding the way topics are organised in interaction would provide insight on the structure of dialogue beyond the sequence of utterances. However, studying this high-level structure is a complex task that we try to approach by first segmenting dialogues into smaller topically coherent sets of utterances. Understanding the interactions between these segments would then enable us to propose a model of topic organisation at a dialogue level. In this paper we work with open-domain conversations and try to reach a comparable level of accuracy as recent machine learning based topic segmentation models but with a formal approach. The features we identify as meaningful for this task help us understand better the topical structure of a conversation.",
    "path": "papers/24/02/2402.02837.json",
    "total_tokens": 789,
    "translated_title": "从（语言的）朋友那里得到一点帮助：多方随意对话的主题分割",
    "translated_abstract": "主题在对话的全局组织中发挥重要作用，当前讨论的内容限制了参与者的可能贡献。理解主题在互动中的组织方式将揭示对话结构超越话语序列的洞察。然而，研究这种高层结构是一项复杂任务，我们首先尝试将对话分割为更小的主题连贯的话语集合。理解这些片段之间的交互将使我们能够提出对话级别的主题组织模型。在本文中，我们使用开放领域的对话，试图以正式方法达到与最近基于机器学习的主题分割模型相当的准确性。我们确定的对于这个任务有意义的特征有助于更好地理解对话的主题结构。",
    "tldr": "在这篇论文中，我们从对话中识别出有意义的特征，通过将对话分割为主题连贯的话语集合，以一个正式的方法来研究对话的主题组织结构。",
    "en_tdlr": "In this paper, we identify meaningful features from conversations and study the topic organization structure of dialogues by segmenting them into topically coherent sets of utterances using a formal approach."
}