{
    "title": "Multi-Agent Collaboration Framework for Recommender Systems",
    "abstract": "arXiv:2402.15235v1 Announce Type: new  Abstract: LLM-based agents have gained considerable attention for their decision-making skills and ability to handle complex tasks. Recognizing the current gap in leveraging agent capabilities for multi-agent collaboration in recommendation systems, we introduce MACRec, a novel framework designed to enhance recommendation systems through multi-agent collaboration. Unlike existing work on using agents for user/item simulation, we aim to deploy multi-agents to tackle recommendation tasks directly. In our framework, recommendation tasks are addressed through the collaborative efforts of various specialized agents, including Manager, User/Item Analyst, Reflector, Searcher, and Task Interpreter, with different working flows. Furthermore, we provide application examples of how developers can easily use MACRec on various recommendation tasks, including rating prediction, sequential recommendation, conversational recommendation, and explanation generation",
    "link": "https://arxiv.org/abs/2402.15235",
    "context": "Title: Multi-Agent Collaboration Framework for Recommender Systems\nAbstract: arXiv:2402.15235v1 Announce Type: new  Abstract: LLM-based agents have gained considerable attention for their decision-making skills and ability to handle complex tasks. Recognizing the current gap in leveraging agent capabilities for multi-agent collaboration in recommendation systems, we introduce MACRec, a novel framework designed to enhance recommendation systems through multi-agent collaboration. Unlike existing work on using agents for user/item simulation, we aim to deploy multi-agents to tackle recommendation tasks directly. In our framework, recommendation tasks are addressed through the collaborative efforts of various specialized agents, including Manager, User/Item Analyst, Reflector, Searcher, and Task Interpreter, with different working flows. Furthermore, we provide application examples of how developers can easily use MACRec on various recommendation tasks, including rating prediction, sequential recommendation, conversational recommendation, and explanation generation",
    "path": "papers/24/02/2402.15235.json",
    "total_tokens": 817,
    "translated_title": "用于推荐系统的多智能体协作框架",
    "translated_abstract": "基于LLM的智能体因其决策技能和处理复杂任务的能力而受到广泛关注。鉴于当前在利用智能体协作能力增强推荐系统方面存在的空白，我们介绍了MACRec，这是一个旨在通过多智能体协作增强推荐系统的新颖框架。与现有关于使用智能体进行用户/商品模拟的工作不同，我们旨在部署多智能体直接处理推荐任务。在我们的框架中，通过各种专业智能体的协作努力来解决推荐任务，包括经理、用户/商品分析师、反射器、搜索器和任务解释器，它们具有不同的工作流。此外，我们提供应用示例，说明开发人员如何轻松在各种推荐任务上使用MACRec，包括评分预测、序列推荐、对话推荐和解释生成。",
    "tldr": "MACRec是一个新颖的框架，旨在通过多智能体协作来增强推荐系统，提供了多种专业智能体的协作努力解决推荐任务，并提供了应用示例。",
    "en_tdlr": "MACRec is a novel framework designed to enhance recommendation systems through multi-agent collaboration, providing collaborative efforts of various specialized agents to tackle recommendation tasks and application examples."
}