{
    "title": "Review on Fault Diagnosis and Fault-Tolerant Control Scheme for Robotic Manipulators: Recent Advances in AI, Machine Learning, and Digital Twin",
    "abstract": "This comprehensive review article delves into the intricate realm of fault-tolerant control (FTC) schemes tailored for robotic manipulators. Our exploration spans the historical evolution of FTC, tracing its development over time, and meticulously examines the recent breakthroughs fueled by the synergistic integration of cutting-edge technologies such as artificial intelligence (AI), machine learning (ML), and digital twin technologies (DTT). The article places a particular emphasis on the transformative influence these contemporary trends exert on the landscape of robotic manipulator control and fault tolerance.   By delving into the historical context, our aim is to provide a comprehensive understanding of the evolution of FTC schemes. This journey encompasses the transition from model-based and signal-based schemes to the role of sensors, setting the stage for an exploration of the present-day paradigm shift enabled by AI, ML, and DTT. The narrative unfolds as we dissect the intrica",
    "link": "https://arxiv.org/abs/2402.02980",
    "context": "Title: Review on Fault Diagnosis and Fault-Tolerant Control Scheme for Robotic Manipulators: Recent Advances in AI, Machine Learning, and Digital Twin\nAbstract: This comprehensive review article delves into the intricate realm of fault-tolerant control (FTC) schemes tailored for robotic manipulators. Our exploration spans the historical evolution of FTC, tracing its development over time, and meticulously examines the recent breakthroughs fueled by the synergistic integration of cutting-edge technologies such as artificial intelligence (AI), machine learning (ML), and digital twin technologies (DTT). The article places a particular emphasis on the transformative influence these contemporary trends exert on the landscape of robotic manipulator control and fault tolerance.   By delving into the historical context, our aim is to provide a comprehensive understanding of the evolution of FTC schemes. This journey encompasses the transition from model-based and signal-based schemes to the role of sensors, setting the stage for an exploration of the present-day paradigm shift enabled by AI, ML, and DTT. The narrative unfolds as we dissect the intrica",
    "path": "papers/24/02/2402.02980.json",
    "total_tokens": 999,
    "translated_title": "机器人操纵器的故障诊断和容错控制方案综述：人工智能、机器学习和数字孪生的最新进展",
    "translated_abstract": "这篇全面的综述文章深入探讨了针对机器人操纵器量身定制的容错控制（FTC）方案的复杂领域。我们的探索涵盖了FTC的历史演变，追溯其随时间的发展，并详细考察了人工智能（AI）、机器学习（ML）和数字孪生技术（DTT）等尖端技术相互融合所驱动的最新突破。本文特别强调了这些当代趋势在机器人操纵器控制和容错能力领域所产生的变革影响。通过深入研究历史背景，我们旨在提供对FTC方案演变的全面理解。这一过程包括了从基于模型和基于信号的方案过渡到传感器的作用，为后续探索AI、ML和DTT所带来的当今范式转变打下基础。我们在解剖这个复杂的氛围的同时，涵盖了各种近期研究所采用的AI、ML和DTT在机器人操纵器控制和容错能力方面的创新方法。",
    "tldr": "这篇综述文章介绍了针对机器人操纵器的故障诊断和容错控制方案的最新进展，重点关注人工智能、机器学习和数字孪生等尖端技术对机器人控制和容错能力的变革影响。",
    "en_tdlr": "This review article presents the recent advances in fault diagnosis and fault-tolerant control schemes for robotic manipulators, with a particular focus on the transformative impact of cutting-edge technologies such as artificial intelligence, machine learning, and digital twin technologies on robotic control and fault tolerance."
}