{
    "title": "Descriptive Kernel Convolution Network with Improved Random Walk Kernel",
    "abstract": "Graph kernels used to be the dominant approach to feature engineering for structured data, which are superseded by modern GNNs as the former lacks learnability. Recently, a suite of Kernel Convolution Networks (KCNs) successfully revitalized graph kernels by introducing learnability, which convolves input with learnable hidden graphs using a certain graph kernel. The random walk kernel (RWK) has been used as the default kernel in many KCNs, gaining increasing attention. In this paper, we first revisit the RWK and its current usage in KCNs, revealing several shortcomings of the existing designs, and propose an improved graph kernel RWK+, by introducing color-matching random walks and deriving its efficient computation. We then propose RWK+CN, a KCN that uses RWK+ as the core kernel to learn descriptive graph features with an unsupervised objective, which can not be achieved by GNNs. Further, by unrolling RWK+, we discover its connection with a regular GCN layer, and propose a novel GNN ",
    "link": "https://arxiv.org/abs/2402.06087",
    "context": "Title: Descriptive Kernel Convolution Network with Improved Random Walk Kernel\nAbstract: Graph kernels used to be the dominant approach to feature engineering for structured data, which are superseded by modern GNNs as the former lacks learnability. Recently, a suite of Kernel Convolution Networks (KCNs) successfully revitalized graph kernels by introducing learnability, which convolves input with learnable hidden graphs using a certain graph kernel. The random walk kernel (RWK) has been used as the default kernel in many KCNs, gaining increasing attention. In this paper, we first revisit the RWK and its current usage in KCNs, revealing several shortcomings of the existing designs, and propose an improved graph kernel RWK+, by introducing color-matching random walks and deriving its efficient computation. We then propose RWK+CN, a KCN that uses RWK+ as the core kernel to learn descriptive graph features with an unsupervised objective, which can not be achieved by GNNs. Further, by unrolling RWK+, we discover its connection with a regular GCN layer, and propose a novel GNN ",
    "path": "papers/24/02/2402.06087.json",
    "total_tokens": 933,
    "translated_title": "具有改进的随机游走核的描述性核卷积网络",
    "translated_abstract": "图核曾经是处理结构化数据的主要特征工程方法，但由于缺乏可学习性，已被现代GNN取代。最近，一系列核卷积网络(KCNs)通过引入可学习的隐藏图来卷积输入数据，成功地使图核得以复苏。随机游走核(RWK)作为许多KCNs中的默认核，受到越来越多的关注。本文首先重新审视了RWK及其在KCNs中的现有使用情况，并揭示了现有设计的几个不足之处，提出了一种改进的图核RWK+，通过引入颜色匹配随机游走并推导其高效计算方法。然后，我们提出了RWK+CN，一个使用RWK+作为核心核函数的KCN，通过无监督目标来学习描述性的图特征，这是GNNs无法实现的。此外，通过展开RWK+，我们发现它与常规GCN层存在联系，并提出了一种新颖的GNN方法。",
    "tldr": "本文提出了一种描述性核卷积网络，通过改进随机游走核并引入颜色匹配随机游走，提升了图核在特征工程中的可学习性。进一步发现了随机游走核与GCN层的联系，并提出了一种新颖的GNN方法。",
    "en_tdlr": "This paper proposes a Descriptive Kernel Convolution Network by improving the Random Walk Kernel and introducing color-matching random walks, enhancing the learnability of graph kernels in feature engineering. Furthermore, the paper discovers the connection between the Random Walk Kernel and GCN layer and proposes a novel GNN approach."
}