{
    "title": "Deinterleaving of Discrete Renewal Process Mixtures with Application to Electronic Support Measures",
    "abstract": "arXiv:2402.09166v1 Announce Type: new Abstract: In this paper, we propose a new deinterleaving method for mixtures of discrete renewal Markov chains. This method relies on the maximization of a penalized likelihood score. It exploits all available information about both the sequence of the different symbols and their arrival times. A theoretical analysis is carried out to prove that minimizing this score allows to recover the true partition of symbols in the large sample limit, under mild conditions on the component processes. This theoretical analysis is then validated by experiments on synthetic data. Finally, the method is applied to deinterleave pulse trains received from different emitters in a RESM (Radar Electronic Support Measurements) context and we show that the proposed method competes favorably with state-of-the-art methods on simulated warfare datasets.",
    "link": "https://arxiv.org/abs/2402.09166",
    "context": "Title: Deinterleaving of Discrete Renewal Process Mixtures with Application to Electronic Support Measures\nAbstract: arXiv:2402.09166v1 Announce Type: new Abstract: In this paper, we propose a new deinterleaving method for mixtures of discrete renewal Markov chains. This method relies on the maximization of a penalized likelihood score. It exploits all available information about both the sequence of the different symbols and their arrival times. A theoretical analysis is carried out to prove that minimizing this score allows to recover the true partition of symbols in the large sample limit, under mild conditions on the component processes. This theoretical analysis is then validated by experiments on synthetic data. Finally, the method is applied to deinterleave pulse trains received from different emitters in a RESM (Radar Electronic Support Measurements) context and we show that the proposed method competes favorably with state-of-the-art methods on simulated warfare datasets.",
    "path": "papers/24/02/2402.09166.json",
    "total_tokens": 841,
    "translated_title": "混合离散更新过程的解缠织方法及其在电子支援措施中的应用",
    "translated_abstract": "在本文中，我们提出了一种用于混合离散更新Markov链的新的解缠织方法。该方法依赖于对惩罚似然分数的最大化。它利用了有关不同符号序列及其到达时间的所有可用信息。通过理论分析证明，在组成过程上满足一定条件的情况下，最小化该分数能够在大样本限制下恢复出真实的符号分组。然后，通过对合成数据的实验验证了该理论分析。最后，将该方法应用于从RESM（雷达电子支援测量）环境中接收到的不同发射机的脉冲串解缠织，并且我们展示了该方法在模拟战数据集上与最先进的方法相比具有竞争优势。",
    "tldr": "本文提出了一种用于解缠织混合离散更新Markov链的新方法，通过最大化惩罚似然分数来恢复真实的符号分组，并在电子支援措施中的应用中展示了较好的性能。",
    "en_tdlr": "This paper proposes a new method for deinterleaving mixtures of discrete renewal Markov chains, which recovers the true partition of symbols by maximizing a penalized likelihood score. Experimental results show the method performs well in deinterleaving pulse trains received from different emitters in a Radar Electronic Support Measurements (RESM) context."
}