{
    "title": "Unveiling Delay Effects in Traffic Forecasting: A Perspective from Spatial-Temporal Delay Differential Equations",
    "abstract": "Traffic flow forecasting is a fundamental research issue for transportation planning and management, which serves as a canonical and typical example of spatial-temporal predictions. In recent years, Graph Neural Networks (GNNs) and Recurrent Neural Networks (RNNs) have achieved great success in capturing spatial-temporal correlations for traffic flow forecasting. Yet, two non-ignorable issues haven't been well solved: 1) The message passing in GNNs is immediate, while in reality the spatial message interactions among neighboring nodes can be delayed. The change of traffic flow at one node will take several minutes, i.e., time delay, to influence its connected neighbors. 2) Traffic conditions undergo continuous changes. The prediction frequency for traffic flow forecasting may vary based on specific scenario requirements. Most existing discretized models require retraining for each prediction horizon, restricting their applicability. To tackle the above issues, we propose a neural Spati",
    "link": "https://rss.arxiv.org/abs/2402.01231",
    "context": "Title: Unveiling Delay Effects in Traffic Forecasting: A Perspective from Spatial-Temporal Delay Differential Equations\nAbstract: Traffic flow forecasting is a fundamental research issue for transportation planning and management, which serves as a canonical and typical example of spatial-temporal predictions. In recent years, Graph Neural Networks (GNNs) and Recurrent Neural Networks (RNNs) have achieved great success in capturing spatial-temporal correlations for traffic flow forecasting. Yet, two non-ignorable issues haven't been well solved: 1) The message passing in GNNs is immediate, while in reality the spatial message interactions among neighboring nodes can be delayed. The change of traffic flow at one node will take several minutes, i.e., time delay, to influence its connected neighbors. 2) Traffic conditions undergo continuous changes. The prediction frequency for traffic flow forecasting may vary based on specific scenario requirements. Most existing discretized models require retraining for each prediction horizon, restricting their applicability. To tackle the above issues, we propose a neural Spati",
    "path": "papers/24/02/2402.01231.json",
    "total_tokens": 894,
    "translated_title": "交通预测中的延迟效应揭示：基于时空延迟微分方程的视角",
    "translated_abstract": "交通流量预测是交通规划和管理中的一个基本研究问题，也是空间-时间预测的一个典型例子。最近，图神经网络（GNNs）和循环神经网络（RNNs）在捕捉交通流量预测的空间-时间相关性方面取得了巨大成功。然而，目前仍有两个不可忽视的问题没有得到很好地解决：1）GNNs中的消息传递是即时的，而在现实中，邻居节点之间的空间消息交互可能存在延迟。交通流量在一个节点上的变化需要几分钟的时间延迟，才能影响其相连的邻居节点。2）交通状况不断变化。交通流量预测的预测频率可能根据具体场景要求而变化。目前大多数现有的离散模型需要针对每个预测时间段进行重新训练，限制了它们的适用性。为了解决以上问题，我们提出了一个基于神经网络的空间-时间延迟微分方程模型，来捕捉交通预测中的延迟效应。",
    "tldr": "本研究提出了一个基于神经网络的空间-时间延迟微分方程模型，用于捕捉交通预测中的延迟效应。"
}