{
    "title": "When Can We Use Two-Way Fixed-Effects (TWFE): A Comparison of TWFE and Novel Dynamic Difference-in-Differences Estimators",
    "abstract": "arXiv:2402.09928v1 Announce Type: new  Abstract: The conventional Two-Way Fixed-Effects (TWFE) estimator has been under strain lately. Recent literature has revealed potential shortcomings of TWFE when the treatment effects are heterogeneous. Scholars have developed new advanced dynamic Difference-in-Differences (DiD) estimators to tackle these potential shortcomings. However, confusion remains in applied research as to when the conventional TWFE is biased and what issues the novel estimators can and cannot address. In this study, we first provide an intuitive explanation of the problems of TWFE and elucidate the key features of the novel alternative DiD estimators. We then systematically demonstrate the conditions under which the conventional TWFE is inconsistent. We employ Monte Carlo simulations to assess the performance of dynamic DiD estimators under violations of key assumptions, which likely happens in applied cases. While the new dynamic DiD estimators offer notable advantages ",
    "link": "https://arxiv.org/abs/2402.09928",
    "context": "Title: When Can We Use Two-Way Fixed-Effects (TWFE): A Comparison of TWFE and Novel Dynamic Difference-in-Differences Estimators\nAbstract: arXiv:2402.09928v1 Announce Type: new  Abstract: The conventional Two-Way Fixed-Effects (TWFE) estimator has been under strain lately. Recent literature has revealed potential shortcomings of TWFE when the treatment effects are heterogeneous. Scholars have developed new advanced dynamic Difference-in-Differences (DiD) estimators to tackle these potential shortcomings. However, confusion remains in applied research as to when the conventional TWFE is biased and what issues the novel estimators can and cannot address. In this study, we first provide an intuitive explanation of the problems of TWFE and elucidate the key features of the novel alternative DiD estimators. We then systematically demonstrate the conditions under which the conventional TWFE is inconsistent. We employ Monte Carlo simulations to assess the performance of dynamic DiD estimators under violations of key assumptions, which likely happens in applied cases. While the new dynamic DiD estimators offer notable advantages ",
    "path": "papers/24/02/2402.09928.json",
    "total_tokens": 950,
    "translated_title": "何时可以使用双向固定效应（TWFE）：对比TWFE和新颖的动态差分法估计器",
    "translated_abstract": "最近的文献揭示了在治疗效应具有异质性时，传统的双向固定效应（TWFE）估计器存在潜在缺陷。学者们开发了新颖的动态差分法估计器来解决这些潜在缺陷。然而，在应用研究中仍存在对于传统TWFE何时存在偏差以及新颖估计器能否解决问题的混淆。在本研究中，我们首先直观地解释了TWFE的问题并阐明了新颖替代差分法估计器的关键特点。然后，我们系统地展示了传统TWFE在哪些条件下是不一致的。我们采用蒙特卡洛模拟来评估动态差分法估计器在关键假设违反下的性能，而这在实际应用中可能发生。尽管新的动态差分法估计器提供了显著的优势，",
    "tldr": "该研究对传统的双向固定效应（TWFE）估计器存在的问题进行了详细阐述，并提出了新颖的动态差分法估计器作为替代方案。使用蒙特卡洛模拟评估了动态差分法估计器在假设违反下的性能表现。",
    "en_tdlr": "This study provides a detailed explanation of the drawbacks of the conventional Two-Way Fixed-Effects (TWFE) estimator and introduces new dynamic Difference-in-Differences (DiD) estimators as alternatives. Monte Carlo simulations are used to evaluate the performance of the dynamic DiD estimators under violations of key assumptions."
}