{
    "title": "Enhancing Roadway Safety: LiDAR-based Tree Clearance Analysis",
    "abstract": "arXiv:2402.18309v1 Announce Type: cross  Abstract: In the efforts for safer roads, ensuring adequate vertical clearance above roadways is of great importance. Frequently, trees or other vegetation is growing above the roads, blocking the sight of traffic signs and lights and posing danger to traffic participants. Accurately estimating this space from simple images proves challenging due to a lack of depth information. This is where LiDAR technology comes into play, a laser scanning sensor that reveals a three-dimensional perspective. Thus far, LiDAR point clouds at the street level have mainly been used for applications in the field of autonomous driving. These scans, however, also open up possibilities in urban management. In this paper, we present a new point cloud algorithm that can automatically detect those parts of the trees that grow over the street and need to be trimmed. Our system uses semantic segmentation to filter relevant points and downstream processing steps to create t",
    "link": "https://arxiv.org/abs/2402.18309",
    "context": "Title: Enhancing Roadway Safety: LiDAR-based Tree Clearance Analysis\nAbstract: arXiv:2402.18309v1 Announce Type: cross  Abstract: In the efforts for safer roads, ensuring adequate vertical clearance above roadways is of great importance. Frequently, trees or other vegetation is growing above the roads, blocking the sight of traffic signs and lights and posing danger to traffic participants. Accurately estimating this space from simple images proves challenging due to a lack of depth information. This is where LiDAR technology comes into play, a laser scanning sensor that reveals a three-dimensional perspective. Thus far, LiDAR point clouds at the street level have mainly been used for applications in the field of autonomous driving. These scans, however, also open up possibilities in urban management. In this paper, we present a new point cloud algorithm that can automatically detect those parts of the trees that grow over the street and need to be trimmed. Our system uses semantic segmentation to filter relevant points and downstream processing steps to create t",
    "path": "papers/24/02/2402.18309.json",
    "total_tokens": 868,
    "translated_title": "增强道路安全：基于LiDAR的树木间隙分析",
    "translated_abstract": "在致力于更安全道路的努力中，确保道路上方有足够的垂直间隙非常重要。经常情况下，树木或其他植被会生长在道路上方，遮挡了交通标志和灯光的视线，并对交通参与者构成危险。利用简单的图像准确估计这个空间由于缺乏深度信息而变得具有挑战性。这就是LiDAR技术发挥作用的地方，这是一种激光扫描传感器，可以显示三维视角。迄今为止，街道水平上的LiDAR点云主要被用于自动驾驶领域的应用。然而，这些扫描还打开了城市管理领域的可能性。在本文中，我们提出了一种新的点云算法，可以自动检测那些生长在街道上方需要修剪的树木部分。我们的系统利用语义分割来过滤相关点，然后进行下游处理步骤来创建...",
    "tldr": "本文提出了一种新的点云算法，利用LiDAR技术自动检测树木生长在街道上需要修剪的部分，这有助于增强道路安全。"
}