{
    "title": "Hebbian Learning based Orthogonal Projection for Continual Learning of Spiking Neural Networks",
    "abstract": "arXiv:2402.11984v1 Announce Type: cross  Abstract: Neuromorphic computing with spiking neural networks is promising for energy-efficient artificial intelligence (AI) applications. However, different from humans who continually learn different tasks in a lifetime, neural network models suffer from catastrophic forgetting. How could neuronal operations solve this problem is an important question for AI and neuroscience. Many previous studies draw inspiration from observed neuroscience phenomena and propose episodic replay or synaptic metaplasticity, but they are not guaranteed to explicitly preserve knowledge for neuron populations. Other works focus on machine learning methods with more mathematical grounding, e.g., orthogonal projection on high dimensional spaces, but there is no neural correspondence for neuromorphic computing. In this work, we develop a new method with neuronal operations based on lateral connections and Hebbian learning, which can protect knowledge by projecting act",
    "link": "https://arxiv.org/abs/2402.11984",
    "context": "Title: Hebbian Learning based Orthogonal Projection for Continual Learning of Spiking Neural Networks\nAbstract: arXiv:2402.11984v1 Announce Type: cross  Abstract: Neuromorphic computing with spiking neural networks is promising for energy-efficient artificial intelligence (AI) applications. However, different from humans who continually learn different tasks in a lifetime, neural network models suffer from catastrophic forgetting. How could neuronal operations solve this problem is an important question for AI and neuroscience. Many previous studies draw inspiration from observed neuroscience phenomena and propose episodic replay or synaptic metaplasticity, but they are not guaranteed to explicitly preserve knowledge for neuron populations. Other works focus on machine learning methods with more mathematical grounding, e.g., orthogonal projection on high dimensional spaces, but there is no neural correspondence for neuromorphic computing. In this work, we develop a new method with neuronal operations based on lateral connections and Hebbian learning, which can protect knowledge by projecting act",
    "path": "papers/24/02/2402.11984.json",
    "total_tokens": 678,
    "translated_title": "基于Hebbian学习的正交投影用于持续学习脉冲神经网络",
    "translated_abstract": "使用脉冲神经网络进行神经形态计算，对于能效高的人工智能应用具有潜力。然而，与终身不断学习不同，神经网络模型容易出现灾难性遗忘。神经操作如何解决这一问题是人工智能和神经科学中的重要问题。本研究开发了一种基于横向连接和Hebbian学习的神经操作新方法，可以通过投影保护知识。",
    "tldr": "该研究提出了一种基于横向连接和Hebbian学习的神经操作新方法，能够通过投影保护知识",
    "en_tdlr": "A novel method utilizing neuronal operations based on lateral connections and Hebbian learning is proposed, which can protect knowledge by projecting act."
}