{
    "title": "Why do Random Forests Work? Understanding Tree Ensembles as Self-Regularizing Adaptive Smoothers",
    "abstract": "Despite their remarkable effectiveness and broad application, the drivers of success underlying ensembles of trees are still not fully understood. In this paper, we highlight how interpreting tree ensembles as adaptive and self-regularizing smoothers can provide new intuition and deeper insight to this topic. We use this perspective to show that, when studied as smoothers, randomized tree ensembles not only make predictions that are quantifiably more smooth than the predictions of the individual trees they consist of, but also further regulate their smoothness at test-time based on the dissimilarity between testing and training inputs. First, we use this insight to revisit, refine and reconcile two recent explanations of forest success by providing a new way of quantifying the conjectured behaviors of tree ensembles objectively by measuring the effective degree of smoothing they imply. Then, we move beyond existing explanations for the mechanisms by which tree ensembles improve upon in",
    "link": "https://rss.arxiv.org/abs/2402.01502",
    "context": "Title: Why do Random Forests Work? Understanding Tree Ensembles as Self-Regularizing Adaptive Smoothers\nAbstract: Despite their remarkable effectiveness and broad application, the drivers of success underlying ensembles of trees are still not fully understood. In this paper, we highlight how interpreting tree ensembles as adaptive and self-regularizing smoothers can provide new intuition and deeper insight to this topic. We use this perspective to show that, when studied as smoothers, randomized tree ensembles not only make predictions that are quantifiably more smooth than the predictions of the individual trees they consist of, but also further regulate their smoothness at test-time based on the dissimilarity between testing and training inputs. First, we use this insight to revisit, refine and reconcile two recent explanations of forest success by providing a new way of quantifying the conjectured behaviors of tree ensembles objectively by measuring the effective degree of smoothing they imply. Then, we move beyond existing explanations for the mechanisms by which tree ensembles improve upon in",
    "path": "papers/24/02/2402.01502.json",
    "total_tokens": 904,
    "translated_title": "为什么随机森林有效？将树集成解释为自适应的自正则化平滑器的理解",
    "translated_abstract": "尽管树集成在效果和广泛应用方面表现出卓越的能力，但其成功的驱动因素尚未完全被理解。在本文中，我们强调将树集成解释为自适应的自正则化平滑器可以提供新的直觉和更深入的见解。我们利用这个观点来展示，当将随机化树集成视为平滑器时，它们的预测不仅比它们所包含的单个树的预测更加平滑，而且还根据测试和训练输入之间的差异在测试时进一步调节它们的平滑性。首先，我们利用这个洞察力重新审视、精炼和协调了最近两个对森林成功的解释，通过测量所暗示的平滑程度来客观地量化树集成的猜想行为方式。然后，我们超越了现有的关于树集成改进机制的解释",
    "tldr": "本文将树集成解释为自适应的自正则化平滑器，通过量化预测的平滑程度并根据测试和训练输入的差异调节平滑性，提供了对树集成成功驱动因素的新见解。",
    "en_tdlr": "This paper interprets tree ensembles as self-adaptive self-regularizing smoothers, quantifies the level of smoothing in their predictions, and further regulates their smoothness based on the dissimilarity between testing and training inputs, providing new insights into the drivers of success for tree ensembles."
}