{
    "title": "HetTree: Heterogeneous Tree Graph Neural Network",
    "abstract": "arXiv:2402.13496v1 Announce Type: new  Abstract: The recent past has seen an increasing interest in Heterogeneous Graph Neural Networks (HGNNs) since many real-world graphs are heterogeneous in nature, from citation graphs to email graphs. However, existing methods ignore a tree hierarchy among metapaths, which is naturally constituted by different node types and relation types. In this paper, we present HetTree, a novel heterogeneous tree graph neural network that models both the graph structure and heterogeneous aspects in a scalable and effective manner. Specifically, HetTree builds a semantic tree data structure to capture the hierarchy among metapaths. Existing tree encoding techniques aggregate children nodes by weighting the contribution of children nodes based on similarity to the parent node. However, we find that this tree encoding fails to capture the entire parent-children hierarchy by only considering the parent node. Hence, HetTree uses a novel subtree attention mechanism",
    "link": "https://arxiv.org/abs/2402.13496",
    "context": "Title: HetTree: Heterogeneous Tree Graph Neural Network\nAbstract: arXiv:2402.13496v1 Announce Type: new  Abstract: The recent past has seen an increasing interest in Heterogeneous Graph Neural Networks (HGNNs) since many real-world graphs are heterogeneous in nature, from citation graphs to email graphs. However, existing methods ignore a tree hierarchy among metapaths, which is naturally constituted by different node types and relation types. In this paper, we present HetTree, a novel heterogeneous tree graph neural network that models both the graph structure and heterogeneous aspects in a scalable and effective manner. Specifically, HetTree builds a semantic tree data structure to capture the hierarchy among metapaths. Existing tree encoding techniques aggregate children nodes by weighting the contribution of children nodes based on similarity to the parent node. However, we find that this tree encoding fails to capture the entire parent-children hierarchy by only considering the parent node. Hence, HetTree uses a novel subtree attention mechanism",
    "path": "papers/24/02/2402.13496.json",
    "total_tokens": 855,
    "translated_title": "HetTree: 异构树图神经网络",
    "translated_abstract": "最近的过去看到了对异构图神经网络（HGNNs）的兴趣日益增长，因为许多现实世界中的图是异构的，从引用图到电子邮件图。然而，现有方法忽略了元路径之间的树形层次结构，该结构是由不同的节点类型和关系类型自然构成的。在本文中，我们提出了HetTree，一种新颖的异构树图神经网络，以可扩展且有效的方式建模图结构和异构方面。具体来说，HetTree构建了一个语义树数据结构，用于捕捉元路径之间的层次关系。现有的树形编码技术通过根据子节点与父节点的相似性来加权子节点的贡献来聚合子节点。然而，我们发现这种树形编码未能捕捉整个父子层次结构，因为只考虑了父节点。因此，HetTree使用了一种新颖的子树注意机制。",
    "tldr": "HetTree提出了一种新颖的异构树图神经网络，通过构建语义树数据结构捕捉元路径之间的层次关系，解决了现有方法忽略的异构图中的树形层次结构问题。",
    "en_tdlr": "HetTree proposes a novel heterogeneous tree graph neural network, which captures the hierarchy among metapaths by building a semantic tree data structure and addresses the issue of overlooking the tree hierarchy in heterogeneous graphs by existing methods."
}