{
    "title": "Stability and Multigroup Fairness in Ranking with Uncertain Predictions",
    "abstract": "arXiv:2402.09326v1 Announce Type: new Abstract: Rankings are ubiquitous across many applications, from search engines to hiring committees. In practice, many rankings are derived from the output of predictors. However, when predictors trained for classification tasks have intrinsic uncertainty, it is not obvious how this uncertainty should be represented in the derived rankings. Our work considers ranking functions: maps from individual predictions for a classification task to distributions over rankings. We focus on two aspects of ranking functions: stability to perturbations in predictions and fairness towards both individuals and subgroups. Not only is stability an important requirement for its own sake, but -- as we show -- it composes harmoniously with individual fairness in the sense of Dwork et al. (2012). While deterministic ranking functions cannot be stable aside from trivial scenarios, we show that the recently proposed uncertainty aware (UA) ranking functions of Singh et al",
    "link": "https://arxiv.org/abs/2402.09326",
    "context": "Title: Stability and Multigroup Fairness in Ranking with Uncertain Predictions\nAbstract: arXiv:2402.09326v1 Announce Type: new Abstract: Rankings are ubiquitous across many applications, from search engines to hiring committees. In practice, many rankings are derived from the output of predictors. However, when predictors trained for classification tasks have intrinsic uncertainty, it is not obvious how this uncertainty should be represented in the derived rankings. Our work considers ranking functions: maps from individual predictions for a classification task to distributions over rankings. We focus on two aspects of ranking functions: stability to perturbations in predictions and fairness towards both individuals and subgroups. Not only is stability an important requirement for its own sake, but -- as we show -- it composes harmoniously with individual fairness in the sense of Dwork et al. (2012). While deterministic ranking functions cannot be stable aside from trivial scenarios, we show that the recently proposed uncertainty aware (UA) ranking functions of Singh et al",
    "path": "papers/24/02/2402.09326.json",
    "total_tokens": 781,
    "translated_title": "不确定预测中的稳定性和多组公平性在排名中的应用",
    "translated_abstract": "排名在许多应用中都是普遍存在的，从搜索引擎到招聘委员会。然而，在预测器训练用于分类任务时，当存在内在的不确定性时，不明确如何在派生排名中表示这种不确定性。我们的工作考虑排名函数：从分类任务的个体预测到排名分布的映射。我们关注排名函数的两个方面：对预测扰动的稳定性和对个体和子群体的公平性。稳定性不仅是其本身的重要要求，而且正如我们所显示的，它与Dwork等人（2012）的个体公平性在意义上是和谐的。尽管确定性排名函数除了平凡的情况外不能稳定，但我们显示了最近由Singh等人提出的考虑不确定性的（UA）排名函数",
    "tldr": "本研究考虑了在不确定预测中如何表示稳定性和公平性的问题，并提出了一种新的不确定性感知排名函数。",
    "en_tdlr": "This study addresses the issue of how to represent stability and fairness in uncertain predictions and proposes a new uncertainty-aware ranking function."
}