{
    "title": "Can ChatGPT Support Developers? An Empirical Evaluation of Large Language Models for Code Generation",
    "abstract": "arXiv:2402.11702v1 Announce Type: cross  Abstract: Large language models (LLMs) have demonstrated notable proficiency in code generation, with numerous prior studies showing their promising capabilities in various development scenarios. However, these studies mainly provide evaluations in research settings, which leaves a significant gap in understanding how effectively LLMs can support developers in real-world. To address this, we conducted an empirical analysis of conversations in DevGPT, a dataset collected from developers' conversations with ChatGPT (captured with the Share Link feature on platforms such as GitHub). Our empirical findings indicate that the current practice of using LLM-generated code is typically limited to either demonstrating high-level concepts or providing examples in documentation, rather than to be used as production-ready code. These findings indicate that there is much future work needed to improve LLMs in code generation before they can be integral parts o",
    "link": "https://arxiv.org/abs/2402.11702",
    "context": "Title: Can ChatGPT Support Developers? An Empirical Evaluation of Large Language Models for Code Generation\nAbstract: arXiv:2402.11702v1 Announce Type: cross  Abstract: Large language models (LLMs) have demonstrated notable proficiency in code generation, with numerous prior studies showing their promising capabilities in various development scenarios. However, these studies mainly provide evaluations in research settings, which leaves a significant gap in understanding how effectively LLMs can support developers in real-world. To address this, we conducted an empirical analysis of conversations in DevGPT, a dataset collected from developers' conversations with ChatGPT (captured with the Share Link feature on platforms such as GitHub). Our empirical findings indicate that the current practice of using LLM-generated code is typically limited to either demonstrating high-level concepts or providing examples in documentation, rather than to be used as production-ready code. These findings indicate that there is much future work needed to improve LLMs in code generation before they can be integral parts o",
    "path": "papers/24/02/2402.11702.json",
    "total_tokens": 842,
    "translated_title": "ChatGPT是否能支持开发者？对大型语言模型用于代码生成的实证评估",
    "translated_abstract": "大型语言模型（LLMs）已经展示出在代码生成方面的显著能力，许多先前的研究显示它们在各种开发场景中具有很大潜力。然而，这些研究主要提供了在研究环境中的评估，这在理解LLM在实际世界中能有效支持开发者方面留下了显著的空白。为了解决这个问题，我们对DevGPT中的对话进行了实证分析，这是从开发者与ChatGPT的对话中收集的数据集（通过GitHub等平台上的Share Link功能捕获）。我们的实证结果表明，目前使用LLM生成的代码的实践通常仅限于展示高层概念或提供文档中的示例，而不是作为可用于生产的代码。这些发现表明，在LLM代码生成方面还需要大量未来工作才能使其成为不可或缺的组成部分。",
    "tldr": "大型语言模型在代码生成方面表现出显著能力，但目前主要用于展示概念或提供示例，需要进一步改进才能实现生产就绪代码。",
    "en_tdlr": "Large language models show notable proficiency in code generation but are currently used mainly for showcasing concepts or providing examples, indicating a need for further improvements for production-ready code."
}