{
    "title": "SADAS: A Dialogue Assistant System Towards Remediating Norm Violations in Bilingual Socio-Cultural Conversations",
    "abstract": "In today's globalized world, bridging the cultural divide is more critical than ever for forging meaningful connections. The Socially-Aware Dialogue Assistant System (SADAS) is our answer to this global challenge, and it's designed to ensure that conversations between individuals from diverse cultural backgrounds unfold with respect and understanding. Our system's novel architecture includes: (1) identifying the categories of norms present in the dialogue, (2) detecting potential norm violations, (3) evaluating the severity of these violations, (4) implementing targeted remedies to rectify the breaches, and (5) articulates the rationale behind these corrective actions. We employ a series of State-Of-The-Art (SOTA) techniques to build different modules, and conduct numerous experiments to select the most suitable backbone model for each of the modules. We also design a human preference experiment to validate the overall performance of the system. We will open-source our system (includin",
    "link": "https://arxiv.org/abs/2402.01736",
    "context": "Title: SADAS: A Dialogue Assistant System Towards Remediating Norm Violations in Bilingual Socio-Cultural Conversations\nAbstract: In today's globalized world, bridging the cultural divide is more critical than ever for forging meaningful connections. The Socially-Aware Dialogue Assistant System (SADAS) is our answer to this global challenge, and it's designed to ensure that conversations between individuals from diverse cultural backgrounds unfold with respect and understanding. Our system's novel architecture includes: (1) identifying the categories of norms present in the dialogue, (2) detecting potential norm violations, (3) evaluating the severity of these violations, (4) implementing targeted remedies to rectify the breaches, and (5) articulates the rationale behind these corrective actions. We employ a series of State-Of-The-Art (SOTA) techniques to build different modules, and conduct numerous experiments to select the most suitable backbone model for each of the modules. We also design a human preference experiment to validate the overall performance of the system. We will open-source our system (includin",
    "path": "papers/24/02/2402.01736.json",
    "total_tokens": 944,
    "translated_title": "SADAS: 一个面向双语社会文化对话修复规范违例的对话助手系统",
    "translated_abstract": "在当今全球化的世界中，弥合文化差异对于建立有意义的联系比以往任何时候都更加重要。社会感知对话助手系统（SADAS）是我们对这一全球挑战的回答，旨在确保来自不同文化背景的个体之间的对话能够以尊重和理解的方式进行。我们系统的新颖架构包括：（1）识别对话中存在的规范类别，（2）检测潜在的规范违例，（3）评估这些违例的严重程度，（4）实施有针对性的措施来纠正违规行为，并（5）阐述这些纠正措施的理由。我们采用一系列最先进的技术来构建不同的模块，并进行大量实验选择每个模块最合适的骨干模型。我们还设计了一个人类偏好实验来验证系统的整体性能。我们将开源我们的系统（包括...",
    "tldr": "SADAS是一个面向双语社会文化对话的对话助手系统，旨在通过识别规范类别、检测违例、评估严重程度、实施纠正措施并阐述理由等新颖架构，确保不同文化背景的个体之间的对话能够以尊重和理解的方式进行。",
    "en_tdlr": "SADAS is a dialogue assistant system designed for bilingual socio-cultural conversations, aiming to ensure respectful and understanding dialogues between individuals from different cultural backgrounds through its novel architecture of identifying norm categories, detecting violations, evaluating severity, implementing corrective measures, and articulating rationales."
}