{
    "title": "Dual-View Visual Contextualization for Web Navigation",
    "abstract": "Automatic web navigation aims to build a web agent that can follow language instructions to execute complex and diverse tasks on real-world websites. Existing work primarily takes HTML documents as input, which define the contents and action spaces (i.e., actionable elements and operations) of webpages. Nevertheless, HTML documents may not provide a clear task-related context for each element, making it hard to select the right (sequence of) actions. In this paper, we propose to contextualize HTML elements through their \"dual views\" in webpage screenshots: each HTML element has its corresponding bounding box and visual content in the screenshot. We build upon the insight -- web developers tend to arrange task-related elements nearby on webpages to enhance user experiences -- and propose to contextualize each element with its neighbor elements, using both textual and visual features. The resulting representations of HTML elements are more informative for the agent to take action. We val",
    "link": "https://arxiv.org/abs/2402.04476",
    "context": "Title: Dual-View Visual Contextualization for Web Navigation\nAbstract: Automatic web navigation aims to build a web agent that can follow language instructions to execute complex and diverse tasks on real-world websites. Existing work primarily takes HTML documents as input, which define the contents and action spaces (i.e., actionable elements and operations) of webpages. Nevertheless, HTML documents may not provide a clear task-related context for each element, making it hard to select the right (sequence of) actions. In this paper, we propose to contextualize HTML elements through their \"dual views\" in webpage screenshots: each HTML element has its corresponding bounding box and visual content in the screenshot. We build upon the insight -- web developers tend to arrange task-related elements nearby on webpages to enhance user experiences -- and propose to contextualize each element with its neighbor elements, using both textual and visual features. The resulting representations of HTML elements are more informative for the agent to take action. We val",
    "path": "papers/24/02/2402.04476.json",
    "total_tokens": 865,
    "translated_title": "双视图视觉背景化的网页导航",
    "translated_abstract": "自动网页导航旨在构建一个可以根据语言指令在实际网站上执行复杂和多样任务的网络代理。现有工作主要是以 HTML 文档作为输入，HTML 文档定义了网页的内容和操作空间（即可操作元素和操作）。然而，HTML 文档可能无法为每个元素提供清晰的任务相关背景，使得选择正确的（一系列的）操作变得困难。本文提出通过网页截图中元素的“双视图”来进行 HTML 元素的背景化：每个 HTML 元素在截图中有其对应的边界框和视觉内容。我们基于一个洞察力——网页开发者倾向于在网页上将任务相关元素放置在附近以增强用户体验，并提出将每个元素与其邻居元素进行背景化，使用文本和视觉特征。HTML 元素的结果表示对于代理执行操作更加信息丰富。",
    "tldr": "本文提出了一种通过网页截图中元素的“双视图”来进行 HTML 元素的背景化的方法，这种方法通过将每个元素与其邻居元素进行背景化，使用文本和视觉特征，使得HTML元素的结果表示对于代理执行操作更加信息丰富。",
    "en_tdlr": "This paper proposes a method to contextualize HTML elements through their \"dual views\" in webpage screenshots, which helps enhance the informative representations of HTML elements for agents to perform actions by contextualizing each element with its neighbor elements using textual and visual features."
}