{
    "title": "EEG classifier cross-task transfer to avoid training sessions in robot-assisted rehabilitation",
    "abstract": "arXiv:2402.17790v1 Announce Type: cross  Abstract: Background: For an individualized support of patients during rehabilitation, learning of individual machine learning models from the human electroencephalogram (EEG) is required. Our approach allows labeled training data to be recorded without the need for a specific training session. For this, the planned exoskeleton-assisted rehabilitation enables bilateral mirror therapy, in which movement intentions can be inferred from the activity of the unaffected arm. During this therapy, labeled EEG data can be collected to enable movement predictions of only the affected arm of a patient. Methods: A study was conducted with 8 healthy subjects and the performance of the classifier transfer approach was evaluated. Each subject performed 3 runs of 40 self-intended unilateral and bilateral reaching movements toward a target while EEG data was recorded from 64 channels. A support vector machine (SVM) classifier was trained under both movement cond",
    "link": "https://arxiv.org/abs/2402.17790",
    "context": "Title: EEG classifier cross-task transfer to avoid training sessions in robot-assisted rehabilitation\nAbstract: arXiv:2402.17790v1 Announce Type: cross  Abstract: Background: For an individualized support of patients during rehabilitation, learning of individual machine learning models from the human electroencephalogram (EEG) is required. Our approach allows labeled training data to be recorded without the need for a specific training session. For this, the planned exoskeleton-assisted rehabilitation enables bilateral mirror therapy, in which movement intentions can be inferred from the activity of the unaffected arm. During this therapy, labeled EEG data can be collected to enable movement predictions of only the affected arm of a patient. Methods: A study was conducted with 8 healthy subjects and the performance of the classifier transfer approach was evaluated. Each subject performed 3 runs of 40 self-intended unilateral and bilateral reaching movements toward a target while EEG data was recorded from 64 channels. A support vector machine (SVM) classifier was trained under both movement cond",
    "path": "papers/24/02/2402.17790.json",
    "total_tokens": 745,
    "translated_title": "EEG分类器跨任务转移，避免机器人辅助康复中的训练会话",
    "translated_abstract": "背景:为了个性化支持患者在康复期间，需要从人类脑电图(EEG)中学习个体化的机器学习模型。我们的方法允许记录带标记的训练数据，而无需特定的训练会话。方法:进行了一项研究，评估了分类器转移方法的性能。每个受试者进行了3次40次自我打算的单侧和双侧伸手运动，向一个目标运动，同时从64个通道记录了EEG数据。一个支持向量机(SVM)分类器在两种运动条件下进行了训练。",
    "tldr": "该研究提出了一种能够避免特定训练会话的EEG分类器跨任务转移方法，可用于机器人辅助康复中的个性化支持。",
    "en_tdlr": "This study presents an EEG classifier cross-task transfer approach that avoids the need for specific training sessions, which can be utilized for personalized support in robot-assisted rehabilitation."
}