{
    "title": "PDETime: Rethinking Long-Term Multivariate Time Series Forecasting from the perspective of partial differential equations",
    "abstract": "arXiv:2402.16913v1 Announce Type: new  Abstract: Recent advancements in deep learning have led to the development of various models for long-term multivariate time-series forecasting (LMTF), many of which have shown promising results. Generally, the focus has been on historical-value-based models, which rely on past observations to predict future series. Notably, a new trend has emerged with time-index-based models, offering a more nuanced understanding of the continuous dynamics underlying time series. Unlike these two types of models that aggregate the information of spatial domains or temporal domains, in this paper, we consider multivariate time series as spatiotemporal data regularly sampled from a continuous dynamical system, which can be represented by partial differential equations (PDEs), with the spatial domain being fixed. Building on this perspective, we present PDETime, a novel LMTF model inspired by the principles of Neural PDE solvers, following the encoding-integration-",
    "link": "https://arxiv.org/abs/2402.16913",
    "context": "Title: PDETime: Rethinking Long-Term Multivariate Time Series Forecasting from the perspective of partial differential equations\nAbstract: arXiv:2402.16913v1 Announce Type: new  Abstract: Recent advancements in deep learning have led to the development of various models for long-term multivariate time-series forecasting (LMTF), many of which have shown promising results. Generally, the focus has been on historical-value-based models, which rely on past observations to predict future series. Notably, a new trend has emerged with time-index-based models, offering a more nuanced understanding of the continuous dynamics underlying time series. Unlike these two types of models that aggregate the information of spatial domains or temporal domains, in this paper, we consider multivariate time series as spatiotemporal data regularly sampled from a continuous dynamical system, which can be represented by partial differential equations (PDEs), with the spatial domain being fixed. Building on this perspective, we present PDETime, a novel LMTF model inspired by the principles of Neural PDE solvers, following the encoding-integration-",
    "path": "papers/24/02/2402.16913.json",
    "total_tokens": 866,
    "translated_title": "PDETime：从偏微分方程的视角重新思考长期多元时间序列预测",
    "translated_abstract": "最近深度学习的发展导致了各种模型的出现，用于长期多变量时间序列预测（LMTF），其中许多模型表现出色。一般来说，关注点集中在基于历史价值的模型上，这些模型依赖于过去的观测结果来预测未来的序列。值得注意的是，新的趋势已经出现，即基于时间索引的模型，提供了对时间序列潜在连续动态的更细致理解。与聚合空间域或时间域信息的这两种模型不同，在本文中，我们将多元时间序列视为从连续动力系统定期抽样的时空数据，可通过偏微分方程（PDEs）表示，其中空间域为固定。基于这一视角，我们提出PDETime，这是一种受神经PDE解算器原则启发的新型LMTF模型，遵循编码-集成-",
    "tldr": "本文提出了PDETime，一种受神经PDE解算器原则启发的新型LMTF模型，从偏微分方程的视角重新思考了长期多元时间序列预测。"
}