{
    "title": "Techniques to Detect Crime Leaders within a Criminal Network: A Survey, Experimental, and Comparative Evaluations",
    "abstract": "This survey paper offers a thorough analysis of techniques and algorithms used in the identification of crime leaders within criminal networks. For each technique, the paper examines its effectiveness, limitations, potential for improvement, and future prospects. The main challenge faced by existing survey papers focusing on algorithms for identifying crime leaders and predicting crimes is effectively categorizing these algorithms. To address this limitation, this paper proposes a new methodological taxonomy that hierarchically classifies algorithms into more detailed categories and specific techniques. The paper includes empirical and experimental evaluations to rank the different techniques. The combination of the methodological taxonomy, empirical evaluations, and experimental comparisons allows for a nuanced and comprehensive understanding of the techniques and algorithms for identifying crime leaders, assisting researchers in making informed decisions. Moreover, the paper offers v",
    "link": "https://arxiv.org/abs/2402.03355",
    "context": "Title: Techniques to Detect Crime Leaders within a Criminal Network: A Survey, Experimental, and Comparative Evaluations\nAbstract: This survey paper offers a thorough analysis of techniques and algorithms used in the identification of crime leaders within criminal networks. For each technique, the paper examines its effectiveness, limitations, potential for improvement, and future prospects. The main challenge faced by existing survey papers focusing on algorithms for identifying crime leaders and predicting crimes is effectively categorizing these algorithms. To address this limitation, this paper proposes a new methodological taxonomy that hierarchically classifies algorithms into more detailed categories and specific techniques. The paper includes empirical and experimental evaluations to rank the different techniques. The combination of the methodological taxonomy, empirical evaluations, and experimental comparisons allows for a nuanced and comprehensive understanding of the techniques and algorithms for identifying crime leaders, assisting researchers in making informed decisions. Moreover, the paper offers v",
    "path": "papers/24/02/2402.03355.json",
    "total_tokens": 853,
    "translated_title": "在犯罪网络中识别犯罪头目的技术：一项调查、实验和比较评估",
    "translated_abstract": "本调查论文对在犯罪网络中识别犯罪头目所使用的技术和算法进行了全面分析。针对每种技术，论文讨论了其有效性、局限性、改进潜力和未来前景。现有关注于识别犯罪头目和预测犯罪算法的调查论文所面临的主要挑战是如何有效地对这些算法进行分类。为了解决这个问题，本论文提出了一种新的方法论分类体系，将算法分为更详细的类别和具体技术。论文通过实证评估和实验比较对不同技术进行了排名。方法论分类体系、实证评估和实验比较的结合使人们能够全面而细致地了解识别犯罪头目的技术和算法，为研究人员提供明智的决策支持。此外，论文还提供了其他方面的贡献。",
    "tldr": "本论文调查、分析了在犯罪网络中识别犯罪头目的技术和算法，提出了一种新的方法论分类体系，通过实证评估和实验比较，为研究人员提供了全面的决策支持。",
    "en_tdlr": "This paper surveys and analyzes techniques and algorithms used to identify crime leaders within criminal networks, proposing a new methodological taxonomy and providing comprehensive decision support through empirical evaluations and experimental comparisons."
}