{
    "title": "IICONGRAPH: improved Iconographic and Iconological Statements in Knowledge Graphs",
    "abstract": "Iconography and iconology are fundamental domains when it comes to understanding artifacts of cultural heritage. Iconography deals with the study and interpretation of visual elements depicted in artifacts and their symbolism, while iconology delves deeper, exploring the underlying cultural and historical meanings. Despite the advances in representing cultural heritage with Linked Open Data (LOD), recent studies show persistent gaps in the representation of iconographic and iconological statements in current knowledge graphs (KGs). To address them, this paper presents IICONGRAPH, a KG that was created by refining and extending the iconographic and iconological statements of ArCo (the Italian KG of cultural heritage) and Wikidata. The development of IICONGRAPH was also driven by a series of requirements emerging from research case studies that were unattainable in the non-reengineered versions of the KGs. The evaluation results demonstrate that IICONGRAPH not only outperforms ArCo and W",
    "link": "https://arxiv.org/abs/2402.00048",
    "context": "Title: IICONGRAPH: improved Iconographic and Iconological Statements in Knowledge Graphs\nAbstract: Iconography and iconology are fundamental domains when it comes to understanding artifacts of cultural heritage. Iconography deals with the study and interpretation of visual elements depicted in artifacts and their symbolism, while iconology delves deeper, exploring the underlying cultural and historical meanings. Despite the advances in representing cultural heritage with Linked Open Data (LOD), recent studies show persistent gaps in the representation of iconographic and iconological statements in current knowledge graphs (KGs). To address them, this paper presents IICONGRAPH, a KG that was created by refining and extending the iconographic and iconological statements of ArCo (the Italian KG of cultural heritage) and Wikidata. The development of IICONGRAPH was also driven by a series of requirements emerging from research case studies that were unattainable in the non-reengineered versions of the KGs. The evaluation results demonstrate that IICONGRAPH not only outperforms ArCo and W",
    "path": "papers/24/02/2402.00048.json",
    "total_tokens": 868,
    "translated_title": "IICONGRAPH: 改进的知识图谱中图标学和图象学陈述",
    "translated_abstract": "图标学和图象学是理解文化遗产中的艺术品的基本领域。图标学涉及对艺术品中描绘的视觉元素及其象征意义的研究和解释，而图象学更深入探索其中的文化和历史意义。尽管利用链接开放数据（LOD）来表示文化遗产取得了进展，但最近的研究表明当前知识图谱（KGs）中的图标学和图象学陈述仍存在差距。为了解决这些问题，本文介绍了IICONGRAPH，它是通过改进和扩展ArCo（意大利文化遗产知识图谱）和Wikidata的图标学和图象学陈述而创建的KG。IICONGRAPH的开发也受到一系列研究案例的要求的驱动，这些要求在非重新设计版本的KG中无法实现。评估结果表明，IICONGRAPH不仅超越了ArCo和W",
    "tldr": "改进的知识图谱IICONGRAPH填补了当前知识图谱中关于图标学和图象学陈述的空缺，并通过改进和扩展ArCo和Wikidata实现了更好的性能。"
}