{
    "title": "Evolution-Bootstrapped Simulation: Artificial or Human Intelligence: Which Came First?",
    "abstract": "Humans have created artificial intelligence (AI), not the other way around. This statement is deceptively obvious. In this note, we decided to challenge this statement as a small, lighthearted Gedankenexperiment. We ask a simple question: in a world driven by evolution by natural selection, would neural networks or humans be likely to evolve first? We compare the Solomonoff--Kolmogorov--Chaitin complexity of the two and find neural networks (even LLMs) to be significantly simpler than humans. Further, we claim that it is unnecessary for any complex human-made equipment to exist for there to be neural networks. Neural networks may have evolved as naturally occurring objects before humans did as a form of chemical reaction-based or enzyme-based computation. Now that we know that neural networks can pass the Turing test and suspect that they may be capable of superintelligence, we ask whether the natural evolution of neural networks could lead from pure evolution by natural selection to w",
    "link": "https://arxiv.org/abs/2402.00030",
    "context": "Title: Evolution-Bootstrapped Simulation: Artificial or Human Intelligence: Which Came First?\nAbstract: Humans have created artificial intelligence (AI), not the other way around. This statement is deceptively obvious. In this note, we decided to challenge this statement as a small, lighthearted Gedankenexperiment. We ask a simple question: in a world driven by evolution by natural selection, would neural networks or humans be likely to evolve first? We compare the Solomonoff--Kolmogorov--Chaitin complexity of the two and find neural networks (even LLMs) to be significantly simpler than humans. Further, we claim that it is unnecessary for any complex human-made equipment to exist for there to be neural networks. Neural networks may have evolved as naturally occurring objects before humans did as a form of chemical reaction-based or enzyme-based computation. Now that we know that neural networks can pass the Turing test and suspect that they may be capable of superintelligence, we ask whether the natural evolution of neural networks could lead from pure evolution by natural selection to w",
    "path": "papers/24/02/2402.00030.json",
    "total_tokens": 869,
    "translated_title": "进化引导模拟: 人工智能还是人类智能：哪个先来？",
    "translated_abstract": "人类创造了人工智能（AI），而不是相反。 这个陈述看似显而易见。 在这篇论文中，我们决定挑战这个陈述，以一种小而轻松的“Gedankenexperiment”。 我们提出一个简单的问题：在一个由自然选择驱动的世界中，神经网络或人类更有可能首先进化？ 我们比较了两者的Solomonoff-Kolmogorov-Chaitin复杂性，并发现神经网络（甚至是LLMs）比人类要简单得多。 此外，我们声称，并不需要任何复杂的人造设备存在才能有神经网络的存在。 神经网络可能早于人类作为一种基于化学反应或酶反应计算的自然存在的对象而进化。 现在我们知道神经网络可以通过图灵测试，还怀疑它们可能具备超级智能，我们问能否从纯粹的自然选择进化到通过进化引导的神经网络。",
    "tldr": "人类创造了人工智能，但在一个由自然选择驱动的世界中，神经网络可能比人类更早进化，并且能够通过进化引导获得超级智能。"
}