{
    "title": "Optimal Transport for Structure Learning Under Missing Data",
    "abstract": "arXiv:2402.15255v1 Announce Type: cross  Abstract: Causal discovery in the presence of missing data introduces a chicken-and-egg dilemma. While the goal is to recover the true causal structure, robust imputation requires considering the dependencies or preferably causal relations among variables. Merely filling in missing values with existing imputation methods and subsequently applying structure learning on the complete data is empirical shown to be sub-optimal. To this end, we propose in this paper a score-based algorithm, based on optimal transport, for learning causal structure from missing data. This optimal transport viewpoint diverges from existing score-based approaches that are dominantly based on EM. We project structure learning as a density fitting problem, where the goal is to find the causal model that induces a distribution of minimum Wasserstein distance with the distribution over the observed data. Through extensive simulations and real-data experiments, our framework ",
    "link": "https://arxiv.org/abs/2402.15255",
    "context": "Title: Optimal Transport for Structure Learning Under Missing Data\nAbstract: arXiv:2402.15255v1 Announce Type: cross  Abstract: Causal discovery in the presence of missing data introduces a chicken-and-egg dilemma. While the goal is to recover the true causal structure, robust imputation requires considering the dependencies or preferably causal relations among variables. Merely filling in missing values with existing imputation methods and subsequently applying structure learning on the complete data is empirical shown to be sub-optimal. To this end, we propose in this paper a score-based algorithm, based on optimal transport, for learning causal structure from missing data. This optimal transport viewpoint diverges from existing score-based approaches that are dominantly based on EM. We project structure learning as a density fitting problem, where the goal is to find the causal model that induces a distribution of minimum Wasserstein distance with the distribution over the observed data. Through extensive simulations and real-data experiments, our framework ",
    "path": "papers/24/02/2402.15255.json",
    "total_tokens": 852,
    "translated_title": "缺失数据下的结构学习的最优输运",
    "translated_abstract": "在缺失数据的情况下进行因果发现会引入鸡生蛋问题。虽然目标是恢复真实的因果结构，但鲁棒的插补需要考虑变量之间的依赖性或更好地因果关系。仅仅用现有的插补方法填充缺失值，然后在完整数据上应用结构学习被证明是次优的。为此，本文提出了一种基于最优输运的基于得分的算法，用于从缺失数据中学习因果结构。这种最优输运的观点不同于现有基于EM的基于得分方法。我们将结构学习投影为密度拟合问题，其目标是找到引起观测数据分布和观测数据之间的沃尔仑斯坦距离的因果模型。通过大量的模拟和实际数据实验，我们的框架...",
    "tldr": "提出了一种基于最优输运的得分算法，用于从缺失数据中学习因果结构，通过将结构学习视为密度拟合问题，并通过最小化与观测数据分布之间的沃尔仑斯坦距离来找到导致观测数据分布的因果模型",
    "en_tdlr": "Proposed a score-based algorithm based on optimal transport for learning causal structure from missing data, projecting structure learning as a density fitting problem and finding the causal model that induces the minimum Wasserstein distance with the distribution over the observed data."
}