{
    "title": "Domain Embeddings for Generating Complex Descriptions of Concepts in Italian Language",
    "abstract": "arXiv:2402.16632v1 Announce Type: new  Abstract: In this work, we propose a Distributional Semantic resource enriched with linguistic and lexical information extracted from electronic dictionaries, designed to address the challenge of bridging the gap between the continuous semantic values represented by distributional vectors and the discrete descriptions offered by general semantics theory. Recently, many researchers have concentrated on the nexus between embeddings and a comprehensive theory of semantics and meaning. This often involves decoding the representation of word meanings in Distributional Models into a set of discrete, manually constructed properties such as semantic primitives or features, using neural decoding techniques. Our approach introduces an alternative strategy grounded in linguistic data. We have developed a collection of domain-specific co-occurrence matrices, derived from two sources: a classification of Italian nouns categorized into 4 semantic traits and 20 ",
    "link": "https://arxiv.org/abs/2402.16632",
    "context": "Title: Domain Embeddings for Generating Complex Descriptions of Concepts in Italian Language\nAbstract: arXiv:2402.16632v1 Announce Type: new  Abstract: In this work, we propose a Distributional Semantic resource enriched with linguistic and lexical information extracted from electronic dictionaries, designed to address the challenge of bridging the gap between the continuous semantic values represented by distributional vectors and the discrete descriptions offered by general semantics theory. Recently, many researchers have concentrated on the nexus between embeddings and a comprehensive theory of semantics and meaning. This often involves decoding the representation of word meanings in Distributional Models into a set of discrete, manually constructed properties such as semantic primitives or features, using neural decoding techniques. Our approach introduces an alternative strategy grounded in linguistic data. We have developed a collection of domain-specific co-occurrence matrices, derived from two sources: a classification of Italian nouns categorized into 4 semantic traits and 20 ",
    "path": "papers/24/02/2402.16632.json",
    "total_tokens": 674,
    "translated_title": "基于领域嵌入生成意大利语概念复杂描述",
    "translated_abstract": "在这项研究中，我们提出了一个分布语义资源，其中包含从电子词典中提取的语言和词汇信息，旨在解决连续语义值与一般语义理论提供的离散描述之间的差距。我们的方法引入了一个基于语言数据的替代策略，我们开发了一组特定领域的共现矩阵，从两个来源派生而来：将意大利名词分类为4个语义特征和20",
    "tldr": "提出了一个新的领域嵌入方法，通过引入从电子词典中提取的信息，解决了连续语义值和离散描述之间的差距"
}