{
    "title": "Political Pandering and Bureaucratic Influence",
    "abstract": "arXiv:2402.17526v1 Announce Type: new  Abstract: This paper examines the impact of bureaucracy on policy implementation in environments where electoral incentives generate pandering. A two-period model is developed to analyze the interactions between politicians and bureaucrats, who are categorized as either aligned -- sharing the voters' preferences over policies -- or intent on enacting policies that favor elite groups. The findings reveal equilibria in which aligned politicians resort to pandering, whereas aligned bureaucrats either support or oppose such behavior. The analysis further indicates that, depending on parameters, any level of bureaucratic influence can maximize the voters' welfare, ranging from scenarios with an all-powerful to a toothless bureaucracy.",
    "link": "https://arxiv.org/abs/2402.17526",
    "context": "Title: Political Pandering and Bureaucratic Influence\nAbstract: arXiv:2402.17526v1 Announce Type: new  Abstract: This paper examines the impact of bureaucracy on policy implementation in environments where electoral incentives generate pandering. A two-period model is developed to analyze the interactions between politicians and bureaucrats, who are categorized as either aligned -- sharing the voters' preferences over policies -- or intent on enacting policies that favor elite groups. The findings reveal equilibria in which aligned politicians resort to pandering, whereas aligned bureaucrats either support or oppose such behavior. The analysis further indicates that, depending on parameters, any level of bureaucratic influence can maximize the voters' welfare, ranging from scenarios with an all-powerful to a toothless bureaucracy.",
    "path": "papers/24/02/2402.17526.json",
    "total_tokens": 778,
    "translated_title": "政治讨好和官僚主义影响",
    "translated_abstract": "本文研究了在选举激励产生讨好行为的环境中，官僚主义对政策实施的影响。通过发展一个两期模型来分析政治家和官僚之间的互动，他们被分类为与选民偏好政策相一致的对齐型或者意图制定有利于精英集团的政策的官僚。研究结果揭示了在对齐的政治家诉诸于讨好的均衡状态，而对齐的官僚则支持或反对这种行为。分析进一步表明，根据参数的不同，官僚主义的任何程度都可能使选民的福利最大化，范围从全能的到无力的官僚体系情景都有。",
    "tldr": "研究发现在政策实施中，政治家和官僚之间的互动在选举激励下会产生讨好行为，不同类型的官僚对此有不同态度，分析显示官僚主义的影响程度能够最大化选民福利。",
    "en_tdlr": "The paper investigates the interactions between politicians and bureaucrats in policy implementation under electoral incentives leading to pandering, finding that different types of bureaucrats have varying attitudes towards pandering, with the impact of bureaucratic influence potentially maximizing voter welfare."
}