{
    "title": "Intent Assurance using LLMs guided by Intent Drift",
    "abstract": "Intent-Based Networking (IBN) presents a paradigm shift for network management, by promising to align intents and business objectives with network operations--in an automated manner. However, its practical realization is challenging: 1) processing intents, i.e., translate, decompose and identify the logic to fulfill the intent, and 2) intent conformance, that is, considering dynamic networks, the logic should be adequately adapted to assure intents. To address the latter, intent assurance is tasked with continuous verification and validation, including taking the necessary actions to align the operational and target states. In this paper, we define an assurance framework that allows us to detect and act when intent drift occurs. To do so, we leverage AI-driven policies, generated by Large Language Models (LLMs) which can quickly learn the necessary in-context requirements, and assist with the fulfillment and assurance of intents.",
    "link": "https://arxiv.org/abs/2402.00715",
    "context": "Title: Intent Assurance using LLMs guided by Intent Drift\nAbstract: Intent-Based Networking (IBN) presents a paradigm shift for network management, by promising to align intents and business objectives with network operations--in an automated manner. However, its practical realization is challenging: 1) processing intents, i.e., translate, decompose and identify the logic to fulfill the intent, and 2) intent conformance, that is, considering dynamic networks, the logic should be adequately adapted to assure intents. To address the latter, intent assurance is tasked with continuous verification and validation, including taking the necessary actions to align the operational and target states. In this paper, we define an assurance framework that allows us to detect and act when intent drift occurs. To do so, we leverage AI-driven policies, generated by Large Language Models (LLMs) which can quickly learn the necessary in-context requirements, and assist with the fulfillment and assurance of intents.",
    "path": "papers/24/02/2402.00715.json",
    "total_tokens": 835,
    "translated_title": "使用以意图漂移为引导的LLMs进行意图保证",
    "translated_abstract": "意图驱动的网络（IBN）为网络管理提供了范式转变，承诺以自动化的方式将意图和业务目标与网络操作对齐。然而，其实际实现具有挑战性：1）处理意图，即翻译、分解和识别实现意图的逻辑；2）意图一致性，即考虑到动态网络，逻辑应适当调整以保证意图。为了解决后者，意图保证负责持续验证和验证，包括采取必要行动使操作状态和目标状态保持一致。在本文中，我们定义了一个保证框架，允许我们在发生意图漂移时进行检测和采取行动。为此，我们利用了由大型语言模型（LLM）生成的基于AI驱动的策略，这些模型可以快速学习必要的上下文要求，并协助实现和保证意图。",
    "tldr": "该论文介绍了一种使用以意图漂移为引导的LLMs进行意图保证的框架，通过利用自然语言模型生成的策略识别和处理意图漂移，以实现意图与业务目标的对齐。",
    "en_tdlr": "This paper presents a framework for intent assurance using LLMs guided by intent drift. It leverages AI-driven policies generated by natural language models to detect and handle intent drift in order to align intents with business objectives."
}