{
    "title": "COCOA: CBT-based Conversational Counseling Agent using Memory Specialized in Cognitive Distortions and Dynamic Prompt",
    "abstract": "arXiv:2402.17546v1 Announce Type: new  Abstract: The demand for conversational agents that provide mental health care is consistently increasing. In this work, we develop a psychological counseling agent, referred to as CoCoA, that applies Cognitive Behavioral Therapy (CBT) techniques to identify and address cognitive distortions inherent in the client's statements. Specifically, we construct a memory system to efficiently manage information necessary for counseling while extracting high-level insights about the client from their utterances. Additionally, to ensure that the counseling agent generates appropriate responses, we introduce dynamic prompting to flexibly apply CBT techniques and facilitate the appropriate retrieval of information. We conducted dialogues between CoCoA and characters from Character.ai, creating a dataset for evaluation. Then, we asked GPT to evaluate the constructed counseling dataset, and our model demonstrated a statistically significant difference from othe",
    "link": "https://arxiv.org/abs/2402.17546",
    "context": "Title: COCOA: CBT-based Conversational Counseling Agent using Memory Specialized in Cognitive Distortions and Dynamic Prompt\nAbstract: arXiv:2402.17546v1 Announce Type: new  Abstract: The demand for conversational agents that provide mental health care is consistently increasing. In this work, we develop a psychological counseling agent, referred to as CoCoA, that applies Cognitive Behavioral Therapy (CBT) techniques to identify and address cognitive distortions inherent in the client's statements. Specifically, we construct a memory system to efficiently manage information necessary for counseling while extracting high-level insights about the client from their utterances. Additionally, to ensure that the counseling agent generates appropriate responses, we introduce dynamic prompting to flexibly apply CBT techniques and facilitate the appropriate retrieval of information. We conducted dialogues between CoCoA and characters from Character.ai, creating a dataset for evaluation. Then, we asked GPT to evaluate the constructed counseling dataset, and our model demonstrated a statistically significant difference from othe",
    "path": "papers/24/02/2402.17546.json",
    "total_tokens": 864,
    "translated_title": "COCOA: 基于认知失调和动态提示的CBT对话辅导代理",
    "translated_abstract": "随着对提供心理健康护理的对话代理的需求持续增加，我们开发了一款心理辅导代理CoCoA，应用认知行为疗法（CBT）技术来识别和解决客户陈述中固有的认知失调问题。具体来说，我们构建了一个记忆系统，以便有效管理辅导所需的信息，并从客户的话语中提取高层次的见解。此外，为了确保辅导代理生成适当的回应，我们引入了动态提示，灵活应用CBT技术，并促进信息的适当检索。我们在CoCoA和Character.ai的角色之间进行了对话，创建了一个用于评估的数据集。然后，我们要求GPT评估构建的辅导数据集，我们的模型表现出与其他方法的统计显著差异。",
    "tldr": "CoCoA是一款基于认知行为疗法技术的心理辅导代理，通过构建记忆系统管理信息、提取高层见解，引入动态提示灵活运用CBT技术，生成适当回应，并在与Character.ai角色的对话中展示出显著差异。",
    "en_tdlr": "CoCoA is a psychological counseling agent based on Cognitive Behavioral Therapy (CBT) techniques, which efficiently manages information, extracts high-level insights, introduces dynamic prompting to flexibly apply CBT techniques, generates appropriate responses, and demonstrates a significant difference in dialogues with Character.ai characters."
}