{
    "title": "Sizing the bets in a focused portfolio",
    "abstract": "arXiv:2402.15588v1 Announce Type: new  Abstract: The paper provides a mathematical model and a tool for the focused investing strategy as advocated by Buffett, Munger, and others from this investment community. The approach presented here assumes that the investor's role is to think about probabilities of different outcomes for a set of businesses. Based on these assumptions, the tool calculates the optimal allocation of capital for each of the investment candidates. The model is based on a generalized Kelly Criterion with options to provide constraints that ensure: no shorting, limited use of leverage, providing a maximum limit to the risk of permanent loss of capital, and maximum individual allocation. The software is applied to an example portfolio from which certain observations about excessive diversification are obtained. In addition, the software is made available for public use.",
    "link": "https://arxiv.org/abs/2402.15588",
    "context": "Title: Sizing the bets in a focused portfolio\nAbstract: arXiv:2402.15588v1 Announce Type: new  Abstract: The paper provides a mathematical model and a tool for the focused investing strategy as advocated by Buffett, Munger, and others from this investment community. The approach presented here assumes that the investor's role is to think about probabilities of different outcomes for a set of businesses. Based on these assumptions, the tool calculates the optimal allocation of capital for each of the investment candidates. The model is based on a generalized Kelly Criterion with options to provide constraints that ensure: no shorting, limited use of leverage, providing a maximum limit to the risk of permanent loss of capital, and maximum individual allocation. The software is applied to an example portfolio from which certain observations about excessive diversification are obtained. In addition, the software is made available for public use.",
    "path": "papers/24/02/2402.15588.json",
    "total_tokens": 777,
    "translated_title": "专注投资组合中的下注规模",
    "translated_abstract": "本文提供了一种数学模型和工具，用于专注投资策略，正如巴菲特、芒格和其他投资社区成员所提倡的。所提出的方法假定投资者的角色是考虑一组企业不同结果的概率。基于这些假设，该工具计算了每个投资候选标的的资本最优分配。该模型基于一种广义凯利准则，并提供选项以提供确保的约束条件：不做空、限制杠杆使用、提供资本永久损失风险的最大限制和最大个人分配。该软件应用于一个示例投资组合，从中获得了关于过度分散的某些观察。此外，该软件已经可供公众使用。",
    "tldr": "本文提出了一种专注投资策略的数学模型和工具，其基于广义凯利准则，为每个投资标的计算了资本的最优分配，并提供了确保不做空、限制杠杆使用等约束条件。",
    "en_tdlr": "The paper introduces a mathematical model and tool for a focused investing strategy, based on a generalized Kelly Criterion, to calculate the optimal allocation of capital for each investment candidate while providing constraints like no shorting and limited leverage use."
}