{
    "title": "Dual-Space Optimization: Improved Molecule Sequence Design by Latent Prompt Transformer",
    "abstract": "arXiv:2402.17179v1 Announce Type: new  Abstract: Designing molecules with desirable properties, such as drug-likeliness and high binding affinities towards protein targets, is a challenging problem. In this paper, we propose the Dual-Space Optimization (DSO) method that integrates latent space sampling and data space selection to solve this problem. DSO iteratively updates a latent space generative model and a synthetic dataset in an optimization process that gradually shifts the generative model and the synthetic data towards regions of desired property values. Our generative model takes the form of a Latent Prompt Transformer (LPT) where the latent vector serves as the prompt of a causal transformer. Our extensive experiments demonstrate effectiveness of the proposed method, which sets new performance benchmarks across single-objective, multi-objective and constrained molecule design tasks.",
    "link": "https://arxiv.org/abs/2402.17179",
    "context": "Title: Dual-Space Optimization: Improved Molecule Sequence Design by Latent Prompt Transformer\nAbstract: arXiv:2402.17179v1 Announce Type: new  Abstract: Designing molecules with desirable properties, such as drug-likeliness and high binding affinities towards protein targets, is a challenging problem. In this paper, we propose the Dual-Space Optimization (DSO) method that integrates latent space sampling and data space selection to solve this problem. DSO iteratively updates a latent space generative model and a synthetic dataset in an optimization process that gradually shifts the generative model and the synthetic data towards regions of desired property values. Our generative model takes the form of a Latent Prompt Transformer (LPT) where the latent vector serves as the prompt of a causal transformer. Our extensive experiments demonstrate effectiveness of the proposed method, which sets new performance benchmarks across single-objective, multi-objective and constrained molecule design tasks.",
    "path": "papers/24/02/2402.17179.json",
    "total_tokens": 807,
    "translated_title": "双空间优化：通过潜在提示变换器改进分子序列设计",
    "translated_abstract": "设计具有理想性质（如药物样性和对蛋白靶点的高结合亲和力）的分子是一个具有挑战性的问题。在本文中，我们提出了双空间优化（DSO）方法，该方法整合了潜在空间采样和数据空间选择来解决这一问题。DSO通过迭代更新潜在空间生成模型和合成数据集，逐步将生成模型和合成数据移向所需性质数值的区域。我们的生成模型采用潜在提示变换器（LPT）的形式，其中潜在向量充当因果变换器的提示。我们广泛的实验表明了提出方法的有效性，该方法在单目标、多目标和约束分子设计任务中树立了新的性能基准。",
    "tldr": "提出了双空间优化（DSO）方法，通过整合潜在空间采样和数据空间选择，使用Latent Prompt Transformer (LPT)生成模型，解决了分子设计中的关键问题，取得了在不同任务中的性能优势。",
    "en_tdlr": "Introducing the Dual-Space Optimization (DSO) method to address the challenging problem of molecule design, which integrates latent space sampling and data space selection, leveraging the Latent Prompt Transformer (LPT) generative model to achieve superior performance across various design tasks."
}