{
    "title": "Social Learning with Intrinsic Preferences",
    "abstract": "arXiv:2402.18452v1 Announce Type: new  Abstract: Despite strong evidence for peer effects, little is known about how individuals balance intrinsic preferences and social learning in different choice environments. Using a combination of experiments and discrete choice modeling, we show that intrinsic preferences and social learning jointly influence participants' decisions, but their relative importance varies across choice tasks and environments. Intrinsic preferences guide participants' decisions in a subjective choice task, while social learning determines participants' decisions in a task with an objectively correct solution. A choice environment in which people expect to be rewarded for their choices reinforces the influence of intrinsic preferences, whereas an environment in which people expect to be punished for their choices reinforces conformist social learning. We use simulations to discuss the implications of these findings for the polarization of behavior.",
    "link": "https://arxiv.org/abs/2402.18452",
    "context": "Title: Social Learning with Intrinsic Preferences\nAbstract: arXiv:2402.18452v1 Announce Type: new  Abstract: Despite strong evidence for peer effects, little is known about how individuals balance intrinsic preferences and social learning in different choice environments. Using a combination of experiments and discrete choice modeling, we show that intrinsic preferences and social learning jointly influence participants' decisions, but their relative importance varies across choice tasks and environments. Intrinsic preferences guide participants' decisions in a subjective choice task, while social learning determines participants' decisions in a task with an objectively correct solution. A choice environment in which people expect to be rewarded for their choices reinforces the influence of intrinsic preferences, whereas an environment in which people expect to be punished for their choices reinforces conformist social learning. We use simulations to discuss the implications of these findings for the polarization of behavior.",
    "path": "papers/24/02/2402.18452.json",
    "total_tokens": 850,
    "translated_title": "具有内在偏好的社会学习",
    "translated_abstract": "尽管存在大量关于同侪效应的证据，但人们对个体在不同选择环境中如何平衡内在偏好和社会学习了解甚少。我们利用实验和离散选择建模相结合的方法，展示了内在偏好和社会学习共同影响参与者的决策，但它们的相对重要性因选择任务和环境的不同而变化。内在偏好指导参与者在主观选择任务中的决策，而社会学习决定参与者在具有客观正确解的任务中的决策。人们期望根据自己的选择获得奖励的选择环境强化了内在偏好的影响，而人们期望因自己的选择而受到惩罚的环境强化了顺从式社会学习。我们使用模拟讨论了这些发现对行为极化的影响。",
    "tldr": "内在偏好和社会学习共同影响参与者的决策，内在偏好指导主观选择任务中的决策，社会学习决定客观正确解的任务中的决策，不同选择环境下奖励或惩罚会强化各自影响，对行为极化有重要意义。",
    "en_tdlr": "Intrinsic preferences and social learning jointly influence participants' decisions; intrinsic preferences guide decisions in subjective choice tasks, while social learning determines decisions in tasks with objectively correct solutions; rewards or punishments in different choice environments reinforce their respective influences, with significant implications for behavioral polarization."
}