{
    "title": "Computation Rate Maximization for Wireless Powered Edge Computing With Multi-User Cooperation",
    "abstract": "arXiv:2402.16866v1 Announce Type: cross  Abstract: The combination of mobile edge computing (MEC) and radio frequency-based wireless power transfer (WPT) presents a promising technique for providing sustainable energy supply and computing services at the network edge. This study considers a wireless-powered mobile edge computing system that includes a hybrid access point (HAP) equipped with a computing unit and multiple Internet of Things (IoT) devices. In particular, we propose a novel muti-user cooperation scheme to improve computation performance, where collaborative clusters are dynamically formed. Each collaborative cluster comprises a source device (SD) and an auxiliary device (AD), where the SD can partition the computation task into various segments for local processing, offloading to the HAP, and remote execution by the AD with the assistance of the HAP. Specifically, we aims to maximize the weighted sum computation rate (WSCR) of all the IoT devices in the network. This invol",
    "link": "https://arxiv.org/abs/2402.16866",
    "context": "Title: Computation Rate Maximization for Wireless Powered Edge Computing With Multi-User Cooperation\nAbstract: arXiv:2402.16866v1 Announce Type: cross  Abstract: The combination of mobile edge computing (MEC) and radio frequency-based wireless power transfer (WPT) presents a promising technique for providing sustainable energy supply and computing services at the network edge. This study considers a wireless-powered mobile edge computing system that includes a hybrid access point (HAP) equipped with a computing unit and multiple Internet of Things (IoT) devices. In particular, we propose a novel muti-user cooperation scheme to improve computation performance, where collaborative clusters are dynamically formed. Each collaborative cluster comprises a source device (SD) and an auxiliary device (AD), where the SD can partition the computation task into various segments for local processing, offloading to the HAP, and remote execution by the AD with the assistance of the HAP. Specifically, we aims to maximize the weighted sum computation rate (WSCR) of all the IoT devices in the network. This invol",
    "path": "papers/24/02/2402.16866.json",
    "total_tokens": 838,
    "translated_title": "用于多用户协作的无线供电边缘计算的计算速率最大化",
    "translated_abstract": "arXiv:2402.16866v1 公告类型: 跨学科 摘要: 移动边缘计算（MEC）和基于射频的无线功率传输（WPT）的结合呈现出一种为网络边缘提供可持续能源供应和计算服务的有前景的技术。本研究考虑了一个包括具有计算单元和多个物联网（IoT）设备的混合接入点（HAP）的无线供电移动边缘计算系统。具体而言，我们提出了一种新颖的多用户协作方案来改善计算性能，其中合作集群是动态形成的。每个合作集群包括一个源设备（SD）和一个辅助设备（AD），其中SD可以将计算任务分成各种部分进行本地处理，向HAP卸载，并在HAP的帮助下由AD远程执行。具体而言，我们旨在最大化网络中所有IoT设备的加权总计算速率（WSCR）。",
    "tldr": "提出一种新颖的多用户协作方案，旨在最大化网络中所有IoT设备的加权总计算速率（WSCR）。",
    "en_tdlr": "Propose a novel multi-user cooperation scheme aiming to maximize the weighted sum computation rate (WSCR) of all IoT devices in the network."
}