{
    "title": "Calibrated Uncertainty Quantification for Operator Learning via Conformal Prediction",
    "abstract": "Operator learning has been increasingly adopted in scientific and engineering applications, many of which require calibrated uncertainty quantification. Since the output of operator learning is a continuous function, quantifying uncertainty simultaneously at all points in the domain is challenging. Current methods consider calibration at a single point or over one scalar function or make strong assumptions such as Gaussianity. We propose a risk-controlling quantile neural operator, a distribution-free, finite-sample functional calibration conformal prediction method. We provide a theoretical calibration guarantee on the coverage rate, defined as the expected percentage of points on the function domain whose true value lies within the predicted uncertainty ball. Empirical results on a 2D Darcy flow and a 3D car surface pressure prediction tasks validate our theoretical results, demonstrating calibrated coverage and efficient uncertainty bands outperforming baseline methods. In particula",
    "link": "https://arxiv.org/abs/2402.01960",
    "context": "Title: Calibrated Uncertainty Quantification for Operator Learning via Conformal Prediction\nAbstract: Operator learning has been increasingly adopted in scientific and engineering applications, many of which require calibrated uncertainty quantification. Since the output of operator learning is a continuous function, quantifying uncertainty simultaneously at all points in the domain is challenging. Current methods consider calibration at a single point or over one scalar function or make strong assumptions such as Gaussianity. We propose a risk-controlling quantile neural operator, a distribution-free, finite-sample functional calibration conformal prediction method. We provide a theoretical calibration guarantee on the coverage rate, defined as the expected percentage of points on the function domain whose true value lies within the predicted uncertainty ball. Empirical results on a 2D Darcy flow and a 3D car surface pressure prediction tasks validate our theoretical results, demonstrating calibrated coverage and efficient uncertainty bands outperforming baseline methods. In particula",
    "path": "papers/24/02/2402.01960.json",
    "total_tokens": 888,
    "translated_title": "通过符合预测实现运算器学习的校准不确定性量化",
    "translated_abstract": "运算器学习在科学和工程应用中越来越被采用，其中很多应用需要校准的不确定性量化。由于运算器学习的输出是连续函数，在整个定义域上同时量化不确定性是具有挑战性的。当前的方法只考虑一个点的校准，或者针对一个标量函数进行校准，或者做出强大的假设，比如假设高斯性。我们提出了一种风险控制的分位数神经运算器,一种无分布、有限样本的函数校准符合预测方法。我们提供了一个理论上的校准保证，即覆盖率，其定义为函数定义域内真实值位于预测不确定性球内的预期百分比。在一个2D Darcy流动和一个3D车辆表面压力预测任务上的实证结果验证了我们的理论结果，表明校准的覆盖率和有效的不确定性区间优于基线方法。",
    "tldr": "通过符合预测方法，提出了一种校准不确定性量化的分位数神经运算器，能够在函数定义域上同时量化不确定性，无需分布假设，实验结果表明其在2D Darcy流动和3D车辆表面压力预测任务上优于基线方法。",
    "en_tdlr": "A risk-controlling quantile neural operator is proposed for calibrated uncertainty quantification in operator learning, which can simultaneously quantify uncertainty at all points in the function domain without distribution assumptions. Experimental results on 2D Darcy flow and 3D car surface pressure prediction tasks demonstrate its superiority over baseline methods."
}