{
    "title": "Towards Industry 5.0: A Systematic Literature Review on Sustainable and Green Composite Materials Supply Chains",
    "abstract": "Sustainable supply chain management is a key objective of Industry 5.0, leveraging technologies like real-time data analytics, connectivity, and intelligent automation. At the same time, composite materials present benefits such as lightweight structures, crucial for reducing fuel consumption. This study investigates the intersection between sustainable supply chains and composites by analyzing the current status, research gaps, methodologies, and future research opportunities through bibliometric analysis and a systematic review of the state of the art in the composite materials supply chain. A systematic literature review approach is employed to analyze the Scopus and Web of Science (WOS) databases, offering a comprehensive overview of the existing literature. Through bibliometric analysis, the study investigates countries, authors, citations, keywords, subject areas, and article themes within the metadata to provide additional context. An in-depth analysis of thirty selected papers ",
    "link": "https://arxiv.org/abs/2402.06100",
    "context": "Title: Towards Industry 5.0: A Systematic Literature Review on Sustainable and Green Composite Materials Supply Chains\nAbstract: Sustainable supply chain management is a key objective of Industry 5.0, leveraging technologies like real-time data analytics, connectivity, and intelligent automation. At the same time, composite materials present benefits such as lightweight structures, crucial for reducing fuel consumption. This study investigates the intersection between sustainable supply chains and composites by analyzing the current status, research gaps, methodologies, and future research opportunities through bibliometric analysis and a systematic review of the state of the art in the composite materials supply chain. A systematic literature review approach is employed to analyze the Scopus and Web of Science (WOS) databases, offering a comprehensive overview of the existing literature. Through bibliometric analysis, the study investigates countries, authors, citations, keywords, subject areas, and article themes within the metadata to provide additional context. An in-depth analysis of thirty selected papers ",
    "path": "papers/24/02/2402.06100.json",
    "total_tokens": 878,
    "translated_title": "迈向工业5.0：可持续和绿色复合材料供应链的系统文献综述",
    "translated_abstract": "可持续供应链管理是工业5.0的关键目标，利用实时数据分析、连接性和智能自动化等技术。与此同时，复合材料具有轻质结构等优点，对于减少燃油消耗至关重要。本研究通过对复合材料供应链现状、研究缺口、方法论和未来研究机会进行计量分析和系统综述，探讨了可持续供应链与复合材料之间的交叉点。采用系统文献综述方法分析Scopus和Web of Science (WOS)数据库，提供了现有文献的全面概述。通过计量分析，研究调查了元数据中的国家、作者、引用、关键词、学科领域和文章主题，以提供额外的背景信息。在对30篇选定论文的深入分析中，",
    "tldr": "这篇论文通过分析文献和系统综述，研究了可持续供应链和复合材料之间的交叉点，提供了关于工业5.0中可持续和绿色复合材料供应链的现状、研究缺口和未来研究机会的综合概述。"
}