{
    "title": "Time preference, wealth and utility inequality: A microeconomic interaction and dynamic macroeconomic model connection approach",
    "abstract": "arXiv:2402.08905v1 Announce Type: new Abstract: Based on interactions between individuals and others and references to social norms, this study reveals the impact of heterogeneity in time preference on wealth distribution and inequality. We present a novel approach that connects the interactions between microeconomic agents that generate heterogeneity to the dynamic equations for capital and consumption in macroeconomic models. Using this approach, we estimate the impact of changes in the discount rate due to microeconomic interactions on capital, consumption and utility and the degree of inequality. The results show that intercomparisons with others regarding consumption significantly affect capital, i.e. wealth inequality. Furthermore, the impact on utility is never small and social norms can reduce this impact. Our supporting evidence shows that the quantitative results of inequality calculations correspond to survey data from cohort and cross-cultural studies. This study's micro-ma",
    "link": "https://arxiv.org/abs/2402.08905",
    "context": "Title: Time preference, wealth and utility inequality: A microeconomic interaction and dynamic macroeconomic model connection approach\nAbstract: arXiv:2402.08905v1 Announce Type: new Abstract: Based on interactions between individuals and others and references to social norms, this study reveals the impact of heterogeneity in time preference on wealth distribution and inequality. We present a novel approach that connects the interactions between microeconomic agents that generate heterogeneity to the dynamic equations for capital and consumption in macroeconomic models. Using this approach, we estimate the impact of changes in the discount rate due to microeconomic interactions on capital, consumption and utility and the degree of inequality. The results show that intercomparisons with others regarding consumption significantly affect capital, i.e. wealth inequality. Furthermore, the impact on utility is never small and social norms can reduce this impact. Our supporting evidence shows that the quantitative results of inequality calculations correspond to survey data from cohort and cross-cultural studies. This study's micro-ma",
    "path": "papers/24/02/2402.08905.json",
    "total_tokens": 1005,
    "translated_title": "时间偏好、财富和效用不平等：一种微观经济互动和动态宏观经济模型连接方法",
    "translated_abstract": "基于个体与他人的互动与对社会规范的参考，本研究揭示了时间偏好的异质性对财富分配和不平等的影响。我们提出了一种新颖的方法，将产生异质性的微观经济主体之间的互动与宏观经济模型中的资本和消费动态方程相连接。利用这种方法，我们估计了微观经济互动引起的折现率变化对资本、消费和效用以及不平等程度的影响。结果显示，与他人的消费比较显著影响资本，即财富不平等。此外，对效用的影响从未微小，并且社会规范可以减少这种影响。我们的支持证据显示，不平等计算的定量结果与队列和跨文化研究的调查数据相符。本研究的微观-宏观连接方法为理解时间偏好对经济不平等的影响提供了新的框架。",
    "tldr": "本研究通过将个体之间的互动与社会规范参考相连接，揭示了时间偏好对财富分配和不平等的影响。通过模型计算和实证分析，结果显示，个体之间的消费比较对财富不平等和效用产生显著影响。社会规范在一定程度上可以减缓这种影响。这个方法提供了一个新的框架，用于理解时间偏好在经济不平等中的作用。"
}