{
    "title": "Fuzzy clustering of circular time series based on a new dependence measure with applications to wind data",
    "abstract": "arXiv:2402.08687v1 Announce Type: cross Abstract: Time series clustering is an essential machine learning task with applications in many disciplines. While the majority of the methods focus on time series taking values on the real line, very few works consider time series defined on the unit circle, although the latter objects frequently arise in many applications. In this paper, the problem of clustering circular time series is addressed. To this aim, a distance between circular series is introduced and used to construct a clustering procedure. The metric relies on a new measure of serial dependence considering circular arcs, thus taking advantage of the directional character inherent to the series range. Since the dynamics of the series may vary over the time, we adopt a fuzzy approach, which enables the procedure to locate each series into several clusters with different membership degrees. The resulting clustering algorithm is able to group series generated from similar stochastic ",
    "link": "https://arxiv.org/abs/2402.08687",
    "context": "Title: Fuzzy clustering of circular time series based on a new dependence measure with applications to wind data\nAbstract: arXiv:2402.08687v1 Announce Type: cross Abstract: Time series clustering is an essential machine learning task with applications in many disciplines. While the majority of the methods focus on time series taking values on the real line, very few works consider time series defined on the unit circle, although the latter objects frequently arise in many applications. In this paper, the problem of clustering circular time series is addressed. To this aim, a distance between circular series is introduced and used to construct a clustering procedure. The metric relies on a new measure of serial dependence considering circular arcs, thus taking advantage of the directional character inherent to the series range. Since the dynamics of the series may vary over the time, we adopt a fuzzy approach, which enables the procedure to locate each series into several clusters with different membership degrees. The resulting clustering algorithm is able to group series generated from similar stochastic ",
    "path": "papers/24/02/2402.08687.json",
    "total_tokens": 855,
    "translated_title": "基于新的依赖测度的模糊圆形时间序列聚类及其在风数据中的应用",
    "translated_abstract": "时间序列聚类是一项机器学习任务，广泛应用于许多领域。尽管大多数方法都集中在取值于实数线上的时间序列，但很少有方法考虑到取值在单位圆上的时间序列，尽管后者在许多应用中经常出现。本文提出了对圆形时间序列进行聚类的问题。为此，引入了一种圆形序列之间的距离，用于构建聚类过程。该度量依赖于一种考虑圆弧的新的序列依赖测度，从而利用了序列范围固有的方向特性。由于序列的动态特性可能随时间变化，我们采用了模糊方法，使该过程能够将每个序列分配到具有不同成员度的多个聚类中。得到的聚类算法能够将从相似随机生成的序列分组在一起。",
    "tldr": "本文提出了一种基于新的依赖测度的模糊圆形时间序列聚类方法，能够有效地将取值在单位圆上的时间序列进行聚类分析，并考虑了序列的动态特性。",
    "en_tdlr": "This paper proposes a fuzzy clustering method for circular time series based on a new dependence measure, which effectively clusters time series defined on the unit circle and takes into account the dynamics of the series."
}