{
    "title": "Estimating the age-conditioned average treatment effects curves: An application for assessing load-management strategies in the NBA",
    "abstract": "arXiv:2402.12400v1 Announce Type: cross  Abstract: In the realm of competitive sports, understanding the performance dynamics of athletes, represented by the age curve (showing progression, peak, and decline), is vital. Our research introduces a novel framework for quantifying age-specific treatment effects, enhancing the granularity of performance trajectory analysis. Firstly, we propose a methodology for estimating the age curve using game-level data, diverging from traditional season-level data approaches, and tackling its inherent complexities with a meta-learner framework that leverages advanced machine learning models. This approach uncovers intricate non-linear patterns missed by existing methods. Secondly, our framework enables the identification of causal effects, allowing for a detailed examination of age curves under various conditions. By defining the Age-Conditioned Treatment Effect (ACTE), we facilitate the exploration of causal relationships regarding treatment impacts a",
    "link": "https://arxiv.org/abs/2402.12400",
    "context": "Title: Estimating the age-conditioned average treatment effects curves: An application for assessing load-management strategies in the NBA\nAbstract: arXiv:2402.12400v1 Announce Type: cross  Abstract: In the realm of competitive sports, understanding the performance dynamics of athletes, represented by the age curve (showing progression, peak, and decline), is vital. Our research introduces a novel framework for quantifying age-specific treatment effects, enhancing the granularity of performance trajectory analysis. Firstly, we propose a methodology for estimating the age curve using game-level data, diverging from traditional season-level data approaches, and tackling its inherent complexities with a meta-learner framework that leverages advanced machine learning models. This approach uncovers intricate non-linear patterns missed by existing methods. Secondly, our framework enables the identification of causal effects, allowing for a detailed examination of age curves under various conditions. By defining the Age-Conditioned Treatment Effect (ACTE), we facilitate the exploration of causal relationships regarding treatment impacts a",
    "path": "papers/24/02/2402.12400.json",
    "total_tokens": 887,
    "translated_title": "估计年龄条件下的平均治疗效应曲线：评估NBA中的负荷管理策略应用",
    "translated_abstract": "在竞技体育领域，了解运动员表现动态（通过年龄曲线展示进展、巅峰和衰退）至关重要。我们的研究引入了一种新颖的框架来量化年龄特定的治疗效应，增强了性能轨迹分析的细致度。首先，我们提出了一种使用比赛层次数据估计年龄曲线的方法，与传统的赛季级数据方法有所不同，通过利用先进的机器学习模型的元学习框架来解决其固有的复杂性。该方法揭示了现有方法忽略的复杂非线性模式。其次，我们的框架使得能够确定因果效应，可以详细研究不同条件下的年龄曲线。通过定义年龄条件下的治疗效应（ACTE），我们促进了对治疗影响因果关系的探讨。",
    "tldr": "引入了一种新框架，通过比赛层次数据估计年龄曲线，提高了性能轨迹分析的细致度，可以发现复杂非线性模式，实现对年龄曲线的因果效应的细致研究。",
    "en_tdlr": "Introducing a new framework that estimates age curves using game-level data, enhancing the granularity of performance trajectory analysis, uncovering complex non-linear patterns, and enabling detailed exploration of causal effects regarding age curves."
}