{
    "title": "A case study of sending graph neural networks back to the test bench for applications in high-energy particle physics",
    "abstract": "arXiv:2402.17386v1 Announce Type: cross  Abstract: In high-energy particle collisions, the primary collision products usually decay further resulting in tree-like, hierarchical structures with a priori unknown multiplicity. At the stable-particle level all decay products of a collision form permutation invariant sets of final state objects. The analogy to mathematical graphs gives rise to the idea that graph neural networks (GNNs), which naturally resemble these properties, should be best-suited to address many tasks related to high-energy particle physics. In this paper we describe a benchmark test of a typical GNN against neural networks of the well-established deep fully-connected feed-forward architecture. We aim at performing this comparison maximally unbiased in terms of nodes, hidden layers, or trainable parameters of the neural networks under study. As physics case we use the classification of the final state X produced in association with top quark-antiquark pairs in proton-pr",
    "link": "https://arxiv.org/abs/2402.17386",
    "context": "Title: A case study of sending graph neural networks back to the test bench for applications in high-energy particle physics\nAbstract: arXiv:2402.17386v1 Announce Type: cross  Abstract: In high-energy particle collisions, the primary collision products usually decay further resulting in tree-like, hierarchical structures with a priori unknown multiplicity. At the stable-particle level all decay products of a collision form permutation invariant sets of final state objects. The analogy to mathematical graphs gives rise to the idea that graph neural networks (GNNs), which naturally resemble these properties, should be best-suited to address many tasks related to high-energy particle physics. In this paper we describe a benchmark test of a typical GNN against neural networks of the well-established deep fully-connected feed-forward architecture. We aim at performing this comparison maximally unbiased in terms of nodes, hidden layers, or trainable parameters of the neural networks under study. As physics case we use the classification of the final state X produced in association with top quark-antiquark pairs in proton-pr",
    "path": "papers/24/02/2402.17386.json",
    "total_tokens": 852,
    "translated_title": "将图神经网络重新送回试验台进行在高能粒子物理学中的应用的案例研究",
    "translated_abstract": "在高能粒子碰撞中，主要的碰撞产物通常会进一步衰变，形成类似树状结构的分层结构，其中节点数量未知。在稳定粒子级别上，碰撞的所有衰变产物形成具有置换不变性的最终状态对象集合。与数学图的类比引发了一个想法，即图神经网络（GNNs），自然地类似于这些属性，应该最适合处理许多与高能粒子物理学相关的任务。在本文中，我们描述了针对典型GNN与深度全连接前馈结构神经网络进行基准测试的案例。我们旨在以节点、隐藏层或所研究神经网络的可训练参数方面最大程度地不偏性地进行这种比较。作为物理案例，我们使用与质子中产生的顶夸克对关联的最终态X的分类。",
    "tldr": "本文进行了一项用典型GNN与深度全连接前馈结构神经网络进行基准测试的案例研究，以在高能粒子物理学领域中探讨它们的应用。",
    "en_tdlr": "This paper presents a case study of benchmark testing a typical GNN against deep fully-connected feed-forward neural networks for applications in high-energy particle physics."
}