{
    "title": "Under Pressure: Comparative Statics for Optimal Stopping Problems in Nonstationary Environments",
    "abstract": "We present a general optimal stopping problem accommodating a broad spectrum of nonstationary environments. These include scenarios where the decision maker's patience (i.e., discount rate), time pressure (i.e., arrival rate of a stochastic deadline), learning speed (i.e., volatility of the diffusion process) can change over time both gradually and abruptly. Our paper offers three main contributions. First, we prove this general problem has a well-defined solution under mild regularity conditions. Second, we develop comprehensive comparative statics results that are crucial to characterize the shape of the stopping region in the broad class of \\textit{monotone environments}. Finally, we leverage these comparative statics to examine the speed-accuracy tradeoffs in various information acquisition problems, revealing how decision accuracy varies over time in response to changes in the discount rate, learning speed, or deadline-induced time pressure. Notably, our main comparative static re",
    "link": "https://arxiv.org/abs/2402.06999",
    "context": "Title: Under Pressure: Comparative Statics for Optimal Stopping Problems in Nonstationary Environments\nAbstract: We present a general optimal stopping problem accommodating a broad spectrum of nonstationary environments. These include scenarios where the decision maker's patience (i.e., discount rate), time pressure (i.e., arrival rate of a stochastic deadline), learning speed (i.e., volatility of the diffusion process) can change over time both gradually and abruptly. Our paper offers three main contributions. First, we prove this general problem has a well-defined solution under mild regularity conditions. Second, we develop comprehensive comparative statics results that are crucial to characterize the shape of the stopping region in the broad class of \\textit{monotone environments}. Finally, we leverage these comparative statics to examine the speed-accuracy tradeoffs in various information acquisition problems, revealing how decision accuracy varies over time in response to changes in the discount rate, learning speed, or deadline-induced time pressure. Notably, our main comparative static re",
    "path": "papers/24/02/2402.06999.json",
    "total_tokens": 903,
    "translated_title": "在非平稳环境中的最优停止问题的比较静态研究",
    "translated_abstract": "我们提出了一个通用的最优停止问题，适用于广泛的非平稳环境。这些环境包括决策者耐心（即折现率）、时间压力（即随机截止期的到达率）、学习速度（即扩散过程的波动性）等可以随时间逐渐或突然变化的情景。我们的论文提供了三个主要贡献。首先，我们证明在温和的正则条件下，这个通用问题有一个合理定义的解。其次，我们开发了全面的比较静态结果，对于描述在广泛类别的单调环境中停止区域的形状是至关重要的。最后，我们利用这些比较静态结果，来研究各种信息获取问题中的速度-精度权衡，在折现率、学习速度或截止期引起的时间压力发生变化时，揭示决策准确性如何随时间变化。值得注意的是，我们的主要比较静态结果可以推广至其他最优停止问题。",
    "tldr": "这项研究提出了一个通用的最优停止问题，适用于各种非平稳环境。研究结果包括了问题的解存在性、比较静态结果的推导和速度-精度权衡的分析。通过研究可以发现，决策准确性会随着折现率、学习速度和截止期引起的时间压力变化而变化。"
}