{
    "title": "Conditional Normalizing Flows for Active Learning of Coarse-Grained Molecular Representations",
    "abstract": "Efficient sampling of the Boltzmann distribution of molecular systems is a long-standing challenge. Recently, instead of generating long molecular dynamics simulations, generative machine learning methods such as normalizing flows have been used to learn the Boltzmann distribution directly, without samples. However, this approach is susceptible to mode collapse and thus often does not explore the full configurational space. In this work, we address this challenge by separating the problem into two levels, the fine-grained and coarse-grained degrees of freedom. A normalizing flow conditioned on the coarse-grained space yields a probabilistic connection between the two levels. To explore the configurational space, we employ coarse-grained simulations with active learning which allows us to update the flow and make all-atom potential energy evaluations only when necessary. Using alanine dipeptide as an example, we show that our methods obtain a speedup to molecular dynamics simulations of",
    "link": "https://rss.arxiv.org/abs/2402.01195",
    "context": "Title: Conditional Normalizing Flows for Active Learning of Coarse-Grained Molecular Representations\nAbstract: Efficient sampling of the Boltzmann distribution of molecular systems is a long-standing challenge. Recently, instead of generating long molecular dynamics simulations, generative machine learning methods such as normalizing flows have been used to learn the Boltzmann distribution directly, without samples. However, this approach is susceptible to mode collapse and thus often does not explore the full configurational space. In this work, we address this challenge by separating the problem into two levels, the fine-grained and coarse-grained degrees of freedom. A normalizing flow conditioned on the coarse-grained space yields a probabilistic connection between the two levels. To explore the configurational space, we employ coarse-grained simulations with active learning which allows us to update the flow and make all-atom potential energy evaluations only when necessary. Using alanine dipeptide as an example, we show that our methods obtain a speedup to molecular dynamics simulations of",
    "path": "papers/24/02/2402.01195.json",
    "total_tokens": 853,
    "translated_title": "条件化正则化流用于粗粒化分子表示的主动学习",
    "translated_abstract": "高效采样分子系统的玻尔兹曼分布是一个长期存在的挑战。最近，与生成长时间分子动力学模拟不同，生成机器学习方法如正则化流被用于直接学习玻尔兹曼分布，而不需要样本。然而，这种方法容易出现模式崩溃，因此常常无法探索全部的构型空间。在这项工作中，我们将问题分为两个层次，细粒度和粗粒度自由度。在粗粒化空间上条件化正则化流可以产生两个层次之间的概率连接。为了探索构型空间，我们采用了粗粒化模拟与主动学习的方法，可以在必要时更新流并进行全原子势能评估。以丙氨酸二肽为例，我们展示了我们的方法相对于分子动力学模拟的加速效果。",
    "tldr": "本文提出了使用条件化正则化流和主动学习的方法来解决粗粒化分子表示中的玻尔兹曼分布采样问题，相比传统的分子动力学模拟，该方法能够获得更高效的加速效果。"
}