{
    "title": "Improving Weak-to-Strong Generalization with Scalable Oversight and Ensemble Learning",
    "abstract": "This paper presents a follow-up study to OpenAI's recent superalignment work on Weak-to-Strong Generalization (W2SG). Superalignment focuses on ensuring that high-level AI systems remain consistent with human values and intentions when dealing with complex, high-risk tasks. The W2SG framework has opened new possibilities for empirical research in this evolving field. Our study simulates two phases of superalignment under the W2SG framework: the development of general superhuman models and the progression towards superintelligence. In the first phase, based on human supervision, the quality of weak supervision is enhanced through a combination of scalable oversight and ensemble learning, reducing the capability gap between weak teachers and strong students. In the second phase, an automatic alignment evaluator is employed as the weak supervisor. By recursively updating this auto aligner, the capabilities of the weak teacher models are synchronously enhanced, achieving weak-to-strong sup",
    "link": "https://arxiv.org/abs/2402.00667",
    "context": "Title: Improving Weak-to-Strong Generalization with Scalable Oversight and Ensemble Learning\nAbstract: This paper presents a follow-up study to OpenAI's recent superalignment work on Weak-to-Strong Generalization (W2SG). Superalignment focuses on ensuring that high-level AI systems remain consistent with human values and intentions when dealing with complex, high-risk tasks. The W2SG framework has opened new possibilities for empirical research in this evolving field. Our study simulates two phases of superalignment under the W2SG framework: the development of general superhuman models and the progression towards superintelligence. In the first phase, based on human supervision, the quality of weak supervision is enhanced through a combination of scalable oversight and ensemble learning, reducing the capability gap between weak teachers and strong students. In the second phase, an automatic alignment evaluator is employed as the weak supervisor. By recursively updating this auto aligner, the capabilities of the weak teacher models are synchronously enhanced, achieving weak-to-strong sup",
    "path": "papers/24/02/2402.00667.json",
    "total_tokens": 856,
    "translated_title": "通过可扩展监督和集成学习提高弱到强泛化能力的研究",
    "translated_abstract": "本文对OpenAI最新的关于弱到强泛化能力的超对齐工作进行了后续研究。超对齐工作旨在确保高级AI系统在处理复杂、高风险任务时与人类的价值和意图保持一致。弱到强泛化能力的框架为这一不断发展的领域开拓了新的研究可能性。我们的研究模拟了W2SG框架下的两个超对齐阶段：通用超人类模型的发展和朝着超级智能的进步。在第一阶段中，通过可扩展监督和集成学习的组合，通过人类监督提高了弱监督的质量，减小了弱教师和强学生之间的能力差距。在第二阶段中，利用自动对齐评估器作为弱监督者。通过递归更新该自动对齐器，同步增强了弱教师模型的能力，实现了从弱到强的超对齐。",
    "tldr": "本文通过结合可扩展监督和集成学习的方式，在弱教师和强学生之间减小了能力差距，提高了弱到强泛化能力的框架下的泛化效果。"
}