{
    "title": "Explainable Automated Machine Learning for Credit Decisions: Enhancing Human Artificial Intelligence Collaboration in Financial Engineering",
    "abstract": "This paper explores the integration of Explainable Automated Machine Learning (AutoML) in the realm of financial engineering, specifically focusing on its application in credit decision-making. The rapid evolution of Artificial Intelligence (AI) in finance has necessitated a balance between sophisticated algorithmic decision-making and the need for transparency in these systems. The focus is on how AutoML can streamline the development of robust machine learning models for credit scoring, while Explainable AI (XAI) methods, particularly SHapley Additive exPlanations (SHAP), provide insights into the models' decision-making processes. This study demonstrates how the combination of AutoML and XAI not only enhances the efficiency and accuracy of credit decisions but also fosters trust and collaboration between humans and AI systems. The findings underscore the potential of explainable AutoML in improving the transparency and accountability of AI-driven financial decisions, aligning with r",
    "link": "https://arxiv.org/abs/2402.03806",
    "context": "Title: Explainable Automated Machine Learning for Credit Decisions: Enhancing Human Artificial Intelligence Collaboration in Financial Engineering\nAbstract: This paper explores the integration of Explainable Automated Machine Learning (AutoML) in the realm of financial engineering, specifically focusing on its application in credit decision-making. The rapid evolution of Artificial Intelligence (AI) in finance has necessitated a balance between sophisticated algorithmic decision-making and the need for transparency in these systems. The focus is on how AutoML can streamline the development of robust machine learning models for credit scoring, while Explainable AI (XAI) methods, particularly SHapley Additive exPlanations (SHAP), provide insights into the models' decision-making processes. This study demonstrates how the combination of AutoML and XAI not only enhances the efficiency and accuracy of credit decisions but also fosters trust and collaboration between humans and AI systems. The findings underscore the potential of explainable AutoML in improving the transparency and accountability of AI-driven financial decisions, aligning with r",
    "path": "papers/24/02/2402.03806.json",
    "total_tokens": 977,
    "translated_title": "可解释的自动化机器学习在信贷决策中的应用：增强金融工程中人工智能与人类合作的能力",
    "translated_abstract": "本文探讨了可解释的自动化机器学习（AutoML）在金融工程领域的整合，特别关注其在信贷决策中的应用。金融领域中人工智能的快速发展需要在这些系统中找到复杂算法决策与透明度之间的平衡。重点是AutoML如何简化强大的机器学习模型的开发，以进行信用评分，而可解释的人工智能（XAI）方法，尤其是SHapley Additive exPlanations（SHAP），则为模型的决策过程提供了洞察力。本研究证明了AutoML和XAI的结合不仅提高了信贷决策的效率和准确性，还促进了人类和人工智能系统之间的信任和合作。研究结果强调了可解释的AutoML在改善人工智能驱动的金融决策的透明度和责任方面的潜力，与要求为用户提供解释的趋势相一致。",
    "tldr": "本文介绍了可解释的自动化机器学习（AutoML）在信贷决策中的应用，结合了可解释的人工智能（XAI）方法，特别是SHapley Additive exPlanations（SHAP）。它提高了信贷决策的效率和准确性，同时增进了人类和人工智能系统之间的信任和合作。"
}