{
    "title": "Practice Makes Perfect: Planning to Learn Skill Parameter Policies",
    "abstract": "arXiv:2402.15025v1 Announce Type: cross  Abstract: One promising approach towards effective robot decision making in complex, long-horizon tasks is to sequence together parameterized skills. We consider a setting where a robot is initially equipped with (1) a library of parameterized skills, (2) an AI planner for sequencing together the skills given a goal, and (3) a very general prior distribution for selecting skill parameters. Once deployed, the robot should rapidly and autonomously learn to improve its performance by specializing its skill parameter selection policy to the particular objects, goals, and constraints in its environment. In this work, we focus on the active learning problem of choosing which skills to practice to maximize expected future task success. We propose that the robot should estimate the competence of each skill, extrapolate the competence (asking: \"how much would the competence improve through practice?\"), and situate the skill in the task distribution throu",
    "link": "https://arxiv.org/abs/2402.15025",
    "context": "Title: Practice Makes Perfect: Planning to Learn Skill Parameter Policies\nAbstract: arXiv:2402.15025v1 Announce Type: cross  Abstract: One promising approach towards effective robot decision making in complex, long-horizon tasks is to sequence together parameterized skills. We consider a setting where a robot is initially equipped with (1) a library of parameterized skills, (2) an AI planner for sequencing together the skills given a goal, and (3) a very general prior distribution for selecting skill parameters. Once deployed, the robot should rapidly and autonomously learn to improve its performance by specializing its skill parameter selection policy to the particular objects, goals, and constraints in its environment. In this work, we focus on the active learning problem of choosing which skills to practice to maximize expected future task success. We propose that the robot should estimate the competence of each skill, extrapolate the competence (asking: \"how much would the competence improve through practice?\"), and situate the skill in the task distribution throu",
    "path": "papers/24/02/2402.15025.json",
    "total_tokens": 797,
    "translated_title": "练习方能致完美：规划学习技能参数策略",
    "translated_abstract": "一个有效的机器人决策方法是将参数化技能序列起来，考虑到机器人最初会配备一系列参数化技能库、一个AI规划器用于根据目标对技能进行排序，并且具有用于选择技能参数的非常普遍的先验分布。一旦部署，机器人应该通过将其技能参数选择策略专门化到其环境中的特定对象、目标和约束，来迅速自主地学习以提高其性能。本文侧重于主动学习问题，即选择要练习的技能以最大化未来任务成功的预期。我们提出机器人应该估计每个技能的能力，推断能力（即“通过练习能力会提升多少？”），并将该技能置于任务分配中。",
    "tldr": "机器人应该通过估计技能的能力，推断通过练习能力的提升，并将其放置在任务分配中，以选择要练习的技能来最大化未来任务成功的预期。",
    "en_tdlr": "The robot should estimate the competence of each skill, extrapolate the competence improvement through practice, and situate the skill in the task distribution to choose which skills to practice for maximizing expected future task success."
}