{
    "title": "List-aware Reranking-Truncation Joint Model for Search and Retrieval-augmented Generation",
    "abstract": "The results of information retrieval (IR) are usually presented in the form of a ranked list of candidate documents, such as web search for humans and retrieval-augmented generation for large language models (LLMs). List-aware retrieval aims to capture the list-level contextual features to return a better list, mainly including reranking and truncation. Reranking finely re-scores the documents in the list. Truncation dynamically determines the cut-off point of the ranked list to achieve the trade-off between overall relevance and avoiding misinformation from irrelevant documents. Previous studies treat them as two separate tasks and model them separately. However, the separation is not optimal. First, it is hard to share the contextual information of the ranking list between the two tasks. Second, the separate pipeline usually meets the error accumulation problem, where the small error from the reranking stage can largely affect the truncation stage. To solve these problems, we propose",
    "link": "https://arxiv.org/abs/2402.02764",
    "context": "Title: List-aware Reranking-Truncation Joint Model for Search and Retrieval-augmented Generation\nAbstract: The results of information retrieval (IR) are usually presented in the form of a ranked list of candidate documents, such as web search for humans and retrieval-augmented generation for large language models (LLMs). List-aware retrieval aims to capture the list-level contextual features to return a better list, mainly including reranking and truncation. Reranking finely re-scores the documents in the list. Truncation dynamically determines the cut-off point of the ranked list to achieve the trade-off between overall relevance and avoiding misinformation from irrelevant documents. Previous studies treat them as two separate tasks and model them separately. However, the separation is not optimal. First, it is hard to share the contextual information of the ranking list between the two tasks. Second, the separate pipeline usually meets the error accumulation problem, where the small error from the reranking stage can largely affect the truncation stage. To solve these problems, we propose",
    "path": "papers/24/02/2402.02764.json",
    "total_tokens": 957,
    "translated_title": "基于列表感知的重新排序-截断联合模型用于搜索和生成增强检索",
    "translated_abstract": "信息检索的结果通常以排名列表的形式呈现，例如面向人类的网络搜索和面向大型语言模型的检索增强生成。列表感知检索旨在捕捉列表级的上下文特征，返回更好的列表，主要包括重新排序和截断。重新排序对列表中的文档进行精细重新评分。截断动态确定排名列表的截断点，以在整体相关性和避免无关文档的错误信息之间进行权衡。过去的研究将它们视为两个单独的任务并分别对其进行建模，然而，这种分离是不理想的。首先，很难在两个任务之间共享排名列表的上下文信息。其次，独立的流水线通常会遇到错误积累问题，即重新排序阶段的小错误可能会严重影响截断阶段。为了解决这些问题，我们提出了...（继续描述我们提出的方法）",
    "tldr": "该论文提出了一个基于列表感知的重新排序-截断联合模型，用于搜索和生成增强检索。该模型旨在捕捉列表级的上下文特征，通过重新排序和截断来返回更好的列表。先前的研究将重新排序和截断视为两个单独的任务，但这种分离不是最优的。因此，该论文提出的联合模型可以解决信息共享和错误积累的问题。",
    "en_tdlr": "This paper proposes a list-aware reranking-truncation joint model for search and retrieval-augmented generation. The model aims to capture list-level contextual features to return a better list through reranking and truncation. Previous studies treated reranking and truncation as separate tasks, but the proposed joint model addresses issues of information sharing and error accumulation."
}