{
    "title": "Just Cluster It: An Approach for Exploration in High-Dimensions using Clustering and Pre-Trained Representations",
    "abstract": "In this paper we adopt a representation-centric perspective on exploration in reinforcement learning, viewing exploration fundamentally as a density estimation problem. We investigate the effectiveness of clustering representations for exploration in 3-D environments, based on the observation that the importance of pixel changes between transitions is less pronounced in 3-D environments compared to 2-D environments, where pixel changes between transitions are typically distinct and significant. We propose a method that performs episodic and global clustering on random representations and on pre-trained DINO representations to count states, i.e, estimate pseudo-counts. Surprisingly, even random features can be clustered effectively to count states in 3-D environments, however when these become visually more complex, pre-trained DINO representations are more effective thanks to the pre-trained inductive biases in the representations. Overall, this presents a pathway for integrating pre-t",
    "link": "https://arxiv.org/abs/2402.03138",
    "context": "Title: Just Cluster It: An Approach for Exploration in High-Dimensions using Clustering and Pre-Trained Representations\nAbstract: In this paper we adopt a representation-centric perspective on exploration in reinforcement learning, viewing exploration fundamentally as a density estimation problem. We investigate the effectiveness of clustering representations for exploration in 3-D environments, based on the observation that the importance of pixel changes between transitions is less pronounced in 3-D environments compared to 2-D environments, where pixel changes between transitions are typically distinct and significant. We propose a method that performs episodic and global clustering on random representations and on pre-trained DINO representations to count states, i.e, estimate pseudo-counts. Surprisingly, even random features can be clustered effectively to count states in 3-D environments, however when these become visually more complex, pre-trained DINO representations are more effective thanks to the pre-trained inductive biases in the representations. Overall, this presents a pathway for integrating pre-t",
    "path": "papers/24/02/2402.03138.json",
    "total_tokens": 855,
    "translated_title": "Just Cluster It: 一种使用聚类和预训练表示进行高维空间探索的方法",
    "translated_abstract": "本文从表征为中心的角度探讨了强化学习中探索问题，将探索视为密度估计问题。我们研究了在三维环境中使用聚类来进行探索的有效性，基于一个观察：在三维环境中，与二维环境相比，状态转换中的像素变化的重要性不那么明显。我们提出了一种方法，通过对随机表示和预训练DINO表示进行周期性和全局聚类来计算状态数，即估计伪计数。令人惊讶的是，即使是随机特征也可以在三维环境中有效地进行聚类以计算状态数，然而当这些特征变得更加复杂时，预训练DINO表示由于其预训练的归纳偏差在表示中更加有效。总体而言，这为集成预训练表示提供了一条路径。",
    "tldr": "本文提出了一种基于聚类和预训练表示的方法，用于在高维空间中进行探索。通过对随机和预训练表示进行聚类，可以有效计算状态数，特别是在多维环境中预训练表示更加有效。",
    "en_tdlr": "This paper proposes an approach using clustering and pre-trained representations for exploration in high-dimensional spaces. By clustering random and pre-trained representations, state counts can be effectively estimated, with pre-trained representations being more effective in complex environments."
}