{
    "title": "Domain Generalization via Causal Adjustment for Cross-Domain Sentiment Analysis",
    "abstract": "arXiv:2402.14536v1 Announce Type: new  Abstract: Domain adaption has been widely adapted for cross-domain sentiment analysis to transfer knowledge from the source domain to the target domain. Whereas, most methods are proposed under the assumption that the target (test) domain is known, making them fail to generalize well on unknown test data that is not always available in practice. In this paper, we focus on the problem of domain generalization for cross-domain sentiment analysis. Specifically, we propose a backdoor adjustment-based causal model to disentangle the domain-specific and domain-invariant representations that play essential roles in tackling domain shift. First, we rethink the cross-domain sentiment analysis task in a causal view to model the causal-and-effect relationships among different variables. Then, to learn an invariant feature representation, we remove the effect of domain confounders (e.g., domain knowledge) using the backdoor adjustment. A series of experiments",
    "link": "https://arxiv.org/abs/2402.14536",
    "context": "Title: Domain Generalization via Causal Adjustment for Cross-Domain Sentiment Analysis\nAbstract: arXiv:2402.14536v1 Announce Type: new  Abstract: Domain adaption has been widely adapted for cross-domain sentiment analysis to transfer knowledge from the source domain to the target domain. Whereas, most methods are proposed under the assumption that the target (test) domain is known, making them fail to generalize well on unknown test data that is not always available in practice. In this paper, we focus on the problem of domain generalization for cross-domain sentiment analysis. Specifically, we propose a backdoor adjustment-based causal model to disentangle the domain-specific and domain-invariant representations that play essential roles in tackling domain shift. First, we rethink the cross-domain sentiment analysis task in a causal view to model the causal-and-effect relationships among different variables. Then, to learn an invariant feature representation, we remove the effect of domain confounders (e.g., domain knowledge) using the backdoor adjustment. A series of experiments",
    "path": "papers/24/02/2402.14536.json",
    "total_tokens": 861,
    "translated_title": "通过因果调整实现跨领域情感分析的领域泛化",
    "translated_abstract": "领域自适应已被广泛应用于跨领域情感分析，将知识从源领域转移到目标领域。然而，大多数方法是基于目标（测试）领域已知的假设提出的，导致它们在未知的测试数据上泛化效果不佳，而在实践中这种情况并不总是可用。本文关注跨领域情感分析的领域泛化问题。具体来说，我们提出了基于后门调整的因果模型，以解开在解决领域转移中起着关键作用的领域特定和领域不变表示。首先，我们从因果视角重新思考了跨领域情感分析任务，以建模不同变量之间的因果关系。然后，为了学习一个不变的特征表示，我们使用后门调整去除领域混杂因素（如领域知识）的影响。一系列实验",
    "tldr": "本文提出了基于后门调整的因果模型，用于解决领域泛化问题，通过解开领域特定和领域不变表示之间的关系来应对领域转移",
    "en_tdlr": "This paper proposes a causal model based on backdoor adjustment to address the domain generalization issue, by disentangling the relationships between domain-specific and domain-invariant representations to tackle domain shift."
}