{
    "title": "SPARQL Generation: an analysis on fine-tuning OpenLLaMA for Question Answering over a Life Science Knowledge Graph",
    "abstract": "The recent success of Large Language Models (LLM) in a wide range of Natural Language Processing applications opens the path towards novel Question Answering Systems over Knowledge Graphs leveraging LLMs. However, one of the main obstacles preventing their implementation is the scarcity of training data for the task of translating questions into corresponding SPARQL queries, particularly in the case of domain-specific KGs. To overcome this challenge, in this study, we evaluate several strategies for fine-tuning the OpenLlama LLM for question answering over life science knowledge graphs. In particular, we propose an end-to-end data augmentation approach for extending a set of existing queries over a given knowledge graph towards a larger dataset of semantically enriched question-to-SPARQL query pairs, enabling fine-tuning even for datasets where these pairs are scarce. In this context, we also investigate the role of semantic \"clues\" in the queries, such as meaningful variable names and",
    "link": "https://arxiv.org/abs/2402.04627",
    "context": "Title: SPARQL Generation: an analysis on fine-tuning OpenLLaMA for Question Answering over a Life Science Knowledge Graph\nAbstract: The recent success of Large Language Models (LLM) in a wide range of Natural Language Processing applications opens the path towards novel Question Answering Systems over Knowledge Graphs leveraging LLMs. However, one of the main obstacles preventing their implementation is the scarcity of training data for the task of translating questions into corresponding SPARQL queries, particularly in the case of domain-specific KGs. To overcome this challenge, in this study, we evaluate several strategies for fine-tuning the OpenLlama LLM for question answering over life science knowledge graphs. In particular, we propose an end-to-end data augmentation approach for extending a set of existing queries over a given knowledge graph towards a larger dataset of semantically enriched question-to-SPARQL query pairs, enabling fine-tuning even for datasets where these pairs are scarce. In this context, we also investigate the role of semantic \"clues\" in the queries, such as meaningful variable names and",
    "path": "papers/24/02/2402.04627.json",
    "total_tokens": 927,
    "translated_title": "SPARQL生成：对OpenLLaMA用于生命科学知识图谱问答的微调进行分析",
    "translated_abstract": "大型语言模型（LLM）在各种自然语言处理应用中的成功为基于LLM的知识图谱问答系统开辟了新的路径。然而，其实施的主要障碍之一是在将问题转化为相应的SPARQL查询的任务中，尤其是在特定领域的知识图谱中，训练数据的稀缺性。为了克服这一挑战，在本研究中，我们评估了针对生命科学知识图谱上的问题回答对OpenLlama LLM进行微调的几种策略。具体而言，我们提出了一种端到端的数据增强方法，用于扩展已有查询集合，从而获得一组更大的语义丰富的问题-SPARQL查询对的数据集，即使在这些对稀缺的数据集中也能进行微调。在这个背景下，我们还研究了查询中语义“线索”的作用，例如有意义的变量名和...",
    "tldr": "在本研究中，我们针对生命科学知识图谱上的问题回答对OpenLlama LLM进行了微调，并提出了一种数据增强方法，以扩展现有查询集合，从而能够进行微调，即使训练数据稀缺。我们还研究了查询中语义线索的作用。",
    "en_tdlr": "In this study, we fine-tuned OpenLlama LLM for question answering over life science knowledge graphs and proposed a data augmentation approach to extend the existing query set, enabling fine-tuning even with scarce training data. We also investigated the role of semantic clues in the queries."
}