{
    "title": "Lester: rotoscope animation through video object segmentation and tracking",
    "abstract": "arXiv:2402.09883v1 Announce Type: cross  Abstract: This article introduces Lester, a novel method to automatically synthetise retro-style 2D animations from videos. The method approaches the challenge mainly as an object segmentation and tracking problem. Video frames are processed with the Segment Anything Model (SAM) and the resulting masks are tracked through subsequent frames with DeAOT, a method of hierarchical propagation for semi-supervised video object segmentation. The geometry of the masks' contours is simplified with the Douglas-Peucker algorithm. Finally, facial traits, pixelation and a basic shadow effect can be optionally added. The results show that the method exhibits an excellent temporal consistency and can correctly process videos with different poses and appearances, dynamic shots, partial shots and diverse backgrounds. The proposed method provides a more simple and deterministic approach than diffusion models based video-to-video translation pipelines, which suffer",
    "link": "https://arxiv.org/abs/2402.09883",
    "context": "Title: Lester: rotoscope animation through video object segmentation and tracking\nAbstract: arXiv:2402.09883v1 Announce Type: cross  Abstract: This article introduces Lester, a novel method to automatically synthetise retro-style 2D animations from videos. The method approaches the challenge mainly as an object segmentation and tracking problem. Video frames are processed with the Segment Anything Model (SAM) and the resulting masks are tracked through subsequent frames with DeAOT, a method of hierarchical propagation for semi-supervised video object segmentation. The geometry of the masks' contours is simplified with the Douglas-Peucker algorithm. Finally, facial traits, pixelation and a basic shadow effect can be optionally added. The results show that the method exhibits an excellent temporal consistency and can correctly process videos with different poses and appearances, dynamic shots, partial shots and diverse backgrounds. The proposed method provides a more simple and deterministic approach than diffusion models based video-to-video translation pipelines, which suffer",
    "path": "papers/24/02/2402.09883.json",
    "total_tokens": 783,
    "translated_title": "Lester: 通过视频对象分割和跟踪实现Rotoscope动画",
    "translated_abstract": "本文介绍了Lester，一种从视频中自动合成复古风格2D动画的新方法。该方法主要将挑战看作是对象分割和跟踪问题。视频帧使用Segment Anything Model (SAM)进行处理，生成的掩模通过DeAOT进行后续帧的跟踪，DeAOT是一种用于半监督视频对象分割的层次传播方法。掩模的几何轮廓使用Douglas-Peucker算法进行简化。最后，可以选择性地添加面部特征、像素化和基本阴影效果。结果表明，该方法具有出色的时间一致性，能够正确处理具有不同姿势和外观、动态镜头、部分镜头和多样背景的视频。与基于扩散模型的视频到视频转换流水线相比，所提出的方法提供了一种更简单和确定性的方法。",
    "tldr": "Lester是一种通过视频对象分割和跟踪实现Rotoscope动画的新方法，具有出色的时间一致性和适应性。",
    "en_tdlr": "Lester is a novel method that automatically synthesizes retro-style 2D animations from videos, achieving excellent temporal consistency and versatility through video object segmentation and tracking."
}