{
    "title": "Double machine learning for causal hybrid modeling -- applications in the Earth sciences",
    "abstract": "arXiv:2402.13332v1 Announce Type: new  Abstract: Hybrid modeling integrates machine learning with scientific knowledge with the goal of enhancing interpretability, generalization, and adherence to natural laws. Nevertheless, equifinality and regularization biases pose challenges in hybrid modeling to achieve these purposes. This paper introduces a novel approach to estimating hybrid models via a causal inference framework, specifically employing Double Machine Learning (DML) to estimate causal effects. We showcase its use for the Earth sciences on two problems related to carbon dioxide fluxes. In the $Q_{10}$ model, we demonstrate that DML-based hybrid modeling is superior in estimating causal parameters over end-to-end deep neural network (DNN) approaches, proving efficiency, robustness to bias from regularization methods, and circumventing equifinality. Our approach, applied to carbon flux partitioning, exhibits flexibility in accommodating heterogeneous causal effects. The study emp",
    "link": "https://arxiv.org/abs/2402.13332",
    "context": "Title: Double machine learning for causal hybrid modeling -- applications in the Earth sciences\nAbstract: arXiv:2402.13332v1 Announce Type: new  Abstract: Hybrid modeling integrates machine learning with scientific knowledge with the goal of enhancing interpretability, generalization, and adherence to natural laws. Nevertheless, equifinality and regularization biases pose challenges in hybrid modeling to achieve these purposes. This paper introduces a novel approach to estimating hybrid models via a causal inference framework, specifically employing Double Machine Learning (DML) to estimate causal effects. We showcase its use for the Earth sciences on two problems related to carbon dioxide fluxes. In the $Q_{10}$ model, we demonstrate that DML-based hybrid modeling is superior in estimating causal parameters over end-to-end deep neural network (DNN) approaches, proving efficiency, robustness to bias from regularization methods, and circumventing equifinality. Our approach, applied to carbon flux partitioning, exhibits flexibility in accommodating heterogeneous causal effects. The study emp",
    "path": "papers/24/02/2402.13332.json",
    "total_tokens": 955,
    "translated_title": "用于因果混合建模的双机器学习——地球科学应用",
    "translated_abstract": "arXiv:2402.13332v1 公告类型: 新摘要: 混合建模将机器学习与科学知识相结合，旨在提高解释性、泛化性和遵守自然规律。然而，在混合建模中，等效性和正则化偏差对于实现这些目的构成挑战。本文介绍了一种通过因果推断框架估计混合模型的新方法，特别使用双机器学习(DML)来估计因果效应。我们展示了其在两个涉及二氧化碳通量的地球科学问题上的应用。在$Q_{10}$模型中，我们证明了基于DML的混合建模比端到端深度神经网络(DNN)方法更优，证明了效率高、鲁棒性强，并且规避了正则化方法带来的偏差和等效性。我们的方法应用于碳通量分配，展现了适应不同因果效应的灵活性。这项研究展示了因果混合建模概念在地球科学中的潜力。",
    "tldr": "本文引入了一种通过因果推断框架估计混合模型的新方法，利用双机器学习(DML)来估计因果效应，并在地球科学中展示了其在估计因果参数方面优于端到端深度神经网络(DNN)方法的效率、鲁棒性和避免等效性的能力。"
}