{
    "title": "Deep Active Learning for Data Mining from Conflict Text Corpora",
    "abstract": "High-resolution event data on armed conflict and related processes have revolutionized the study of political contention with datasets like UCDP GED, ACLED etc. However, most of these datasets limit themselves to collecting spatio-temporal (high-resolution) and intensity data. Information on dynamics, such as targets, tactics, purposes etc. are rarely collected owing to the extreme workload of collecting data. However, most datasets rely on a rich corpus of textual data allowing further mining of further information connected to each event. This paper proposes one such approach that is inexpensive and high performance, leveraging active learning - an iterative process of improving a machine learning model based on sequential (guided) human input. Active learning is employed to then step-wise train (fine-tuning) of a large, encoder-only language model adapted for extracting sub-classes of events relating to conflict dynamics. The approach shows performance similar to human (gold-standar",
    "link": "https://rss.arxiv.org/abs/2402.01577",
    "context": "Title: Deep Active Learning for Data Mining from Conflict Text Corpora\nAbstract: High-resolution event data on armed conflict and related processes have revolutionized the study of political contention with datasets like UCDP GED, ACLED etc. However, most of these datasets limit themselves to collecting spatio-temporal (high-resolution) and intensity data. Information on dynamics, such as targets, tactics, purposes etc. are rarely collected owing to the extreme workload of collecting data. However, most datasets rely on a rich corpus of textual data allowing further mining of further information connected to each event. This paper proposes one such approach that is inexpensive and high performance, leveraging active learning - an iterative process of improving a machine learning model based on sequential (guided) human input. Active learning is employed to then step-wise train (fine-tuning) of a large, encoder-only language model adapted for extracting sub-classes of events relating to conflict dynamics. The approach shows performance similar to human (gold-standar",
    "path": "papers/24/02/2402.01577.json",
    "total_tokens": 890,
    "translated_title": "来自冲突文本语料库的深度主动学习数据挖掘",
    "translated_abstract": "高分辨率的武装冲突事件数据以及相关过程已经通过UCDP GED、ACLED等数据集彻底改变了政治争论的研究。然而，大部分这些数据集仅限于收集时空（高分辨率）和强度数据。关于目标、战术、目的等动态信息很少被收集，这是因为数据收集的工作量非常大。然而，大部分数据集依赖于丰富的文本数据库，可以进一步挖掘与每个事件相关的更多信息。本文提出了一种廉价且高性能的方法，利用主动学习来改进机器学习模型，通过顺序（有导向的）人工输入的迭代过程。然后，使用主动学习逐步训练（微调）一个大型的仅编码器语言模型，以提取与冲突动态相关的子类事件。该方法表现出与人类（金标准）相似的性能。",
    "tldr": "本文提出了一种利用深度主动学习从冲突文本语料库中进行数据挖掘的方法。通过迭代的主动学习过程，结合大型的仅编码器语言模型，可以提取与冲突动态相关的子类事件，达到类似于人类的性能。",
    "en_tdlr": "This paper presents a method for data mining from conflict text corpora using deep active learning. By leveraging an iterative process of active learning and a large encoder-only language model, sub-classes of events related to conflict dynamics can be extracted with performance similar to human."
}