{
    "title": "A Comparative Analysis of Microrings Based Incoherent Photonic GEMM Accelerators",
    "abstract": "Several microring resonator (MRR) based analog photonic architectures have been proposed to accelerate general matrix-matrix multiplications (GEMMs) in deep neural networks with exceptional throughput and energy efficiency. To implement GEMM functions, these MRR-based architectures, in general, manipulate optical signals in five different ways: (i) Splitting (copying) of multiple optical signals to achieve a certain fan-out, (ii) Aggregation (multiplexing) of multiple optical signals to achieve a certain fan-in, (iii) Modulation of optical signals to imprint input values onto analog signal amplitude, (iv) Weighting of modulated optical signals to achieve analog input-weight multiplication, (v) Summation of optical signals. The MRR-based GEMM accelerators undertake the first four ways of signal manipulation in an arbitrary order ignoring the possible impact of the order of these manipulations on their performance. In this paper, we conduct a detailed analysis of accelerator organization",
    "link": "https://arxiv.org/abs/2402.03149",
    "context": "Title: A Comparative Analysis of Microrings Based Incoherent Photonic GEMM Accelerators\nAbstract: Several microring resonator (MRR) based analog photonic architectures have been proposed to accelerate general matrix-matrix multiplications (GEMMs) in deep neural networks with exceptional throughput and energy efficiency. To implement GEMM functions, these MRR-based architectures, in general, manipulate optical signals in five different ways: (i) Splitting (copying) of multiple optical signals to achieve a certain fan-out, (ii) Aggregation (multiplexing) of multiple optical signals to achieve a certain fan-in, (iii) Modulation of optical signals to imprint input values onto analog signal amplitude, (iv) Weighting of modulated optical signals to achieve analog input-weight multiplication, (v) Summation of optical signals. The MRR-based GEMM accelerators undertake the first four ways of signal manipulation in an arbitrary order ignoring the possible impact of the order of these manipulations on their performance. In this paper, we conduct a detailed analysis of accelerator organization",
    "path": "papers/24/02/2402.03149.json",
    "total_tokens": 926,
    "translated_title": "基于微环的相干光学GEMM加速器的比较分析",
    "translated_abstract": "提出了几种基于微环谐振器（MRR）的模拟光学架构，以在深度神经网络中加速通用的矩阵-矩阵乘法（GEMM），具有出色的吞吐量和能量效率。为了实现GEMM功能，这些基于MRR的架构一般通过五种不同的方式操作光信号：（i）将多个光信号分裂（复制）以达到某种多分支，（ii）将多个光信号聚合（复用）以达到某种多输入，（iii）调制光信号以将输入值印置于模拟信号幅度上，（iv）对调制的光信号进行加权，以实现模拟输入权重相乘，（v）对光信号进行求和。MRR基于的GEMM加速器以任意顺序执行前四种信号操作，忽略了这些操作顺序对其性能的可能影响。本文对加速器组织进行了详细分析。",
    "tldr": "本文详细分析了基于微环的相干光学GEMM加速器的组织，其通过分裂、聚合、调制、加权和求和等方式操作光信号以加速深度神经网络中的矩阵-矩阵乘法，提高吞吐量和能量效率。",
    "en_tdlr": "This paper presents a detailed analysis of the organization of microring-based incoherent photonic GEMM accelerators, which manipulate optical signals through splitting, aggregation, modulation, weighting, and summation to accelerate matrix-matrix multiplications in deep neural networks, improving throughput and energy efficiency."
}