{
    "title": "Cost-Efficient Subjective Task Annotation and Modeling through Few-Shot Annotator Adaptation",
    "abstract": "arXiv:2402.14101v1 Announce Type: new  Abstract: In subjective NLP tasks, where a single ground truth does not exist, the inclusion of diverse annotators becomes crucial as their unique perspectives significantly influence the annotations. In realistic scenarios, the annotation budget often becomes the main determinant of the number of perspectives (i.e., annotators) included in the data and subsequent modeling. We introduce a novel framework for annotation collection and modeling in subjective tasks that aims to minimize the annotation budget while maximizing the predictive performance for each annotator. Our framework has a two-stage design: first, we rely on a small set of annotators to build a multitask model, and second, we augment the model for a new perspective by strategically annotating a few samples per annotator. To test our framework at scale, we introduce and release a unique dataset, Moral Foundations Subjective Corpus, of 2000 Reddit posts annotated by 24 annotators for ",
    "link": "https://arxiv.org/abs/2402.14101",
    "context": "Title: Cost-Efficient Subjective Task Annotation and Modeling through Few-Shot Annotator Adaptation\nAbstract: arXiv:2402.14101v1 Announce Type: new  Abstract: In subjective NLP tasks, where a single ground truth does not exist, the inclusion of diverse annotators becomes crucial as their unique perspectives significantly influence the annotations. In realistic scenarios, the annotation budget often becomes the main determinant of the number of perspectives (i.e., annotators) included in the data and subsequent modeling. We introduce a novel framework for annotation collection and modeling in subjective tasks that aims to minimize the annotation budget while maximizing the predictive performance for each annotator. Our framework has a two-stage design: first, we rely on a small set of annotators to build a multitask model, and second, we augment the model for a new perspective by strategically annotating a few samples per annotator. To test our framework at scale, we introduce and release a unique dataset, Moral Foundations Subjective Corpus, of 2000 Reddit posts annotated by 24 annotators for ",
    "path": "papers/24/02/2402.14101.json",
    "total_tokens": 881,
    "translated_title": "通过少样本标注者调适实现高效主观任务标注与建模",
    "translated_abstract": "在主观性自然语言处理任务中，由于不存在单一的标准答案，包括不同标注者变得至关重要，因为他们独特的视角显著影响标注。在现实场景中，标注预算通常成为决定数据中包含的视角数量（即标注者）及后续建模的主要因素。我们引入了一个新颖的框架，用于在主观任务中进行标注收集和建模，旨在最大程度地减少标注预算，同时最大化每个标注者的预测性能。我们的框架采用两阶段设计：首先，我们依赖一小组标注者来构建多任务模型，然后，我们通过为每个标注者策略性地标注少量样本，来为新视角增强模型。为了在规模上测试我们的框架，我们介绍并发布了一个独特数据集《道德基础主观语料库》，包含2000个Reddit帖子，由24名标注者进行标注。",
    "tldr": "引入了一个新颖的框架，通过少样本标注者调适来实现在主观任务中进行高效标注与建模，最大程度减少标注预算，同时最大化每个标注者的预测性能。",
    "en_tdlr": "Introduced a novel framework for cost-efficient annotation collection and modeling in subjective tasks through few-shot annotator adaptation, aiming to minimize annotation budget while maximizing predictive performance for each annotator."
}