{
    "title": "Key-Graph Transformer for Image Restoration",
    "abstract": "While it is crucial to capture global information for effective image restoration (IR), integrating such cues into transformer-based methods becomes computationally expensive, especially with high input resolution. Furthermore, the self-attention mechanism in transformers is prone to considering unnecessary global cues from unrelated objects or regions, introducing computational inefficiencies. In response to these challenges, we introduce the Key-Graph Transformer (KGT) in this paper. Specifically, KGT views patch features as graph nodes. The proposed Key-Graph Constructor efficiently forms a sparse yet representative Key-Graph by selectively connecting essential nodes instead of all the nodes. Then the proposed Key-Graph Attention is conducted under the guidance of the Key-Graph only among selected nodes with linear computational complexity within each window. Extensive experiments across 6 IR tasks confirm the proposed KGT's state-of-the-art performance, showcasing advancements both",
    "link": "https://arxiv.org/abs/2402.02634",
    "context": "Title: Key-Graph Transformer for Image Restoration\nAbstract: While it is crucial to capture global information for effective image restoration (IR), integrating such cues into transformer-based methods becomes computationally expensive, especially with high input resolution. Furthermore, the self-attention mechanism in transformers is prone to considering unnecessary global cues from unrelated objects or regions, introducing computational inefficiencies. In response to these challenges, we introduce the Key-Graph Transformer (KGT) in this paper. Specifically, KGT views patch features as graph nodes. The proposed Key-Graph Constructor efficiently forms a sparse yet representative Key-Graph by selectively connecting essential nodes instead of all the nodes. Then the proposed Key-Graph Attention is conducted under the guidance of the Key-Graph only among selected nodes with linear computational complexity within each window. Extensive experiments across 6 IR tasks confirm the proposed KGT's state-of-the-art performance, showcasing advancements both",
    "path": "papers/24/02/2402.02634.json",
    "total_tokens": 817,
    "translated_title": "图像修复的关键图变换器",
    "translated_abstract": "在有效的图像修复中捕捉全局信息至关重要，但将这些提示集成到基于变换器的方法中会导致计算负担加重，尤其是在高输入分辨率下。此外，变换器中的自注意机制容易考虑与无关对象或区域的不必要全局提示，从而引入计算效率低下的问题。为了应对这些挑战，我们在本文中引入了关键图变换器（KGT）。具体而言，KGT将图像块特征视为图节点。所提出的关键图构造器通过仅选择关键节点而不是所有节点来高效地形成稀疏但具有代表性的关键图。然后，在每个窗口内，只在所选择节点之间引导关键图的指导下进行关键图注意操作，其计算复杂性线性。对6个图像修复任务的大量实验验证了所提出的KGT在性能上的领先地位，展示了双方面的进展。",
    "tldr": "我们提出了一种关键图变换器（KGT）用于高效地进行图像修复，通过选择性地连接关键节点，减少了计算负担，并且在6个图像修复任务上展示了最先进的性能。",
    "en_tdlr": "We propose Key-Graph Transformer (KGT) for efficient image restoration by selectively connecting key nodes, reducing computational burden, and showcasing state-of-the-art performance in 6 image restoration tasks."
}