{
    "title": "DIGIC: Domain Generalizable Imitation Learning by Causal Discovery",
    "abstract": "arXiv:2402.18910v1 Announce Type: cross  Abstract: Causality has been combined with machine learning to produce robust representations for domain generalization. Most existing methods of this type require massive data from multiple domains to identify causal features by cross-domain variations, which can be expensive or even infeasible and may lead to misidentification in some cases. In this work, we make a different attempt by leveraging the demonstration data distribution to discover the causal features for a domain generalizable policy. We design a novel framework, called DIGIC, to identify the causal features by finding the direct cause of the expert action from the demonstration data distribution via causal discovery. Our framework can achieve domain generalizable imitation learning with only single-domain data and serve as a complement for cross-domain variation-based methods under non-structural assumptions on the underlying causal models. Our empirical study in various control ",
    "link": "https://arxiv.org/abs/2402.18910",
    "context": "Title: DIGIC: Domain Generalizable Imitation Learning by Causal Discovery\nAbstract: arXiv:2402.18910v1 Announce Type: cross  Abstract: Causality has been combined with machine learning to produce robust representations for domain generalization. Most existing methods of this type require massive data from multiple domains to identify causal features by cross-domain variations, which can be expensive or even infeasible and may lead to misidentification in some cases. In this work, we make a different attempt by leveraging the demonstration data distribution to discover the causal features for a domain generalizable policy. We design a novel framework, called DIGIC, to identify the causal features by finding the direct cause of the expert action from the demonstration data distribution via causal discovery. Our framework can achieve domain generalizable imitation learning with only single-domain data and serve as a complement for cross-domain variation-based methods under non-structural assumptions on the underlying causal models. Our empirical study in various control ",
    "path": "papers/24/02/2402.18910.json",
    "total_tokens": 871,
    "translated_title": "DIGIC: 通过因果发现实现领域泛化的模仿学习",
    "translated_abstract": "因果性已经与机器学习相结合，产生了针对领域泛化的强大表示。大多数现有的这类方法需要来自多个领域的大量数据，通过跨领域变化来识别引起特征，这可能昂贵甚至不可行，在某些情况下可能会导致误识别。在这项工作中，我们通过利用演示数据分布来发现领域泛化策略的因果特征，提出了一种不同的尝试。我们设计了一个名为DIGIC的新领域泛化模仿学习框架，通过因果发现从演示数据分布中找出专家动作的直接原因来识别因果特征。我们的框架可以在只有单一领域数据的情况下实现领域泛化的模仿学习，并在基础因果模型的非结构化假设下作为基于跨领域变化方法的补充。",
    "tldr": "通过在只有单一领域数据的情况下发现因果特征，提出了一种新颖的领域泛化模仿学习框架DIGIC，可以作为非结构化假设下基于跨领域变化方法的补充",
    "en_tdlr": "A novel domain generalizable imitation learning framework DIGIC is proposed to identify causal features with only single-domain data and serve as a complement for cross-domain variation-based methods under non-structural assumptions on the underlying causal models."
}