{
    "title": "Legal and ethical implications of applications based on agreement technologies: the case of auction-based road intersections",
    "abstract": "Agreement Technologies refer to a novel paradigm for the construction of distributed intelligent systems, where autonomous software agents negotiate to reach agreements on behalf of their human users. Smart Cities are a key application domain for Agreement Technologies. While several proofs of concept and prototypes exist, such systems are still far from ready for being deployed in the real-world. In this paper we focus on a novel method for managing elements of smart road infrastructures of the future, namely the case of auction-based road intersections. We show that, even though the key technological elements for such methods are already available, there are multiple non-technical issues that need to be tackled before they can be applied in practice. For this purpose, we analyse legal and ethical implications of auction-based road intersections in the context of international regulations and from the standpoint of the Spanish legislation. From this exercise, we extract a set of requi",
    "link": "https://arxiv.org/abs/2402.01673",
    "context": "Title: Legal and ethical implications of applications based on agreement technologies: the case of auction-based road intersections\nAbstract: Agreement Technologies refer to a novel paradigm for the construction of distributed intelligent systems, where autonomous software agents negotiate to reach agreements on behalf of their human users. Smart Cities are a key application domain for Agreement Technologies. While several proofs of concept and prototypes exist, such systems are still far from ready for being deployed in the real-world. In this paper we focus on a novel method for managing elements of smart road infrastructures of the future, namely the case of auction-based road intersections. We show that, even though the key technological elements for such methods are already available, there are multiple non-technical issues that need to be tackled before they can be applied in practice. For this purpose, we analyse legal and ethical implications of auction-based road intersections in the context of international regulations and from the standpoint of the Spanish legislation. From this exercise, we extract a set of requi",
    "path": "papers/24/02/2402.01673.json",
    "total_tokens": 818,
    "translated_title": "基于协议技术的应用的法律和伦理问题：拍卖式道路交叉口的案例研究",
    "translated_abstract": "协议技术是构建分布式智能系统的一种新范 Paradigm，其中自主软件代理商代表他们的人类用户进行谈判以达成协议。智能城市是协议技术的关键应用领域。尽管有几个概念验证和原型存在，但这些系统距离在现实世界中投入使用还有很长的距离。本文重点研究了未来智能道路基础设施管理的一种新方法，即拍卖式道路交叉口的案例。我们发现，虽然这种方法的关键技术要素已经可用，但在实际应用之前仍需要解决多个非技术问题。为此，我们从国际法规和西班牙立法的角度分析了基于拍卖的道路交叉口的法律和伦理问题。通过这个研究，我们提出了一些要求。",
    "tldr": "本文研究了基于协议技术的应用在道路交叉口拍卖中的法律和伦理问题，并提出了相应的要求。",
    "en_tdlr": "This paper examines the legal and ethical implications of using agreement technologies in auction-based road intersections and presents the corresponding requirements."
}