{
    "title": "Exploring the Effects of Population and Employment Characteristics on Truck Flows: An Analysis of NextGen NHTS Origin-Destination Data",
    "abstract": "Truck transportation remains the dominant mode of US freight transportation because of its advantages, such as the flexibility of accessing pickup and drop-off points and faster delivery. Because of the massive freight volume transported by trucks, understanding the effects of population and employment characteristics on truck flows is critical for better transportation planning and investment decisions. The US Federal Highway Administration published a truck travel origin-destination data set as part of the Next Generation National Household Travel Survey program. This data set contains the total number of truck trips in 2020 within and between 583 predefined zones encompassing metropolitan and nonmetropolitan statistical areas within each state and Washington, DC. In this study, origin-destination-level truck trip flow data was augmented to include zone-level population and employment characteristics from the US Census Bureau. Census population and County Business Patterns data were ",
    "link": "https://arxiv.org/abs/2402.04019",
    "context": "Title: Exploring the Effects of Population and Employment Characteristics on Truck Flows: An Analysis of NextGen NHTS Origin-Destination Data\nAbstract: Truck transportation remains the dominant mode of US freight transportation because of its advantages, such as the flexibility of accessing pickup and drop-off points and faster delivery. Because of the massive freight volume transported by trucks, understanding the effects of population and employment characteristics on truck flows is critical for better transportation planning and investment decisions. The US Federal Highway Administration published a truck travel origin-destination data set as part of the Next Generation National Household Travel Survey program. This data set contains the total number of truck trips in 2020 within and between 583 predefined zones encompassing metropolitan and nonmetropolitan statistical areas within each state and Washington, DC. In this study, origin-destination-level truck trip flow data was augmented to include zone-level population and employment characteristics from the US Census Bureau. Census population and County Business Patterns data were ",
    "path": "papers/24/02/2402.04019.json",
    "total_tokens": 832,
    "translated_title": "探究人口和就业特征对卡车流量的影响：对NextGen NHTS出发地-目的地数据的分析",
    "translated_abstract": "卡车运输因其灵活性（能够方便地到达提取和卸货点）和更快的交货速度等优势，仍然是美国货物运输的主要方式。由于卡车运输承载了大量货物，了解人口和就业特征对卡车流量的影响对于更好的交通规划和投资决策至关重要。美国联邦公路管理局作为Next Generation National Household Travel Survey项目的一部分，公布了一组卡车出行起-止点数据。该数据集包含2020年在每个州和华盛顿特区内583个预定义区域之间的卡车出行总数。本研究通过将区域层面的人口和就业特征数据从美国人口普查局和县级商业模式数据加入到起-止点级别的卡车出行流量数据中。",
    "tldr": "本研究通过分析NextGen NHTS出发地-目的地数据集，探究人口和就业特征对卡车流量的影响。这些研究结果对于改善交通规划和投资决策非常关键。",
    "en_tdlr": "This study analyzes the NextGen NHTS origin-destination data to explore the effects of population and employment characteristics on truck flows. The findings are crucial for improving transportation planning and investment decisions."
}