{
    "title": "Integration of cognitive tasks into artificial general intelligence test for large models",
    "abstract": "During the evolution of large models, performance evaluation is necessarily performed on the intermediate models to assess their capabilities, and on the well-trained model to ensure safety before practical application. However, current model evaluations mainly rely on specific tasks and datasets, lacking a united framework for assessing the multidimensional intelligence of large models. In this perspective, we advocate for a comprehensive framework of artificial general intelligence (AGI) test, aimed at fulfilling the testing needs of large language models and multi-modal large models with enhanced capabilities. The AGI test framework bridges cognitive science and natural language processing to encompass the full spectrum of intelligence facets, including crystallized intelligence, a reflection of amassed knowledge and experience; fluid intelligence, characterized by problem-solving and adaptive reasoning; social intelligence, signifying comprehension and adaptation within multifacete",
    "link": "https://arxiv.org/abs/2402.02547",
    "context": "Title: Integration of cognitive tasks into artificial general intelligence test for large models\nAbstract: During the evolution of large models, performance evaluation is necessarily performed on the intermediate models to assess their capabilities, and on the well-trained model to ensure safety before practical application. However, current model evaluations mainly rely on specific tasks and datasets, lacking a united framework for assessing the multidimensional intelligence of large models. In this perspective, we advocate for a comprehensive framework of artificial general intelligence (AGI) test, aimed at fulfilling the testing needs of large language models and multi-modal large models with enhanced capabilities. The AGI test framework bridges cognitive science and natural language processing to encompass the full spectrum of intelligence facets, including crystallized intelligence, a reflection of amassed knowledge and experience; fluid intelligence, characterized by problem-solving and adaptive reasoning; social intelligence, signifying comprehension and adaptation within multifacete",
    "path": "papers/24/02/2402.02547.json",
    "total_tokens": 876,
    "translated_title": "将认知任务整合到大型模型的人工通用智能测试中",
    "translated_abstract": "在大型模型的发展过程中，必须对中间模型进行性能评估以评估其能力，并对经过充分训练的模型进行安全性评估，以确保在实际应用之前的安全性。然而，当前的模型评估主要依赖于特定任务和数据集，缺乏对大型模型的多维智能评估的统一框架。在这个视角中，我们提倡建立一个人工通用智能测试的综合框架，旨在满足大型语言模型和多模态大型模型的测试需求，以提高其能力。该人工通用智能测试框架将认知科学和自然语言处理联系起来，包括智力的各个方面，包括稳态智力，即积累的知识和经验的反映; 流态智力，特点是解决问题和适应性推理; 社交智能，表示在多方面理解和适应的能力。",
    "tldr": "建议将认知任务整合到大型模型的人工通用智能测试中，以建立一个综合框架，能够评估大型模型的多维智能。这个框架结合了认知科学和自然语言处理，包含了稳态智力、流态智力和社交智能等方面。",
    "en_tdlr": "It is proposed to integrate cognitive tasks into the artificial general intelligence test for large models to establish a comprehensive framework for evaluating the multidimensional intelligence of these models. The framework bridges cognitive science and natural language processing, covering crystallized intelligence, fluid intelligence, and social intelligence."
}