{
    "title": "Taylor Videos for Action Recognition",
    "abstract": "Effectively extracting motions from video is a critical and long-standing problem for action recognition. This problem is very challenging because motions (i) do not have an explicit form, (ii) have various concepts such as displacement, velocity, and acceleration, and (iii) often contain noise caused by unstable pixels. Addressing these challenges, we propose the Taylor video, a new video format that highlights the dominate motions (e.g., a waving hand) in each of its frames named the Taylor frame. Taylor video is named after Taylor series, which approximates a function at a given point using important terms. In the scenario of videos, we define an implicit motion-extraction function which aims to extract motions from video temporal block. In this block, using the frames, the difference frames, and higher-order difference frames, we perform Taylor expansion to approximate this function at the starting frame. We show the summation of the higher-order terms in the Taylor series gives us",
    "link": "https://arxiv.org/abs/2402.03019",
    "context": "Title: Taylor Videos for Action Recognition\nAbstract: Effectively extracting motions from video is a critical and long-standing problem for action recognition. This problem is very challenging because motions (i) do not have an explicit form, (ii) have various concepts such as displacement, velocity, and acceleration, and (iii) often contain noise caused by unstable pixels. Addressing these challenges, we propose the Taylor video, a new video format that highlights the dominate motions (e.g., a waving hand) in each of its frames named the Taylor frame. Taylor video is named after Taylor series, which approximates a function at a given point using important terms. In the scenario of videos, we define an implicit motion-extraction function which aims to extract motions from video temporal block. In this block, using the frames, the difference frames, and higher-order difference frames, we perform Taylor expansion to approximate this function at the starting frame. We show the summation of the higher-order terms in the Taylor series gives us",
    "path": "papers/24/02/2402.03019.json",
    "total_tokens": 836,
    "translated_title": "用于动作识别的Taylor视频",
    "translated_abstract": "从视频中有效地提取动作是动作识别中一个重要且长期存在的问题。这个问题非常具有挑战性，因为动作(i)没有明确的形式，(ii)拥有诸如位移、速度和加速度等各种概念，(iii)通常会受到不稳定像素引起的噪声的干扰。为了解决这些挑战，我们提出了Taylor视频，一种新的视频格式，它突出显示了每个帧中的主要动作（例如挥手）被称为Taylor帧。Taylor视频的命名来源于Taylor级数，它使用重要的项来近似给定点上的函数。在视频的情境中，我们定义了一个隐含的动作提取函数，旨在从视频时间块中提取动作。在这个块中，我们使用帧、差分帧和高阶差分帧进行Taylor展开，以近似计算起始帧上的这个函数。我们展示了Taylor级数中高阶项的求和给我们提供了...",
    "tldr": "Taylor视频是一种新的视频格式，用于动作识别中的动作提取问题。它通过使用Taylor展开近似计算隐含的动作提取函数，从而解决了动作提取中的挑战性问题。",
    "en_tdlr": "Taylor Videos is a new video format that addresses the challenging problem of extracting motions for action recognition by approximating the implicit motion-extraction function using Taylor expansion."
}