{
    "title": "Using CPI in Loss Given Default Forecasting Models for Commercial Real Estate Portfolio",
    "abstract": "arXiv:2402.15498v1 Announce Type: new  Abstract: Forecasting the loss given default (LGD) for defaulted Commercial Real Estate (CRE) loans poses a significant challenge due to the extended resolution and workout time associated with such defaults, particularly in CCAR and CECL framework where the utilization of post-default information, including macroeconomic variables (MEVs) such as unemployment (UER) and various rates, is restricted. The current environment of persistent inflation and resultant elevated rates further compounds the uncertainty surrounding predictive LGD models. In this paper, we leverage both internal and public data sources, including observations from the COVID-19 period, to present a list of evidence indicating that the growth rates of the Consumer Price, such as Year-over-Year (YoY) growth and logarithmic growth, are good leading indicators for various CRE related rates and indices. These include the Federal Funds Effective Rate and CRE market sales price indices",
    "link": "https://arxiv.org/abs/2402.15498",
    "context": "Title: Using CPI in Loss Given Default Forecasting Models for Commercial Real Estate Portfolio\nAbstract: arXiv:2402.15498v1 Announce Type: new  Abstract: Forecasting the loss given default (LGD) for defaulted Commercial Real Estate (CRE) loans poses a significant challenge due to the extended resolution and workout time associated with such defaults, particularly in CCAR and CECL framework where the utilization of post-default information, including macroeconomic variables (MEVs) such as unemployment (UER) and various rates, is restricted. The current environment of persistent inflation and resultant elevated rates further compounds the uncertainty surrounding predictive LGD models. In this paper, we leverage both internal and public data sources, including observations from the COVID-19 period, to present a list of evidence indicating that the growth rates of the Consumer Price, such as Year-over-Year (YoY) growth and logarithmic growth, are good leading indicators for various CRE related rates and indices. These include the Federal Funds Effective Rate and CRE market sales price indices",
    "path": "papers/24/02/2402.15498.json",
    "total_tokens": 793,
    "translated_title": "在商业房地产组合损失给定违约预测模型中使用消费者物价指数",
    "translated_abstract": "随着商业房地产（CRE）贷款违约的解决和清偿时间延长，特别是在CCAR和CECL框架中，由于受限于使用包括失业率（UER）和各种利率在内的宏观经济变量（MEVs）的后续信息，为预测违约后的loss given default（LGD）提出了重大挑战。本文利用内部和公共数据源，包括COVID-19时期的观察结果，提出了一系列证据，表明消费者价格的增长率，如年同比增长和对数增长，是各种与CRE相关的利率和指数的良好先行指标。这些指标包括联邦基金有效利率和CRE市场销售价格指数。",
    "tldr": "本文利用消费者价格指数的增长率作为商业房地产相关利率和指数的先导指标，为商业房地产组合损失给定违约预测模型提供了新的方法。",
    "en_tdlr": "This paper introduces a new approach by using the growth rates of the Consumer Price Index as leading indicators for commercial real estate-related rates and indices in loss given default forecasting models."
}