{
    "title": "Graph Pruning for Enumeration of Minimal Unsatisfiable Subsets",
    "abstract": "arXiv:2402.15524v1 Announce Type: new  Abstract: Finding Minimal Unsatisfiable Subsets (MUSes) of binary constraints is a common problem in infeasibility analysis of over-constrained systems. However, because of the exponential search space of the problem, enumerating MUSes is extremely time-consuming in real applications. In this work, we propose to prune formulas using a learned model to speed up MUS enumeration. We represent formulas as graphs and then develop a graph-based learning model to predict which part of the formula should be pruned. Importantly, our algorithm does not require data labeling by only checking the satisfiability of pruned formulas. It does not even require training data from the target application because it extrapolates to data with different distributions. In our experiments we combine our algorithm with existing MUS enumerators and validate its effectiveness in multiple benchmarks including a set of real-world problems outside our training distribution. The",
    "link": "https://arxiv.org/abs/2402.15524",
    "context": "Title: Graph Pruning for Enumeration of Minimal Unsatisfiable Subsets\nAbstract: arXiv:2402.15524v1 Announce Type: new  Abstract: Finding Minimal Unsatisfiable Subsets (MUSes) of binary constraints is a common problem in infeasibility analysis of over-constrained systems. However, because of the exponential search space of the problem, enumerating MUSes is extremely time-consuming in real applications. In this work, we propose to prune formulas using a learned model to speed up MUS enumeration. We represent formulas as graphs and then develop a graph-based learning model to predict which part of the formula should be pruned. Importantly, our algorithm does not require data labeling by only checking the satisfiability of pruned formulas. It does not even require training data from the target application because it extrapolates to data with different distributions. In our experiments we combine our algorithm with existing MUS enumerators and validate its effectiveness in multiple benchmarks including a set of real-world problems outside our training distribution. The",
    "path": "papers/24/02/2402.15524.json",
    "total_tokens": 884,
    "translated_title": "图剪枝用于枚举最小不可满足子集",
    "translated_abstract": "寻找二进制约束的最小不可满足子集（MUSes）是超约束系统不可行性分析中的常见问题。然而，由于问题的指数搜索空间，枚举MUSes在实际应用中非常耗时。本文提出使用学习模型对公式进行修剪以加速MUS枚举。我们将公式表示为图，然后开发基于图的学习模型来预测应该修剪公式的哪一部分。重要的是，我们的算法不需要通过仅检查修剪后的公式的可满足性来进行数据标记。它甚至不需要来自目标应用的训练数据，因为它对具有不同分布的数据进行外推。在我们的实验中，我们将我们的算法与现有的MUS枚举器结合，并验证其在包括一组超出我们训练分布范围的实际问题在内的多个基准测试中的有效性。",
    "tldr": "提出了一种图剪枝算法，通过基于图的学习模型预测修剪公式的部分，加速枚举最小不可满足子集，无需数据标记，也无需来自目标应用的训练数据，实验结果表明在各种基准测试中的有效性。",
    "en_tdlr": "Proposed a graph pruning algorithm that accelerates the enumeration of Minimal Unsatisfiable Subsets by predicting parts of formulas to prune using a graph-based learning model, without the need for data labeling or training data from the target application, with experimental validation across various benchmarks."
}