{
    "title": "Healthcare Copilot: Eliciting the Power of General LLMs for Medical Consultation",
    "abstract": "arXiv:2402.13408v1 Announce Type: new  Abstract: The copilot framework, which aims to enhance and tailor large language models (LLMs) for specific complex tasks without requiring fine-tuning, is gaining increasing attention from the community. In this paper, we introduce the construction of a Healthcare Copilot designed for medical consultation. The proposed Healthcare Copilot comprises three main components: 1) the Dialogue component, responsible for effective and safe patient interactions; 2) the Memory component, storing both current conversation data and historical patient information; and 3) the Processing component, summarizing the entire dialogue and generating reports. To evaluate the proposed Healthcare Copilot, we implement an auto-evaluation scheme using ChatGPT for two roles: as a virtual patient engaging in dialogue with the copilot, and as an evaluator to assess the quality of the dialogue. Extensive results demonstrate that the proposed Healthcare Copilot significantly e",
    "link": "https://arxiv.org/abs/2402.13408",
    "context": "Title: Healthcare Copilot: Eliciting the Power of General LLMs for Medical Consultation\nAbstract: arXiv:2402.13408v1 Announce Type: new  Abstract: The copilot framework, which aims to enhance and tailor large language models (LLMs) for specific complex tasks without requiring fine-tuning, is gaining increasing attention from the community. In this paper, we introduce the construction of a Healthcare Copilot designed for medical consultation. The proposed Healthcare Copilot comprises three main components: 1) the Dialogue component, responsible for effective and safe patient interactions; 2) the Memory component, storing both current conversation data and historical patient information; and 3) the Processing component, summarizing the entire dialogue and generating reports. To evaluate the proposed Healthcare Copilot, we implement an auto-evaluation scheme using ChatGPT for two roles: as a virtual patient engaging in dialogue with the copilot, and as an evaluator to assess the quality of the dialogue. Extensive results demonstrate that the proposed Healthcare Copilot significantly e",
    "path": "papers/24/02/2402.13408.json",
    "total_tokens": 946,
    "translated_title": "Healthcare Copilot: 启动通用LLM的力量进行医疗咨询",
    "translated_abstract": "arXiv:2402.13408v1 公告类型: 新的 摘要: 旨在增强和定制大型语言模型（LLMs）以针对特定复杂任务而无需精细调整的副驾驶框架正受到社区越来越多的关注。在本文中，我们介绍了为医疗咨询而设计的Healthcare Copilot的构建。所提出的Healthcare Copilot由三个主要组件组成: 1) 对话组件，负责与患者进行有效且安全的交互; 2) 存储当前对话数据和历史患者信息的记忆组件; 3) 处理组件，总结整个对话并生成报告。为了评估提出的Healthcare Copilot，我们使用ChatGPT实施了一个自动评估方案，担任两个角色: 与副驾驶进行对话的虚拟患者，以及评估者，以评估对话质量。广泛的结果表明，所提出的Healthcare Copilot显着地...",
    "tldr": "该论文介绍了一种旨在增强和定制大型语言模型（LLMs）以进行医疗咨询的Healthcare Copilot框架，其包括对话组件、记忆组件和处理组件。通过实施自动评估方案，结果表明该Healthcare Copilot能够显著改善医疗咨询质量。",
    "en_tdlr": "This paper introduces a Healthcare Copilot framework designed to enhance and tailor large language models (LLMs) for medical consultation, consisting of dialogue, memory, and processing components. Through an auto-evaluation scheme, results demonstrate that this Healthcare Copilot significantly improves the quality of medical consultations."
}