{
    "title": "Approximating Families of Sharp Solutions to Fisher's Equation with Physics-Informed Neural Networks",
    "abstract": "This paper employs physics-informed neural networks (PINNs) to solve Fisher's equation, a fundamental representation of a reaction-diffusion system with both simplicity and significance. The focus lies specifically in investigating Fisher's equation under conditions of large reaction rate coefficients, wherein solutions manifest as traveling waves, posing a challenge for numerical methods due to the occurring steepness of the wave front. To address optimization challenges associated with the standard PINN approach, a residual weighting scheme is introduced. This scheme is designed to enhance the tracking of propagating wave fronts by considering the reaction term in the reaction-diffusion equation. Furthermore, a specific network architecture is studied which is tailored for solutions in the form of traveling waves. Lastly, the capacity of PINNs to approximate an entire family of solutions is assessed by incorporating the reaction rate coefficient as an additional input to the network ",
    "link": "https://arxiv.org/abs/2402.08313",
    "context": "Title: Approximating Families of Sharp Solutions to Fisher's Equation with Physics-Informed Neural Networks\nAbstract: This paper employs physics-informed neural networks (PINNs) to solve Fisher's equation, a fundamental representation of a reaction-diffusion system with both simplicity and significance. The focus lies specifically in investigating Fisher's equation under conditions of large reaction rate coefficients, wherein solutions manifest as traveling waves, posing a challenge for numerical methods due to the occurring steepness of the wave front. To address optimization challenges associated with the standard PINN approach, a residual weighting scheme is introduced. This scheme is designed to enhance the tracking of propagating wave fronts by considering the reaction term in the reaction-diffusion equation. Furthermore, a specific network architecture is studied which is tailored for solutions in the form of traveling waves. Lastly, the capacity of PINNs to approximate an entire family of solutions is assessed by incorporating the reaction rate coefficient as an additional input to the network ",
    "path": "papers/24/02/2402.08313.json",
    "total_tokens": 869,
    "translated_title": "使用物理信息神经网络近似Fisher方程的解的族群",
    "translated_abstract": "本文利用物理信息神经网络（PINNs）求解Fisher方程，这是一个具有简单性和重要性的反应扩散系统的基本表示。重点是研究在大反应速率系数条件下的Fisher方程，其中解呈现为行波，由于波前的陡峭性，对数值方法提出了挑战。为了解决标准PINN方法所面临的优化挑战，引入了一种残差加权方案。该方案旨在通过考虑反应扩散方程中的反应项来增强行波前的跟踪能力。此外，还研究了一种特定的网络架构，专门针对行波形式的解。最后，通过将反应速率系数作为网络的额外输入，评估了PINN近似整个解族群的能力。",
    "tldr": "本文利用物理信息神经网络（PINNs）近似求解Fisher方程，针对大反应速率系数条件下的行波解，引入了残差加权方案来提高解的精度，并通过特定的网络架构和反应速率系数作为额外输入，评估了PINN近似整个解族群的能力。",
    "en_tdlr": "This paper utilizes physics-informed neural networks (PINNs) to approximate solutions to Fisher's equation. It introduces a residual weighting scheme to improve the accuracy of the solutions for large reaction rate coefficients, focuses on traveling wave solutions, and evaluates the capacity of PINNs to approximate an entire family of solutions by incorporating the reaction rate coefficient as an additional input."
}