{
    "title": "Assessing Patient Eligibility for Inspire Therapy through Machine Learning and Deep Learning Models",
    "abstract": "Inspire therapy is an FDA-approved internal neurostimulation treatment for obstructive sleep apnea. However, not all patients respond to this therapy, posing a challenge even for experienced otolaryngologists to determine candidacy. This paper makes the first attempt to leverage both machine learning and deep learning techniques in discerning patient responsiveness to Inspire therapy using medical data and videos captured through Drug-Induced Sleep Endoscopy (DISE), an essential procedure for Inspire therapy. To achieve this, we gathered and annotated three datasets from 127 patients. Two of these datasets comprise endoscopic videos focused on the Base of the Tongue and Velopharynx. The third dataset composes the patient's clinical information. By utilizing these datasets, we benchmarked and compared the performance of six deep learning models and five classical machine learning algorithms. The results demonstrate the potential of employing machine learning and deep learning techniques",
    "link": "https://rss.arxiv.org/abs/2402.01067",
    "context": "Title: Assessing Patient Eligibility for Inspire Therapy through Machine Learning and Deep Learning Models\nAbstract: Inspire therapy is an FDA-approved internal neurostimulation treatment for obstructive sleep apnea. However, not all patients respond to this therapy, posing a challenge even for experienced otolaryngologists to determine candidacy. This paper makes the first attempt to leverage both machine learning and deep learning techniques in discerning patient responsiveness to Inspire therapy using medical data and videos captured through Drug-Induced Sleep Endoscopy (DISE), an essential procedure for Inspire therapy. To achieve this, we gathered and annotated three datasets from 127 patients. Two of these datasets comprise endoscopic videos focused on the Base of the Tongue and Velopharynx. The third dataset composes the patient's clinical information. By utilizing these datasets, we benchmarked and compared the performance of six deep learning models and five classical machine learning algorithms. The results demonstrate the potential of employing machine learning and deep learning techniques",
    "path": "papers/24/02/2402.01067.json",
    "total_tokens": 965,
    "translated_title": "通过机器学习和深度学习模型评估Inspire治疗的患者适应性",
    "translated_abstract": "Inspire治疗是一种获得FDA批准的内部神经刺激治疗阻塞性睡眠呼吸暂停症的方法。然而，并不是所有患者都对这种疗法产生反应，这对于经验丰富的耳鼻喉科医生来说都是一个挑战，他们很难确定适宜治疗的候选者。本文首次尝试利用机器学习和深度学习技术，通过使用医学数据和通过药物诱导睡眠内窥镜检查（DISE）捕捉到的视频来判断患者对Inspire治疗的反应性。为了实现这一目标，我们收集并注释了来自127名患者的三个数据集。其中两个数据集包括关注于舌根和鼻咽的内窥镜视频。第三个数据集包括患者的临床信息。通过利用这些数据集，我们评估和比较了六个深度学习模型和五个经典机器学习算法的性能。结果显示了利用机器学习和深度学习技术的潜力。",
    "tldr": "本文利用机器学习和深度学习技术评估Inspire治疗的患者适应性，通过分析医学数据和DISE视频，比较了不同模型的性能，展示了机器学习和深度学习技术的潜力。"
}