{
    "title": "An Ontology-Based multi-domain model in Social Network Analysis: Experimental validation and case study",
    "abstract": "The use of social network theory and methods of analysis have been applied to different domains in recent years, including public health. The complete procedure for carrying out a social network analysis (SNA) is a time-consuming task that entails a series of steps in which the expert in social network analysis could make mistakes. This research presents a multi-domain knowledge model capable of automatically gathering data and carrying out different social network analyses in different domains, without errors and obtaining the same conclusions that an expert in SNA would obtain. The model is represented in an ontology called OntoSNAQA, which is made up of classes, properties and rules representing the domains of People, Questionnaires and Social Network Analysis. Besides the ontology itself, different rules are represented by SWRL and SPARQL queries. A Knowledge Based System was created using OntoSNAQA and applied to a real case study in order to show the advantages of the approach. F",
    "link": "https://arxiv.org/abs/2402.02181",
    "context": "Title: An Ontology-Based multi-domain model in Social Network Analysis: Experimental validation and case study\nAbstract: The use of social network theory and methods of analysis have been applied to different domains in recent years, including public health. The complete procedure for carrying out a social network analysis (SNA) is a time-consuming task that entails a series of steps in which the expert in social network analysis could make mistakes. This research presents a multi-domain knowledge model capable of automatically gathering data and carrying out different social network analyses in different domains, without errors and obtaining the same conclusions that an expert in SNA would obtain. The model is represented in an ontology called OntoSNAQA, which is made up of classes, properties and rules representing the domains of People, Questionnaires and Social Network Analysis. Besides the ontology itself, different rules are represented by SWRL and SPARQL queries. A Knowledge Based System was created using OntoSNAQA and applied to a real case study in order to show the advantages of the approach. F",
    "path": "papers/24/02/2402.02181.json",
    "total_tokens": 832,
    "translated_title": "基于本体的多领域社交网络分析模型：实验验证和案例研究",
    "translated_abstract": "近年来，社交网络理论和分析方法已被应用于不同的领域，包括公共卫生。进行社交网络分析(SNA)的完整流程是一项耗时任务，其中专家可能会犯错误。本研究提出了一个多领域知识模型，能够自动收集数据并在不同领域进行不同的社交网络分析，避免错误，并获得与SNA专家相同的结论。该模型以一个名为OntoSNAQA的本体表示，该本体由表示People、Questionnaires和Social Network Analysis领域的类、属性和规则组成。除了本体本身，还通过SWRL和SPARQL查询来表示不同的规则。利用OntoSNAQA创建了一个基于知识的系统，并应用于一个真实案例研究以展示该方法的优势。",
    "tldr": "本研究提出了一个基于本体的多领域知识模型，能够自动进行社交网络分析，避免错误，并获得与专家相同的结论。通过一个真实案例研究，展示了该方法的优势。",
    "en_tdlr": "This research presents a ontology-based multi-domain knowledge model that can automatically carry out social network analysis without errors and obtain the same conclusions as an expert in the field. The advantages of this approach are demonstrated through a real case study."
}