{
    "title": "Breaking Data Silos: Cross-Domain Learning for Multi-Agent Perception from Independent Private Sources",
    "abstract": "The diverse agents in multi-agent perception systems may be from different companies. Each company might use the identical classic neural network architecture based encoder for feature extraction. However, the data source to train the various agents is independent and private in each company, leading to the Distribution Gap of different private data for training distinct agents in multi-agent perception system. The data silos by the above Distribution Gap could result in a significant performance decline in multi-agent perception. In this paper, we thoroughly examine the impact of the distribution gap on existing multi-agent perception systems. To break the data silos, we introduce the Feature Distribution-aware Aggregation (FDA) framework for cross-domain learning to mitigate the above Distribution Gap in multi-agent perception. FDA comprises two key components: Learnable Feature Compensation Module and Distribution-aware Statistical Consistency Module, both aimed at enhancing interme",
    "link": "https://arxiv.org/abs/2402.04273",
    "context": "Title: Breaking Data Silos: Cross-Domain Learning for Multi-Agent Perception from Independent Private Sources\nAbstract: The diverse agents in multi-agent perception systems may be from different companies. Each company might use the identical classic neural network architecture based encoder for feature extraction. However, the data source to train the various agents is independent and private in each company, leading to the Distribution Gap of different private data for training distinct agents in multi-agent perception system. The data silos by the above Distribution Gap could result in a significant performance decline in multi-agent perception. In this paper, we thoroughly examine the impact of the distribution gap on existing multi-agent perception systems. To break the data silos, we introduce the Feature Distribution-aware Aggregation (FDA) framework for cross-domain learning to mitigate the above Distribution Gap in multi-agent perception. FDA comprises two key components: Learnable Feature Compensation Module and Distribution-aware Statistical Consistency Module, both aimed at enhancing interme",
    "path": "papers/24/02/2402.04273.json",
    "total_tokens": 938,
    "translated_title": "打破数据孤岛：跨领域学习实现独立私有源的多智能体感知",
    "translated_abstract": "多智能体感知系统中的不同智能体可能来自不同公司。每个公司可能都使用相同的经典神经网络结构的编码器进行特征提取。然而，训练各个智能体的数据源在每个公司中是相互独立和私有的，导致多智能体感知系统中训练不同智能体的不同私有数据的分布差异。上述分布差异造成的数据孤岛可能导致多智能体感知性能明显下降。本文深入研究了分布差异对现有多智能体感知系统的影响。为了打破数据孤岛，我们引入了面向跨领域学习的特征分布感知聚合（FDA）框架，以减轻多智能体感知中的分布差异。FDA包括两个关键组成部分：可学习特征补偿模块和分布感知统计一致性模块，旨在加强中间特征交流和数据分布一致性。",
    "tldr": "本文提出了一种名为FDA的框架，通过跨领域学习来打破多智能体感知中的数据孤岛问题。该框架包括可学习特征补偿模块和分布感知统计一致性模块，用于增强中间特征交流和数据分布一致性。",
    "en_tdlr": "This paper proposes a framework called FDA to break the data silos problem in multi-agent perception by cross-domain learning. The FDA framework consists of a Learnable Feature Compensation Module and a Distribution-aware Statistical Consistency Module, aiming to enhance the exchange of intermediate features and the consistency of data distribution."
}