{
    "title": "Towards Understanding Counseling Conversations: Domain Knowledge and Large Language Models",
    "abstract": "arXiv:2402.14200v1 Announce Type: new  Abstract: Understanding the dynamics of counseling conversations is an important task, yet it is a challenging NLP problem regardless of the recent advance of Transformer-based pre-trained language models. This paper proposes a systematic approach to examine the efficacy of domain knowledge and large language models (LLMs) in better representing conversations between a crisis counselor and a help seeker. We empirically show that state-of-the-art language models such as Transformer-based models and GPT models fail to predict the conversation outcome. To provide richer context to conversations, we incorporate human-annotated domain knowledge and LLM-generated features; simple integration of domain knowledge and LLM features improves the model performance by approximately 15%. We argue that both domain knowledge and LLM-generated features can be exploited to better characterize counseling conversations when they are used as an additional context to c",
    "link": "https://arxiv.org/abs/2402.14200",
    "context": "Title: Towards Understanding Counseling Conversations: Domain Knowledge and Large Language Models\nAbstract: arXiv:2402.14200v1 Announce Type: new  Abstract: Understanding the dynamics of counseling conversations is an important task, yet it is a challenging NLP problem regardless of the recent advance of Transformer-based pre-trained language models. This paper proposes a systematic approach to examine the efficacy of domain knowledge and large language models (LLMs) in better representing conversations between a crisis counselor and a help seeker. We empirically show that state-of-the-art language models such as Transformer-based models and GPT models fail to predict the conversation outcome. To provide richer context to conversations, we incorporate human-annotated domain knowledge and LLM-generated features; simple integration of domain knowledge and LLM features improves the model performance by approximately 15%. We argue that both domain knowledge and LLM-generated features can be exploited to better characterize counseling conversations when they are used as an additional context to c",
    "path": "papers/24/02/2402.14200.json",
    "total_tokens": 854,
    "translated_title": "探索对话理解：领域知识与大型语言模型",
    "translated_abstract": "理解咨询对话的动态是一项重要任务，然而，即使最近基于Transformer的预训练语言模型取得了进展，这仍然是一个具有挑战性的NLP问题。本文提出了一种系统方法，以检验领域知识和大型语言模型（LLMs）在更好地表示危机辅导员与求助者之间对话方面的有效性。我们在实证中显示，最先进的语言模型如Transformer模型和GPT模型未能预测对话结果。为了为对话提供更丰富的上下文，我们结合人工注释的领域知识和LLM生成的特征；简单地整合领域知识和LLM特征将模型性能提升约15%。我们认为，当它们被用作额外的上下文时，领域知识和LLM生成的特征都可以被利用来更好地表征咨询对话。",
    "tldr": "本文提出了一种系统方法，结合领域知识和大型语言模型来更好地表示危机辅导员与求助者之间的对话，实验证明加入领域知识和模型特征可以提高模型性能约15%。",
    "en_tdlr": "This paper proposes a systematic approach to better represent conversations between a crisis counselor and a help seeker by combining domain knowledge and large language models, and empirically shows that incorporating domain knowledge and model features can improve model performance by approximately 15%."
}