{
    "title": "Improving Efficiency of Iso-Surface Extraction on Implicit Neural Representations Using Uncertainty Propagation",
    "abstract": "arXiv:2402.13861v1 Announce Type: cross  Abstract: Implicit Neural representations (INRs) are widely used for scientific data reduction and visualization by modeling the function that maps a spatial location to a data value. Without any prior knowledge about the spatial distribution of values, we are forced to sample densely from INRs to perform visualization tasks like iso-surface extraction which can be very computationally expensive. Recently, range analysis has shown promising results in improving the efficiency of geometric queries, such as ray casting and hierarchical mesh extraction, on INRs for 3D geometries by using arithmetic rules to bound the output range of the network within a spatial region. However, the analysis bounds are often too conservative for complex scientific data. In this paper, we present an improved technique for range analysis by revisiting the arithmetic rules and analyzing the probability distribution of the network output within a spatial region. We mode",
    "link": "https://arxiv.org/abs/2402.13861",
    "context": "Title: Improving Efficiency of Iso-Surface Extraction on Implicit Neural Representations Using Uncertainty Propagation\nAbstract: arXiv:2402.13861v1 Announce Type: cross  Abstract: Implicit Neural representations (INRs) are widely used for scientific data reduction and visualization by modeling the function that maps a spatial location to a data value. Without any prior knowledge about the spatial distribution of values, we are forced to sample densely from INRs to perform visualization tasks like iso-surface extraction which can be very computationally expensive. Recently, range analysis has shown promising results in improving the efficiency of geometric queries, such as ray casting and hierarchical mesh extraction, on INRs for 3D geometries by using arithmetic rules to bound the output range of the network within a spatial region. However, the analysis bounds are often too conservative for complex scientific data. In this paper, we present an improved technique for range analysis by revisiting the arithmetic rules and analyzing the probability distribution of the network output within a spatial region. We mode",
    "path": "papers/24/02/2402.13861.json",
    "total_tokens": 832,
    "translated_title": "利用不确定性传播改进隐式神经表示的等值面提取效率",
    "translated_abstract": "隐式神经表示（INRs）广泛用于科学数据降维和可视化，通过建模将空间位置映射到数据值的函数。在没有关于值的空间分布的任何先验知识的情况下，我们被迫从INRs中密集采样来执行诸如等值面提取之类的可视化任务，这可能非常耗费计算资源。最近的范围分析已经显示，通过使用算术规则将网络输出范围限制在空间区域内，可以明显提高在INRs上进行几何查询（如射线投射和层次网格提取）的效率，用于3D几何图形。然而，对于复杂的科学数据，分析边界往往过于保守。本文通过重新审视算术规则并分析网络输出在空间区域内的概率分布，提出了对范围分析的改进技术。",
    "tldr": "通过重新审视算术规则并分析网络输出的概率分布，本文提出了一种改进的范围分析技术，以提高隐式神经表示中等值面提取的效率。",
    "en_tdlr": "This paper proposes an improved technique for range analysis by revisiting arithmetic rules and analyzing the probability distribution of the network output to enhance the efficiency of iso-surface extraction on Implicit Neural Representations."
}