{
    "title": "NanoNER: Named Entity Recognition for nanobiology using experts' knowledge and distant supervision",
    "abstract": "Here we present the training and evaluation of NanoNER, a Named Entity Recognition (NER) model for Nanobiology. NER consists in the identification of specific entities in spans of unstructured texts and is often a primary task in Natural Language Processing (NLP) and Information Extraction. The aim of our model is to recognise entities previously identified by domain experts as constituting the essential knowledge of the domain. Relying on ontologies, which provide us with a domain vocabulary and taxonomy, we implemented an iterative process enabling experts to determine the entities relevant to the domain at hand. We then delve into the potential of distant supervision learning in NER, supporting how this method can increase the quantity of annotated data with minimal additional manpower. On our full corpus of 728 full-text nanobiology articles, containing more than 120k entity occurrences, NanoNER obtained a F1-score of 0.98 on the recognition of previously known entities. Our model ",
    "link": "https://arxiv.org/abs/2402.03362",
    "context": "Title: NanoNER: Named Entity Recognition for nanobiology using experts' knowledge and distant supervision\nAbstract: Here we present the training and evaluation of NanoNER, a Named Entity Recognition (NER) model for Nanobiology. NER consists in the identification of specific entities in spans of unstructured texts and is often a primary task in Natural Language Processing (NLP) and Information Extraction. The aim of our model is to recognise entities previously identified by domain experts as constituting the essential knowledge of the domain. Relying on ontologies, which provide us with a domain vocabulary and taxonomy, we implemented an iterative process enabling experts to determine the entities relevant to the domain at hand. We then delve into the potential of distant supervision learning in NER, supporting how this method can increase the quantity of annotated data with minimal additional manpower. On our full corpus of 728 full-text nanobiology articles, containing more than 120k entity occurrences, NanoNER obtained a F1-score of 0.98 on the recognition of previously known entities. Our model ",
    "path": "papers/24/02/2402.03362.json",
    "total_tokens": 850,
    "translated_title": "NanoNER: 使用领域专家知识和远程监督进行纳米生物学的命名实体识别",
    "translated_abstract": "本文介绍了NanoNER的训练和评估，它是一种用于纳米生物学的命名实体识别（NER）模型。NER是在非结构化文本中识别特定实体的任务，在自然语言处理（NLP）和信息提取中经常是一个主要任务。我们的模型的目的是识别领域专家之前确定为该领域基本知识的实体。我们依靠本体论来提供领域词汇和分类，实现了一个迭代过程，使专家能够确定与当前领域相关的实体。然后我们深入探讨了远程监督学习在NER中的潜力，支持这种方法如何可以通过最少的人力增加注释数据的数量。在包含超过120k实体出现次数的728篇全文纳米生物学文章的完整语料库上，NanoNER在先前已知实体的识别上获得了0.98的F1分数。",
    "tldr": "本文介绍了NanoNER，它是一种用于纳米生物学的命名实体识别模型。通过使用领域专家的知识和远程监督学习，NanoNER能够准确地识别先前已知实体，并最大程度地提高注释数据的质量和数量。"
}