{
    "title": "Optimal and Near-Optimal Adaptive Vector Quantization",
    "abstract": "Quantization is a fundamental optimization for many machine-learning use cases, including compressing gradients, model weights and activations, and datasets. The most accurate form of quantization is \\emph{adaptive}, where the error is minimized with respect to a given input, rather than optimizing for the worst case. However, optimal adaptive quantization methods are considered infeasible in terms of both their runtime and memory requirements.   We revisit the Adaptive Vector Quantization (AVQ) problem and present algorithms that find optimal solutions with asymptotically improved time and space complexity. We also present an even faster near-optimal algorithm for large inputs. Our experiments show our algorithms may open the door to using AVQ more extensively in a variety of machine learning applications.",
    "link": "https://arxiv.org/abs/2402.03158",
    "context": "Title: Optimal and Near-Optimal Adaptive Vector Quantization\nAbstract: Quantization is a fundamental optimization for many machine-learning use cases, including compressing gradients, model weights and activations, and datasets. The most accurate form of quantization is \\emph{adaptive}, where the error is minimized with respect to a given input, rather than optimizing for the worst case. However, optimal adaptive quantization methods are considered infeasible in terms of both their runtime and memory requirements.   We revisit the Adaptive Vector Quantization (AVQ) problem and present algorithms that find optimal solutions with asymptotically improved time and space complexity. We also present an even faster near-optimal algorithm for large inputs. Our experiments show our algorithms may open the door to using AVQ more extensively in a variety of machine learning applications.",
    "path": "papers/24/02/2402.03158.json",
    "total_tokens": 755,
    "translated_title": "最优和近似最优的自适应向量量化",
    "translated_abstract": "量化是许多机器学习用例中的基本优化，包括压缩梯度、模型权重和激活以及数据集。最准确的量化形式是“自适应”，其中通过最小化相对于给定输入的误差来优化，而不是针对最坏情况进行优化。然而，最优的自适应量化方法在运行时间和内存需求方面被认为是不可行的。我们重新审视了自适应向量量化（AVQ）问题，并提出了一种能够在渐近改进的时间和空间复杂度下找到最优解的算法。我们还提出了一种更快速的近似最优算法，以处理大输入。我们的实验表明，我们的算法可能会在各种机器学习应用中更广泛地使用AVQ。",
    "tldr": "该论文提出了最优和近似最优的自适应向量量化算法，能够优化量化过程，在时间和空间复杂度上具有改进，可扩展应用于各种机器学习任务。"
}