{
    "title": "On the Interplay of Artificial Intelligence and Space-Air-Ground Integrated Networks: A Survey",
    "abstract": "Space-Air-Ground Integrated Networks (SAGINs), which incorporate space and aerial networks with terrestrial wireless systems, are vital enablers of the emerging sixth-generation (6G) wireless networks. Besides bringing significant benefits to various applications and services, SAGINs are envisioned to extend high-speed broadband coverage to remote areas, such as small towns or mining sites, or areas where terrestrial infrastructure cannot reach, such as airplanes or maritime use cases. However, due to the limited power and storage resources, as well as other constraints introduced by the design of terrestrial networks, SAGINs must be intelligently configured and controlled to satisfy the envisioned requirements. Meanwhile, Artificial Intelligence (AI) is another critical enabler of 6G. Due to massive amounts of available data, AI has been leveraged to address pressing challenges of current and future wireless networks. By adding AI and facilitating the decision-making and prediction pr",
    "link": "https://rss.arxiv.org/abs/2402.00881",
    "context": "Title: On the Interplay of Artificial Intelligence and Space-Air-Ground Integrated Networks: A Survey\nAbstract: Space-Air-Ground Integrated Networks (SAGINs), which incorporate space and aerial networks with terrestrial wireless systems, are vital enablers of the emerging sixth-generation (6G) wireless networks. Besides bringing significant benefits to various applications and services, SAGINs are envisioned to extend high-speed broadband coverage to remote areas, such as small towns or mining sites, or areas where terrestrial infrastructure cannot reach, such as airplanes or maritime use cases. However, due to the limited power and storage resources, as well as other constraints introduced by the design of terrestrial networks, SAGINs must be intelligently configured and controlled to satisfy the envisioned requirements. Meanwhile, Artificial Intelligence (AI) is another critical enabler of 6G. Due to massive amounts of available data, AI has been leveraged to address pressing challenges of current and future wireless networks. By adding AI and facilitating the decision-making and prediction pr",
    "path": "papers/24/02/2402.00881.json",
    "total_tokens": 884,
    "translated_title": "关于人工智能和空中地面综合网络的相互作用：一项调查研究",
    "translated_abstract": "空中地面综合网络（SAGINs）将空间和空中网络与地面无线系统结合在一起，是新兴第六代（6G）无线网络的重要支持者。除了为各种应用和服务带来重大好处外，SAGINs还被用于将高速宽带覆盖范围延伸至偏远地区，如小镇或矿区，或者无法到达地面基础设施的地方，如飞机或航海场景。然而，由于有限的电力和存储资源以及地面网络设计引入的其他限制，SAGINs必须智能配置和控制以满足预期要求。同时，人工智能（AI）是6G的另一个重要推动因素。由于大量可用数据，AI已被用来解决当前和未来无线网络的紧迫挑战。通过添加AI并促进决策和预测的过程，",
    "tldr": "人工智能和空中地面综合网络的相互作用是新兴第六代无线网络的关键，通过智能配置和控制SAGINs来满足预期要求，并利用AI解决当前和未来无线网络的挑战。"
}