{
    "title": "Collaborative filtering, K-nearest neighbor and cosine similarity in home decor recommender systems",
    "abstract": "An architectural framework, based on collaborative filtering using K-nearest neighbor and cosine similarity, was developed and implemented to fit the requirements for the company DecorRaid. The aim of the paper is to test different evaluation techniques within the environment to research the recommender systems performance. Three perspectives were found relevant for evaluating a recommender system in the specific environment, namely dataset, system and user perspective. With these perspectives it was possible to gain a broader view of the recommender systems performance. Online A/B split testing was conducted to compare the performance of small adjustments to the RS and to test the relevance of the evaluation techniques. Key factors are solving the sparsity and cold start problem, where the suggestion is to research a hybrid RS combining Content-based and CF based techniques.",
    "link": "https://arxiv.org/abs/2402.06233",
    "context": "Title: Collaborative filtering, K-nearest neighbor and cosine similarity in home decor recommender systems\nAbstract: An architectural framework, based on collaborative filtering using K-nearest neighbor and cosine similarity, was developed and implemented to fit the requirements for the company DecorRaid. The aim of the paper is to test different evaluation techniques within the environment to research the recommender systems performance. Three perspectives were found relevant for evaluating a recommender system in the specific environment, namely dataset, system and user perspective. With these perspectives it was possible to gain a broader view of the recommender systems performance. Online A/B split testing was conducted to compare the performance of small adjustments to the RS and to test the relevance of the evaluation techniques. Key factors are solving the sparsity and cold start problem, where the suggestion is to research a hybrid RS combining Content-based and CF based techniques.",
    "path": "papers/24/02/2402.06233.json",
    "total_tokens": 803,
    "translated_title": "在家居装饰推荐系统中的协同过滤、K最近邻和余弦相似度",
    "translated_abstract": "基于协同过滤使用K最近邻和余弦相似度的体系结构框架被开发和实施，以满足DecorRaid公司的需求。本文旨在测试环境中不同的评估技术，以研究推荐系统的性能。在特定环境中，发现了三个相关的评估视角，即数据集、系统和用户视角。通过这些视角，可以更全面地了解推荐系统的性能。进行了在线A/B分割测试，比较了对推荐系统进行小调整的性能，并测试了评估技术的相关性。关键因素是解决稀疏性和冷启动问题，建议通过研究将基于内容和基于协同过滤的技术进行混合。",
    "tldr": "该论文开发并实施了基于协同过滤、K最近邻和余弦相似度的家居装饰推荐系统，通过测试不同的评估技术来研究其性能，并提出了解决稀疏性和冷启动问题的建议。"
}