{
    "title": "Replication Study: Enhancing Hydrological Modeling with Physics-Guided Machine Learning",
    "abstract": "arXiv:2402.13911v1 Announce Type: new  Abstract: Current hydrological modeling methods combine data-driven Machine Learning (ML) algorithms and traditional physics-based models to address their respective limitations incorrect parameter estimates from rigid physics-based models and the neglect of physical process constraints by ML algorithms. Despite the accuracy of ML in outcome prediction, the integration of scientific knowledge is crucial for reliable predictions. This study introduces a Physics Informed Machine Learning (PIML) model, which merges the process understanding of conceptual hydrological models with the predictive efficiency of ML algorithms. Applied to the Anandapur sub-catchment, the PIML model demonstrates superior performance in forecasting monthly streamflow and actual evapotranspiration over both standalone conceptual models and ML algorithms, ensuring physical consistency of the outputs. This study replicates the methodologies of Bhasme, P., Vagadiya, J., & Bhatia",
    "link": "https://arxiv.org/abs/2402.13911",
    "context": "Title: Replication Study: Enhancing Hydrological Modeling with Physics-Guided Machine Learning\nAbstract: arXiv:2402.13911v1 Announce Type: new  Abstract: Current hydrological modeling methods combine data-driven Machine Learning (ML) algorithms and traditional physics-based models to address their respective limitations incorrect parameter estimates from rigid physics-based models and the neglect of physical process constraints by ML algorithms. Despite the accuracy of ML in outcome prediction, the integration of scientific knowledge is crucial for reliable predictions. This study introduces a Physics Informed Machine Learning (PIML) model, which merges the process understanding of conceptual hydrological models with the predictive efficiency of ML algorithms. Applied to the Anandapur sub-catchment, the PIML model demonstrates superior performance in forecasting monthly streamflow and actual evapotranspiration over both standalone conceptual models and ML algorithms, ensuring physical consistency of the outputs. This study replicates the methodologies of Bhasme, P., Vagadiya, J., & Bhatia",
    "path": "papers/24/02/2402.13911.json",
    "total_tokens": 891,
    "translated_title": "通过物理引导的机器学习增强水文建模",
    "translated_abstract": "当前的水文建模方法将数据驱动的机器学习算法和传统的基于物理的模型相结合，以解决各自的局限性，即刚性基于物理的模型产生的参数估计不准确，以及机器学习算法忽略物理过程约束的问题。尽管机器学习在结果预测方面很准确，但融合科学知识对于可靠的预测至关重要。本研究引入了一种物理信息引导的机器学习（PIML）模型，将概念性水文模型的过程理解与机器学习算法的预测效率相结合。该PIML模型应用于Anandapur分水岭，在预测月均流量和实际蒸腾蒸发时展示出卓越的性能，优于独立的概念模型和机器学习算法，确保输出的物理一致性。本研究复制了Bhasme，P.，Vagadiya，J.和Bhatia的方法。",
    "tldr": "本研究引入了一种名为物理信息引导的机器学习（PIML）模型，将概念性水文模型的过程理解与机器学习算法的预测效率结合，在水文建模中取得了优异的性能表现。",
    "en_tdlr": "This study introduces a Physics Informed Machine Learning (PIML) model which combines process understanding of conceptual hydrological models with the predictive efficiency of ML algorithms, achieving superior performance in hydrological modeling."
}