{
    "title": "MFBind: a Multi-Fidelity Approach for Evaluating Drug Compounds in Practical Generative Modeling",
    "abstract": "arXiv:2402.10387v1 Announce Type: cross  Abstract: Current generative models for drug discovery primarily use molecular docking to evaluate the quality of generated compounds. However, such models are often not useful in practice because even compounds with high docking scores do not consistently show experimental activity. More accurate methods for activity prediction exist, such as molecular dynamics based binding free energy calculations, but they are too computationally expensive to use in a generative model. We propose a multi-fidelity approach, Multi-Fidelity Bind (MFBind), to achieve the optimal trade-off between accuracy and computational cost. MFBind integrates docking and binding free energy simulators to train a multi-fidelity deep surrogate model with active learning. Our deep surrogate model utilizes a pretraining technique and linear prediction heads to efficiently fit small amounts of high-fidelity data. We perform extensive experiments and show that MFBind (1) outperfor",
    "link": "https://arxiv.org/abs/2402.10387",
    "context": "Title: MFBind: a Multi-Fidelity Approach for Evaluating Drug Compounds in Practical Generative Modeling\nAbstract: arXiv:2402.10387v1 Announce Type: cross  Abstract: Current generative models for drug discovery primarily use molecular docking to evaluate the quality of generated compounds. However, such models are often not useful in practice because even compounds with high docking scores do not consistently show experimental activity. More accurate methods for activity prediction exist, such as molecular dynamics based binding free energy calculations, but they are too computationally expensive to use in a generative model. We propose a multi-fidelity approach, Multi-Fidelity Bind (MFBind), to achieve the optimal trade-off between accuracy and computational cost. MFBind integrates docking and binding free energy simulators to train a multi-fidelity deep surrogate model with active learning. Our deep surrogate model utilizes a pretraining technique and linear prediction heads to efficiently fit small amounts of high-fidelity data. We perform extensive experiments and show that MFBind (1) outperfor",
    "path": "papers/24/02/2402.10387.json",
    "total_tokens": 856,
    "translated_title": "MFBind：一种用于在实际生成建模中评估药物化合物的多保真度方法",
    "translated_abstract": "当前药物发现的生成模型主要使用分子对接来评估生成的化合物的质量。然而，这样的模型在实践中通常并不实用，因为即使得分数高的化合物也不一定始终具有实验活性。存在更准确的活性预测方法，如基于分子动力学的结合自由能计算，但它们在生成模型中使用起来计算成本太高。我们提出了一种多保真度方法，Multi-Fidelity Bind（MFBind），以实现准确性和计算成本之间的最佳权衡。MFBind集成了对接和结合自由能模拟器，通过主动学习训练多保真度深度代理模型。我们的深度代理模型利用了一种预训练技术和线性预测头，以高效拟合少量高保真度数据。我们进行了大量实验证明MFBind（1）表现超越benchmark模型。",
    "tldr": "MFBind提出了一种多保真度方法，通过集成对接和结合自由能模拟器，使用主动学习训练多保真度深度代理模型，实现了在准确性和计算成本之间的最佳权衡。",
    "en_tdlr": "MFBind introduces a multi-fidelity approach that integrates docking and binding free energy simulators, trains a deep surrogate model with active learning, and achieves the optimal trade-off between accuracy and computational cost."
}