{
    "title": "Feature-Action Design Patterns for Storytelling Visualizations with Time Series Data",
    "abstract": "We present a method to create storytelling visualization with time series data. Many personal decisions nowadays rely on access to dynamic data regularly, as we have seen during the COVID-19 pandemic. It is thus desirable to construct storytelling visualization for dynamic data that is selected by an individual for a specific context. Because of the need to tell data-dependent stories, predefined storyboards based on known data cannot accommodate dynamic data easily nor scale up to many different individuals and contexts. Motivated initially by the need to communicate time series data during the COVID-19 pandemic, we developed a novel computer-assisted method for meta-authoring of stories, which enables the design of storyboards that include feature-action patterns in anticipation of potential features that may appear in dynamically arrived or selected data. In addition to meta-storyboards involving COVID-19 data, we also present storyboards for telling stories about progress in a mach",
    "link": "https://arxiv.org/abs/2402.03116",
    "context": "Title: Feature-Action Design Patterns for Storytelling Visualizations with Time Series Data\nAbstract: We present a method to create storytelling visualization with time series data. Many personal decisions nowadays rely on access to dynamic data regularly, as we have seen during the COVID-19 pandemic. It is thus desirable to construct storytelling visualization for dynamic data that is selected by an individual for a specific context. Because of the need to tell data-dependent stories, predefined storyboards based on known data cannot accommodate dynamic data easily nor scale up to many different individuals and contexts. Motivated initially by the need to communicate time series data during the COVID-19 pandemic, we developed a novel computer-assisted method for meta-authoring of stories, which enables the design of storyboards that include feature-action patterns in anticipation of potential features that may appear in dynamically arrived or selected data. In addition to meta-storyboards involving COVID-19 data, we also present storyboards for telling stories about progress in a mach",
    "path": "papers/24/02/2402.03116.json",
    "total_tokens": 844,
    "translated_title": "基于时间序列数据的故事化可视化特征行为设计模式",
    "translated_abstract": "我们提出了一种使用时间序列数据创建故事化可视化的方法。现如今，许多个人决策都依赖于定期访问动态数据，正如我们在COVID-19大流行期间所见。因此，为选择某个特定情境下个人选定的动态数据构建故事化可视化是可取的。由于需要讲述依赖于数据的故事，基于已知数据的预定义故事板不能轻松地适应动态数据，也无法扩展到许多不同的个人和情境。最初受COVID-19大流行期间传达时间序列数据的需求的激发，我们开发了一种新颖的计算机辅助方法，用于元创作故事，它可以设计包括特征行为模式的故事板，以预测动态到达或选择的数据中可能出现的潜在特征。除了涉及COVID-19数据的元故事板外，我们还提供了关于进展的故事板。",
    "tldr": "该论文提出了一种基于时间序列数据创建故事化可视化的方法，通过引入特征行为模式，使得故事板能够适应动态到达或选择的数据中可能出现的潜在特征。"
}