{
    "title": "Sparse Graph Representations for Procedural Instructional Documents",
    "abstract": "Computation of document similarity is a critical task in various NLP domains that has applications in deduplication, matching, and recommendation. Traditional approaches for document similarity computation include learning representations of documents and employing a similarity or a distance function over the embeddings. However, pairwise similarities and differences are not efficiently captured by individual representations. Graph representations such as Joint Concept Interaction Graph (JCIG) represent a pair of documents as a joint undirected weighted graph. JCIGs facilitate an interpretable representation of document pairs as a graph. However, JCIGs are undirected, and don't consider the sequential flow of sentences in documents. We propose two approaches to model document similarity by representing document pairs as a directed and sparse JCIG that incorporates sequential information. We propose two algorithms inspired by Supergenome Sorting and Hamiltonian Path that replace the und",
    "link": "https://arxiv.org/abs/2402.03957",
    "context": "Title: Sparse Graph Representations for Procedural Instructional Documents\nAbstract: Computation of document similarity is a critical task in various NLP domains that has applications in deduplication, matching, and recommendation. Traditional approaches for document similarity computation include learning representations of documents and employing a similarity or a distance function over the embeddings. However, pairwise similarities and differences are not efficiently captured by individual representations. Graph representations such as Joint Concept Interaction Graph (JCIG) represent a pair of documents as a joint undirected weighted graph. JCIGs facilitate an interpretable representation of document pairs as a graph. However, JCIGs are undirected, and don't consider the sequential flow of sentences in documents. We propose two approaches to model document similarity by representing document pairs as a directed and sparse JCIG that incorporates sequential information. We propose two algorithms inspired by Supergenome Sorting and Hamiltonian Path that replace the und",
    "path": "papers/24/02/2402.03957.json",
    "total_tokens": 852,
    "translated_title": "用于过程指令文档的稀疏图表示",
    "translated_abstract": "文档相似性计算是各种自然语言处理领域的重要任务，其在去重、匹配和推荐等方面有应用。传统的文档相似性计算方法包括学习文档表示和使用相似度或距离函数进行嵌入。然而，单独的表示无法有效捕捉成对相似性和差异性。图表示（如联合概念交互图，JCIG）将一对文档表示为一个联合的无向加权图，有助于将文档对作为图形的可解释表示。然而，JCIG是无向的，不考虑文档中句子的顺序。我们提出了两种方法来建模文档相似性，通过将文档对表示为一个有向和稀疏的JCIG，以包含顺序信息。我们提出了两种算法，灵感来自超基因组排序和哈密顿路径，这两种算法取代了无向JCIG的构建过程，以更好地捕捉到文档之间的顺序流。",
    "tldr": "本论文提出了两种方法，通过将文档对表示为有向和稀疏的JCIG以包含顺序信息，来建模文档相似性。这些方法可以更好地捕捉到文档之间的顺序流。",
    "en_tdlr": "This paper proposes two approaches to model document similarity by representing document pairs as directed and sparse Joint Concept Interaction Graphs (JCIG) that incorporate sequential information. These methods can better capture the sequential flow between documents."
}