{
    "title": "Social Physics Informed Diffusion Model for Crowd Simulation",
    "abstract": "Crowd simulation holds crucial applications in various domains, such as urban planning, architectural design, and traffic arrangement. In recent years, physics-informed machine learning methods have achieved state-of-the-art performance in crowd simulation but fail to model the heterogeneity and multi-modality of human movement comprehensively. In this paper, we propose a social physics-informed diffusion model named SPDiff to mitigate the above gap. SPDiff takes both the interactive and historical information of crowds in the current timeframe to reverse the diffusion process, thereby generating the distribution of pedestrian movement in the subsequent timeframe. Inspired by the well-known social physics model, i.e., Social Force, regarding crowd dynamics, we design a crowd interaction module to guide the denoising process and further enhance this module with the equivariant properties of crowd interactions. To mitigate error accumulation in long-term simulations, we propose a multi-f",
    "link": "https://arxiv.org/abs/2402.06680",
    "context": "Title: Social Physics Informed Diffusion Model for Crowd Simulation\nAbstract: Crowd simulation holds crucial applications in various domains, such as urban planning, architectural design, and traffic arrangement. In recent years, physics-informed machine learning methods have achieved state-of-the-art performance in crowd simulation but fail to model the heterogeneity and multi-modality of human movement comprehensively. In this paper, we propose a social physics-informed diffusion model named SPDiff to mitigate the above gap. SPDiff takes both the interactive and historical information of crowds in the current timeframe to reverse the diffusion process, thereby generating the distribution of pedestrian movement in the subsequent timeframe. Inspired by the well-known social physics model, i.e., Social Force, regarding crowd dynamics, we design a crowd interaction module to guide the denoising process and further enhance this module with the equivariant properties of crowd interactions. To mitigate error accumulation in long-term simulations, we propose a multi-f",
    "path": "papers/24/02/2402.06680.json",
    "total_tokens": 1002,
    "translated_title": "基于社会物理的扩散模型用于人群模拟",
    "translated_abstract": "人群模拟在城市规划、建筑设计和交通安排等领域具有重要应用。近年来，基于物理启发的机器学习方法在人群模拟中取得了最先进的性能，但未能全面建模人类运动的异质性和多模态性。在本文中，我们提出了一种名为SPDiff的社会物理启发的扩散模型，以弥补上述差距。SPDiff同时考虑了当前时间段内人群的互动和历史信息，通过逆向扩散过程生成下一个时间段内行人运动的分布。受社会力模型（Social Force）中人群动力学的启发，我们设计了一个人群互动模块来指导去噪过程，并通过人群互动的等变性属性进一步增强该模块。为了减轻长期模拟中的误差累积问题，我们提出了一个多层次的扩散模型，并使用最小二乘法进行模型参数估计。",
    "tldr": "本文提出了一种叫做SPDiff的基于社会物理的扩散模型，用于人群模拟。模型综合考虑了人群的互动和历史信息，通过逆向扩散过程生成下一个时间段内行人运动的分布。此外，借鉴社会力模型，并利用人群互动的等变性属性增强了模型的性能。为了解决长期模拟中的误差累积问题，引入了多层次扩散模型和最小二乘法进行参数估计。",
    "en_tdlr": "This paper proposes a social physics-informed diffusion model called SPDiff for crowd simulation. The model takes into account both the interaction and historical information of crowds to generate the distribution of pedestrian movement in the subsequent timeframe. Inspired by the social force model, a crowd interaction module is designed to guide the denoising process and enhance the model. To address error accumulation in long-term simulations, a multi-layer diffusion model and least squares method for parameter estimation are proposed."
}