{
    "title": "Strategizing against No-Regret Learners in First-Price Auctions",
    "abstract": "We study repeated first-price auctions and general repeated Bayesian games between two players, where one player, the learner, employs a no-regret learning algorithm, and the other player, the optimizer, knowing the learner's algorithm, strategizes to maximize its own utility. For a commonly used class of no-regret learning algorithms called mean-based algorithms, we show that (i) in standard (i.e., full-information) first-price auctions, the optimizer cannot get more than the Stackelberg utility -- a standard benchmark in the literature, but (ii) in Bayesian first-price auctions, there are instances where the optimizer can achieve much higher than the Stackelberg utility.   On the other hand, Mansour et al. (2022) showed that a more sophisticated class of algorithms called no-polytope-swap-regret algorithms are sufficient to cap the optimizer's utility at the Stackelberg utility in any repeated Bayesian game (including Bayesian first-price auctions), and they pose the open question wh",
    "link": "https://arxiv.org/abs/2402.08637",
    "context": "Title: Strategizing against No-Regret Learners in First-Price Auctions\nAbstract: We study repeated first-price auctions and general repeated Bayesian games between two players, where one player, the learner, employs a no-regret learning algorithm, and the other player, the optimizer, knowing the learner's algorithm, strategizes to maximize its own utility. For a commonly used class of no-regret learning algorithms called mean-based algorithms, we show that (i) in standard (i.e., full-information) first-price auctions, the optimizer cannot get more than the Stackelberg utility -- a standard benchmark in the literature, but (ii) in Bayesian first-price auctions, there are instances where the optimizer can achieve much higher than the Stackelberg utility.   On the other hand, Mansour et al. (2022) showed that a more sophisticated class of algorithms called no-polytope-swap-regret algorithms are sufficient to cap the optimizer's utility at the Stackelberg utility in any repeated Bayesian game (including Bayesian first-price auctions), and they pose the open question wh",
    "path": "papers/24/02/2402.08637.json",
    "total_tokens": 1098,
    "translated_title": "针对无悔学习者的第一价格拍卖策略",
    "translated_abstract": "我们研究了重复的第一价格拍卖和两个玩家之间的通用重复贝叶斯博弈，其中一个玩家，即学习者，采用无悔学习算法，而另一个玩家，优化者，知道学习者的算法，并制定策略以最大化自己的效用。对于一类常用的称为基于均值的算法，我们表明（i）在标准（即完全信息）的第一价格拍卖中，优化者无法获得超过斯塔克尔贝格效用—文献中的标准基准，但是（ii）在贝叶斯第一价格拍卖中，存在一些情况，优化者可以获得远高于斯塔克尔贝格效用的效用。另一方面，Mansour等人（2022）表明，一类更复杂的算法，称为无多面体互换后悔算法，足以将优化者的效用限制在斯塔克尔贝格效用上，在任何重复的贝叶斯博弈（包括贝叶斯第一价格拍卖）中，他们提出了一个未解决的问题。",
    "tldr": "我们研究了第一价格拍卖中的无悔学习者和优化者之间的策略博弈。对于一类常用的无悔学习算法，我们发现在标准的第一价格拍卖中，优化者无法获得超过斯塔克尔贝格效用，但在贝叶斯第一价格拍卖中，他们可以获得远高于斯塔克尔贝格效用的效用。另外，我们也发现对于一类更复杂的算法，优化者的效用可以被限制在斯塔克尔贝格效用上。",
    "en_tdlr": "We study the strategic game between no-regret learners and optimizers in first-price auctions. For a commonly used class of algorithms, we find that optimizers cannot achieve utility beyond the Stackelberg benchmark in standard auctions, but can achieve higher utility in Bayesian auctions. Additionally, we show that a more sophisticated class of algorithms can cap the optimizer's utility at the Stackelberg level."
}