{
    "title": "Disambiguated Node Classification with Graph Neural Networks",
    "abstract": "arXiv:2402.08824v1 Announce Type: new Abstract: Graph Neural Networks (GNNs) have demonstrated significant success in learning from graph-structured data across various domains. Despite their great successful, one critical challenge is often overlooked by existing works, i.e., the learning of message propagation that can generalize effectively to underrepresented graph regions. These minority regions often exhibit irregular homophily/heterophily patterns and diverse neighborhood class distributions, resulting in ambiguity. In this work, we investigate the ambiguity problem within GNNs, its impact on representation learning, and the development of richer supervision signals to fight against this problem. We conduct a fine-grained evaluation of GNN, analyzing the existence of ambiguity in different graph regions and its relation with node positions. To disambiguate node embeddings, we propose a novel method, {\\method}, which exploits additional optimization guidance to enhance representa",
    "link": "https://arxiv.org/abs/2402.08824",
    "context": "Title: Disambiguated Node Classification with Graph Neural Networks\nAbstract: arXiv:2402.08824v1 Announce Type: new Abstract: Graph Neural Networks (GNNs) have demonstrated significant success in learning from graph-structured data across various domains. Despite their great successful, one critical challenge is often overlooked by existing works, i.e., the learning of message propagation that can generalize effectively to underrepresented graph regions. These minority regions often exhibit irregular homophily/heterophily patterns and diverse neighborhood class distributions, resulting in ambiguity. In this work, we investigate the ambiguity problem within GNNs, its impact on representation learning, and the development of richer supervision signals to fight against this problem. We conduct a fine-grained evaluation of GNN, analyzing the existence of ambiguity in different graph regions and its relation with node positions. To disambiguate node embeddings, we propose a novel method, {\\method}, which exploits additional optimization guidance to enhance representa",
    "path": "papers/24/02/2402.08824.json",
    "total_tokens": 812,
    "translated_title": "带有图神经网络的消除歧义节点分类",
    "translated_abstract": "图神经网络（GNNs）在学习各种领域的图结构数据方面取得了显著的成功。然而，现有的研究往往忽视了一个关键挑战，即如何学习能够有效推广到代表性不足的图区域的消息传播。这些少数区域常常表现出不规则的同质/异质性模式和多样化的邻域类分布，导致了歧义。在本研究中，我们调查了GNN中的歧义问题，它对表示学习的影响以及对抗这个问题的更丰富的监督信号的发展。我们对GNN进行了细粒度评估，分析了不同图区域中是否存在歧义及其与节点位置的关系。为了消除节点嵌入的歧义，我们提出了一种新的方法{\\method}，它利用额外的优化指导来增强表示。",
    "tldr": "这篇论文研究了图神经网络中歧义问题对表示学习的影响，并提出了一种新的方法{\\method}来消除节点嵌入中的歧义。"
}