{
    "title": "Temporal-Aware Deep Reinforcement Learning for Energy Storage Bidding in Energy and Contingency Reserve Markets",
    "abstract": "arXiv:2402.19110v1 Announce Type: cross  Abstract: The battery energy storage system (BESS) has immense potential for enhancing grid reliability and security through its participation in the electricity market. BESS often seeks various revenue streams by taking part in multiple markets to unlock its full potential, but effective algorithms for joint-market participation under price uncertainties are insufficiently explored in the existing research. To bridge this gap, we develop a novel BESS joint bidding strategy that utilizes deep reinforcement learning (DRL) to bid in the spot and contingency frequency control ancillary services (FCAS) markets. Our approach leverages a transformer-based temporal feature extractor to effectively respond to price fluctuations in seven markets simultaneously and helps DRL learn the best BESS bidding strategy in joint-market participation. Additionally, unlike conventional \"black-box\" DRL model, our approach is more interpretable and provides valuable i",
    "link": "https://arxiv.org/abs/2402.19110",
    "context": "Title: Temporal-Aware Deep Reinforcement Learning for Energy Storage Bidding in Energy and Contingency Reserve Markets\nAbstract: arXiv:2402.19110v1 Announce Type: cross  Abstract: The battery energy storage system (BESS) has immense potential for enhancing grid reliability and security through its participation in the electricity market. BESS often seeks various revenue streams by taking part in multiple markets to unlock its full potential, but effective algorithms for joint-market participation under price uncertainties are insufficiently explored in the existing research. To bridge this gap, we develop a novel BESS joint bidding strategy that utilizes deep reinforcement learning (DRL) to bid in the spot and contingency frequency control ancillary services (FCAS) markets. Our approach leverages a transformer-based temporal feature extractor to effectively respond to price fluctuations in seven markets simultaneously and helps DRL learn the best BESS bidding strategy in joint-market participation. Additionally, unlike conventional \"black-box\" DRL model, our approach is more interpretable and provides valuable i",
    "path": "papers/24/02/2402.19110.json",
    "total_tokens": 899,
    "translated_title": "能源存储出价中的时序感知深度强化学习在能源和备用服务市场中的应用",
    "translated_abstract": "电池能量存储系统（BESS）通过参与电力市场极大地提高了电网的可靠性和安全性。BESS常常通过参与多个市场来寻求各种收入来源，以发挥其全部潜力，但关于在价格不确定性下联合参与市场的有效算法在现有研究中尚未得到充分探讨。为了弥补这一不足，我们开发了一种利用深度强化学习（DRL）在现货市场和容灾频率控制辅助服务（FCAS）市场出价的新颖BESS联合竞标策略。我们的方法利用基于transformer的时序特征提取器来有效应对七个市场同时的价格波动，并帮助DRL学习最佳的BESS出价策略。此外，与传统的“黑匣子”DRL模型不同，我们的方法更具可解释性，并提供有价值的i",
    "tldr": "提出了一种利用深度强化学习在现货市场和容灾频率控制辅助服务市场进行出价的新颖BESS联合竞标策略，通过时序特征提取器有效响应多个市场的价格波动，发展出更具解释性的DRL模型。",
    "en_tdlr": "Proposed a novel BESS joint bidding strategy that utilizes deep reinforcement learning to bid in the spot and contingency frequency control ancillary services markets, effectively responding to price fluctuations in multiple markets using a temporal feature extractor and developing a more interpretable DRL model."
}