{
    "title": "Regime-Aware Asset Allocation: a Statistical Jump Model Approach",
    "abstract": "This article investigates the impact of regime switching on asset allocation decisions, with a primary focus on comparing different regime identification models. In contrast to traditional Markov-switching models, we adopt the statistical jump model, a recently proposed robust model known for its ability to capture persistent market regimes by applying an explicit jump penalty. The feature set of our jump model comprises return and volatility features derived solely from the price series. We introduce a data-driven approach for selecting the jump penalty within a time-series cross-validation framework, which directly optimizes the performance metric of the regime-aware asset allocation strategy constructed following a comprehensive multi-step process. Through empirical analysis using daily return series from major US equity indices, we highlight the outperformance of employing jump models in comparison to both buy-and-hold strategies and Markov-switching asset allocation approaches. Th",
    "link": "https://arxiv.org/abs/2402.05272",
    "context": "Title: Regime-Aware Asset Allocation: a Statistical Jump Model Approach\nAbstract: This article investigates the impact of regime switching on asset allocation decisions, with a primary focus on comparing different regime identification models. In contrast to traditional Markov-switching models, we adopt the statistical jump model, a recently proposed robust model known for its ability to capture persistent market regimes by applying an explicit jump penalty. The feature set of our jump model comprises return and volatility features derived solely from the price series. We introduce a data-driven approach for selecting the jump penalty within a time-series cross-validation framework, which directly optimizes the performance metric of the regime-aware asset allocation strategy constructed following a comprehensive multi-step process. Through empirical analysis using daily return series from major US equity indices, we highlight the outperformance of employing jump models in comparison to both buy-and-hold strategies and Markov-switching asset allocation approaches. Th",
    "path": "papers/24/02/2402.05272.json",
    "total_tokens": 922,
    "translated_title": "决策制度感知资产配置：基于统计跳跃模型方法的研究",
    "translated_abstract": "本文研究了制度转换对资产配置决策的影响，重点比较了不同制度识别模型。与传统的马尔可夫转换模型不同，我们采用了统计跳跃模型，这是一种近期被提出的稳健模型，以其能够通过应用显式跳跃惩罚来捕捉持久的市场制度而闻名。我们的跳跃模型的特征集仅包括从价格序列中得出的收益和波动率特征。我们引入了一种在时间序列交叉验证框架内选择跳跃惩罚的数据驱动方法，该方法直接优化决策制度感知资产配置策略的性能指标，这一策略经历了全面的多步骤过程构建。通过使用美国主要股票指数的日回报序列进行实证分析，我们突出了采用跳跃模型相对于买入持有策略和马尔可夫转换资产配置方法的表现优势。",
    "tldr": "本文研究了制度转换对资产配置决策的影响，并比较了不同的制度识别模型。通过使用统计跳跃模型，作者开发了一种决策制度感知的资产配置策略，通过优化跳跃模型的性能指标，并在实证分析中展示了该策略相对于传统方法的表现优势。",
    "en_tdlr": "This article explores the impact of regime switching on asset allocation decisions and compares different regime identification models. By utilizing statistical jump models, the authors develop a regime-aware asset allocation strategy that optimizes the performance metric and demonstrates superior performance compared to traditional approaches."
}