{
    "title": "TriSampler: A Better Negative Sampling Principle for Dense Retrieval",
    "abstract": "arXiv:2402.11855v1 Announce Type: new  Abstract: Negative sampling stands as a pivotal technique in dense retrieval, essential for training effective retrieval models and significantly impacting retrieval performance. While existing negative sampling methods have made commendable progress by leveraging hard negatives, a comprehensive guiding principle for constructing negative candidates and designing negative sampling distributions is still lacking. To bridge this gap, we embark on a theoretical analysis of negative sampling in dense retrieval. This exploration culminates in the unveiling of the quasi-triangular principle, a novel framework that elucidates the triangular-like interplay between query, positive document, and negative document. Fueled by this guiding principle, we introduce TriSampler, a straightforward yet highly effective negative sampling method. The keypoint of TriSampler lies in its ability to selectively sample more informative negatives within a prescribed constra",
    "link": "https://arxiv.org/abs/2402.11855",
    "context": "Title: TriSampler: A Better Negative Sampling Principle for Dense Retrieval\nAbstract: arXiv:2402.11855v1 Announce Type: new  Abstract: Negative sampling stands as a pivotal technique in dense retrieval, essential for training effective retrieval models and significantly impacting retrieval performance. While existing negative sampling methods have made commendable progress by leveraging hard negatives, a comprehensive guiding principle for constructing negative candidates and designing negative sampling distributions is still lacking. To bridge this gap, we embark on a theoretical analysis of negative sampling in dense retrieval. This exploration culminates in the unveiling of the quasi-triangular principle, a novel framework that elucidates the triangular-like interplay between query, positive document, and negative document. Fueled by this guiding principle, we introduce TriSampler, a straightforward yet highly effective negative sampling method. The keypoint of TriSampler lies in its ability to selectively sample more informative negatives within a prescribed constra",
    "path": "papers/24/02/2402.11855.json",
    "total_tokens": 816,
    "translated_title": "TriSampler: 一种更好的稠密检索负采样原则",
    "translated_abstract": "arXiv:2402.11855v1 公告类型: 新摘要: 负采样作为稠密检索中的一个关键技术，是训练有效检索模型和明显影响检索性能的基本要素。虽然现有的负采样方法通过利用困难的负例取得了可观的进展，但仍然缺乏一个全面的指导原则，用于构建负候选项和设计负采样分布。为填补这一空白，我们对稠密检索中的负采样进行了理论分析。这种探索最终揭示了准三角原则，这是一个阐明查询、正文档和负文档之间类似三角形相互作用的新框架。在这一指导原则的推动下，我们引入了TriSampler，一个简单而高效的负采样方法。TriSampler的关键点在于其能够在规定的约束条件下选择性地采样更具信息量的负例。",
    "tldr": "TriSampler提出了一种新颖的基于准三角原则的负采样框架，能够在稠密检索中选择性地采样更具信息量的负例"
}