{
    "title": "BuffGraph: Enhancing Class-Imbalanced Node Classification via Buffer Nodes",
    "abstract": "arXiv:2402.13114v1 Announce Type: cross  Abstract: Class imbalance in graph-structured data, where minor classes are significantly underrepresented, poses a critical challenge for Graph Neural Networks (GNNs). To address this challenge, existing studies generally generate new minority nodes and edges connecting new nodes to the original graph to make classes balanced. However, they do not solve the problem that majority classes still propagate information to minority nodes by edges in the original graph which introduces bias towards majority classes. To address this, we introduce BuffGraph, which inserts buffer nodes into the graph, modulating the impact of majority classes to improve minor class representation. Our extensive experiments across diverse real-world datasets empirically demonstrate that BuffGraph outperforms existing baseline methods in class-imbalanced node classification in both natural settings and imbalanced settings. Code is available at https://anonymous.4open.scien",
    "link": "https://arxiv.org/abs/2402.13114",
    "context": "Title: BuffGraph: Enhancing Class-Imbalanced Node Classification via Buffer Nodes\nAbstract: arXiv:2402.13114v1 Announce Type: cross  Abstract: Class imbalance in graph-structured data, where minor classes are significantly underrepresented, poses a critical challenge for Graph Neural Networks (GNNs). To address this challenge, existing studies generally generate new minority nodes and edges connecting new nodes to the original graph to make classes balanced. However, they do not solve the problem that majority classes still propagate information to minority nodes by edges in the original graph which introduces bias towards majority classes. To address this, we introduce BuffGraph, which inserts buffer nodes into the graph, modulating the impact of majority classes to improve minor class representation. Our extensive experiments across diverse real-world datasets empirically demonstrate that BuffGraph outperforms existing baseline methods in class-imbalanced node classification in both natural settings and imbalanced settings. Code is available at https://anonymous.4open.scien",
    "path": "papers/24/02/2402.13114.json",
    "total_tokens": 801,
    "translated_title": "BuffGraph: 通过缓冲节点增强节点分类的不平衡类别问题",
    "translated_abstract": "图结构数据中的类别不平衡，即次要类别明显代表不足，对图神经网络（GNNs）构成了重大挑战。为了应对这一挑战，现有研究通常生成新的少数节点，并连接新节点到原始图中，使得类别平衡。然而，它们并未解决主要类别通过原始图中的边向次要节点传播信息的问题，从而引入了对主要类别的偏见。为了解决这个问题，我们引入了BuffGraph，将缓冲节点插入图中，调节主要类别的影响，以改善次要类别的表示。我们在各种真实世界数据集上进行了大量实验证明，BuffGraph在自然设置和不平衡设置中的类别不平衡节点分类中优于现有基线方法。代码可在https://anonymous.4open.scien获得。",
    "tldr": "BuffGraph通过插入缓冲节点到图中，调节主要类别的影响，以改善次要类别的表示，在类别不平衡的节点分类问题上表现优越。",
    "en_tdlr": "BuffGraph enhances class-imbalanced node classification by inserting buffer nodes into the graph to modulate the impact of majority classes and improve the representation of minority classes, outperforming existing baseline methods."
}