{
    "title": "Causal Discovery under Off-Target Interventions",
    "abstract": "Causal graph discovery is a significant problem with applications across various disciplines. However, with observational data alone, the underlying causal graph can only be recovered up to its Markov equivalence class, and further assumptions or interventions are necessary to narrow down the true graph. This work addresses the causal discovery problem under the setting of stochastic interventions with the natural goal of minimizing the number of interventions performed. We propose the following stochastic intervention model which subsumes existing adaptive noiseless interventions in the literature while capturing scenarios such as fat-hand interventions and CRISPR gene knockouts: any intervention attempt results in an actual intervention on a random subset of vertices, drawn from a distribution dependent on attempted action. Under this model, we study the two fundamental problems in causal discovery of verification and search and provide approximation algorithms with polylogarithmic c",
    "link": "https://arxiv.org/abs/2402.08229",
    "context": "Title: Causal Discovery under Off-Target Interventions\nAbstract: Causal graph discovery is a significant problem with applications across various disciplines. However, with observational data alone, the underlying causal graph can only be recovered up to its Markov equivalence class, and further assumptions or interventions are necessary to narrow down the true graph. This work addresses the causal discovery problem under the setting of stochastic interventions with the natural goal of minimizing the number of interventions performed. We propose the following stochastic intervention model which subsumes existing adaptive noiseless interventions in the literature while capturing scenarios such as fat-hand interventions and CRISPR gene knockouts: any intervention attempt results in an actual intervention on a random subset of vertices, drawn from a distribution dependent on attempted action. Under this model, we study the two fundamental problems in causal discovery of verification and search and provide approximation algorithms with polylogarithmic c",
    "path": "papers/24/02/2402.08229.json",
    "total_tokens": 839,
    "translated_title": "非目标干预下的因果发现",
    "translated_abstract": "因果图发现是一个在各个学科中具有重要应用的问题。然而，仅凭观察数据，只能恢复到其马尔可夫等价类的潜在因果图，并且需要进一步的假设或干预来缩小真实图的范围。本研究解决了在随机干预设置下的因果发现问题，目标是尽量减少干预次数。我们提出了以下随机干预模型，它包含了现有文献中的自适应无噪声干预，并能捕捉到脂肪手干预和CRISPR基因敲除等情况：任何干预尝试都会导致对一个随机顶点子集的实际干预，这个子集的选择是依赖于尝试的动作的分布。在这个模型下，我们研究了因果发现中的验证和搜索两个基本问题，并提供了具有多对数复杂度的近似算法。",
    "tldr": "本文研究了非目标干预下的因果发现问题，提出了一个随机干预模型来尽量减少干预次数。通过验证和搜索两个基本问题，提供了多对数复杂度的近似算法。",
    "en_tdlr": "This paper addresses the problem of causal discovery under off-target interventions and proposes a stochastic intervention model to minimize the number of interventions performed. By studying the verification and search problems, approximation algorithms with polylogarithmic complexity are provided."
}