{
    "title": "DivaTrack: Diverse Bodies and Motions from Acceleration-Enhanced Three-Point Trackers",
    "abstract": "arXiv:2402.09211v1 Announce Type: cross Abstract: Full-body avatar presence is crucial for immersive social and environmental interactions in digital reality. However, current devices only provide three six degrees of freedom (DOF) poses from the headset and two controllers (i.e. three-point trackers). Because it is a highly under-constrained problem, inferring full-body pose from these inputs is challenging, especially when supporting the full range of body proportions and use cases represented by the general population. In this paper, we propose a deep learning framework, DivaTrack, which outperforms existing methods when applied to diverse body sizes and activities. We augment the sparse three-point inputs with linear accelerations from Inertial Measurement Units (IMU) to improve foot contact prediction. We then condition the otherwise ambiguous lower-body pose with the predictions of foot contact and upper-body pose in a two-stage model. We further stabilize the inferred full-body ",
    "link": "https://arxiv.org/abs/2402.09211",
    "context": "Title: DivaTrack: Diverse Bodies and Motions from Acceleration-Enhanced Three-Point Trackers\nAbstract: arXiv:2402.09211v1 Announce Type: cross Abstract: Full-body avatar presence is crucial for immersive social and environmental interactions in digital reality. However, current devices only provide three six degrees of freedom (DOF) poses from the headset and two controllers (i.e. three-point trackers). Because it is a highly under-constrained problem, inferring full-body pose from these inputs is challenging, especially when supporting the full range of body proportions and use cases represented by the general population. In this paper, we propose a deep learning framework, DivaTrack, which outperforms existing methods when applied to diverse body sizes and activities. We augment the sparse three-point inputs with linear accelerations from Inertial Measurement Units (IMU) to improve foot contact prediction. We then condition the otherwise ambiguous lower-body pose with the predictions of foot contact and upper-body pose in a two-stage model. We further stabilize the inferred full-body ",
    "path": "papers/24/02/2402.09211.json",
    "total_tokens": 973,
    "translated_title": "DivaTrack: 利用加速度增强的三点跟踪器实现多样化的身体和动作",
    "translated_abstract": "arXiv:2402.09211v1 公告类型: 跨领域 摘要: 全身仿真是数字现实中沉浸式社交和环境交互的关键。然而，当前的设备只能提供来自头盔和两个控制器（即三点跟踪器）的六个自由度（DOF）姿势。由于这是一个高度欠约束的问题，从这些输入中推断出全身姿势是具有挑战性的，特别是当支持普通人群所代表的各种身体比例和使用情况时。在本文中，我们提出了一个名为DivaTrack的深度学习框架，在应用于多样化的身体尺寸和活动时，优于现有的方法。我们利用惯性测量单元（IMU）的线性加速度增强了稀疏的三点输入，以改善脚部接触的预测。然后，我们使用两阶段模型将低身体姿势的模糊性条件化为脚部接触和上身姿势的预测。我们进一步稳定推断出的全身姿势。",
    "tldr": "DivaTrack是一个基于深度学习的框架，可以在多样化的身体尺寸和活动情况下优于现有方法，通过加入线性加速度从IMU提供更准确的脚部接触预测，并使用两阶段模型来提高对全身姿势的预测稳定性。",
    "en_tdlr": "DivaTrack is a deep learning framework that outperforms existing methods in diverse body sizes and activities, by incorporating linear accelerations from IMU to improve foot contact prediction, and using a two-stage model to enhance the stability of predicting full-body poses."
}