{
    "title": "Asclepius: A Spectrum Evaluation Benchmark for Medical Multi-Modal Large Language Models",
    "abstract": "arXiv:2402.11217v1 Announce Type: new  Abstract: The significant breakthroughs of Medical Multi-Modal Large Language Models (Med-MLLMs) renovate modern healthcare with robust information synthesis and medical decision support. However, these models are often evaluated on benchmarks that are unsuitable for the Med-MLLMs due to the intricate nature of the real-world diagnostic frameworks, which encompass diverse medical specialties and involve complex clinical decisions. Moreover, these benchmarks are susceptible to data leakage, since Med-MLLMs are trained on large assemblies of publicly available data. Thus, an isolated and clinically representative benchmark is highly desirable for credible Med-MLLMs evaluation. To this end, we introduce Asclepius, a novel Med-MLLM benchmark that rigorously and comprehensively assesses model capability in terms of: distinct medical specialties (cardiovascular, gastroenterology, etc.) and different diagnostic capacities (perception, disease analysis, e",
    "link": "https://arxiv.org/abs/2402.11217",
    "context": "Title: Asclepius: A Spectrum Evaluation Benchmark for Medical Multi-Modal Large Language Models\nAbstract: arXiv:2402.11217v1 Announce Type: new  Abstract: The significant breakthroughs of Medical Multi-Modal Large Language Models (Med-MLLMs) renovate modern healthcare with robust information synthesis and medical decision support. However, these models are often evaluated on benchmarks that are unsuitable for the Med-MLLMs due to the intricate nature of the real-world diagnostic frameworks, which encompass diverse medical specialties and involve complex clinical decisions. Moreover, these benchmarks are susceptible to data leakage, since Med-MLLMs are trained on large assemblies of publicly available data. Thus, an isolated and clinically representative benchmark is highly desirable for credible Med-MLLMs evaluation. To this end, we introduce Asclepius, a novel Med-MLLM benchmark that rigorously and comprehensively assesses model capability in terms of: distinct medical specialties (cardiovascular, gastroenterology, etc.) and different diagnostic capacities (perception, disease analysis, e",
    "path": "papers/24/02/2402.11217.json",
    "total_tokens": 895,
    "translated_title": "Asclepius：用于医学多模态大语言模型的频谱评估基准",
    "translated_abstract": "arXiv:2402.11217v1 公告类型：新摘要：医学多模态大语言模型（Med-MLLMs）的重大突破通过强大的信息综合和医疗决策支持改造了现代医疗保健。然而，由于现实世界诊断框架的复杂性涵盖了各种医学专业，并涉及复杂的临床决策，这些模型通常在不适合Med-MLLMs的基准上进行评估。此外，由于Med-MLLMs是在大量公开可用数据集上进行训练的，这些基准容易出现数据泄露。因此，需要一个独立且临床代表性的基准用于可信的Med-MLLMs评估。为此，我们引入了Asclepius，一个新颖的Med-MLLM基准，严格和全面评估模型在不同医学专业（心血管、胃肠等）和不同诊断能力（知觉、疾病分析等）方面的能力。",
    "tldr": "Asclepius是一个新的医学多模态大语言模型基准，旨在为可信的Med-MLLMs评估提供单独且临床代表性的评估方案。"
}