{
    "title": "LoTa-Bench: Benchmarking Language-oriented Task Planners for Embodied Agents",
    "abstract": "Large language models (LLMs) have recently received considerable attention as alternative solutions for task planning. However, comparing the performance of language-oriented task planners becomes difficult, and there exists a dearth of detailed exploration regarding the effects of various factors such as pre-trained model selection and prompt construction. To address this, we propose a benchmark system for automatically quantifying performance of task planning for home-service embodied agents. Task planners are tested on two pairs of datasets and simulators: 1) ALFRED and AI2-THOR, 2) an extension of Watch-And-Help and VirtualHome. Using the proposed benchmark system, we perform extensive experiments with LLMs and prompts, and explore several enhancements of the baseline planner. We expect that the proposed benchmark tool would accelerate the development of language-oriented task planners.",
    "link": "https://arxiv.org/abs/2402.08178",
    "context": "Title: LoTa-Bench: Benchmarking Language-oriented Task Planners for Embodied Agents\nAbstract: Large language models (LLMs) have recently received considerable attention as alternative solutions for task planning. However, comparing the performance of language-oriented task planners becomes difficult, and there exists a dearth of detailed exploration regarding the effects of various factors such as pre-trained model selection and prompt construction. To address this, we propose a benchmark system for automatically quantifying performance of task planning for home-service embodied agents. Task planners are tested on two pairs of datasets and simulators: 1) ALFRED and AI2-THOR, 2) an extension of Watch-And-Help and VirtualHome. Using the proposed benchmark system, we perform extensive experiments with LLMs and prompts, and explore several enhancements of the baseline planner. We expect that the proposed benchmark tool would accelerate the development of language-oriented task planners.",
    "path": "papers/24/02/2402.08178.json",
    "total_tokens": 784,
    "translated_title": "LoTa-Bench: 基于语言的任务规划器对于具身代理的基准测试",
    "translated_abstract": "大型语言模型（LLMs）最近作为任务规划的替代解决方案受到了广泛关注。然而，比较语言导向的任务规划器的性能变得困难，关于预训练模型选择和提示构建等各种因素的详细探索也缺乏。为了解决这个问题，我们提出了一个基准系统，用于自动量化家庭服务具身代理的任务规划性能。任务规划器在两对数据集和模拟器上进行测试：1）ALFRED和AI2-THOR，2）Watch-And-Help和VirtualHome的扩展。使用提出的基准系统，我们对LLMs和提示进行了广泛的实验，并探索了基线规划器的几种改进。我们期望提出的基准工具将加速语言导向任务规划器的开发。",
    "tldr": "LoTa-Bench是一个用于评估具身代理任务规划性能的基准系统，通过对LLMs和提示进行实验，加速语言导向任务规划器的开发。",
    "en_tdlr": "LoTa-Bench is a benchmark system for evaluating the performance of task planning for embodied agents, which accelerates the development of language-oriented task planners through experiments with LLMs and prompts."
}