{
    "title": "Artificial Intelligence and Diabetes Mellitus: An Inside Look Through the Retina",
    "abstract": "arXiv:2402.18600v1 Announce Type: cross  Abstract: Diabetes mellitus (DM) predisposes patients to vascular complications. Retinal images and vasculature reflect the body's micro- and macrovascular health. They can be used to diagnose DM complications, including diabetic retinopathy (DR), neuropathy, nephropathy, and atherosclerotic cardiovascular disease, as well as forecast the risk of cardiovascular events. Artificial intelligence (AI)-enabled systems developed for high-throughput detection of DR using digitized retinal images have become clinically adopted. Beyond DR screening, AI integration also holds immense potential to address challenges associated with the holistic care of the patient with DM. In this work, we aim to comprehensively review the literature for studies on AI applications based on retinal images related to DM diagnosis, prognostication, and management. We will describe the findings of holistic AI-assisted diabetes care, including but not limited to DR screening, a",
    "link": "https://arxiv.org/abs/2402.18600",
    "context": "Title: Artificial Intelligence and Diabetes Mellitus: An Inside Look Through the Retina\nAbstract: arXiv:2402.18600v1 Announce Type: cross  Abstract: Diabetes mellitus (DM) predisposes patients to vascular complications. Retinal images and vasculature reflect the body's micro- and macrovascular health. They can be used to diagnose DM complications, including diabetic retinopathy (DR), neuropathy, nephropathy, and atherosclerotic cardiovascular disease, as well as forecast the risk of cardiovascular events. Artificial intelligence (AI)-enabled systems developed for high-throughput detection of DR using digitized retinal images have become clinically adopted. Beyond DR screening, AI integration also holds immense potential to address challenges associated with the holistic care of the patient with DM. In this work, we aim to comprehensively review the literature for studies on AI applications based on retinal images related to DM diagnosis, prognostication, and management. We will describe the findings of holistic AI-assisted diabetes care, including but not limited to DR screening, a",
    "path": "papers/24/02/2402.18600.json",
    "total_tokens": 922,
    "translated_title": "人工智能与糖尿病：通过视网膜深入探究",
    "translated_abstract": "糖尿病（DM）使患者易患血管并发症。视网膜图像和血管反映了身体的微血管和大血管健康状况。它们可用于诊断DM并发症，包括糖尿病视网膜病变（DR）、神经病变、肾病以及动脉粥样硬化心血管疾病，还可预测心血管事件的风险。应用人工智能（AI）技术开发的高通量DR检测系统已被临床采用。除DR筛查外，AI整合还具有巨大潜力应对糖尿病患者整体护理的挑战。本文旨在全面审查与DM诊断、预后和管理相关的基于视网膜图像的AI应用研究文献。我们将描述综合AI辅助糖尿病护理的研究结果，包括但不限于DR筛查。",
    "tldr": "通过视网膜图像与血管状况，人工智能系统用于高通量糖尿病视网膜病变（DR）检测，并具有潜力解决糖尿病患者整体护理挑战。",
    "en_tdlr": "By utilizing retinal images and vasculature, artificial intelligence systems are employed for high-throughput detection of diabetic retinopathy (DR) and hold potential to address challenges in holistic care of diabetes patients."
}