{
    "title": "Multi-Intent Attribute-Aware Text Matching in Searching",
    "abstract": "Text matching systems have become a fundamental service in most searching platforms. For instance, they are responsible for matching user queries to relevant candidate items, or rewriting the user-input query to a pre-selected high-performing one for a better search experience. In practice, both the queries and items often contain multiple attributes, such as the category of the item and the location mentioned in the query, which represent condensed key information that is helpful for matching. However, most of the existing works downplay the effectiveness of attributes by integrating them into text representations as supplementary information. Hence, in this work, we focus on exploring the relationship between the attributes from two sides. Since attributes from two ends are often not aligned in terms of number and type, we propose to exploit the benefit of attributes by multiple-intent modeling. The intents extracted from attributes summarize the diverse needs of queries and provide ",
    "link": "https://arxiv.org/abs/2402.07788",
    "context": "Title: Multi-Intent Attribute-Aware Text Matching in Searching\nAbstract: Text matching systems have become a fundamental service in most searching platforms. For instance, they are responsible for matching user queries to relevant candidate items, or rewriting the user-input query to a pre-selected high-performing one for a better search experience. In practice, both the queries and items often contain multiple attributes, such as the category of the item and the location mentioned in the query, which represent condensed key information that is helpful for matching. However, most of the existing works downplay the effectiveness of attributes by integrating them into text representations as supplementary information. Hence, in this work, we focus on exploring the relationship between the attributes from two sides. Since attributes from two ends are often not aligned in terms of number and type, we propose to exploit the benefit of attributes by multiple-intent modeling. The intents extracted from attributes summarize the diverse needs of queries and provide ",
    "path": "papers/24/02/2402.07788.json",
    "total_tokens": 783,
    "translated_title": "在搜索中的多意图属性感知文本匹配",
    "translated_abstract": "文本匹配系统已成为大多数搜索平台的基本服务。例如，它们负责将用户查询匹配到相关的候选项，或将用户输入的查询改写为预选的高性能查询，以获得更好的搜索体验。在实践中，查询和项通常包含多个属性，例如项的类别和查询中提到的位置，这些属性代表着有助于匹配的关键信息。然而，大多数现有工作通过将属性集成到文本表示中作为辅助信息，低估了属性的有效性。因此，本文致力于探索两方面的属性之间的关系。由于两端的属性在数量和类型上通常不对齐，我们提出通过多意图建模来利用属性的好处。从属性中提取的意图总结了查询的多样化需求，并提供。",
    "tldr": "本研究针对搜索中的文本匹配系统进行了多意图属性感知的研究，提出了通过多意图建模来利用多个属性之间的关系。意图从属性中提取，总结了查询的多样化需求。",
    "en_tdlr": "This research focuses on multi-intent attribute-aware text matching in searching. It proposes exploring the relationship between attributes by using multiple-intent modeling, where intents extracted from attributes summarize the diverse needs of queries."
}