{
    "title": "Determining the severity of Parkinson's disease in patients using a multi task neural network",
    "abstract": "Parkinson's disease is easy to diagnose when it is advanced, but it is very difficult to diagnose in its early stages. Early diagnosis is essential to be able to treat the symptoms. It impacts on daily activities and reduces the quality of life of both the patients and their families and it is also the second most prevalent neurodegenerative disorder after Alzheimer in people over the age of 60. Most current studies on the prediction of Parkinson's severity are carried out in advanced stages of the disease. In this work, the study analyzes a set of variables that can be easily extracted from voice analysis, making it a very non-intrusive technique. In this paper, a method based on different deep learning techniques is proposed with two purposes. On the one hand, to find out if a person has severe or non-severe Parkinson's disease, and on the other hand, to determine by means of regression techniques the degree of evolution of the disease in a given patient. The UPDRS (Unified Parkinson",
    "link": "https://arxiv.org/abs/2402.05491",
    "context": "Title: Determining the severity of Parkinson's disease in patients using a multi task neural network\nAbstract: Parkinson's disease is easy to diagnose when it is advanced, but it is very difficult to diagnose in its early stages. Early diagnosis is essential to be able to treat the symptoms. It impacts on daily activities and reduces the quality of life of both the patients and their families and it is also the second most prevalent neurodegenerative disorder after Alzheimer in people over the age of 60. Most current studies on the prediction of Parkinson's severity are carried out in advanced stages of the disease. In this work, the study analyzes a set of variables that can be easily extracted from voice analysis, making it a very non-intrusive technique. In this paper, a method based on different deep learning techniques is proposed with two purposes. On the one hand, to find out if a person has severe or non-severe Parkinson's disease, and on the other hand, to determine by means of regression techniques the degree of evolution of the disease in a given patient. The UPDRS (Unified Parkinson",
    "path": "papers/24/02/2402.05491.json",
    "total_tokens": 876,
    "translated_title": "使用多任务神经网络确定帕金森病患者的严重程度",
    "translated_abstract": "在帕金森病的晚期，诊断比较容易，但在早期阶段很难诊断。早期诊断是治疗症状的关键。它影响日常生活，并降低患者和家人的生活质量，是继老年痴呆症后第二常见的神经退行性疾病。目前大多数关于预测帕金森病严重程度的研究都是在疾病的晚期进行的。本研究分析了一组可以通过语音分析轻松提取的变量，使其成为一种非侵入性技术。本文提出了一种基于不同深度学习技术的方法，具有两个目的。一方面，确定一个人是严重帕金森病还是非严重帕金森病；另一方面，通过回归技术确定给定患者疾病的进展程度。",
    "tldr": "本文提出了一种基于声音分析的非侵入性技术，使用多任务神经网络来确定帕金森病患者的严重程度和疾病进展的方法。"
}