{
    "title": "Where It Really Matters: Few-Shot Environmental Conservation Media Monitoring for Low-Resource Languages",
    "abstract": "arXiv:2402.11818v1 Announce Type: cross  Abstract: Environmental conservation organizations routinely monitor news content on conservation in protected areas to maintain situational awareness of developments that can have an environmental impact. Existing automated media monitoring systems require large amounts of data labeled by domain experts, which is only feasible at scale for high-resource languages like English. However, such tools are most needed in the global south where news of interest is mainly in local low-resource languages, and far fewer experts are available to annotate datasets sustainably. In this paper, we propose NewsSerow, a method to automatically recognize environmental conservation content in low-resource languages. NewsSerow is a pipeline of summarization, in-context few-shot classification, and self-reflection using large language models (LLMs). Using at most 10 demonstration example news articles in Nepali, NewsSerow significantly outperforms other few-shot me",
    "link": "https://arxiv.org/abs/2402.11818",
    "context": "Title: Where It Really Matters: Few-Shot Environmental Conservation Media Monitoring for Low-Resource Languages\nAbstract: arXiv:2402.11818v1 Announce Type: cross  Abstract: Environmental conservation organizations routinely monitor news content on conservation in protected areas to maintain situational awareness of developments that can have an environmental impact. Existing automated media monitoring systems require large amounts of data labeled by domain experts, which is only feasible at scale for high-resource languages like English. However, such tools are most needed in the global south where news of interest is mainly in local low-resource languages, and far fewer experts are available to annotate datasets sustainably. In this paper, we propose NewsSerow, a method to automatically recognize environmental conservation content in low-resource languages. NewsSerow is a pipeline of summarization, in-context few-shot classification, and self-reflection using large language models (LLMs). Using at most 10 demonstration example news articles in Nepali, NewsSerow significantly outperforms other few-shot me",
    "path": "papers/24/02/2402.11818.json",
    "total_tokens": 844,
    "translated_title": "在真正重要的地方：低资源语言的少样本环境保护媒体监测",
    "translated_abstract": "环保组织常规监测有可能对环境产生影响的保护区媒体内容，以保持对可能发展的情况的认识。现有的自动化媒体监测系统需要由领域专家标记的大量数据，这在英语等高资源语言的规模上才是可行的。然而，这样的工具在全球南方最需要，在那里感兴趣的新闻主要是用本地低资源语言发布的，可持续地对数据集进行注释的专家也很少。在本文中，我们提出了一种NewsSerow方法，用于自动识别低资源语言中的环境保护内容。NewsSerow是一个利用大型语言模型（LLMs）的总结、上下文少样本分类和自我反思的流程。在尼泊尔语中使用最多10个新闻示例文章，NewsSerow明显优于其他少样本模型。",
    "tldr": "提出了一种名为NewsSerow的方法，用于自动识别低资源语言中的环境保护内容，并且在尼泊尔语中使用少于10个示例新闻文章时，NewsSerow显着优于其他少样本模型。",
    "en_tdlr": "Proposed NewsSerow method for automatically recognizing environmental conservation content in low-resource languages significantly outperforms other few-shot models with at most 10 demonstration example news articles in Nepali."
}