{
    "title": "Adversarially Robust Feature Learning for Breast Cancer Diagnosis",
    "abstract": "arXiv:2402.08768v1 Announce Type: cross Abstract: Adversarial data can lead to malfunction of deep learning applications. It is essential to develop deep learning models that are robust to adversarial data while accurate on standard, clean data. In this study, we proposed a novel adversarially robust feature learning (ARFL) method for a real-world application of breast cancer diagnosis. ARFL facilitates adversarial training using both standard data and adversarial data, where a feature correlation measure is incorporated as an objective function to encourage learning of robust features and restrain spurious features. To show the effects of ARFL in breast cancer diagnosis, we built and evaluated diagnosis models using two independent clinically collected breast imaging datasets, comprising a total of 9,548 mammogram images. We performed extensive experiments showing that our method outperformed several state-of-the-art methods and that our method can enhance safer breast cancer diagnosi",
    "link": "https://arxiv.org/abs/2402.08768",
    "context": "Title: Adversarially Robust Feature Learning for Breast Cancer Diagnosis\nAbstract: arXiv:2402.08768v1 Announce Type: cross Abstract: Adversarial data can lead to malfunction of deep learning applications. It is essential to develop deep learning models that are robust to adversarial data while accurate on standard, clean data. In this study, we proposed a novel adversarially robust feature learning (ARFL) method for a real-world application of breast cancer diagnosis. ARFL facilitates adversarial training using both standard data and adversarial data, where a feature correlation measure is incorporated as an objective function to encourage learning of robust features and restrain spurious features. To show the effects of ARFL in breast cancer diagnosis, we built and evaluated diagnosis models using two independent clinically collected breast imaging datasets, comprising a total of 9,548 mammogram images. We performed extensive experiments showing that our method outperformed several state-of-the-art methods and that our method can enhance safer breast cancer diagnosi",
    "path": "papers/24/02/2402.08768.json",
    "total_tokens": 921,
    "translated_title": "乳腺癌诊断中的对抗性鲁棒特征学习",
    "translated_abstract": "对抗性数据可能导致深度学习应用的故障。对于标准、干净数据准确的深度学习模型而言，开发对抗性数据具有鲁棒性的模型是至关重要的。在这项研究中，我们提出了一种新颖的对抗性鲁棒特征学习(ARFL)方法，用于乳腺癌诊断的真实世界应用。ARFL利用标准数据和对抗性数据进行对抗性训练，其中将特征相关性测量作为目标函数，以鼓励学习鲁棒特征和抑制虚假特征。为了展示ARFL在乳腺癌诊断中的效果，我们使用两个独立临床收集的乳腺影像数据集建立并评估了诊断模型，总共包括9,548张乳腺X光片图像。我们进行了大量实验证明我们的方法优于几种最先进的方法，并且我们的方法可以提高更安全的乳腺癌诊断。",
    "tldr": "提出了一种乳腺癌诊断中的对抗性鲁棒特征学习方法(ARFL)，通过对抗性训练和特征相关性测量来学习鲁棒特征，提供更准确和安全的乳腺癌诊断。",
    "en_tdlr": "A novel adversarially robust feature learning (ARFL) method is proposed for breast cancer diagnosis, which uses adversarial training and feature correlation measure to learn robust features and provide more accurate and safe diagnosis."
}