{
    "title": "PriorBoost: An Adaptive Algorithm for Learning from Aggregate Responses",
    "abstract": "This work studies algorithms for learning from aggregate responses. We focus on the construction of aggregation sets (called bags in the literature) for event-level loss functions. We prove for linear regression and generalized linear models (GLMs) that the optimal bagging problem reduces to one-dimensional size-constrained $k$-means clustering. Further, we theoretically quantify the advantage of using curated bags over random bags. We then propose the PriorBoost algorithm, which adaptively forms bags of samples that are increasingly homogeneous with respect to (unobserved) individual responses to improve model quality. We study label differential privacy for aggregate learning, and we also provide extensive experiments showing that PriorBoost regularly achieves optimal model quality for event-level predictions, in stark contrast to non-adaptive algorithms.",
    "link": "https://arxiv.org/abs/2402.04987",
    "context": "Title: PriorBoost: An Adaptive Algorithm for Learning from Aggregate Responses\nAbstract: This work studies algorithms for learning from aggregate responses. We focus on the construction of aggregation sets (called bags in the literature) for event-level loss functions. We prove for linear regression and generalized linear models (GLMs) that the optimal bagging problem reduces to one-dimensional size-constrained $k$-means clustering. Further, we theoretically quantify the advantage of using curated bags over random bags. We then propose the PriorBoost algorithm, which adaptively forms bags of samples that are increasingly homogeneous with respect to (unobserved) individual responses to improve model quality. We study label differential privacy for aggregate learning, and we also provide extensive experiments showing that PriorBoost regularly achieves optimal model quality for event-level predictions, in stark contrast to non-adaptive algorithms.",
    "path": "papers/24/02/2402.04987.json",
    "total_tokens": 832,
    "translated_title": "PriorBoost：一种用于学习聚合回应的自适应算法",
    "translated_abstract": "本文研究了从聚合回应中学习的算法。我们重点研究了用于事件级损失函数的聚合集合构建（在文献中称为bags）的方法。我们证明了对于线性回归和广义线性模型（GLMs），最优的bagging问题可以简化为一维大小受限的k-means聚类问题。此外，我们从理论上量化了使用策划的bags比随机bags更有优势。然后，我们提出了PriorBoost算法，它自适应地形成样本bags，使其在（未观察到的）个体回应方面越来越同质，以改善模型质量。我们还研究了聚合学习的标签差分隐私，并提供了大量实验证明，与非自适应算法形成鲜明对比，PriorBoost在事件级别预测中经常实现最优模型质量。",
    "tldr": "本研究提出了一种名为PriorBoost的自适应算法，用于学习从聚合回应中学习的算法。该算法通过自适应地形成一些越来越同质的样本bags，以提高模型质量，并在事件级别预测方面实现了最优模型质量。"
}