{
    "title": "GeneOH Diffusion: Towards Generalizable Hand-Object Interaction Denoising via Denoising Diffusion",
    "abstract": "arXiv:2402.14810v1 Announce Type: cross  Abstract: In this work, we tackle the challenging problem of denoising hand-object interactions (HOI). Given an erroneous interaction sequence, the objective is to refine the incorrect hand trajectory to remove interaction artifacts for a perceptually realistic sequence. This challenge involves intricate interaction noise, including unnatural hand poses and incorrect hand-object relations, alongside the necessity for robust generalization to new interactions and diverse noise patterns. We tackle those challenges through a novel approach, GeneOH Diffusion, incorporating two key designs: an innovative contact-centric HOI representation named GeneOH and a new domain-generalizable denoising scheme. The contact-centric representation GeneOH informatively parameterizes the HOI process, facilitating enhanced generalization across various HOI scenarios. The new denoising scheme consists of a canonical denoising model trained to project noisy data sample",
    "link": "https://arxiv.org/abs/2402.14810",
    "context": "Title: GeneOH Diffusion: Towards Generalizable Hand-Object Interaction Denoising via Denoising Diffusion\nAbstract: arXiv:2402.14810v1 Announce Type: cross  Abstract: In this work, we tackle the challenging problem of denoising hand-object interactions (HOI). Given an erroneous interaction sequence, the objective is to refine the incorrect hand trajectory to remove interaction artifacts for a perceptually realistic sequence. This challenge involves intricate interaction noise, including unnatural hand poses and incorrect hand-object relations, alongside the necessity for robust generalization to new interactions and diverse noise patterns. We tackle those challenges through a novel approach, GeneOH Diffusion, incorporating two key designs: an innovative contact-centric HOI representation named GeneOH and a new domain-generalizable denoising scheme. The contact-centric representation GeneOH informatively parameterizes the HOI process, facilitating enhanced generalization across various HOI scenarios. The new denoising scheme consists of a canonical denoising model trained to project noisy data sample",
    "path": "papers/24/02/2402.14810.json",
    "total_tokens": 891,
    "translated_title": "GeneOH扩散: 通过去噪扩散实现可泛化的手-物体交互去噪",
    "translated_abstract": "在这项工作中，我们解决了去噪手-物体交互（HOI）的挑战性问题。在给定一个错误的交互序列的情况下，目标是对不正确的手的轨迹进行细化，以消除交互伪影，获得一个感知上真实的序列。这一挑战涉及复杂的交互噪声，包括不自然的手部姿势和不正确的手-物体关系，以及对新交互和不同噪声模式的稳健泛化的必要性。我们通过一种新颖的方法GeneOH Diffusion应对这些挑战，包括两个关键设计:一种名为GeneOH的创新的基于接触的HOI表示和一种新的领域通用的去噪方案。基于接触的表示GeneOH对HOI过程进行信息化参数化，促进在各种HOI场景中实现增强的泛化。新的去噪方案包括一个经过训练用于投影嘈杂数据样本的经典去噪模型。",
    "tldr": "通过GeneOH扩散方法，实现了可泛化的手-物体交互去噪，其中关键创新包括基于接触的HOI表示和领域通用的去噪方案。",
    "en_tdlr": "The novel GeneOH Diffusion method achieves generalizable hand-object interaction denoising, with key innovations including a contact-centric HOI representation and a domain-generalizable denoising scheme."
}