{
    "title": "Resolution invariant deep operator network for PDEs with complex geometries",
    "abstract": "Neural operators (NO) are discretization invariant deep learning methods with functional output and can approximate any continuous operator. NO have demonstrated the superiority of solving partial differential equations (PDEs) over other deep learning methods. However, the spatial domain of its input function needs to be identical to its output, which limits its applicability. For instance, the widely used Fourier neural operator (FNO) fails to approximate the operator that maps the boundary condition to the PDE solution. To address this issue, we propose a novel framework called resolution-invariant deep operator (RDO) that decouples the spatial domain of the input and output. RDO is motivated by the Deep operator network (DeepONet) and it does not require retraining the network when the input/output is changed compared with DeepONet. RDO takes functional input and its output is also functional so that it keeps the resolution invariant property of NO. It can also resolve PDEs with com",
    "link": "https://arxiv.org/abs/2402.00825",
    "context": "Title: Resolution invariant deep operator network for PDEs with complex geometries\nAbstract: Neural operators (NO) are discretization invariant deep learning methods with functional output and can approximate any continuous operator. NO have demonstrated the superiority of solving partial differential equations (PDEs) over other deep learning methods. However, the spatial domain of its input function needs to be identical to its output, which limits its applicability. For instance, the widely used Fourier neural operator (FNO) fails to approximate the operator that maps the boundary condition to the PDE solution. To address this issue, we propose a novel framework called resolution-invariant deep operator (RDO) that decouples the spatial domain of the input and output. RDO is motivated by the Deep operator network (DeepONet) and it does not require retraining the network when the input/output is changed compared with DeepONet. RDO takes functional input and its output is also functional so that it keeps the resolution invariant property of NO. It can also resolve PDEs with com",
    "path": "papers/24/02/2402.00825.json",
    "total_tokens": 889,
    "translated_title": "具有复杂几何体的PDE的分辨率不变的深度算子网络",
    "translated_abstract": "神经算子（NO）是具有功能性输出的离散不变深度学习方法，可以逼近任何连续性算子。NO在解决偏微分方程（PDE）方面表现出优势，超过其他深度学习方法。然而，其输入函数的空间域需要与输出函数相同，这限制了其适用性。例如，广泛使用的傅立叶神经算子（FNO）无法逼近将边界条件映射到PDE解的算子。为解决这个问题，我们提出了一种称为分辨率不变深度算子（RDO）的新框架，它将输入和输出的空间域解耦。RDO受到深度算子网络（DeepONet）的启发，与DeepONet相比，它不需要对网络进行重新训练来适应输入/输出的变化。RDO接受功能性输入，其输出也是功能性的，因此保持NO的分辨率不变性质。它还可以解决具有复杂几何体的PDE。",
    "tldr": "本文提出了一种名为分辨率不变的深度算子网络（RDO）的新框架，通过解耦输入和输出的空间域来解决神经算子（NO）的应用限制问题，可以解决具有复杂几何体的PDE。 (RDO is a novel framework that decouples the spatial domain of input and output, addressing the limitation of neural operators (NO) and enabling the resolution of PDEs with complex geometries.)"
}