{
    "title": "Are we making much progress? Revisiting chemical reaction yield prediction from an imbalanced regression perspective",
    "abstract": "The yield of a chemical reaction quantifies the percentage of the target product formed in relation to the reactants consumed during the chemical reaction. Accurate yield prediction can guide chemists toward selecting high-yield reactions during synthesis planning, offering valuable insights before dedicating time and resources to wet lab experiments. While recent advancements in yield prediction have led to overall performance improvement across the entire yield range, an open challenge remains in enhancing predictions for high-yield reactions, which are of greater concern to chemists. In this paper, we argue that the performance gap in high-yield predictions results from the imbalanced distribution of real-world data skewed towards low-yield reactions, often due to unreacted starting materials and inherent ambiguities in the reaction processes. Despite this data imbalance, existing yield prediction methods continue to treat different yield ranges equally, assuming a balanced training",
    "link": "https://arxiv.org/abs/2402.05971",
    "context": "Title: Are we making much progress? Revisiting chemical reaction yield prediction from an imbalanced regression perspective\nAbstract: The yield of a chemical reaction quantifies the percentage of the target product formed in relation to the reactants consumed during the chemical reaction. Accurate yield prediction can guide chemists toward selecting high-yield reactions during synthesis planning, offering valuable insights before dedicating time and resources to wet lab experiments. While recent advancements in yield prediction have led to overall performance improvement across the entire yield range, an open challenge remains in enhancing predictions for high-yield reactions, which are of greater concern to chemists. In this paper, we argue that the performance gap in high-yield predictions results from the imbalanced distribution of real-world data skewed towards low-yield reactions, often due to unreacted starting materials and inherent ambiguities in the reaction processes. Despite this data imbalance, existing yield prediction methods continue to treat different yield ranges equally, assuming a balanced training",
    "path": "papers/24/02/2402.05971.json",
    "total_tokens": 891,
    "translated_title": "我们取得了多少进展？从不平衡回归的角度重新审视化学反应收率预测",
    "translated_abstract": "化学反应的收率是指目标产物形成的百分比与化学反应过程中消耗的反应物之间的关系。准确的收率预测可以在合成规划中指导化学家选择高收率反应，在投入时间和资源进行湿实验之前提供宝贵的见解。虽然最近在收率预测方面取得了整体性能的改进，但在提高高收率反应的预测方面仍存在一个开放性挑战，这对于化学家来说更为重要。本文认为高收率预测方面的性能差距是由于真实世界数据的不平衡分布所致，这些数据偏向于低收率反应，通常是由于未反应的起始物质和反应过程中的固有歧义性。尽管存在数据不平衡，现有的收率预测方法继续将不同收率范围视为平衡的训练情况。",
    "tldr": "本文从不平衡回归的角度重新审视了化学反应收率预测。在合成规划中，准确的高收率预测对于化学家来说至关重要。然而，真实世界数据的不平衡分布导致了现有方法在高收率预测方面的性能差距。",
    "en_tdlr": "This paper revisits yield prediction in chemical reactions from an imbalanced regression perspective. Accurate prediction of high yields is crucial for chemists in synthesis planning. However, the imbalance in real-world data leads to a performance gap in high-yield predictions using existing methods."
}