{
    "title": "Guided Quantum Compression for Higgs Identification",
    "abstract": "arXiv:2402.09524v1 Announce Type: cross  Abstract: Quantum machine learning provides a fundamentally novel and promising approach to analyzing data. However, many data sets are too complex for currently available quantum computers. Consequently, quantum machine learning applications conventionally resort to dimensionality reduction algorithms, e.g., auto-encoders, before passing data through the quantum models. We show that using a classical auto-encoder as an independent preprocessing step can significantly decrease the classification performance of a quantum machine learning algorithm. To ameliorate this issue, we design an architecture that unifies the preprocessing and quantum classification algorithms into a single trainable model: the guided quantum compression model. The utility of this model is demonstrated by using it to identify the Higgs boson in proton-proton collisions at the LHC, where the conventional approach proves ineffective. Conversely, the guided quantum compressio",
    "link": "https://arxiv.org/abs/2402.09524",
    "context": "Title: Guided Quantum Compression for Higgs Identification\nAbstract: arXiv:2402.09524v1 Announce Type: cross  Abstract: Quantum machine learning provides a fundamentally novel and promising approach to analyzing data. However, many data sets are too complex for currently available quantum computers. Consequently, quantum machine learning applications conventionally resort to dimensionality reduction algorithms, e.g., auto-encoders, before passing data through the quantum models. We show that using a classical auto-encoder as an independent preprocessing step can significantly decrease the classification performance of a quantum machine learning algorithm. To ameliorate this issue, we design an architecture that unifies the preprocessing and quantum classification algorithms into a single trainable model: the guided quantum compression model. The utility of this model is demonstrated by using it to identify the Higgs boson in proton-proton collisions at the LHC, where the conventional approach proves ineffective. Conversely, the guided quantum compressio",
    "path": "papers/24/02/2402.09524.json",
    "total_tokens": 854,
    "translated_title": "Higgs鉴别的引导量子压缩",
    "translated_abstract": "arXiv：2402.09524v1 公告类型：交叉摘要：量子机器学习提供了一种基本新颖且有前景的数据分析方法。然而，许多数据集对当前可用的量子计算机来说过于复杂。因此，传统上，量子机器学习应用通过使用降维算法（如自动编码器）在通过量子模型之前对数据进行预处理。我们展示了使用经典自动编码器作为独立的预处理步骤可以显著降低量子机器学习算法的分类性能。为了改善这个问题，我们设计了一种将预处理和量子分类算法统一到单个可训练模型中的架构：引导量子压缩模型。通过使用该模型在LHC的质子-质子碰撞中鉴别希格斯玻色子的实用性得到了证明，而传统方法则无效。",
    "tldr": "Higgs鉴别的引导量子压缩模型将预处理和量子分类算法统一为可训练模型，解决了量子机器学习中使用自动编码器导致分类性能降低的问题，能够有效鉴别LHC中的希格斯玻色子。",
    "en_tdlr": "The guided quantum compression model for Higgs identification unifies preprocessing and quantum classification algorithms into a trainable model, resolving the issue of decreased classification performance caused by using auto-encoders in quantum machine learning and effectively identifying the Higgs boson in the LHC."
}