{
    "title": "T-Stitch: Accelerating Sampling in Pre-Trained Diffusion Models with Trajectory Stitching",
    "abstract": "arXiv:2402.14167v1 Announce Type: cross  Abstract: Sampling from diffusion probabilistic models (DPMs) is often expensive for high-quality image generation and typically requires many steps with a large model. In this paper, we introduce sampling Trajectory Stitching T-Stitch, a simple yet efficient technique to improve the sampling efficiency with little or no generation degradation. Instead of solely using a large DPM for the entire sampling trajectory, T-Stitch first leverages a smaller DPM in the initial steps as a cheap drop-in replacement of the larger DPM and switches to the larger DPM at a later stage. Our key insight is that different diffusion models learn similar encodings under the same training data distribution and smaller models are capable of generating good global structures in the early steps. Extensive experiments demonstrate that T-Stitch is training-free, generally applicable for different architectures, and complements most existing fast sampling techniques with f",
    "link": "https://arxiv.org/abs/2402.14167",
    "context": "Title: T-Stitch: Accelerating Sampling in Pre-Trained Diffusion Models with Trajectory Stitching\nAbstract: arXiv:2402.14167v1 Announce Type: cross  Abstract: Sampling from diffusion probabilistic models (DPMs) is often expensive for high-quality image generation and typically requires many steps with a large model. In this paper, we introduce sampling Trajectory Stitching T-Stitch, a simple yet efficient technique to improve the sampling efficiency with little or no generation degradation. Instead of solely using a large DPM for the entire sampling trajectory, T-Stitch first leverages a smaller DPM in the initial steps as a cheap drop-in replacement of the larger DPM and switches to the larger DPM at a later stage. Our key insight is that different diffusion models learn similar encodings under the same training data distribution and smaller models are capable of generating good global structures in the early steps. Extensive experiments demonstrate that T-Stitch is training-free, generally applicable for different architectures, and complements most existing fast sampling techniques with f",
    "path": "papers/24/02/2402.14167.json",
    "total_tokens": 944,
    "translated_title": "T-Stitch：使用轨迹拼接加速预训练扩散模型中的采样",
    "translated_abstract": "从扩散概率模型（DPMs）进行采样对于高质量图像生成往往是昂贵的，通常需要许多步骤和大型模型。本文介绍了一种名为Trajectory Stitching T-Stitch的采样技术，这是一种简单而高效的技术，可以在几乎不降低生成质量的情况下提高采样效率。T-Stitch不同于仅仅使用一个大型DPM进行整个采样轨迹，而是首先利用较小的DPM作为初始步骤中较为廉价的替代方案，然后在后期切换到大型DPM。我们的关键见解是，不同的扩散模型在相同的训练数据分布下学习相似的编码，并且较小的模型能够在早期步骤中生成良好的全局结构。大量实验证明，T-Stitch无需训练，通常适用于不同架构，并且与大多数现有的快速采样技术相辅相成。",
    "tldr": "T-Stitch提出了一种轨迹拼接的采样技术，能够在几乎不降低生成质量的情况下提高采样效率，通过在初始阶段使用较小的DPM来生成全局结构，然后切换到较大的DPM，从而实现高效的采样。",
    "en_tdlr": "T-Stitch introduces a trajectory stitching sampling technique that improves sampling efficiency with little or no generation degradation by using a smaller DPM in the initial steps to generate global structures and switching to a larger DPM, without the need for training, and compatible with various architectures."
}