{
    "title": "Cumulative Distribution Function based General Temporal Point Processes",
    "abstract": "Temporal Point Processes (TPPs) hold a pivotal role in modeling event sequences across diverse domains, including social networking and e-commerce, and have significantly contributed to the advancement of recommendation systems and information retrieval strategies. Through the analysis of events such as user interactions and transactions, TPPs offer valuable insights into behavioral patterns, facilitating the prediction of future trends. However, accurately forecasting future events remains a formidable challenge due to the intricate nature of these patterns. The integration of Neural Networks with TPPs has ushered in the development of advanced deep TPP models. While these models excel at processing complex and nonlinear temporal data, they encounter limitations in modeling intensity functions, grapple with computational complexities in integral computations, and struggle to capture long-range temporal dependencies effectively. In this study, we introduce the CuFun model, representing",
    "link": "https://arxiv.org/abs/2402.00388",
    "context": "Title: Cumulative Distribution Function based General Temporal Point Processes\nAbstract: Temporal Point Processes (TPPs) hold a pivotal role in modeling event sequences across diverse domains, including social networking and e-commerce, and have significantly contributed to the advancement of recommendation systems and information retrieval strategies. Through the analysis of events such as user interactions and transactions, TPPs offer valuable insights into behavioral patterns, facilitating the prediction of future trends. However, accurately forecasting future events remains a formidable challenge due to the intricate nature of these patterns. The integration of Neural Networks with TPPs has ushered in the development of advanced deep TPP models. While these models excel at processing complex and nonlinear temporal data, they encounter limitations in modeling intensity functions, grapple with computational complexities in integral computations, and struggle to capture long-range temporal dependencies effectively. In this study, we introduce the CuFun model, representing",
    "path": "papers/24/02/2402.00388.json",
    "total_tokens": 835,
    "translated_title": "基于累积分布函数的通用时间点过程",
    "translated_abstract": "时间点过程在建模各个领域中的事件序列（包括社交网络和电子商务）中发挥着关键作用，并对推荐系统和信息检索策略的进展做出了重大贡献。通过分析用户交互和交易等事件，时间点过程提供了有价值的行为模式洞察，有助于预测未来的趋势。然而，由于这些模式的复杂性，准确预测未来事件仍然是一个巨大挑战。将神经网络与时间点过程相结合，开发了先进的深度时间点过程模型。虽然这些模型在处理复杂和非线性时间数据方面表现出色，但在建模强度函数、复杂积分计算和有效捕捉长期时序依赖方面存在局限性。在本研究中，我们介绍了CuFun模型，该模型代表了一种新的方法来解决这些问题。",
    "tldr": "本研究引入了CuFun模型，基于累积分布函数的通用时间点过程，解决了深度时间点过程模型中的强度函数建模、积分计算复杂性和长期时序依赖性捕捉的问题。"
}