{
    "title": "Awareness of self-control",
    "abstract": "arXiv:2402.11072v1 Announce Type: new  Abstract: Economists modeled self-control problems in decisions of people with the time-inconsistence preferences model. They argued that the source of self-control problems could be uncertainty and temptation. This paper uses an experimental test offered to individuals instantaneous reward and future rewards to measure awareness of self-control problems in a tempting condition and also measure the effect of commitment and flexibility cost on their welfare. The quasi-hyperbolic discounting model with time discount factor and present bias at the same time was used for making a model for measuring awareness and choice reversal conditions. The test showed 66% awareness of self-control (partially naive behaviors) in individuals. The welfare implication for individuals increased with commitment and flexibility costs. The result can be useful in marketing and policy-making fields design precisely offers for customers and society.",
    "link": "https://arxiv.org/abs/2402.11072",
    "context": "Title: Awareness of self-control\nAbstract: arXiv:2402.11072v1 Announce Type: new  Abstract: Economists modeled self-control problems in decisions of people with the time-inconsistence preferences model. They argued that the source of self-control problems could be uncertainty and temptation. This paper uses an experimental test offered to individuals instantaneous reward and future rewards to measure awareness of self-control problems in a tempting condition and also measure the effect of commitment and flexibility cost on their welfare. The quasi-hyperbolic discounting model with time discount factor and present bias at the same time was used for making a model for measuring awareness and choice reversal conditions. The test showed 66% awareness of self-control (partially naive behaviors) in individuals. The welfare implication for individuals increased with commitment and flexibility costs. The result can be useful in marketing and policy-making fields design precisely offers for customers and society.",
    "path": "papers/24/02/2402.11072.json",
    "total_tokens": 820,
    "translated_title": "自控意识的认知",
    "translated_abstract": "经济学家使用时间不一致性偏好模型对具有自控问题的人们在决策中进行建模。他们认为自控问题的根源可能是不确定性和诱惑。本文通过对个体提供即时奖励和未来奖励的实验测试，衡量了在诱人条件下自控问题的认知，并衡量了承诺和灵活成本对其福利的影响。该研究使用了带有时间折现因子和现在偏差的准双曲线贴现模型，用于制定衡量意识和选择颠倒条件的模型。测试显示66%的个体具有自控意识（部分天真行为）。对于个体，福利随着承诺和灵活成本的增加而增加。该结果在精确为客户和社会设计优惠的营销和政策制定领域中可能有用。",
    "tldr": "该论文通过实验测试发现在诱人条件下有66%的个体具有自控意识，同时表明承诺和灵活成本对个体福利的影响，对营销和政策制定领域提供可靠参考。",
    "en_tdlr": "This paper finds through experimental testing that 66% of individuals have awareness of self-control in tempting conditions, and shows the impact of commitment and flexibility costs on individual welfare, providing valuable insights for the fields of marketing and policy-making."
}