{
    "title": "A Fast Method for Lasso and Logistic Lasso",
    "abstract": "We propose a fast method for solving compressed sensing, Lasso regression, and Logistic Lasso regression problems that iteratively runs an appropriate solver using an active set approach. We design a strategy to update the active set that achieves a large speedup over a single call of several solvers, including gradient projection for sparse reconstruction (GPSR), lassoglm of Matlab, and glmnet. For compressed sensing, the hybrid of our method and GPSR is 31.41 times faster than GPSR on average for Gaussian ensembles and 25.64 faster on average for binary ensembles. For Lasso regression, the hybrid of our method and GPSR achieves a 30.67-fold average speedup in our experiments. In our experiments on Logistic Lasso regression, the hybrid of our method and lassoglm gives an 11.95-fold average speedup, and the hybrid of our method and glmnet gives a 1.40-fold average speedup.",
    "link": "https://arxiv.org/abs/2402.02463",
    "context": "Title: A Fast Method for Lasso and Logistic Lasso\nAbstract: We propose a fast method for solving compressed sensing, Lasso regression, and Logistic Lasso regression problems that iteratively runs an appropriate solver using an active set approach. We design a strategy to update the active set that achieves a large speedup over a single call of several solvers, including gradient projection for sparse reconstruction (GPSR), lassoglm of Matlab, and glmnet. For compressed sensing, the hybrid of our method and GPSR is 31.41 times faster than GPSR on average for Gaussian ensembles and 25.64 faster on average for binary ensembles. For Lasso regression, the hybrid of our method and GPSR achieves a 30.67-fold average speedup in our experiments. In our experiments on Logistic Lasso regression, the hybrid of our method and lassoglm gives an 11.95-fold average speedup, and the hybrid of our method and glmnet gives a 1.40-fold average speedup.",
    "path": "papers/24/02/2402.02463.json",
    "total_tokens": 868,
    "translated_title": "一种快速的Lasso和Logistic Lasso方法",
    "translated_abstract": "我们提出了一种快速解决压缩感知、Lasso回归和Logistic Lasso回归问题的方法，该方法使用主动集方法迭代运行适当的求解器。我们设计了一种更新主动集的策略，相比于单次调用多个求解器（包括Matlab的lassoglm和glmnet以及用于稀疏重构的梯度投影算法GPSR），能够实现大幅加速。对于压缩感知，我们的方法与GPSR的混合平均速度提高了31.41倍（对于高斯系列）和25.64倍（对于二进制系列）。在Lasso回归实验中，我们的方法与GPSR的混合平均速度提高了30.67倍。在Logistic Lasso回归的实验中，我们的方法与lassoglm的混合平均速度提高了11.95倍，与glmnet的混合平均速度提高了1.40倍。",
    "tldr": "本论文提出了一种快速解决Lasso和Logistic Lasso问题的方法，通过采用主动集方法和适当的求解器，成功实现了加速。在压缩感知、Lasso回归和Logistic Lasso回归实验中，与传统方法相比，我们的方法平均能提高约30倍的速度。",
    "en_tdlr": "This paper presents a fast method for solving Lasso and Logistic Lasso problems, achieving a significant speedup compared to traditional methods in compressed sensing, Lasso regression, and Logistic Lasso regression experiments."
}