{
    "title": "Subject-Independent Deep Architecture for EEG-based Motor Imagery Classification",
    "abstract": "arXiv:2402.09438v1 Announce Type: cross  Abstract: Motor imagery (MI) classification based on electroencephalogram (EEG) is a widely-used technique in non-invasive brain-computer interface (BCI) systems. Since EEG recordings suffer from heterogeneity across subjects and labeled data insufficiency, designing a classifier that performs the MI independently from the subject with limited labeled samples would be desirable. To overcome these limitations, we propose a novel subject-independent semi-supervised deep architecture (SSDA). The proposed SSDA consists of two parts: an unsupervised and a supervised element. The training set contains both labeled and unlabeled data samples from multiple subjects. First, the unsupervised part, known as the columnar spatiotemporal auto-encoder (CST-AE), extracts latent features from all the training samples by maximizing the similarity between the original and reconstructed data. A dimensional scaling approach is employed to reduce the dimensionality o",
    "link": "https://arxiv.org/abs/2402.09438",
    "context": "Title: Subject-Independent Deep Architecture for EEG-based Motor Imagery Classification\nAbstract: arXiv:2402.09438v1 Announce Type: cross  Abstract: Motor imagery (MI) classification based on electroencephalogram (EEG) is a widely-used technique in non-invasive brain-computer interface (BCI) systems. Since EEG recordings suffer from heterogeneity across subjects and labeled data insufficiency, designing a classifier that performs the MI independently from the subject with limited labeled samples would be desirable. To overcome these limitations, we propose a novel subject-independent semi-supervised deep architecture (SSDA). The proposed SSDA consists of two parts: an unsupervised and a supervised element. The training set contains both labeled and unlabeled data samples from multiple subjects. First, the unsupervised part, known as the columnar spatiotemporal auto-encoder (CST-AE), extracts latent features from all the training samples by maximizing the similarity between the original and reconstructed data. A dimensional scaling approach is employed to reduce the dimensionality o",
    "path": "papers/24/02/2402.09438.json",
    "total_tokens": 947,
    "translated_title": "基于EEG的无主题深度架构用于运动想象分类",
    "translated_abstract": "基于脑电图(EEG)的运动想象(MI)分类是非侵入性脑-计算机接口(BCI)系统中广泛使用的技术。由于受到不同受试者之间的异质性和标记数据不足的影响，设计一个能够在有限标记样本情况下独立于受试者进行MI分类的分类器是可取的。为了克服这些限制，我们提出了一种新颖的基于无主题半监督深度架构(SSDA)的方法。所提出的SSDA包含两部分：无监督部分和监督部分。训练集包含来自多个受试者的有标记和无标记数据样本。首先，无监督部分称为列式时空自编码器(CST-AE)，通过最大化原始数据和重构数据之间的相似度来提取所有训练样本的潜在特征。采用尺度缩放方法来降低维度。",
    "tldr": "本研究提出了一种基于无主题深度架构的方法，用于EEG信号的运动想象分类。该方法通过无监督和半监督的方式进行训练，能够在有限的标记样本情况下独立地对不同受试者进行分类。具体而言，通过无监督学习获得潜在特征，然后使用监督学习进行分类。"
}