{
    "title": "Learning Inverse Kinodynamics for Autonomous Vehicle Drifting",
    "abstract": "arXiv:2402.14928v1 Announce Type: cross  Abstract: In this work, we explore a data-driven learning-based approach to learning the kinodynamic model of a small autonomous vehicle, and observe the effect it has on motion planning, specifically autonomous drifting. When executing a motion plan in the real world, there are numerous causes for error, and what is planned is often not what is executed on the actual car. Learning a kinodynamic planner based off of inertial measurements and executed commands can help us learn the world state. In our case, we look towards the realm of drifting; it is a complex maneuver that requires a smooth enough surface, high enough speed, and a drastic change in velocity. We attempt to learn the kinodynamic model for these drifting maneuvers, and attempt to tighten the slip of the car. Our approach is able to learn a kinodynamic model for high-speed circular navigation, and is able to avoid obstacles on an autonomous drift at high speed by correcting an exec",
    "link": "https://arxiv.org/abs/2402.14928",
    "context": "Title: Learning Inverse Kinodynamics for Autonomous Vehicle Drifting\nAbstract: arXiv:2402.14928v1 Announce Type: cross  Abstract: In this work, we explore a data-driven learning-based approach to learning the kinodynamic model of a small autonomous vehicle, and observe the effect it has on motion planning, specifically autonomous drifting. When executing a motion plan in the real world, there are numerous causes for error, and what is planned is often not what is executed on the actual car. Learning a kinodynamic planner based off of inertial measurements and executed commands can help us learn the world state. In our case, we look towards the realm of drifting; it is a complex maneuver that requires a smooth enough surface, high enough speed, and a drastic change in velocity. We attempt to learn the kinodynamic model for these drifting maneuvers, and attempt to tighten the slip of the car. Our approach is able to learn a kinodynamic model for high-speed circular navigation, and is able to avoid obstacles on an autonomous drift at high speed by correcting an exec",
    "path": "papers/24/02/2402.14928.json",
    "total_tokens": 882,
    "translated_title": "学习逆运动学以实现自动车漂移",
    "translated_abstract": "在这项工作中，我们探索了一种基于数据驱动的学习方法，用于学习小型自动车的运动学模型，并观察其对运动规划特别是自主漂移的影响。在现实世界中执行运动规划时，存在许多导致错误的原因，计划的内容通常与实际汽车上执行的内容不同。基于惯性测量和执行命令学习动力学规划器可以帮助我们学习世界状态。在我们的情况下，我们将目光转向漂移领域；漂移是一种复杂的演练，需要足够平滑的表面、足够高的速度和速度的急剧变化。我们尝试学习这些漂移演练的动力学模型，并尝试减小车辆的侧滑。我们的方法能够学习高速圆形航行的运动学模型，并能够通过校正自主高速漂移上的障碍物来避免障碍物。",
    "tldr": "通过数据驱动的方法学习小型自动车的运动学模型，特别是为了实现高速圆形导航和自主漂移，帮助车辆学习世界状态并避开障碍物。",
    "en_tdlr": "Learning the kinodynamic model for a small autonomous vehicle using a data-driven approach enables high-speed circular navigation and autonomous drifting, assisting the vehicle in learning the world state and avoiding obstacles."
}