{
    "title": "Neural Circuit Diagrams: Robust Diagrams for the Communication, Implementation, and Analysis of Deep Learning Architectures",
    "abstract": "Diagrams matter. Unfortunately, the deep learning community has no standard method for diagramming architectures. The current combination of linear algebra notation and ad-hoc diagrams fails to offer the necessary precision to understand architectures in all their detail. However, this detail is critical for faithful implementation, mathematical analysis, further innovation, and ethical assurances. I present neural circuit diagrams, a graphical language tailored to the needs of communicating deep learning architectures. Neural circuit diagrams naturally keep track of the changing arrangement of data, precisely show how operations are broadcast over axes, and display the critical parallel behavior of linear operations. A lingering issue with existing diagramming methods is the inability to simultaneously express the detail of axes and the free arrangement of data, which neural circuit diagrams solve. Their compositional structure is analogous to code, creating a close correspondence bet",
    "link": "https://arxiv.org/abs/2402.05424",
    "context": "Title: Neural Circuit Diagrams: Robust Diagrams for the Communication, Implementation, and Analysis of Deep Learning Architectures\nAbstract: Diagrams matter. Unfortunately, the deep learning community has no standard method for diagramming architectures. The current combination of linear algebra notation and ad-hoc diagrams fails to offer the necessary precision to understand architectures in all their detail. However, this detail is critical for faithful implementation, mathematical analysis, further innovation, and ethical assurances. I present neural circuit diagrams, a graphical language tailored to the needs of communicating deep learning architectures. Neural circuit diagrams naturally keep track of the changing arrangement of data, precisely show how operations are broadcast over axes, and display the critical parallel behavior of linear operations. A lingering issue with existing diagramming methods is the inability to simultaneously express the detail of axes and the free arrangement of data, which neural circuit diagrams solve. Their compositional structure is analogous to code, creating a close correspondence bet",
    "path": "papers/24/02/2402.05424.json",
    "total_tokens": 858,
    "translated_title": "神经电路图：用于深度学习架构的通信、实现和分析的稳健图示方法",
    "translated_abstract": "图示方法很重要。不幸的是，深度学习界缺乏一种标准的方法来绘制架构图。当前的线性代数符号和临时图示的组合无法提供足够精确的细节，以理解架构的所有细节。然而，这些细节对于忠实的实现、数学分析、进一步的创新和道德保证至关重要。本文提出了神经电路图，这是一种专门针对深度学习架构通信需求的图形语言。神经电路图自然地跟踪数据的变化排列，准确地显示操作如何在坐标轴上广播，并展示线性操作的重要并行行为。现有图示方法的一个悬而未决的问题是无法同时表达坐标轴的细节和数据的自由排列，而神经电路图则解决了这个问题。它们的组合结构类似于代码，创建了一个密切的对应关系。",
    "tldr": "提出了神经电路图，一种适用于深度学习架构通信的图形语言，可以准确地显示数据排列的变化、操作在坐标轴上的广播方式和线性操作的重要并行行为。",
    "en_tdlr": "Introducing neural circuit diagrams, a graphical language tailored for communicating deep learning architectures, accurately representing the changing arrangement of data, broadcasting of operations over axes, and the parallel behavior of linear operations."
}