{
    "title": "Complexity Reduction in Machine Learning-Based Wireless Positioning: Minimum Description Features",
    "abstract": "arXiv:2402.09580v1 Announce Type: new  Abstract: A recent line of research has been investigating deep learning approaches to wireless positioning (WP). Although these WP algorithms have demonstrated high accuracy and robust performance against diverse channel conditions, they also have a major drawback: they require processing high-dimensional features, which can be prohibitive for mobile applications. In this work, we design a positioning neural network (P-NN) that substantially reduces the complexity of deep learning-based WP through carefully crafted minimum description features. Our feature selection is based on maximum power measurements and their temporal locations to convey information needed to conduct WP. We also develop a novel methodology for adaptively selecting the size of feature space, which optimizes over balancing the expected amount of useful information and classification capability, quantified using information-theoretic measures on the signal bin selection. Numeri",
    "link": "https://arxiv.org/abs/2402.09580",
    "context": "Title: Complexity Reduction in Machine Learning-Based Wireless Positioning: Minimum Description Features\nAbstract: arXiv:2402.09580v1 Announce Type: new  Abstract: A recent line of research has been investigating deep learning approaches to wireless positioning (WP). Although these WP algorithms have demonstrated high accuracy and robust performance against diverse channel conditions, they also have a major drawback: they require processing high-dimensional features, which can be prohibitive for mobile applications. In this work, we design a positioning neural network (P-NN) that substantially reduces the complexity of deep learning-based WP through carefully crafted minimum description features. Our feature selection is based on maximum power measurements and their temporal locations to convey information needed to conduct WP. We also develop a novel methodology for adaptively selecting the size of feature space, which optimizes over balancing the expected amount of useful information and classification capability, quantified using information-theoretic measures on the signal bin selection. Numeri",
    "path": "papers/24/02/2402.09580.json",
    "total_tokens": 826,
    "translated_title": "基于机器学习的无线定位中的复杂度降低：最小描述特征",
    "translated_abstract": "最近的一系列研究一直致力于基于深度学习的无线定位（WP）。尽管这些WP算法在不同信道条件下表现出了高精度和鲁棒性，但它们也存在一个主要缺点：它们需要处理高维特征，这对于移动应用来说可能是禁止的。在本工作中，我们设计了一个定位神经网络（P-NN），通过精心设计的最小描述特征，大大降低了基于深度学习的WP的复杂度。我们的特征选择基于最大功率测量及其时间位置，以传达进行WP所需的信息。我们还开发了一种新的方法来自适应地选择特征空间的大小，该方法通过在信号二进制选择上使用信息论度量，优化了期望有用信息量和分类能力之间的平衡。",
    "tldr": "本文设计了一种定位神经网络（P-NN），通过最小描述特征降低了基于深度学习的无线定位中的复杂度，并开发了一种新的方法来自适应地选择特征空间的大小。",
    "en_tdlr": "This paper presents a positioning neural network (P-NN) that reduces the complexity of deep learning-based wireless positioning by utilizing carefully crafted minimum description features. It also introduces a novel methodology for adaptively selecting the size of feature space."
}