{
    "title": "Boosting-Based Sequential Meta-Tree Ensemble Construction for Improved Decision Trees",
    "abstract": "A decision tree is one of the most popular approaches in machine learning fields. However, it suffers from the problem of overfitting caused by overly deepened trees. Then, a meta-tree is recently proposed. It solves the problem of overfitting caused by overly deepened trees. Moreover, the meta-tree guarantees statistical optimality based on Bayes decision theory. Therefore, the meta-tree is expected to perform better than the decision tree. In contrast to a single decision tree, it is known that ensembles of decision trees, which are typically constructed boosting algorithms, are more effective in improving predictive performance. Thus, it is expected that ensembles of meta-trees are more effective in improving predictive performance than a single meta-tree, and there are no previous studies that construct multiple meta-trees in boosting. Therefore, in this study, we propose a method to construct multiple meta-trees using a boosting approach. Through experiments with synthetic and ben",
    "link": "https://arxiv.org/abs/2402.06386",
    "context": "Title: Boosting-Based Sequential Meta-Tree Ensemble Construction for Improved Decision Trees\nAbstract: A decision tree is one of the most popular approaches in machine learning fields. However, it suffers from the problem of overfitting caused by overly deepened trees. Then, a meta-tree is recently proposed. It solves the problem of overfitting caused by overly deepened trees. Moreover, the meta-tree guarantees statistical optimality based on Bayes decision theory. Therefore, the meta-tree is expected to perform better than the decision tree. In contrast to a single decision tree, it is known that ensembles of decision trees, which are typically constructed boosting algorithms, are more effective in improving predictive performance. Thus, it is expected that ensembles of meta-trees are more effective in improving predictive performance than a single meta-tree, and there are no previous studies that construct multiple meta-trees in boosting. Therefore, in this study, we propose a method to construct multiple meta-trees using a boosting approach. Through experiments with synthetic and ben",
    "path": "papers/24/02/2402.06386.json",
    "total_tokens": 804,
    "translated_title": "基于Boosting的顺序元树集成构建以改进决策树",
    "translated_abstract": "决策树是机器学习领域中最流行的方法之一。然而，它存在过度加深树形结构导致的过拟合问题。近期有人提出了元树来解决过度加深树形结构导致的过拟合问题。此外，基于贝叶斯决策理论，元树能够保证统计上的最优性。因此，相较于决策树，我们期望元树表现更好。与单个决策树相比，已知由提升算法构造的决策树集成在提高预测性能方面更为有效。因此，我们期望由元树集成来提高预测性能比单个元树更有效，并且以前没有研究使用提升方法构建多个元树。因此，在本研究中，我们提出了使用提升方法构建多个元树的方法。",
    "tldr": "本研究提出了一种使用提升方法构建多个元树的方法，旨在改进决策树的预测性能。",
    "en_tdlr": "This study proposes a method to construct multiple meta-trees using a boosting approach, aiming to improve the predictive performance of decision trees."
}