{
    "title": "Random Silicon Sampling: Simulating Human Sub-Population Opinion Using a Large Language Model Based on Group-Level Demographic Information",
    "abstract": "arXiv:2402.18144v1 Announce Type: new  Abstract: Large language models exhibit societal biases associated with demographic information, including race, gender, and others. Endowing such language models with personalities based on demographic data can enable generating opinions that align with those of humans. Building on this idea, we propose \"random silicon sampling,\" a method to emulate the opinions of the human population sub-group. Our study analyzed 1) a language model that generates the survey responses that correspond with a human group based solely on its demographic distribution and 2) the applicability of our methodology across various demographic subgroups and thematic questions. Through random silicon sampling and using only group-level demographic information, we discovered that language models can generate response distributions that are remarkably similar to the actual U.S. public opinion polls. Moreover, we found that the replicability of language models varies dependin",
    "link": "https://arxiv.org/abs/2402.18144",
    "context": "Title: Random Silicon Sampling: Simulating Human Sub-Population Opinion Using a Large Language Model Based on Group-Level Demographic Information\nAbstract: arXiv:2402.18144v1 Announce Type: new  Abstract: Large language models exhibit societal biases associated with demographic information, including race, gender, and others. Endowing such language models with personalities based on demographic data can enable generating opinions that align with those of humans. Building on this idea, we propose \"random silicon sampling,\" a method to emulate the opinions of the human population sub-group. Our study analyzed 1) a language model that generates the survey responses that correspond with a human group based solely on its demographic distribution and 2) the applicability of our methodology across various demographic subgroups and thematic questions. Through random silicon sampling and using only group-level demographic information, we discovered that language models can generate response distributions that are remarkably similar to the actual U.S. public opinion polls. Moreover, we found that the replicability of language models varies dependin",
    "path": "papers/24/02/2402.18144.json",
    "total_tokens": 823,
    "translated_title": "随机硅抽样：基于群体级别人口统计信息的大型语言模型模拟人类亚人口意见",
    "translated_abstract": "大型语言模型表现出与人口统计信息相关的社会偏见，包括种族、性别等。为这些语言模型赋予基于人口数据的个性可以实现生成与人类观点一致的意见。基于这一想法，我们提出了“随机硅抽样”，一种方法来模拟人类种群亚组的观点。我们的研究分析了：1）仅基于其人口分布生成与人类群体对应的调查回应的语言模型；2）我们的方法在不同人口子群和主题问题中的适用性。通过随机硅抽样并仅使用群体级别的人口信息，我们发现语言模型可以生成与实际美国公共舆论调查非常相似的回应分布。此外，我们发现语言模型的可复制性取决于不同因",
    "tldr": "通过随机硅抽样方法，可以模拟人类种群亚组的意见，并发现语言模型可以生成回应分布与实际美国公共舆论调查非常相似。",
    "en_tdlr": "Random silicon sampling method can simulate human sub-population opinions and language models can generate response distributions that are remarkably similar to actual U.S. public opinion polls."
}