{
    "title": "Structure Guided Prompt: Instructing Large Language Model in Multi-Step Reasoning by Exploring Graph Structure of the Text",
    "abstract": "arXiv:2402.13415v1 Announce Type: new  Abstract: Although Large Language Models (LLMs) excel at addressing straightforward reasoning tasks, they frequently struggle with difficulties when confronted by more complex multi-step reasoning due to a range of factors. Firstly, natural language often encompasses complex relationships among entities, making it challenging to maintain a clear reasoning chain over longer spans. Secondly, the abundance of linguistic diversity means that the same entities and relationships can be expressed using different terminologies and structures, complicating the task of identifying and establishing connections between multiple pieces of information. Graphs provide an effective solution to represent data rich in relational information and capture long-term dependencies among entities. To harness the potential of graphs, our paper introduces Structure Guided Prompt, an innovative three-stage task-agnostic prompting framework designed to improve the multi-step ",
    "link": "https://arxiv.org/abs/2402.13415",
    "context": "Title: Structure Guided Prompt: Instructing Large Language Model in Multi-Step Reasoning by Exploring Graph Structure of the Text\nAbstract: arXiv:2402.13415v1 Announce Type: new  Abstract: Although Large Language Models (LLMs) excel at addressing straightforward reasoning tasks, they frequently struggle with difficulties when confronted by more complex multi-step reasoning due to a range of factors. Firstly, natural language often encompasses complex relationships among entities, making it challenging to maintain a clear reasoning chain over longer spans. Secondly, the abundance of linguistic diversity means that the same entities and relationships can be expressed using different terminologies and structures, complicating the task of identifying and establishing connections between multiple pieces of information. Graphs provide an effective solution to represent data rich in relational information and capture long-term dependencies among entities. To harness the potential of graphs, our paper introduces Structure Guided Prompt, an innovative three-stage task-agnostic prompting framework designed to improve the multi-step ",
    "path": "papers/24/02/2402.13415.json",
    "total_tokens": 844,
    "translated_title": "结构引导提示: 通过探索文本的图结构，在多步推理中指导大型语言模型",
    "translated_abstract": "虽然大型语言模型(LLMs)擅长处理直接推理任务，但在面对更复杂的多步推理时经常会遇到困难，原因有多种。首先，自然语言中经常包含实体之间的复杂关系，使得在较长的范围内保持清晰的推理链变得具有挑战性。其次，语言多样性的丰富意味着相同的实体和关系可以用不同的术语和结构表达，使得识别和建立多个信息片段之间的连接任务变得复杂。图提供了一种有效的解决方案，可以表示富含关系信息的数据，并捕捉实体之间的长期依赖关系。为了利用图的潜力，本文介绍了结构引导提示，这是一个创新的三阶段任务无关提示框架，旨在改善多步推理。",
    "tldr": "本论文介绍了一种结构引导提示框架，旨在通过探索文本的图结构，指导大型语言模型进行多步推理，以解决推理过程中的复杂关系和多样性带来的困难。",
    "en_tdlr": "This paper introduces a structure guided prompting framework aiming to instruct large language models in multi-step reasoning by exploring the graph structure of the text, addressing the challenges brought by complex relationships and diversity during reasoning process."
}