{
    "title": "Checking the Sufficiently Scattered Condition using a Global Non-Convex Optimization Software",
    "abstract": "The sufficiently scattered condition (SSC) is a key condition in the study of identifiability of various matrix factorization problems, including nonnegative, minimum-volume, symmetric, simplex-structured, and polytopic matrix factorizations. The SSC allows one to guarantee that the computed matrix factorization is unique/identifiable, up to trivial ambiguities. However, this condition is NP-hard to check in general. In this paper, we show that it can however be checked in a reasonable amount of time in realistic scenarios, when the factorization rank is not too large. This is achieved by formulating the problem as a non-convex quadratic optimization problem over a bounded set. We use the global non-convex optimization software Gurobi, and showcase the usefulness of this code on synthetic data sets and on real-world hyperspectral images.",
    "link": "https://arxiv.org/abs/2402.06019",
    "context": "Title: Checking the Sufficiently Scattered Condition using a Global Non-Convex Optimization Software\nAbstract: The sufficiently scattered condition (SSC) is a key condition in the study of identifiability of various matrix factorization problems, including nonnegative, minimum-volume, symmetric, simplex-structured, and polytopic matrix factorizations. The SSC allows one to guarantee that the computed matrix factorization is unique/identifiable, up to trivial ambiguities. However, this condition is NP-hard to check in general. In this paper, we show that it can however be checked in a reasonable amount of time in realistic scenarios, when the factorization rank is not too large. This is achieved by formulating the problem as a non-convex quadratic optimization problem over a bounded set. We use the global non-convex optimization software Gurobi, and showcase the usefulness of this code on synthetic data sets and on real-world hyperspectral images.",
    "path": "papers/24/02/2402.06019.json",
    "total_tokens": 792,
    "translated_title": "使用全局非凸优化软件检验足够分散条件",
    "translated_abstract": "足够分散条件（SSC）是研究各种矩阵分解问题的可辨识性的关键条件，包括非负、最小体积、对称、单纯结构和多面体矩阵分解。足够分散条件可以确保计算得到的矩阵分解是唯一可辨识的，除了平凡的模糊不确定性。然而，一般情况下，这个条件是NP难问题。在本文中，我们展示了在实际场景中，在矩阵的秩不太大时，它可以在合理的时间内进行检查，将问题构建为一个非凸二次优化问题，并在有界集合上求解。我们使用全局非凸优化软件Gurobi，并在合成数据集和实际世界的高光谱图像上展示了该代码的可用性。",
    "tldr": "本文提出了一种使用全局非凸优化软件Gurobi解决足够分散条件检验问题的方法，在实际场景中可以在合理的时间范围内进行检查。",
    "en_tdlr": "This paper presents a method for checking the sufficiently scattered condition (SSC) using the global non-convex optimization software Gurobi, which can be efficiently performed in realistic scenarios."
}