{
    "title": "cecilia: A Machine Learning-Based Pipeline for Measuring Metal Abundances of Helium-rich Polluted White Dwarfs",
    "abstract": "Over the past several decades, conventional spectral analysis techniques of polluted white dwarfs have become powerful tools to learn about the geology and chemistry of extrasolar bodies. Despite their proven capabilities and extensive legacy of scientific discoveries, these techniques are however still limited by their manual, time-intensive, and iterative nature. As a result, they are susceptible to human errors and are difficult to scale up to population-wide studies of metal pollution. This paper seeks to address this problem by presenting cecilia, the first Machine Learning (ML)-powered spectral modeling code designed to measure the metal abundances of intermediate-temperature (10,000$\\leq T_{\\rm eff} \\leq$20,000 K), Helium-rich polluted white dwarfs. Trained with more than 22,000 randomly drawn atmosphere models and stellar parameters, our pipeline aims to overcome the limitations of classical methods by replacing the generation of synthetic spectra from computationally expensive",
    "link": "https://arxiv.org/abs/2402.05176",
    "context": "Title: cecilia: A Machine Learning-Based Pipeline for Measuring Metal Abundances of Helium-rich Polluted White Dwarfs\nAbstract: Over the past several decades, conventional spectral analysis techniques of polluted white dwarfs have become powerful tools to learn about the geology and chemistry of extrasolar bodies. Despite their proven capabilities and extensive legacy of scientific discoveries, these techniques are however still limited by their manual, time-intensive, and iterative nature. As a result, they are susceptible to human errors and are difficult to scale up to population-wide studies of metal pollution. This paper seeks to address this problem by presenting cecilia, the first Machine Learning (ML)-powered spectral modeling code designed to measure the metal abundances of intermediate-temperature (10,000$\\leq T_{\\rm eff} \\leq$20,000 K), Helium-rich polluted white dwarfs. Trained with more than 22,000 randomly drawn atmosphere models and stellar parameters, our pipeline aims to overcome the limitations of classical methods by replacing the generation of synthetic spectra from computationally expensive",
    "path": "papers/24/02/2402.05176.json",
    "total_tokens": 989,
    "translated_title": "cecilia: 一种基于机器学习的用于测量富氦污染白矮星金属丰度的流程",
    "translated_abstract": "在过去的几十年中，传统的污染白矮星光谱分析技术已经成为了了解太阳系外星球地质和化学信息的强大工具。然而，尽管这些技术已经证明了自己的能力并具有广泛的科学发现，它们仍然受到手动、耗时且迭代性的限制。因此，它们容易出现人为错误，并且难以扩展到大规模的金属污染研究。本文通过介绍cecilia，一种基于机器学习的光谱建模代码，旨在解决这个问题。cecilia设计用于测量中温（10,000$\\leq T_{\\rm eff} \\leq$20,000 K）、富氦污染白矮星的金属丰度。通过对超过22,000个随机绘制的大气模型和恒星参数进行训练，我们的流程旨在克服传统方法的限制，可以代替从计算昂贵的合成光谱中生成模拟光谱的步骤。",
    "tldr": "本研究提出了cecilia，一种基于机器学习的光谱建模代码，用于测量富氦污染白矮星的金属丰度。该流程通过训练大量基于随机抽样的模型，旨在克服传统方法的限制，并能够扩展到大规模的研究中。",
    "en_tdlr": "This paper presents cecilia, a machine learning-based spectral modeling code for measuring the metal abundances of helium-rich polluted white dwarfs. Trained with a large number of randomly sampled models, this pipeline aims to overcome the limitations of traditional methods and scale up to large-scale studies."
}