{
    "title": "Explain Variance of Prediction in Variational Time Series Models for Clinical Deterioration Prediction",
    "abstract": "In healthcare, thanks to many model agnostic methods, explainability of the prediction scores made by deep learning applications has improved. However, we note that for daily or hourly risk of deterioration prediction of in-hospital patients, not only the predicted risk probability score matters, but also the variance of the risk scores play key roles in aiding clinical decision making. In this paper, we propose to use delta's method to approximate variance of prediction deterministically, such that the SHAP method can be adopted to attribute contribution of variance. The prediction variance is estimated by sampling the conditional hidden space in variational models and is propagated to input clinical variables based on Shapley values of the variance game. This approach works with variational time series models such as variational recurrent neural networks and variational transformers. We further argue that variational time series models are perfect fits for achieving a balance between",
    "link": "https://arxiv.org/abs/2402.06808",
    "context": "Title: Explain Variance of Prediction in Variational Time Series Models for Clinical Deterioration Prediction\nAbstract: In healthcare, thanks to many model agnostic methods, explainability of the prediction scores made by deep learning applications has improved. However, we note that for daily or hourly risk of deterioration prediction of in-hospital patients, not only the predicted risk probability score matters, but also the variance of the risk scores play key roles in aiding clinical decision making. In this paper, we propose to use delta's method to approximate variance of prediction deterministically, such that the SHAP method can be adopted to attribute contribution of variance. The prediction variance is estimated by sampling the conditional hidden space in variational models and is propagated to input clinical variables based on Shapley values of the variance game. This approach works with variational time series models such as variational recurrent neural networks and variational transformers. We further argue that variational time series models are perfect fits for achieving a balance between",
    "path": "papers/24/02/2402.06808.json",
    "total_tokens": 909,
    "translated_title": "对于临床恶化预测的变分时间序列模型中预测变异性的解释",
    "translated_abstract": "在医疗领域中，由于许多模型无关方法的应用，深度学习应用所作出的预测分数的可解释性得到了改善。然而，对于住院病人的每日或每小时恶化风险预测，不仅预测的风险概率分数很重要，风险分数的变异性也对辅助临床决策起着关键作用。在本文中，我们建议使用delta方法以确定性地近似预测的变异性，从而可以采用SHAP方法来归因于变异的贡献。通过对变分模型中的条件隐藏空间进行采样来估计预测的变异性，并基于变异性博弈的Shapley值将其传播到输入的临床变量上。该方法适用于变分循环神经网络和变分转换器等变分时间序列模型。我们进一步认为，变分时间序列模型非常适合在预测精度和解释性之间取得平衡。",
    "tldr": "本文提出了使用delta方法确定性地近似预测的变异性的方法，并采用SHAP方法来归因于变异的贡献。该方法适用于临床恶化预测中的变分时间序列模型，可以在提高预测精度的同时提供解释性。",
    "en_tdlr": "This paper proposes an approach to deterministically approximate the variance of predictions using the delta method, and attribute the contribution of variance using the SHAP method. This approach is applicable to variational time series models for clinical deterioration prediction, providing interpretability while improving prediction accuracy."
}