{
    "title": "Countries pushing the boundaries of knowledge: the US dominance, China rise, and the EU stagnation",
    "abstract": "arXiv:2402.15263v1 Announce Type: cross  Abstract: Knowing which countries contribute the most to pushing the boundaries of knowledge in science and technology has social and political importance. However, common citation metrics do not adequately measure this contribution. This measure requires more stringent metrics appropriate for the highly influential breakthrough papers that push the boundaries of knowledge, which are very highly cited but very rare. Here I used the recently described Rk index, specifically designed to address this issue. I applied this index to 25 countries and the EU across 10 key research topics, five technological and five biomedical, studying domestic and international collaborative papers independently. In technological topics, the Rk indices of domestic papers show that overall, the USA, China, and the EU are leaders; other countries are clearly behind. The USA is notably ahead of China, and the EU is far behind China. The same approach to biomedical topic",
    "link": "https://arxiv.org/abs/2402.15263",
    "context": "Title: Countries pushing the boundaries of knowledge: the US dominance, China rise, and the EU stagnation\nAbstract: arXiv:2402.15263v1 Announce Type: cross  Abstract: Knowing which countries contribute the most to pushing the boundaries of knowledge in science and technology has social and political importance. However, common citation metrics do not adequately measure this contribution. This measure requires more stringent metrics appropriate for the highly influential breakthrough papers that push the boundaries of knowledge, which are very highly cited but very rare. Here I used the recently described Rk index, specifically designed to address this issue. I applied this index to 25 countries and the EU across 10 key research topics, five technological and five biomedical, studying domestic and international collaborative papers independently. In technological topics, the Rk indices of domestic papers show that overall, the USA, China, and the EU are leaders; other countries are clearly behind. The USA is notably ahead of China, and the EU is far behind China. The same approach to biomedical topic",
    "path": "papers/24/02/2402.15263.json",
    "total_tokens": 939,
    "translated_title": "各国在知识边界上的努力：美国主导地位、中国崛起和欧盟停滞",
    "translated_abstract": "知道哪些国家对推动科学技术知识边界的拓展贡献最大具有社会和政治重要性。然而，常见的引用度量不足以衡量这种贡献。这种度量需要更严格的指标，适用于推动知识边界的极具影响力的突破性论文，这些论文引用量很高但非常罕见。本文使用最近描述的 Rk 指标，专门设计用于解决这个问题。作者将这一指标应用于 25 个国家和欧盟在 10 个关键研究主题上，其中五个是技术主题，五个是生物医学主题，独立地研究了国内和国际合作论文。在技术主题上，国内论文的 Rk 指数显示，总体而言，美国、中国和欧盟处于领先地位；其他国家明显落后。美国明显领先于中国，而欧盟远远落后于中国。生物医学主题采用相同的方法...",
    "tldr": "通过使用 Rk 指标研究了25个国家和欧盟在10个关键研究主题上的贡献，发现在技术领域，美国、中国和欧盟处于领先地位，而欧盟明显落后于中国。",
    "en_tdlr": "By utilizing the Rk index, the study examines the contributions of 25 countries and the EU across 10 key research topics, revealing that in the technological field, the USA, China, and the EU lead, with the EU significantly lagging behind China."
}