{
    "title": "Towards Cohesion-Fairness Harmony: Contrastive Regularization in Individual Fair Graph Clustering",
    "abstract": "arXiv:2402.10756v1 Announce Type: cross  Abstract: Conventional fair graph clustering methods face two primary challenges: i) They prioritize balanced clusters at the expense of cluster cohesion by imposing rigid constraints, ii) Existing methods of both individual and group-level fairness in graph partitioning mostly rely on eigen decompositions and thus, generally lack interpretability. To address these issues, we propose iFairNMTF, an individual Fairness Nonnegative Matrix Tri-Factorization model with contrastive fairness regularization that achieves balanced and cohesive clusters. By introducing fairness regularization, our model allows for customizable accuracy-fairness trade-offs, thereby enhancing user autonomy without compromising the interpretability provided by nonnegative matrix tri-factorization. Experimental evaluations on real and synthetic datasets demonstrate the superior flexibility of iFairNMTF in achieving fairness and clustering performance.",
    "link": "https://arxiv.org/abs/2402.10756",
    "context": "Title: Towards Cohesion-Fairness Harmony: Contrastive Regularization in Individual Fair Graph Clustering\nAbstract: arXiv:2402.10756v1 Announce Type: cross  Abstract: Conventional fair graph clustering methods face two primary challenges: i) They prioritize balanced clusters at the expense of cluster cohesion by imposing rigid constraints, ii) Existing methods of both individual and group-level fairness in graph partitioning mostly rely on eigen decompositions and thus, generally lack interpretability. To address these issues, we propose iFairNMTF, an individual Fairness Nonnegative Matrix Tri-Factorization model with contrastive fairness regularization that achieves balanced and cohesive clusters. By introducing fairness regularization, our model allows for customizable accuracy-fairness trade-offs, thereby enhancing user autonomy without compromising the interpretability provided by nonnegative matrix tri-factorization. Experimental evaluations on real and synthetic datasets demonstrate the superior flexibility of iFairNMTF in achieving fairness and clustering performance.",
    "path": "papers/24/02/2402.10756.json",
    "total_tokens": 858,
    "translated_title": "朝向凝聚-公平-和谐：对比正则化在个体公平图聚类中的应用",
    "translated_abstract": "传统的公平图聚类方法面临两个主要挑战：它们通过施加严格的约束优先考虑平衡的簇，而牺牲了簇的凝聚性；现有的个人和群体级公平方法在图分区中主要依赖于特征值分解，因此通常缺乏可解释性。为了解决这些问题，我们提出了iFairNMTF，这是一种具有对比公平正则化的个体公平非负矩阵三因子分解模型，实现了平衡和凝聚的簇。通过引入公平性正则化，我们的模型允许定制精度-公平度的权衡，从而增强了用户的自主权，而不会影响非负矩阵三因子分解提供的可解释性。在真实和合成数据集上的实验评估表明，iFairNMTF在实现公平性和聚类性能方面具有出色的灵活性。",
    "tldr": "提出了一种对比公平正则化的个体公平非负矩阵三因子分解模型，能够实现平衡和凝聚的簇，并允许用户在精度和公平度之间进行权衡。",
    "en_tdlr": "Proposed an individual fairness nonnegative matrix tri-factorization model with contrastive fairness regularization that achieves balanced and cohesive clusters, allowing users to trade off between accuracy and fairness."
}