{
    "title": "Zero-shot Sequential Neuro-symbolic Reasoning for Automatically Generating Architecture Schematic Designs",
    "abstract": "This paper introduces a novel automated system for generating architecture schematic designs aimed at streamlining complex decision-making at the multifamily real estate development project's outset. Leveraging the combined strengths of generative AI (neuro reasoning) and mathematical program solvers (symbolic reasoning), the method addresses both the reliance on expert insights and technical challenges in architectural schematic design. To address the large-scale and interconnected nature of design decisions needed for designing a whole building, we proposed a novel sequential neuro-symbolic reasoning approach, emulating traditional architecture design processes from initial concept to detailed layout. To remove the need to hand-craft a cost function to approximate the desired objectives, we propose a solution that uses neuro reasoning to generate constraints and cost functions that the symbolic solvers can use to solve. We also incorporate feedback loops for each design stage to ensu",
    "link": "https://arxiv.org/abs/2402.00052",
    "context": "Title: Zero-shot Sequential Neuro-symbolic Reasoning for Automatically Generating Architecture Schematic Designs\nAbstract: This paper introduces a novel automated system for generating architecture schematic designs aimed at streamlining complex decision-making at the multifamily real estate development project's outset. Leveraging the combined strengths of generative AI (neuro reasoning) and mathematical program solvers (symbolic reasoning), the method addresses both the reliance on expert insights and technical challenges in architectural schematic design. To address the large-scale and interconnected nature of design decisions needed for designing a whole building, we proposed a novel sequential neuro-symbolic reasoning approach, emulating traditional architecture design processes from initial concept to detailed layout. To remove the need to hand-craft a cost function to approximate the desired objectives, we propose a solution that uses neuro reasoning to generate constraints and cost functions that the symbolic solvers can use to solve. We also incorporate feedback loops for each design stage to ensu",
    "path": "papers/24/02/2402.00052.json",
    "total_tokens": 845,
    "translated_title": "零射击顺序神经符号推理用于自动生成架构原理图设计",
    "translated_abstract": "本文介绍了一种新颖的自动化系统，用于生成旨在简化多户型房地产项目的复杂决策的架构原理图设计。该方法利用生成AI（神经推理）和数学规划求解器（符号推理）的综合优势，解决了架构原理图设计中专家见解依赖和技术挑战两个方面。为了处理设计整个建筑所需要的大规模和相互关联性决策的特点，我们提出了一种新颖的顺序神经符号推理方法，模拟了从初始概念到详细布局的传统架构设计过程。为了消除手工制作逼近所需目标的成本函数的需要，我们提出了一种解决方案，使用神经推理生成符号求解器可以使用的约束和成本函数进行求解。我们还为每个设计阶段引入了反馈循环，以确保设计的准确性和可迭代性。",
    "tldr": "提出了一种利用神经推理和符号推理相结合的零射击顺序神经符号推理方法，用于自动生成架构原理图设计，解决了专家见解依赖和技术挑战的问题。",
    "en_tdlr": "We propose a zero-shot sequential neuro-symbolic reasoning approach that combines generative AI and mathematical program solvers to automatically generate architecture schematic designs, addressing the reliance on expert insights and technical challenges."
}