{
    "title": "Malaysian English News Decoded: A Linguistic Resource for Named Entity and Relation Extraction",
    "abstract": "arXiv:2402.14521v1 Announce Type: new  Abstract: Standard English and Malaysian English exhibit notable differences, posing challenges for natural language processing (NLP) tasks on Malaysian English. Unfortunately, most of the existing datasets are mainly based on standard English and therefore inadequate for improving NLP tasks in Malaysian English. An experiment using state-of-the-art Named Entity Recognition (NER) solutions on Malaysian English news articles highlights that they cannot handle morphosyntactic variations in Malaysian English. To the best of our knowledge, there is no annotated dataset available to improvise the model. To address these issues, we constructed a Malaysian English News (MEN) dataset, which contains 200 news articles that are manually annotated with entities and relations. We then fine-tuned the spaCy NER tool and validated that having a dataset tailor-made for Malaysian English could improve the performance of NER in Malaysian English significantly. This",
    "link": "https://arxiv.org/abs/2402.14521",
    "context": "Title: Malaysian English News Decoded: A Linguistic Resource for Named Entity and Relation Extraction\nAbstract: arXiv:2402.14521v1 Announce Type: new  Abstract: Standard English and Malaysian English exhibit notable differences, posing challenges for natural language processing (NLP) tasks on Malaysian English. Unfortunately, most of the existing datasets are mainly based on standard English and therefore inadequate for improving NLP tasks in Malaysian English. An experiment using state-of-the-art Named Entity Recognition (NER) solutions on Malaysian English news articles highlights that they cannot handle morphosyntactic variations in Malaysian English. To the best of our knowledge, there is no annotated dataset available to improvise the model. To address these issues, we constructed a Malaysian English News (MEN) dataset, which contains 200 news articles that are manually annotated with entities and relations. We then fine-tuned the spaCy NER tool and validated that having a dataset tailor-made for Malaysian English could improve the performance of NER in Malaysian English significantly. This",
    "path": "papers/24/02/2402.14521.json",
    "total_tokens": 726,
    "translated_title": "马来西亚英语新闻解析：一个用于命名实体和关系抽取的语言资源",
    "translated_abstract": "标准英语和马来西亚英语存在明显差异，在马来西亚英语的自然语言处理（NLP）任务中存在挑战。本文介绍了一个包含200篇新闻文章的马来西亚英语新闻（MEN）数据集，手动对实体和关系进行了标注，并通过对spaCy NER工具进行微调验证了针对马来西亚英语定制的数据集可以显著提高NER在马来西亚英语中的性能。",
    "tldr": "通过构建一个含有实体和关系标注的马来西亚英语新闻数据集，并对spaCy NER工具进行微调，本研究显著改善了马来西亚英语中NER的性能。",
    "en_tdlr": "By constructing a dataset of Malaysian English news articles annotated with entities and relations, and fine-tuning the spaCy NER tool, this study significantly improves the performance of NER in Malaysian English."
}