{
    "title": "OpenTab: Advancing Large Language Models as Open-domain Table Reasoners",
    "abstract": "arXiv:2402.14361v1 Announce Type: new  Abstract: Large Language Models (LLMs) trained on large volumes of data excel at various natural language tasks, but they cannot handle tasks requiring knowledge that has not been trained on previously. One solution is to use a retriever that fetches relevant information to expand LLM's knowledge scope. However, existing textual-oriented retrieval-based LLMs are not ideal on structured table data due to diversified data modalities and large table sizes. In this work, we propose OpenTab, an open-domain table reasoning framework powered by LLMs. Overall, OpenTab leverages table retriever to fetch relevant tables and then generates SQL programs to parse the retrieved tables efficiently. Utilizing the intermediate data derived from the SQL executions, it conducts grounded inference to produce accurate response. Extensive experimental evaluation shows that OpenTab significantly outperforms baselines in both open- and closed-domain settings, achieving u",
    "link": "https://arxiv.org/abs/2402.14361",
    "context": "Title: OpenTab: Advancing Large Language Models as Open-domain Table Reasoners\nAbstract: arXiv:2402.14361v1 Announce Type: new  Abstract: Large Language Models (LLMs) trained on large volumes of data excel at various natural language tasks, but they cannot handle tasks requiring knowledge that has not been trained on previously. One solution is to use a retriever that fetches relevant information to expand LLM's knowledge scope. However, existing textual-oriented retrieval-based LLMs are not ideal on structured table data due to diversified data modalities and large table sizes. In this work, we propose OpenTab, an open-domain table reasoning framework powered by LLMs. Overall, OpenTab leverages table retriever to fetch relevant tables and then generates SQL programs to parse the retrieved tables efficiently. Utilizing the intermediate data derived from the SQL executions, it conducts grounded inference to produce accurate response. Extensive experimental evaluation shows that OpenTab significantly outperforms baselines in both open- and closed-domain settings, achieving u",
    "path": "papers/24/02/2402.14361.json",
    "total_tokens": 884,
    "translated_title": "OpenTab：将大型语言模型推进为开放领域的表格推理器",
    "translated_abstract": "在大量数据上训练的大型语言模型（LLMs）在各种自然语言任务上表现出色，但无法处理需要未经训练的知识的任务。 一种解决方案是使用一个检索器来获取相关信息，以扩展LLM的知识范围。 然而，由于多样化的数据模态和大表格尺寸，现有的面向文本的基于检索的LLMs在结构化表格数据上并不理想。 在这项工作中，我们提出了OpenTab，这是一个由LLMs驱动的开放领域表格推理框架。 总体而言，OpenTab利用表格检索器来获取相关表格，然后生成SQL程序以高效地解析检索到的表格。 利用从SQL执行中导出的中间数据，它进行基于事实的推理以产生准确的响应。 大量实验证明，OpenTab在开放和封闭领域设置中明显优于基线，实现了u",
    "tldr": "OpenTab 是一个开放领域表格推理框架，利用表格检索器扩展了大型语言模型的知识范围，并通过生成SQL程序和基于事实的推理实现了在开放和封闭领域设置中明显优于基线的性能。",
    "en_tdlr": "OpenTab is an open-domain table reasoning framework that extends the knowledge scope of large language models using a table retriever, and achieves significantly better performance than baselines in both open and closed-domain settings through generating SQL programs and grounded inference."
}