{
    "title": "VCD: Knowledge Base Guided Visual Commonsense Discovery in Images",
    "abstract": "arXiv:2402.17213v1 Announce Type: cross  Abstract: Visual commonsense contains knowledge about object properties, relationships, and behaviors in visual data. Discovering visual commonsense can provide a more comprehensive and richer understanding of images, and enhance the reasoning and decision-making capabilities of computer vision systems. However, the visual commonsense defined in existing visual commonsense discovery studies is coarse-grained and incomplete. In this work, we draw inspiration from a commonsense knowledge base ConceptNet in natural language processing, and systematically define the types of visual commonsense. Based on this, we introduce a new task, Visual Commonsense Discovery (VCD), aiming to extract fine-grained commonsense of different types contained within different objects in the image. We accordingly construct a dataset (VCDD) from Visual Genome and ConceptNet for VCD, featuring over 100,000 images and 14 million object-commonsense pairs. We furthermore pro",
    "link": "https://arxiv.org/abs/2402.17213",
    "context": "Title: VCD: Knowledge Base Guided Visual Commonsense Discovery in Images\nAbstract: arXiv:2402.17213v1 Announce Type: cross  Abstract: Visual commonsense contains knowledge about object properties, relationships, and behaviors in visual data. Discovering visual commonsense can provide a more comprehensive and richer understanding of images, and enhance the reasoning and decision-making capabilities of computer vision systems. However, the visual commonsense defined in existing visual commonsense discovery studies is coarse-grained and incomplete. In this work, we draw inspiration from a commonsense knowledge base ConceptNet in natural language processing, and systematically define the types of visual commonsense. Based on this, we introduce a new task, Visual Commonsense Discovery (VCD), aiming to extract fine-grained commonsense of different types contained within different objects in the image. We accordingly construct a dataset (VCDD) from Visual Genome and ConceptNet for VCD, featuring over 100,000 images and 14 million object-commonsense pairs. We furthermore pro",
    "path": "papers/24/02/2402.17213.json",
    "total_tokens": 882,
    "translated_title": "基于知识库的图像视觉常识发现（VCD）",
    "translated_abstract": "图像中的视觉常识包含有关对象属性、关系和行为的知识。发现视觉常识可以提供对图像的更全面和丰富的理解，并增强计算机视觉系统的推理和决策能力。然而，现有的视觉常识发现研究中所定义的视觉常识是粗粒度且不完整的。在这项工作中，我们从自然语言处理中的常识知识库ConceptNet中汲取灵感，并系统地定义了各种类型的视觉常识。基于此，我们引入了一个新任务，即视觉常识发现（VCD），旨在提取图像中不同对象所包含的不同类型的细粒度常识。因此，我们从Visual Genome和ConceptNet中构建了一个名为VCDD的数据集，包括超过10万张图像和1400万个对象-常识对。",
    "tldr": "该论文提出了基于知识库的图像视觉常识发现（VCD）方法，通过定义细粒度的视觉常识类型以及构建包括超过10万张图像和1400万个对象-常识对的数据集，旨在提升计算机视觉系统的推理和决策能力。",
    "en_tdlr": "This paper introduces a Knowledge Base Guided Visual Commonsense Discovery (VCD) method, aiming to enhance the reasoning and decision-making capabilities of computer vision systems by defining fine-grained types of visual commonsense and constructing a dataset with over 100,000 images and 14 million object-commonsense pairs."
}