{
    "title": "A Web-Based Tool for Automatic Data Collection, Curation, and Visualization of Complex Healthcare Survey Studies including Social Network Analysis",
    "abstract": "arXiv:2402.09592v1 Announce Type: new  Abstract: There is a great concern nowadays regarding alcohol consumption and drug abuse, especially in young people. Analyzing the social environment where these adolescents are immersed, as well as a series of measures determining the alcohol abuse risk or personal situation and perception using a number of questionnaires like AUDIT, FAS, KIDSCREEN, and others, it is possible to gain insight into the current situation of a given individual regarding his/her consumption behavior. But this analysis, in order to be achieved, requires the use of tools that can ease the process of questionnaire creation, data gathering, curation and representation, and later analysis and visualization to the user. This research presents the design and construction of a web-based platform able to facilitate each of the mentioned processes by integrating the different phases into an intuitive system with a graphical user interface that hides the complexity underlying e",
    "link": "https://arxiv.org/abs/2402.09592",
    "context": "Title: A Web-Based Tool for Automatic Data Collection, Curation, and Visualization of Complex Healthcare Survey Studies including Social Network Analysis\nAbstract: arXiv:2402.09592v1 Announce Type: new  Abstract: There is a great concern nowadays regarding alcohol consumption and drug abuse, especially in young people. Analyzing the social environment where these adolescents are immersed, as well as a series of measures determining the alcohol abuse risk or personal situation and perception using a number of questionnaires like AUDIT, FAS, KIDSCREEN, and others, it is possible to gain insight into the current situation of a given individual regarding his/her consumption behavior. But this analysis, in order to be achieved, requires the use of tools that can ease the process of questionnaire creation, data gathering, curation and representation, and later analysis and visualization to the user. This research presents the design and construction of a web-based platform able to facilitate each of the mentioned processes by integrating the different phases into an intuitive system with a graphical user interface that hides the complexity underlying e",
    "path": "papers/24/02/2402.09592.json",
    "total_tokens": 919,
    "translated_title": "基于Web的工具用于复杂医疗调查研究的自动数据收集、整理和可视化，包括社交网络分析",
    "translated_abstract": "如今对于饮酒和药物滥用尤其是在年轻人中有着巨大的关注。通过分析这些青少年所处的社交环境，以及一系列衡量酒精滥用风险、个人状态和认知的问卷调查（如AUDIT、FAS、KIDSCREEN等），可以深入了解一个人在饮酒行为方面的实际情况。但为了实现这种分析，需要使用能够简化问卷创建、数据收集、整理和表示以及后续分析和可视化过程的工具。本研究介绍了一个基于Web的平台的设计和构建，该平台能够通过将不同阶段整合为一个直观的系统，并提供图形用户界面来简化上述每个过程。",
    "tldr": "本研究设计和构建了一个基于Web的平台，用于自动化复杂医疗调查研究中数据收集、整理和可视化的过程，包括社交网络分析。该平台提供了直观的图形用户界面，可以简化问卷创建、数据收集和表示等操作，为用户提供便利和深入了解个人饮酒行为的工具。",
    "en_tdlr": "This study presents the design and construction of a web-based platform for automatic data collection, curation, and visualization of complex healthcare survey studies, including social network analysis. The platform provides an intuitive graphical user interface to simplify the process of questionnaire creation, data gathering, and representation, offering users a convenient tool to gain insights into individual alcohol consumption behavior."
}