{
    "title": "Deep learning-driven scheduling algorithm for a single machine problem minimizing the total tardiness",
    "abstract": "arXiv:2402.14847v1 Announce Type: cross  Abstract: In this paper, we investigate the use of the deep learning method for solving a well-known NP-hard single machine scheduling problem with the objective of minimizing the total tardiness. We propose a deep neural network that acts as a polynomial-time estimator of the criterion value used in a single-pass scheduling algorithm based on Lawler's decomposition and symmetric decomposition proposed by Della Croce et al. Essentially, the neural network guides the algorithm by estimating the best splitting of the problem into subproblems. The paper also describes a new method for generating the training data set, which speeds up the training dataset generation and reduces the average optimality gap of solutions. The experimental results show that our machine learning-driven approach can efficiently generalize information from the training phase to significantly larger instances. Even though the instances used in the training phase have from 75",
    "link": "https://arxiv.org/abs/2402.14847",
    "context": "Title: Deep learning-driven scheduling algorithm for a single machine problem minimizing the total tardiness\nAbstract: arXiv:2402.14847v1 Announce Type: cross  Abstract: In this paper, we investigate the use of the deep learning method for solving a well-known NP-hard single machine scheduling problem with the objective of minimizing the total tardiness. We propose a deep neural network that acts as a polynomial-time estimator of the criterion value used in a single-pass scheduling algorithm based on Lawler's decomposition and symmetric decomposition proposed by Della Croce et al. Essentially, the neural network guides the algorithm by estimating the best splitting of the problem into subproblems. The paper also describes a new method for generating the training data set, which speeds up the training dataset generation and reduces the average optimality gap of solutions. The experimental results show that our machine learning-driven approach can efficiently generalize information from the training phase to significantly larger instances. Even though the instances used in the training phase have from 75",
    "path": "papers/24/02/2402.14847.json",
    "total_tokens": 799,
    "translated_title": "基于深度学习的单机问题最小化总滞后的调度算法",
    "translated_abstract": "在本文中，我们研究了使用深度学习方法来解决一个著名的NP难题单机调度问题，目标是最小化总滞后。我们提出了一个深度神经网络，它作为一个多项式时间估计量来用于基于Lawler分解和Della Croce等人提出的对称分解的单遍调度算法。实质上，神经网络通过估计问题划分为子问题的最佳方式来引导算法。本文还描述了一种生成训练数据集的新方法，加快了训练数据集的生成速度，减少了解决方案的平均最优性差距。实验结果表明，我们的机器学习驱动方法能够高效地从训练阶段概括信息到更大规模的实例。即使在训练阶段使用的实例从75",
    "tldr": "本文提出了一种基于深度学习的单机问题调度算法，通过神经网络估计最佳问题划分方式以最小化总滞后。",
    "en_tdlr": "This paper introduces a deep learning-driven scheduling algorithm for a single machine problem, guiding the algorithm by estimating the best splitting of the problem through a neural network to minimize the total tardiness."
}