{
    "title": "Towards Financially Inclusive Credit Products Through Financial Time Series Clustering",
    "abstract": "arXiv:2402.11066v1 Announce Type: new  Abstract: Financial inclusion ensures that individuals have access to financial products and services that meet their needs. As a key contributing factor to economic growth and investment opportunity, financial inclusion increases consumer spending and consequently business development. It has been shown that institutions are more profitable when they provide marginalised social groups access to financial services. Customer segmentation based on consumer transaction data is a well-known strategy used to promote financial inclusion. While the required data is available to modern institutions, the challenge remains that segment annotations are usually difficult and/or expensive to obtain. This prevents the usage of time series classification models for customer segmentation based on domain expert knowledge. As a result, clustering is an attractive alternative to partition customers into homogeneous groups based on the spending behaviour encoded with",
    "link": "https://arxiv.org/abs/2402.11066",
    "context": "Title: Towards Financially Inclusive Credit Products Through Financial Time Series Clustering\nAbstract: arXiv:2402.11066v1 Announce Type: new  Abstract: Financial inclusion ensures that individuals have access to financial products and services that meet their needs. As a key contributing factor to economic growth and investment opportunity, financial inclusion increases consumer spending and consequently business development. It has been shown that institutions are more profitable when they provide marginalised social groups access to financial services. Customer segmentation based on consumer transaction data is a well-known strategy used to promote financial inclusion. While the required data is available to modern institutions, the challenge remains that segment annotations are usually difficult and/or expensive to obtain. This prevents the usage of time series classification models for customer segmentation based on domain expert knowledge. As a result, clustering is an attractive alternative to partition customers into homogeneous groups based on the spending behaviour encoded with",
    "path": "papers/24/02/2402.11066.json",
    "total_tokens": 611,
    "translated_title": "通过金融时间序列聚类实现金融包容性信贷产品",
    "translated_abstract": "金融包容性确保个人能够获得满足其需求的金融产品和服务。利用消费者交易数据进行客户分割是一种促进金融包容的常用策略，然而，对数据标注的需求通常难以获取，这导致了时间序列分类模型在基于领域专家知识进行客户分割时的挑战。",
    "tldr": "通过金融时间序列聚类，解决金融包容性信贷产品中客户分割的挑战",
    "en_tdlr": "Addressing the challenge of customer segmentation in financially inclusive credit products through financial time series clustering."
}