{
    "title": "What is a word?",
    "abstract": "arXiv:2402.12605v1 Announce Type: new  Abstract: In order to design strong paradigms for isolating lexical access and semantics, we need to know what a word is. Surprisingly few linguists and philosophers have a clear model of what a word is, even though words impact basically every aspect of human life. Researchers that regularly publish academic papers about language often rely on outdated, or inaccurate, assumptions about wordhood. This short pedagogical document outlines what the lexicon is most certainly not (though is often mistakenly taken to be), what it might be (based on current good theories), and what some implications for experimental design are.",
    "link": "https://arxiv.org/abs/2402.12605",
    "context": "Title: What is a word?\nAbstract: arXiv:2402.12605v1 Announce Type: new  Abstract: In order to design strong paradigms for isolating lexical access and semantics, we need to know what a word is. Surprisingly few linguists and philosophers have a clear model of what a word is, even though words impact basically every aspect of human life. Researchers that regularly publish academic papers about language often rely on outdated, or inaccurate, assumptions about wordhood. This short pedagogical document outlines what the lexicon is most certainly not (though is often mistakenly taken to be), what it might be (based on current good theories), and what some implications for experimental design are.",
    "path": "papers/24/02/2402.12605.json",
    "total_tokens": 684,
    "translated_title": "什么是一个词？",
    "translated_abstract": "为了设计出能够有效隔离词汇访问和语义的强大范式，我们需要知道一个词是什么。令人惊讶的是，很少有语言学家和哲学家对一个词有着清晰的模型，尽管词汇基本影响着人类生活的方方面面。经常发表关于语言的学术论文的研究人员往往依赖于过时或不准确的关于词性的假设。这篇简短的教育性文件概述了词汇绝对不是什么（尽管经常被错误地认为是什么）、它可能是什么（基于当前的好理论）、以及实验设计的一些影响。",
    "tldr": "研究者探讨了词汇是什么，并指出了现有理论对于词汇的解释及实验设计方面的一些重要影响",
    "en_tdlr": "Researchers discussed what a word is, outlined current good theories on wordhood, and highlighted some implications for experimental design."
}