{
    "title": "Decentralised Traffic Incident Detection via Network Lasso",
    "abstract": "arXiv:2402.18167v1 Announce Type: new  Abstract: Traffic incident detection plays a key role in intelligent transportation systems, which has gained great attention in transport engineering. In the past, traditional machine learning (ML) based detection methods achieved good performance under a centralised computing paradigm, where all data are transmitted to a central server for building ML models therein. Nowadays, deep neural networks based federated learning (FL) has become a mainstream detection approach to enable the model training in a decentralised manner while warranting local data governance. Such neural networks-centred techniques, however, have overshadowed the utility of well-established ML-based detection methods. In this work, we aim to explore the potential of potent conventional ML-based detection models in modern traffic scenarios featured by distributed data. We leverage an elegant but less explored distributed optimisation framework named Network Lasso, with guarant",
    "link": "https://arxiv.org/abs/2402.18167",
    "context": "Title: Decentralised Traffic Incident Detection via Network Lasso\nAbstract: arXiv:2402.18167v1 Announce Type: new  Abstract: Traffic incident detection plays a key role in intelligent transportation systems, which has gained great attention in transport engineering. In the past, traditional machine learning (ML) based detection methods achieved good performance under a centralised computing paradigm, where all data are transmitted to a central server for building ML models therein. Nowadays, deep neural networks based federated learning (FL) has become a mainstream detection approach to enable the model training in a decentralised manner while warranting local data governance. Such neural networks-centred techniques, however, have overshadowed the utility of well-established ML-based detection methods. In this work, we aim to explore the potential of potent conventional ML-based detection models in modern traffic scenarios featured by distributed data. We leverage an elegant but less explored distributed optimisation framework named Network Lasso, with guarant",
    "path": "papers/24/02/2402.18167.json",
    "total_tokens": 840,
    "translated_title": "通过网络套索实现分散式交通事故检测",
    "translated_abstract": "交通事故检测在智能交通系统中起着关键作用，在交通工程领域引起了极大关注。过去，传统的基于机器学习（ML）的检测方法在集中式计算范式下取得了良好的性能，其中所有数据被传输到中央服务器以构建ML模型。如今，基于深度神经网络的联邦学习（FL）已成为一种主流的检测方法，可以在分散式的方式下进行模型训练，同时确保本地数据治理。然而，这种以神经网络为中心的技术掩盖了成熟的基于ML的检测方法的效用。在这项工作中，我们旨在探索在分布式数据环境下，强劲的传统ML-based检测模型在现代交通场景中的潜力。我们利用了一种优雅但鲜为人知的分布式优化框架，名为网络套索。",
    "tldr": "本研究旨在探索在现代交通场景中，针对分布式数据特点，通过利用网络套索这种 less explored 的分布式优化框架，揭示出传统的 ML-based 检测模型的潜力。"
}