{
    "title": "Lying Blindly: Bypassing ChatGPT's Safeguards to Generate Hard-to-Detect Disinformation Claims at Scale",
    "abstract": "As Large Language Models (LLMs) become more proficient, their misuse in large-scale viral disinformation campaigns is a growing concern. This study explores the capability of ChatGPT to generate unconditioned claims about the war in Ukraine, an event beyond its knowledge cutoff, and evaluates whether such claims can be differentiated by human readers and automated tools from human-written ones. We compare war-related claims from ClaimReview, authored by IFCN-registered fact-checkers, and similar short-form content generated by ChatGPT. We demonstrate that ChatGPT can produce realistic, target-specific disinformation cheaply, fast, and at scale, and that these claims cannot be reliably distinguished by humans or existing automated tools.",
    "link": "https://arxiv.org/abs/2402.08467",
    "context": "Title: Lying Blindly: Bypassing ChatGPT's Safeguards to Generate Hard-to-Detect Disinformation Claims at Scale\nAbstract: As Large Language Models (LLMs) become more proficient, their misuse in large-scale viral disinformation campaigns is a growing concern. This study explores the capability of ChatGPT to generate unconditioned claims about the war in Ukraine, an event beyond its knowledge cutoff, and evaluates whether such claims can be differentiated by human readers and automated tools from human-written ones. We compare war-related claims from ClaimReview, authored by IFCN-registered fact-checkers, and similar short-form content generated by ChatGPT. We demonstrate that ChatGPT can produce realistic, target-specific disinformation cheaply, fast, and at scale, and that these claims cannot be reliably distinguished by humans or existing automated tools.",
    "path": "papers/24/02/2402.08467.json",
    "total_tokens": 884,
    "translated_title": "胡乱造谣：绕过ChatGPT的防护措施，大规模生成难以检测的虚假信息声明",
    "translated_abstract": "随着大型语言模型（LLM）变得越来越熟练，它们在大规模病毒式虚假信息活动中的滥用成为一个越来越严重的问题。本研究探讨了ChatGPT生成关于乌克兰战争的无条件声明的能力，这是一个超出其知识界限的事件，并评估这些声明是否可以被人类读者和自动化工具与人类编写的声明区分出来。我们比较了ClaimReview中关于战争的声明，这些声明是由IFCN注册的事实核查员撰写的，以及ChatGPT生成的类似的短篇内容。我们证明，ChatGPT可以快速、廉价且规模化地生成逼真且针对特定目标的虚假信息，而且这些声明人类和现有的自动化工具无法可靠地区分出来。",
    "tldr": "本研究探索了ChatGPT在生成关于乌克兰战争的虚假信息方面的能力，发现它可以以较低成本、快速且大规模地生成逼真的定制虚假信息，而且这些虚假信息很难被人类读者和现有的自动化工具可靠地区分出来。"
}