{
    "title": "Description on IEEE ICME 2024 Grand Challenge: Semi-supervised Acoustic Scene Classification under Domain Shift",
    "abstract": "Acoustic scene classification (ASC) is a crucial research problem in computational auditory scene analysis, and it aims to recognize the unique acoustic characteristics of an environment. One of the challenges of the ASC task is domain shift caused by a distribution gap between training and testing data. Since 2018, ASC challenges have focused on the generalization of ASC models across different recording devices. Although this task in recent years has achieved substantial progress in device generalization, the challenge of domain shift between different regions, involving characteristics such as time, space, culture, and language, remains insufficiently explored at present. In addition, considering the abundance of unlabeled acoustic scene data in the real world, it is important to study the possible ways to utilize these unlabelled data. Therefore, we introduce the task Semi-supervised Acoustic Scene Classification under Domain Shift in the ICME 2024 Grand Challenge. We encourage par",
    "link": "https://arxiv.org/abs/2402.02694",
    "context": "Title: Description on IEEE ICME 2024 Grand Challenge: Semi-supervised Acoustic Scene Classification under Domain Shift\nAbstract: Acoustic scene classification (ASC) is a crucial research problem in computational auditory scene analysis, and it aims to recognize the unique acoustic characteristics of an environment. One of the challenges of the ASC task is domain shift caused by a distribution gap between training and testing data. Since 2018, ASC challenges have focused on the generalization of ASC models across different recording devices. Although this task in recent years has achieved substantial progress in device generalization, the challenge of domain shift between different regions, involving characteristics such as time, space, culture, and language, remains insufficiently explored at present. In addition, considering the abundance of unlabeled acoustic scene data in the real world, it is important to study the possible ways to utilize these unlabelled data. Therefore, we introduce the task Semi-supervised Acoustic Scene Classification under Domain Shift in the ICME 2024 Grand Challenge. We encourage par",
    "path": "papers/24/02/2402.02694.json",
    "total_tokens": 868,
    "translated_title": "IEEE ICME 2024大挑战赛: 半监督领域转移下的声场分类描述",
    "translated_abstract": "声场分类是计算声场分析中一个关键的研究问题，旨在识别环境的独特声学特征。声场分类任务面临的一个挑战是训练和测试数据之间的分布差异所引起的领域转移。虽然近年来的声场分类挑战已经在设备通用性方面取得了实质性进展，但涉及时间、空间、文化和语言等特征的不同区域之间领域转移的挑战目前尚未得到充分探讨。此外，考虑到现实世界中未标记的声场数据的丰富性，研究利用这些未标记数据的可能方法是很重要的。因此，我们在ICME 2024大挑战赛中引入了半监督领域转移下的声场分类任务。",
    "tldr": "这项研究介绍了ICME 2024 Grand Challenge中的半监督领域转移下的声场分类任务，该任务探索了不同区域之间领域转移的挑战，同时研究了如何利用未标记数据来提升声场分类模型的性能。"
}