{
    "title": "A Truly Joint Neural Architecture for Segmentation and Parsing",
    "abstract": "Contemporary multilingual dependency parsers can parse a diverse set of languages, but for Morphologically Rich Languages (MRLs), performance is attested to be lower than other languages. The key challenge is that, due to high morphological complexity and ambiguity of the space-delimited input tokens, the linguistic units that act as nodes in the tree are not known in advance. Pre-neural dependency parsers for MRLs subscribed to the joint morpho-syntactic hypothesis, stating that morphological segmentation and syntactic parsing should be solved jointly, rather than as a pipeline where segmentation precedes parsing. However, neural state-of-the-art parsers to date use a strict pipeline. In this paper we introduce a joint neural architecture where a lattice-based representation preserving all morphological ambiguity of the input is provided to an arc-factored model, which then solves the morphological segmentation and syntactic parsing tasks at once. Our experiments on Hebrew, a rich and",
    "link": "https://arxiv.org/abs/2402.02564",
    "context": "Title: A Truly Joint Neural Architecture for Segmentation and Parsing\nAbstract: Contemporary multilingual dependency parsers can parse a diverse set of languages, but for Morphologically Rich Languages (MRLs), performance is attested to be lower than other languages. The key challenge is that, due to high morphological complexity and ambiguity of the space-delimited input tokens, the linguistic units that act as nodes in the tree are not known in advance. Pre-neural dependency parsers for MRLs subscribed to the joint morpho-syntactic hypothesis, stating that morphological segmentation and syntactic parsing should be solved jointly, rather than as a pipeline where segmentation precedes parsing. However, neural state-of-the-art parsers to date use a strict pipeline. In this paper we introduce a joint neural architecture where a lattice-based representation preserving all morphological ambiguity of the input is provided to an arc-factored model, which then solves the morphological segmentation and syntactic parsing tasks at once. Our experiments on Hebrew, a rich and",
    "path": "papers/24/02/2402.02564.json",
    "total_tokens": 937,
    "translated_title": "一个真正联合的神经网络架构用于分割和解析",
    "translated_abstract": "当代多语言依存句法分析器可以解析多种语言，但对于形态丰富的语言而言，其性能明显低于其他语言。主要挑战是由于输入标记的形态复杂性和模糊性较高，作为树中节点的语言单位事先是未知的。以往的基于神经网络的形态丰富语言的依存句法分析器遵循联合形态-句法假设，即形态分割和句法分析应该在解析过程中一并解决，而不是先进行分割再进行解析的流程。然而，目前的神经网络依存句法分析器采用严格的流水线方法。在本文中，我们引入了一个联合神经网络架构，将基于格子的表示法保留输入的所有形态模糊性，然后将其提供给一个基于弧的模型，该模型能够同时解决形态分割和句法分析任务。我们在希伯来语上进行了实验，该语言形态丰富且模糊性较高，结果表明...",
    "tldr": "本文通过引入一个联合神经网络架构，在形态丰富的语言中实现了同时进行形态分割和句法分析的任务。通过提供基于格子的表示法，保留了输入的所有形态模糊性，有效解决了以往基于神经网络的依存句法分析器的局限性。"
}