{
    "title": "FESS Loss: Feature-Enhanced Spatial Segmentation Loss for Optimizing Medical Image Analysis",
    "abstract": "Medical image segmentation is a critical process in the field of medical imaging, playing a pivotal role in diagnosis, treatment, and research. It involves partitioning of an image into multiple regions, representing distinct anatomical or pathological structures. Conventional methods often grapple with the challenge of balancing spatial precision and comprehensive feature representation due to their reliance on traditional loss functions. To overcome this, we propose Feature-Enhanced Spatial Segmentation Loss (FESS Loss), that integrates the benefits of contrastive learning (which extracts intricate features, particularly in the nuanced domain of medical imaging) with the spatial accuracy inherent in the Dice loss. The objective is to augment both spatial precision and feature-based representation in the segmentation of medical images. FESS Loss signifies a notable advancement, offering a more accurate and refined segmentation process, ultimately contributing to heightened precision i",
    "link": "https://arxiv.org/abs/2402.08582",
    "context": "Title: FESS Loss: Feature-Enhanced Spatial Segmentation Loss for Optimizing Medical Image Analysis\nAbstract: Medical image segmentation is a critical process in the field of medical imaging, playing a pivotal role in diagnosis, treatment, and research. It involves partitioning of an image into multiple regions, representing distinct anatomical or pathological structures. Conventional methods often grapple with the challenge of balancing spatial precision and comprehensive feature representation due to their reliance on traditional loss functions. To overcome this, we propose Feature-Enhanced Spatial Segmentation Loss (FESS Loss), that integrates the benefits of contrastive learning (which extracts intricate features, particularly in the nuanced domain of medical imaging) with the spatial accuracy inherent in the Dice loss. The objective is to augment both spatial precision and feature-based representation in the segmentation of medical images. FESS Loss signifies a notable advancement, offering a more accurate and refined segmentation process, ultimately contributing to heightened precision i",
    "path": "papers/24/02/2402.08582.json",
    "total_tokens": 882,
    "translated_title": "FESS Loss：用于优化医学图像分析的增强特征空间分割损失",
    "translated_abstract": "在医学成像领域，医学图像分割是一个关键的过程，对于诊断、治疗和研究起着重要作用。它涉及将图像划分为多个区域，代表不同的解剖结构或病理结构。传统方法往往面临空间精度和全面特征表示之间平衡的挑战，因为它们依赖于传统的损失函数。为了克服这一问题，我们提出了增强特征空间分割损失（FESS Loss），将对比学习的优势（在医学成像的微妙领域中提取复杂的特征）与Dice损失的空间准确性相结合。目标是在医学图像分割中增强空间精度和基于特征的表示。FESS Loss代表了一个显著的进展，提供了更精确、更精细的分割过程，最终提高了精度。",
    "tldr": "本论文提出了一种名为FESS Loss的增强特征空间分割损失，将对比学习和Dice损失相结合，旨在在医学图像分割中提高空间精度和特征表示，从而实现更精确、更精细的分割过程。",
    "en_tdlr": "This paper proposes a feature-enhanced spatial segmentation loss called FESS Loss, which combines contrastive learning and Dice loss to improve spatial precision and feature representation in medical image segmentation, resulting in a more accurate and refined segmentation process."
}