{
    "title": "Classification of Tennis Actions Using Deep Learning",
    "abstract": "Recent advances of deep learning makes it possible to identify specific events in videos with greater precision. This has great relevance in sports like tennis in order to e.g., automatically collect game statistics, or replay actions of specific interest for game strategy or player improvements. In this paper, we investigate the potential and the challenges of using deep learning to classify tennis actions. Three models of different size, all based on the deep learning architecture SlowFast were trained and evaluated on the academic tennis dataset THETIS. The best models achieve a generalization accuracy of 74 %, demonstrating a good performance for tennis action classification. We provide an error analysis for the best model and pinpoint directions for improvement of tennis datasets in general. We discuss the limitations of the data set, general limitations of current publicly available tennis data-sets, and future steps needed to make progress.",
    "link": "https://arxiv.org/abs/2402.02545",
    "context": "Title: Classification of Tennis Actions Using Deep Learning\nAbstract: Recent advances of deep learning makes it possible to identify specific events in videos with greater precision. This has great relevance in sports like tennis in order to e.g., automatically collect game statistics, or replay actions of specific interest for game strategy or player improvements. In this paper, we investigate the potential and the challenges of using deep learning to classify tennis actions. Three models of different size, all based on the deep learning architecture SlowFast were trained and evaluated on the academic tennis dataset THETIS. The best models achieve a generalization accuracy of 74 %, demonstrating a good performance for tennis action classification. We provide an error analysis for the best model and pinpoint directions for improvement of tennis datasets in general. We discuss the limitations of the data set, general limitations of current publicly available tennis data-sets, and future steps needed to make progress.",
    "path": "papers/24/02/2402.02545.json",
    "total_tokens": 917,
    "translated_title": "使用深度学习对网球动作进行分类",
    "translated_abstract": "深度学习的最新进展使得在视频中识别特定事件变得更加精确。这在网球等运动中具有很大的相关性，例如可以自动收集比赛统计信息，或者回放特定感兴趣的动作以用于游戏策略或球员提高。在本文中，我们研究了使用深度学习进行网球动作分类的潜力和挑战。我们基于深度学习架构SlowFast训练和评估了三个不同大小的模型，并使用学术网球数据集THETIS进行测试。最佳模型达到了74%的泛化准确率，证明了网球动作分类的良好性能。我们为最佳模型提供了错误分析，并指出改进网球数据集的方向。我们讨论了数据集的局限性，目前公开可用的网球数据集的一般限制以及未来需要采取的步骤以取得进展。",
    "tldr": "本研究使用深度学习探索了对网球动作进行分类的潜力和挑战，并通过使用学术网球数据集THETIS进行了训练和评估。最佳模型达到了74%的泛化准确率，为网球动作分类提供了良好的性能。然后，对最佳模型进行了错误分析，并指出了改进网球数据集的方向。同时，讨论了数据集和当前公开可用的网球数据集的限制，并提出了未来的研究方向。",
    "en_tdlr": "This study investigates the potential and challenges of using deep learning to classify tennis actions and achieves a good performance with a generalization accuracy of 74%. The error analysis of the best model and directions for improving tennis datasets are provided, alongside discussions on dataset limitations and future research directions."
}