{
    "title": "Retrosynthesis prediction enhanced by in-silico reaction data augmentation",
    "abstract": "Recent advances in machine learning (ML) have expedited retrosynthesis research by assisting chemists to design experiments more efficiently. However, all ML-based methods consume substantial amounts of paired training data (i.e., chemical reaction: product-reactant(s) pair), which is costly to obtain. Moreover, companies view reaction data as a valuable asset and restrict the accessibility to researchers. These issues prevent the creation of more powerful retrosynthesis models due to their data-driven nature. As a response, we exploit easy-to-access unpaired data (i.e., one component of product-reactant(s) pair) for generating in-silico paired data to facilitate model training. Specifically, we present RetroWISE, a self-boosting framework that employs a base model inferred from real paired data to perform in-silico reaction generation and augmentation using unpaired data, ultimately leading to a superior model. On three benchmark datasets, RetroWISE achieves the best overall performan",
    "link": "https://arxiv.org/abs/2402.00086",
    "context": "Title: Retrosynthesis prediction enhanced by in-silico reaction data augmentation\nAbstract: Recent advances in machine learning (ML) have expedited retrosynthesis research by assisting chemists to design experiments more efficiently. However, all ML-based methods consume substantial amounts of paired training data (i.e., chemical reaction: product-reactant(s) pair), which is costly to obtain. Moreover, companies view reaction data as a valuable asset and restrict the accessibility to researchers. These issues prevent the creation of more powerful retrosynthesis models due to their data-driven nature. As a response, we exploit easy-to-access unpaired data (i.e., one component of product-reactant(s) pair) for generating in-silico paired data to facilitate model training. Specifically, we present RetroWISE, a self-boosting framework that employs a base model inferred from real paired data to perform in-silico reaction generation and augmentation using unpaired data, ultimately leading to a superior model. On three benchmark datasets, RetroWISE achieves the best overall performan",
    "path": "papers/24/02/2402.00086.json",
    "total_tokens": 875,
    "translated_title": "利用计算模拟反应数据增强的 retrosynthesis 预测",
    "translated_abstract": "机器学习在 retrosynthesis 研究中取得了重要进展，帮助化学家更高效地设计实验。然而，所有基于机器学习的方法都需要大量成对的训练数据（即化学反应：产物-反应物对），而这些数据获取成本高昂。此外，公司将反应数据视为有价值的资产，并限制对研究人员的可访问性。这些问题阻碍了更强大的 retrosynthesis 模型的创建，因为这些模型依赖于数据。为了解决这个问题，我们利用易于获取的非配对数据（即产物-反应物对中的一个组分）生成计算模拟的配对数据，为模型训练提供帮助。具体地，我们提出了 RetroWISE，一个自我增强的框架，它使用从真实配对数据推断出的基础模型，利用非配对数据执行计算模拟的反应生成和增强，最终实现了一个卓越的模型。在三个基准数据集上，RetroWISE 实现最佳的整体性能。",
    "tldr": "RetroWISE 是一个利用计算模拟的反应数据增强的 retrosynthesis 预测的框架，通过使用易于获取的非配对数据生成配对数据，提高了模型的训练性能。"
}