{
    "title": "A Hyper-Transformer model for Controllable Pareto Front Learning with Split Feasibility Constraints",
    "abstract": "Controllable Pareto front learning (CPFL) approximates the Pareto solution set and then locates a Pareto optimal solution with respect to a given reference vector. However, decision-maker objectives were limited to a constraint region in practice, so instead of training on the entire decision space, we only trained on the constraint region. Controllable Pareto front learning with Split Feasibility Constraints (SFC) is a way to find the best Pareto solutions to a split multi-objective optimization problem that meets certain constraints. In the previous study, CPFL used a Hypernetwork model comprising multi-layer perceptron (Hyper-MLP) blocks. With the substantial advancement of transformer architecture in deep learning, transformers can outperform other architectures in various tasks. Therefore, we have developed a hyper-transformer (Hyper-Trans) model for CPFL with SFC. We use the theory of universal approximation for the sequence-to-sequence function to show that the Hyper-Trans model",
    "link": "https://arxiv.org/abs/2402.05955",
    "context": "Title: A Hyper-Transformer model for Controllable Pareto Front Learning with Split Feasibility Constraints\nAbstract: Controllable Pareto front learning (CPFL) approximates the Pareto solution set and then locates a Pareto optimal solution with respect to a given reference vector. However, decision-maker objectives were limited to a constraint region in practice, so instead of training on the entire decision space, we only trained on the constraint region. Controllable Pareto front learning with Split Feasibility Constraints (SFC) is a way to find the best Pareto solutions to a split multi-objective optimization problem that meets certain constraints. In the previous study, CPFL used a Hypernetwork model comprising multi-layer perceptron (Hyper-MLP) blocks. With the substantial advancement of transformer architecture in deep learning, transformers can outperform other architectures in various tasks. Therefore, we have developed a hyper-transformer (Hyper-Trans) model for CPFL with SFC. We use the theory of universal approximation for the sequence-to-sequence function to show that the Hyper-Trans model",
    "path": "papers/24/02/2402.05955.json",
    "total_tokens": 911,
    "translated_title": "一个用于具有分离可行性约束的可控帕累托前沿学习的超级变压器模型",
    "translated_abstract": "可控帕累托前沿学习（CPFL）通过近似帕累托解集，然后在给定参考向量下定位帕累托最优解。然而，在实践中，决策者的目标受到约束区域的限制，因此我们只在约束区域进行训练，而不是整个决策空间。具有分离可行性约束（SFC）的可控帕累托前沿学习是一种寻找满足某些约束条件的分裂多目标优化问题的最佳帕累托解的方法。在之前的研究中，CPFL使用了由多层感知器（Hyper-MLP）模块组成的超网络模型。随着深度学习中变压器结构的显著进步，变压器在各种任务中可以超越其他结构。因此，我们为具有SFC的CPFL开发了一种超级变压器（Hyper-Trans）模型。我们使用序列到序列函数的通用逼近理论来展示Hyper-Trans模型的优势。",
    "tldr": "本论文提出了一种用于具有分离可行性约束的可控帕累托前沿学习的超级变压器模型，可以通过近似和定位帕累托最优解来解决分裂多目标优化问题，并且在实践中限制了决策者目标的约束区域进行训练。"
}