{
    "title": "Objective and Interpretable Breast Cosmesis Evaluation with Attention Guided Denoising Diffusion Anomaly Detection Model",
    "abstract": "arXiv:2402.18362v1 Announce Type: cross  Abstract: As advancements in the field of breast cancer treatment continue to progress, the assessment of post-surgical cosmetic outcomes has gained increasing significance due to its substantial impact on patients' quality of life. However, evaluating breast cosmesis presents challenges due to the inherently subjective nature of expert labeling. In this study, we present a novel automated approach, Attention-Guided Denoising Diffusion Anomaly Detection (AG-DDAD), designed to assess breast cosmesis following surgery, addressing the limitations of conventional supervised learning and existing anomaly detection models. Our approach leverages the attention mechanism of the distillation with no label (DINO) self-supervised Vision Transformer (ViT) in combination with a diffusion model to achieve high-quality image reconstruction and precise transformation of discriminative regions. By training the diffusion model on unlabeled data predominantly with",
    "link": "https://arxiv.org/abs/2402.18362",
    "context": "Title: Objective and Interpretable Breast Cosmesis Evaluation with Attention Guided Denoising Diffusion Anomaly Detection Model\nAbstract: arXiv:2402.18362v1 Announce Type: cross  Abstract: As advancements in the field of breast cancer treatment continue to progress, the assessment of post-surgical cosmetic outcomes has gained increasing significance due to its substantial impact on patients' quality of life. However, evaluating breast cosmesis presents challenges due to the inherently subjective nature of expert labeling. In this study, we present a novel automated approach, Attention-Guided Denoising Diffusion Anomaly Detection (AG-DDAD), designed to assess breast cosmesis following surgery, addressing the limitations of conventional supervised learning and existing anomaly detection models. Our approach leverages the attention mechanism of the distillation with no label (DINO) self-supervised Vision Transformer (ViT) in combination with a diffusion model to achieve high-quality image reconstruction and precise transformation of discriminative regions. By training the diffusion model on unlabeled data predominantly with",
    "path": "papers/24/02/2402.18362.json",
    "total_tokens": 856,
    "translated_title": "使用注意力引导去噪扩散异常检测模型进行客观且可解释的乳腺整容评估",
    "translated_abstract": "随着乳腺癌治疗领域的不断发展，术后整容效果的评估因其对患者生活质量的重大影响而日益重要。然而，由于专家标注的固有主观性，评估乳腺整容存在挑战。在本研究中，我们提出了一种新颖的自动化方法，Attention-Guided Denoising Diffusion Anomaly Detection (AG-DDAD)，旨在评估手术后的乳腺整容，并解决传统监督学习和现有异常检测模型的局限性。我们的方法利用无标签蒸馏（DINO）自监督视觉Transformer（ViT）的注意力机制，结合扩散模型，实现高质量图像重建和辨别性区域精确变换。通过主要使用无标签数据训练扩散模型，",
    "tldr": "本研究提出一种新的自动化方法AG-DDAD，旨在通过注意力机制和扩散模型评估乳腺整容，从而克服传统监督学习和现有异常检测模型的局限性。",
    "en_tdlr": "This study introduces a novel automated method AG-DDAD to evaluate breast cosmesis using attention mechanism and diffusion model, overcoming limitations of traditional supervised learning and existing anomaly detection models."
}