{
    "title": "MultiFIX: An XAI-friendly feature inducing approach to building models from multimodal data",
    "abstract": "arXiv:2402.12183v1 Announce Type: new  Abstract: In the health domain, decisions are often based on different data modalities. Thus, when creating prediction models, multimodal fusion approaches that can extract and combine relevant features from different data modalities, can be highly beneficial. Furthermore, it is important to understand how each modality impacts the final prediction, especially in high-stake domains, so that these models can be used in a trustworthy and responsible manner. We propose MultiFIX: a new interpretability-focused multimodal data fusion pipeline that explicitly induces separate features from different data types that can subsequently be combined to make a final prediction. An end-to-end deep learning architecture is used to train a predictive model and extract representative features of each modality. Each part of the model is then explained using explainable artificial intelligence techniques. Attention maps are used to highlight important regions in ima",
    "link": "https://arxiv.org/abs/2402.12183",
    "context": "Title: MultiFIX: An XAI-friendly feature inducing approach to building models from multimodal data\nAbstract: arXiv:2402.12183v1 Announce Type: new  Abstract: In the health domain, decisions are often based on different data modalities. Thus, when creating prediction models, multimodal fusion approaches that can extract and combine relevant features from different data modalities, can be highly beneficial. Furthermore, it is important to understand how each modality impacts the final prediction, especially in high-stake domains, so that these models can be used in a trustworthy and responsible manner. We propose MultiFIX: a new interpretability-focused multimodal data fusion pipeline that explicitly induces separate features from different data types that can subsequently be combined to make a final prediction. An end-to-end deep learning architecture is used to train a predictive model and extract representative features of each modality. Each part of the model is then explained using explainable artificial intelligence techniques. Attention maps are used to highlight important regions in ima",
    "path": "papers/24/02/2402.12183.json",
    "total_tokens": 841,
    "translated_title": "MultiFIX:一种友好的XAI功能诱导方法，用于从多模态数据构建模型",
    "translated_abstract": "在健康领域，决策常常基于不同的数据模态。因此，在创建预测模型时，能够从不同数据模态中提取和组合相关特征的多模态融合方法非常有益。此外，重要的是要了解每个模态如何影响最终预测，特别是在高风险领域中，以便可以信任和负责任地使用这些模型。我们提出了MultiFIX：一种新的注重可解释性的多模态数据融合管道，明确从不同数据类型中诱导出单独的特征，随后可以将其组合以进行最终预测。采用端到端深度学习架构训练预测模型并提取每个模态的代表性特征，然后使用可解释的人工智能技术解释模型的每个部分。注意力图用于突出图像中的重要区域",
    "tldr": "提出了MultiFIX，一种注重可解释性的多模态数据融合方法，使用深度学习架构训练模型，并通过注意力图来解释每个模态对最终预测的影响",
    "en_tdlr": "Introduced MultiFIX, an interpretability-focused multimodal data fusion approach that utilizes a deep learning architecture to train models and explains the impact of each modality on the final prediction using attention maps."
}