{
    "title": "Developing an Optimal Model for Predicting the Severity of Wheat Stem Rust (Case study of Arsi and Bale Zone)",
    "abstract": "arXiv:2402.10492v1 Announce Type: cross  Abstract: This research utilized three types of artificial neural network (ANN) methodologies, namely Backpropagation Neural Network (BPNN) with varied training, transfer, divide, and learning functions; Radial Basis Function Neural Network (RBFNN); and General Regression Neural Network (GRNN), to forecast the severity of stem rust. It considered parameters such as mean maximum temperature, mean minimum temperature, mean rainfall, mean average temperature, mean relative humidity, and different wheat varieties. The statistical analysis revealed that GRNN demonstrated effective predictive capability and required less training time compared to the other models. Additionally, the results indicated that total seasonal rainfall positively influenced the development of wheat stem rust.   Keywords: Wheat stem rust, Back propagation neural network, Radial Basis Function Neural Network, General Regression Neural Network.",
    "link": "https://arxiv.org/abs/2402.10492",
    "context": "Title: Developing an Optimal Model for Predicting the Severity of Wheat Stem Rust (Case study of Arsi and Bale Zone)\nAbstract: arXiv:2402.10492v1 Announce Type: cross  Abstract: This research utilized three types of artificial neural network (ANN) methodologies, namely Backpropagation Neural Network (BPNN) with varied training, transfer, divide, and learning functions; Radial Basis Function Neural Network (RBFNN); and General Regression Neural Network (GRNN), to forecast the severity of stem rust. It considered parameters such as mean maximum temperature, mean minimum temperature, mean rainfall, mean average temperature, mean relative humidity, and different wheat varieties. The statistical analysis revealed that GRNN demonstrated effective predictive capability and required less training time compared to the other models. Additionally, the results indicated that total seasonal rainfall positively influenced the development of wheat stem rust.   Keywords: Wheat stem rust, Back propagation neural network, Radial Basis Function Neural Network, General Regression Neural Network.",
    "path": "papers/24/02/2402.10492.json",
    "total_tokens": 834,
    "translated_title": "发展一种预测小麦枯叶病严重程度的最佳模型（阿尔西和巴勒区案例研究）",
    "translated_abstract": "这项研究利用了三种人工神经网络（ANN）方法，分别是具有不同训练、传输、分割和学习功能的反向传播神经网络（BPNN），径向基函数神经网络（RBFNN）和通用回归神经网络（GRNN），来预测枯叶病的严重程度。考虑了参数如平均最高温度、平均最低温度、平均降雨量、平均气温、平均相对湿度和不同小麦品种。统计分析表明，GRNN表现出有效的预测能力，并且相比其他模型需要更少的训练时间。此外，结果表明总季节降雨量对小麦枯叶病的发展有积极影响。",
    "tldr": "通过比较三种不同的人工神经网络方法，研究发现通用回归神经网络（GRNN）在预测小麦枯叶病严重程度方面表现出有效性，并需要较少的训练时间。",
    "en_tdlr": "By comparing three different artificial neural network methods, the study found that General Regression Neural Network (GRNN) demonstrated effectiveness in predicting the severity of wheat stem rust and required less training time."
}