{
    "title": "A Bargaining-based Approach for Feature Trading in Vertical Federated Learning",
    "abstract": "arXiv:2402.15247v1 Announce Type: cross  Abstract: Vertical Federated Learning (VFL) has emerged as a popular machine learning paradigm, enabling model training across the data and the task parties with different features about the same user set while preserving data privacy. In production environment, VFL usually involves one task party and one data party. Fair and economically efficient feature trading is crucial to the commercialization of VFL, where the task party is considered as the data consumer who buys the data party's features. However, current VFL feature trading practices often price the data party's data as a whole and assume transactions occur prior to the performing VFL. Neglecting the performance gains resulting from traded features may lead to underpayment and overpayment issues. In this study, we propose a bargaining-based feature trading approach in VFL to encourage economically efficient transactions. Our model incorporates performance gain-based pricing, taking int",
    "link": "https://arxiv.org/abs/2402.15247",
    "context": "Title: A Bargaining-based Approach for Feature Trading in Vertical Federated Learning\nAbstract: arXiv:2402.15247v1 Announce Type: cross  Abstract: Vertical Federated Learning (VFL) has emerged as a popular machine learning paradigm, enabling model training across the data and the task parties with different features about the same user set while preserving data privacy. In production environment, VFL usually involves one task party and one data party. Fair and economically efficient feature trading is crucial to the commercialization of VFL, where the task party is considered as the data consumer who buys the data party's features. However, current VFL feature trading practices often price the data party's data as a whole and assume transactions occur prior to the performing VFL. Neglecting the performance gains resulting from traded features may lead to underpayment and overpayment issues. In this study, we propose a bargaining-based feature trading approach in VFL to encourage economically efficient transactions. Our model incorporates performance gain-based pricing, taking int",
    "path": "papers/24/02/2402.15247.json",
    "total_tokens": 800,
    "translated_title": "一种基于谈判的垂直联邦学习特征交易方法",
    "translated_abstract": "垂直联邦学习（VFL）已经成为一种流行的机器学习范式，可以在保护数据隐私的同时，实现跨数据和任务方对相同用户集的模型训练。在生产环境中，VFL通常涉及一个任务方和一个数据方。公平和经济高效的特征交易对VFL的商业化至关重要，其中任务方被视为购买数据方特征的数据消费者。然而，当前的VFL特征交易做法通常将数据方的数据整体定价，并假定交易发生在执行VFL之前。忽略交易特征产生的性能增益可能导致不公平支付和过度支付问题。在本研究中，我们提出了一种基于谈判的VFL特征交易方法，以促进经济高效的交易。我们的模型结合了基于性能增益的定价，",
    "tldr": "该研究提出了一种基于谈判的垂直联邦学习特征交易方法，以促进经济高效的交易",
    "en_tdlr": "The study proposes a bargaining-based approach for feature trading in vertical federated learning to promote economically efficient transactions."
}