{
    "title": "Improved prediction of future user activity in online A/B testing",
    "abstract": "In online randomized experiments or A/B tests, accurate predictions of participant inclusion rates are of paramount importance. These predictions not only guide experimenters in optimizing the experiment's duration but also enhance the precision of treatment effect estimates. In this paper we present a novel, straightforward, and scalable Bayesian nonparametric approach for predicting the rate at which individuals will be exposed to interventions within the realm of online A/B testing. Our approach stands out by offering dual prediction capabilities: it forecasts both the quantity of new customers expected in future time windows and, unlike available alternative methods, the number of times they will be observed. We derive closed-form expressions for the posterior distributions of the quantities needed to form predictions about future user activity, thereby bypassing the need for numerical algorithms such as Markov chain Monte Carlo. After a comprehensive exposition of our model, we te",
    "link": "https://arxiv.org/abs/2402.03231",
    "context": "Title: Improved prediction of future user activity in online A/B testing\nAbstract: In online randomized experiments or A/B tests, accurate predictions of participant inclusion rates are of paramount importance. These predictions not only guide experimenters in optimizing the experiment's duration but also enhance the precision of treatment effect estimates. In this paper we present a novel, straightforward, and scalable Bayesian nonparametric approach for predicting the rate at which individuals will be exposed to interventions within the realm of online A/B testing. Our approach stands out by offering dual prediction capabilities: it forecasts both the quantity of new customers expected in future time windows and, unlike available alternative methods, the number of times they will be observed. We derive closed-form expressions for the posterior distributions of the quantities needed to form predictions about future user activity, thereby bypassing the need for numerical algorithms such as Markov chain Monte Carlo. After a comprehensive exposition of our model, we te",
    "path": "papers/24/02/2402.03231.json",
    "total_tokens": 848,
    "translated_title": "在在线A/B测试中改进对未来用户活动的预测",
    "translated_abstract": "在在线随机实验或A/B测试中，准确预测参与率十分重要。这些预测不仅指导实验者优化实验的持续时间，还提高了治疗效果估计的精度。本文提出了一种新颖、简单和可扩展的贝叶斯非参数方法，用于在在线A/B测试中预测个体被介入的速率。我们的方法有双重预测能力：预测未来时间窗口中的新客户数量，以及与现有的可用方法不同，他们将被观察的次数。我们推导出用于形成对未来用户活动预测的所需数量的后验分布的闭合表达式，从而避免了使用数值算法如马尔可夫链蒙特卡洛。在全面阐述我们的模型之后，我们进行了实证研究，对我们的模型的性能进行了评估。",
    "tldr": "本文提出了一种在在线A/B测试中改进对未来用户活动预测的方法，该方法利用贝叶斯非参数方法预测个体被介入的速率，并提供双重预测能力，预测未来时间窗口中新客户数量和被观察次数。",
    "en_tdlr": "This paper proposes an improved method for predicting future user activity in online A/B testing by utilizing Bayesian nonparametric approach to predict the rate of individual exposure, and provides dual prediction capabilities for forecasting both the quantity of new customers and the number of times they will be observed in future time windows."
}