{
    "title": "A Light-weight and Unsupervised Method for Near Real-time Behavioral Analysis using Operational Data Measurement",
    "abstract": "Monitoring the status of large computing systems is essential to identify unexpected behavior and improve their performance and uptime. However, due to the large-scale and distributed design of such computing systems as well as a large number of monitoring parameters, automated monitoring methods should be applied. Such automatic monitoring methods should also have the ability to adapt themselves to the continuous changes in the computing system. In addition, they should be able to identify behavioral anomalies in useful time, to perform appropriate reactions. This work proposes a general lightweight and unsupervised method for near real-time anomaly detection using operational data measurement on large computing systems. The proposed model requires as little as 4 hours of data and 50 epochs for each training process to accurately resemble the behavioral pattern of computing systems.",
    "link": "https://arxiv.org/abs/2402.05114",
    "context": "Title: A Light-weight and Unsupervised Method for Near Real-time Behavioral Analysis using Operational Data Measurement\nAbstract: Monitoring the status of large computing systems is essential to identify unexpected behavior and improve their performance and uptime. However, due to the large-scale and distributed design of such computing systems as well as a large number of monitoring parameters, automated monitoring methods should be applied. Such automatic monitoring methods should also have the ability to adapt themselves to the continuous changes in the computing system. In addition, they should be able to identify behavioral anomalies in useful time, to perform appropriate reactions. This work proposes a general lightweight and unsupervised method for near real-time anomaly detection using operational data measurement on large computing systems. The proposed model requires as little as 4 hours of data and 50 epochs for each training process to accurately resemble the behavioral pattern of computing systems.",
    "path": "papers/24/02/2402.05114.json",
    "total_tokens": 749,
    "translated_title": "一种轻量级和无监督方法，用于使用运维数据测量进行近实时行为分析",
    "translated_abstract": "监控大型计算系统的状态对于识别意外行为并提高其性能和正常运行至关重要。然而，由于这种计算系统的大规模和分布式设计以及大量的监控参数，应该采用自动化监控方法。这样的自动监控方法还应具有适应计算系统持续变化的能力。此外，它们还应能够在适当的时间内识别出有用的行为异常，以执行相应的反应。本文提出了一种通用的轻量级和无监督方法，利用大型计算系统上的操作数据测量来实现近实时异常检测。所提出的模型只需要4个小时的数据和每个训练过程的50个epochs，就能准确地反映计算系统的行为模式。",
    "tldr": "这种方法提出了一种轻量级和无监督的近实时行为分析方法，可以适应大型计算系统的变化，并能准确识别出行为异常。",
    "en_tdlr": "This method proposes a lightweight and unsupervised approach for near real-time behavioral analysis that can adapt to changes in large computing systems and accurately identify behavioral anomalies."
}