{
    "title": "Hyperdimensional computing: a fast, robust and interpretable paradigm for biological data",
    "abstract": "arXiv:2402.17572v1 Announce Type: new  Abstract: Advances in bioinformatics are primarily due to new algorithms for processing diverse biological data sources. While sophisticated alignment algorithms have been pivotal in analyzing biological sequences, deep learning has substantially transformed bioinformatics, addressing sequence, structure, and functional analyses. However, these methods are incredibly data-hungry, compute-intensive and hard to interpret. Hyperdimensional computing (HDC) has recently emerged as an intriguing alternative. The key idea is that random vectors of high dimensionality can represent concepts such as sequence identity or phylogeny. These vectors can then be combined using simple operators for learning, reasoning or querying by exploiting the peculiar properties of high-dimensional spaces. Our work reviews and explores the potential of HDC for bioinformatics, emphasizing its efficiency, interpretability, and adeptness in handling multimodal and structured da",
    "link": "https://arxiv.org/abs/2402.17572",
    "context": "Title: Hyperdimensional computing: a fast, robust and interpretable paradigm for biological data\nAbstract: arXiv:2402.17572v1 Announce Type: new  Abstract: Advances in bioinformatics are primarily due to new algorithms for processing diverse biological data sources. While sophisticated alignment algorithms have been pivotal in analyzing biological sequences, deep learning has substantially transformed bioinformatics, addressing sequence, structure, and functional analyses. However, these methods are incredibly data-hungry, compute-intensive and hard to interpret. Hyperdimensional computing (HDC) has recently emerged as an intriguing alternative. The key idea is that random vectors of high dimensionality can represent concepts such as sequence identity or phylogeny. These vectors can then be combined using simple operators for learning, reasoning or querying by exploiting the peculiar properties of high-dimensional spaces. Our work reviews and explores the potential of HDC for bioinformatics, emphasizing its efficiency, interpretability, and adeptness in handling multimodal and structured da",
    "path": "papers/24/02/2402.17572.json",
    "total_tokens": 807,
    "translated_title": "超维计算：生物数据的快速、稳健和可解释范式",
    "translated_abstract": "生物信息学的进步主要归因于处理多样生物数据源的新算法。高级的序列比对算法已经在分析生物序列方面发挥了关键作用，深度学习已经大幅改变了生物信息学，解决了序列、结构和功能分析的问题。然而，这些方法非常依赖数据，计算密集且难以解释。超维计算（HDC）最近作为一种有趣的替代方案出现。其关键思想是高维度的随机向量可以表示诸如序列同一性或系统发育等概念。然后，利用高维空间的特殊属性，可以使用简单运算符组合这些向量进行学习、推理或查询。我们的工作审查并探讨了HDC在生物信息学中的潜力，强调了其效率、可解释性以及处理多模态和结构化数据的熟练程度。",
    "tldr": "超维计算作为一种新兴技术，在生物信息学中具有高效、可解释和能够处理多模态数据的潜力。",
    "en_tdlr": "Hyperdimensional computing, as an emerging technology, shows potential in bioinformatics with its efficiency, interpretability, and adeptness in handling multimodal data."
}