{
    "title": "The Role of LLMs in Sustainable Smart Cities: Applications, Challenges, and Future Directions",
    "abstract": "arXiv:2402.14596v1 Announce Type: new  Abstract: Smart cities stand as pivotal components in the ongoing pursuit of elevating urban living standards, facilitating the rapid expansion of urban areas while efficiently managing resources through sustainable and scalable innovations. In this regard, as emerging technologies like Artificial Intelligence (AI), the Internet of Things (IoT), big data analytics, and fog and edge computing have become increasingly prevalent, smart city applications grapple with various challenges, including the potential for unauthorized disclosure of confidential and sensitive data. The seamless integration of emerging technologies has played a vital role in sustaining the dynamic pace of their development. This paper explores the substantial potential and applications of Deep Learning (DL), Federated Learning (FL), IoT, Blockchain, Natural Language Processing (NLP), and large language models (LLMs) in optimizing ICT processes within smart cities. We aim to spo",
    "link": "https://arxiv.org/abs/2402.14596",
    "context": "Title: The Role of LLMs in Sustainable Smart Cities: Applications, Challenges, and Future Directions\nAbstract: arXiv:2402.14596v1 Announce Type: new  Abstract: Smart cities stand as pivotal components in the ongoing pursuit of elevating urban living standards, facilitating the rapid expansion of urban areas while efficiently managing resources through sustainable and scalable innovations. In this regard, as emerging technologies like Artificial Intelligence (AI), the Internet of Things (IoT), big data analytics, and fog and edge computing have become increasingly prevalent, smart city applications grapple with various challenges, including the potential for unauthorized disclosure of confidential and sensitive data. The seamless integration of emerging technologies has played a vital role in sustaining the dynamic pace of their development. This paper explores the substantial potential and applications of Deep Learning (DL), Federated Learning (FL), IoT, Blockchain, Natural Language Processing (NLP), and large language models (LLMs) in optimizing ICT processes within smart cities. We aim to spo",
    "path": "papers/24/02/2402.14596.json",
    "total_tokens": 811,
    "translated_title": "LLM在可持续智慧城市中的作用：应用、挑战和未来方向",
    "translated_abstract": "智慧城市在提升城市生活水平的持续追求中发挥着关键作用，通过可持续且可扩展的创新高效管理资源，促进城市区域的快速扩展。随着人工智能（AI）、物联网（IoT）、大数据分析以及雾计算和边缘计算等新兴技术日益普及，智慧城市的应用面临着各种挑战，包括机密和敏感数据可能被未经授权披露的潜在风险。新兴技术的无缝整合对于维持其发展的动态步伐起着至关重要的作用。本文探讨了深度学习（DL）、联邦学习（FL）、物联网、区块链、自然语言处理（NLP）以及大型语言模型（LLMs）在优化智慧城市中的ICT流程方面的重要潜力和应用。",
    "tldr": "本文探讨了LLM在优化智慧城市中的ICT流程方面的重要潜力和应用。",
    "en_tdlr": "This paper explores the substantial potential and applications of LLMs in optimizing ICT processes within smart cities."
}