{
    "title": "Exploring Educational Equity: A Machine Learning Approach to Unravel Achievement Disparities in Georgia",
    "abstract": "The COVID-19 pandemic has significantly exacerbated existing educational disparities in Georgia's K-12 system, particularly in terms of racial and ethnic achievement gaps. Utilizing machine learning methods, the study conducts a comprehensive analysis of student achievement rates across different demographics, regions, and subjects. The findings highlight a significant decline in proficiency in English and Math during the pandemic, with a noticeable contraction in score distribution and a greater impact on economically disadvantaged and Black students. Socio-economic status, as represented by the Directly Certified Percentage -- the percentage of students eligible for free lunch, emerges as the most crucial factor, with additional insights drawn from faculty resources such as teacher salaries and expenditure on instruction. The study also identifies disparities in achievement rates between urban and rural settings, as well as variations across counties, underscoring the influence of ge",
    "link": "https://arxiv.org/abs/2402.01710",
    "context": "Title: Exploring Educational Equity: A Machine Learning Approach to Unravel Achievement Disparities in Georgia\nAbstract: The COVID-19 pandemic has significantly exacerbated existing educational disparities in Georgia's K-12 system, particularly in terms of racial and ethnic achievement gaps. Utilizing machine learning methods, the study conducts a comprehensive analysis of student achievement rates across different demographics, regions, and subjects. The findings highlight a significant decline in proficiency in English and Math during the pandemic, with a noticeable contraction in score distribution and a greater impact on economically disadvantaged and Black students. Socio-economic status, as represented by the Directly Certified Percentage -- the percentage of students eligible for free lunch, emerges as the most crucial factor, with additional insights drawn from faculty resources such as teacher salaries and expenditure on instruction. The study also identifies disparities in achievement rates between urban and rural settings, as well as variations across counties, underscoring the influence of ge",
    "path": "papers/24/02/2402.01710.json",
    "total_tokens": 878,
    "translated_title": "探索教育公平：揭示乔治亚州成就差距的机器学习方法",
    "translated_abstract": "COVID-19疫情显著加剧了乔治亚州K-12教育系统现有的不平等现象，尤其是在种族和民族成就差距方面。利用机器学习方法，该研究对不同人口统计学特征、地区和学科的学生成绩进行了全面分析。研究发现，在疫情期间英语和数学的熟练程度显著下降，分数分布收缩并对经济困境和黑人学生产生更大影响。直接证明的百分比（Directly Certified Percentage）代表的社会经济地位成为最关键的因素，此外还从教师资源（如教师工资）和教学开支中获得了其他洞见。研究还发现了城市和农村环境之间的成就差异，以及不同县之间的变化，凸显了地理因素的影响。",
    "tldr": "COVID-19疫情对乔治亚州K-12教育系统造成了严重的不平等现象，尤其是在种族和民族成就差距方面。研究利用机器学习方法分析了不同人口统计学特征、地区和学科的学生成绩，发现了英语和数学熟练程度的显著下降，并且进一步探讨了社会经济地位和地理因素对学业成就的影响。"
}