{
    "title": "Towards a large-scale fused and labeled dataset of human pose while interacting with robots in shared urban areas",
    "abstract": "arXiv:2402.10077v1 Announce Type: cross  Abstract: Over the last decade, Autonomous Delivery Robots (ADRs) have transformed conventional delivery methods, responding to the growing e-commerce demand. However, the readiness of ADRs to navigate safely among pedestrians in shared urban areas remains an open question. We contend that there are crucial research gaps in understanding their interactions with pedestrians in such environments. Human Pose Estimation is a vital stepping stone for various downstream applications, including pose prediction and socially aware robot path-planning. Yet, the absence of an enriched and pose-labeled dataset capturing human-robot interactions in shared urban areas hinders this objective. In this paper, we bridge this gap by repurposing, fusing, and labeling two datasets, MOT17 and NCLT, focused on pedestrian tracking and Simultaneous Localization and Mapping (SLAM), respectively. The resulting unique dataset represents thousands of real-world indoor and o",
    "link": "https://arxiv.org/abs/2402.10077",
    "context": "Title: Towards a large-scale fused and labeled dataset of human pose while interacting with robots in shared urban areas\nAbstract: arXiv:2402.10077v1 Announce Type: cross  Abstract: Over the last decade, Autonomous Delivery Robots (ADRs) have transformed conventional delivery methods, responding to the growing e-commerce demand. However, the readiness of ADRs to navigate safely among pedestrians in shared urban areas remains an open question. We contend that there are crucial research gaps in understanding their interactions with pedestrians in such environments. Human Pose Estimation is a vital stepping stone for various downstream applications, including pose prediction and socially aware robot path-planning. Yet, the absence of an enriched and pose-labeled dataset capturing human-robot interactions in shared urban areas hinders this objective. In this paper, we bridge this gap by repurposing, fusing, and labeling two datasets, MOT17 and NCLT, focused on pedestrian tracking and Simultaneous Localization and Mapping (SLAM), respectively. The resulting unique dataset represents thousands of real-world indoor and o",
    "path": "papers/24/02/2402.10077.json",
    "total_tokens": 890,
    "translated_title": "在共享城市区域中与机器人互动的人体姿势大规模融合和标记数据集的研究",
    "translated_abstract": "在过去的十年中，自主配送机器人（ADR）在回应不断增长的电子商务需求的同时，也改变了传统的配送方法。然而，ADR在共享城市区域中安全与行人共同交往的准备问题仍然存在一个悬而未决的问题。我们认为，在这样的环境中，理解ADR与行人的相互作用存在重要的研究空白。人体姿势估计是各种下游应用（包括姿势预测和具有社会意识的机器人路径规划）的重要基石。然而，缺乏一个捕获共享城市区域中人机交互的丰富且标记的数据集，限制了这个目标的实现。本文通过重新利用两个数据集MOT17和NCLT，分别聚焦于行人跟踪和同时定位与地图构建（SLAM），填补了这一空白。结果得到的独特数据集包含数千个真实室内和户外场景的数据。",
    "tldr": "本研究通过融合和标记两个数据集，MOT17和NCLT，填补了共享城市区域中人机交互的人体姿势数据集的空白。"
}