{
    "title": "Towards Optimal Feature-Shaping Methods for Out-of-Distribution Detection",
    "abstract": "Feature shaping refers to a family of methods that exhibit state-of-the-art performance for out-of-distribution (OOD) detection. These approaches manipulate the feature representation, typically from the penultimate layer of a pre-trained deep learning model, so as to better differentiate between in-distribution (ID) and OOD samples. However, existing feature-shaping methods usually employ rules manually designed for specific model architectures and OOD datasets, which consequently limit their generalization ability. To address this gap, we first formulate an abstract optimization framework for studying feature-shaping methods. We then propose a concrete reduction of the framework with a simple piecewise constant shaping function and show that existing feature-shaping methods approximate the optimal solution to the concrete optimization problem. Further, assuming that OOD data is inaccessible, we propose a formulation that yields a closed-form solution for the piecewise constant shapin",
    "link": "https://arxiv.org/abs/2402.00865",
    "context": "Title: Towards Optimal Feature-Shaping Methods for Out-of-Distribution Detection\nAbstract: Feature shaping refers to a family of methods that exhibit state-of-the-art performance for out-of-distribution (OOD) detection. These approaches manipulate the feature representation, typically from the penultimate layer of a pre-trained deep learning model, so as to better differentiate between in-distribution (ID) and OOD samples. However, existing feature-shaping methods usually employ rules manually designed for specific model architectures and OOD datasets, which consequently limit their generalization ability. To address this gap, we first formulate an abstract optimization framework for studying feature-shaping methods. We then propose a concrete reduction of the framework with a simple piecewise constant shaping function and show that existing feature-shaping methods approximate the optimal solution to the concrete optimization problem. Further, assuming that OOD data is inaccessible, we propose a formulation that yields a closed-form solution for the piecewise constant shapin",
    "path": "papers/24/02/2402.00865.json",
    "total_tokens": 840,
    "translated_title": "为解决越界检测而优化特征塑造方法的研究",
    "translated_abstract": "特征塑造是一类方法，其在越界（OOD）检测中展示出最先进的性能。这些方法通过操作特征表示来区分正常（ID）样本和越界（OOD）样本。然而，现有的特征塑造方法通常使用手动设计的规则，针对具体的模型架构和越界数据集，从而限制了它们的泛化能力。为了解决这个问题，我们首先制定了一个抽象的优化框架来研究特征塑造方法。然后，我们提出了一个具体的简化问题，并证明现有的特征塑造方法近似于该问题的最优解。此外，我们假设越界数据是无法访问的，我们提出了一个公式，可以得到一个分段常数塑造的闭式解决方案。",
    "tldr": "本研究针对越界检测，通过优化特征塑造方法，提出了一种抽象优化框架和具体简化方法，以增强特征塑造方法的泛化能力，并提供了一个无法访问越界数据的闭式解决方案。"
}