{
    "title": "Federated Learning Priorities Under the European Union Artificial Intelligence Act",
    "abstract": "The age of AI regulation is upon us, with the European Union Artificial Intelligence Act (AI Act) leading the way. Our key inquiry is how this will affect Federated Learning (FL), whose starting point of prioritizing data privacy while performing ML fundamentally differs from that of centralized learning. We believe the AI Act and future regulations could be the missing catalyst that pushes FL toward mainstream adoption. However, this can only occur if the FL community reprioritizes its research focus. In our position paper, we perform a first-of-its-kind interdisciplinary analysis (legal and ML) of the impact the AI Act may have on FL and make a series of observations supporting our primary position through quantitative and qualitative analysis. We explore data governance issues and the concern for privacy. We establish new challenges regarding performance and energy efficiency within lifecycle monitoring. Taken together, our analysis suggests there is a sizable opportunity for FL to ",
    "link": "https://arxiv.org/abs/2402.05968",
    "context": "Title: Federated Learning Priorities Under the European Union Artificial Intelligence Act\nAbstract: The age of AI regulation is upon us, with the European Union Artificial Intelligence Act (AI Act) leading the way. Our key inquiry is how this will affect Federated Learning (FL), whose starting point of prioritizing data privacy while performing ML fundamentally differs from that of centralized learning. We believe the AI Act and future regulations could be the missing catalyst that pushes FL toward mainstream adoption. However, this can only occur if the FL community reprioritizes its research focus. In our position paper, we perform a first-of-its-kind interdisciplinary analysis (legal and ML) of the impact the AI Act may have on FL and make a series of observations supporting our primary position through quantitative and qualitative analysis. We explore data governance issues and the concern for privacy. We establish new challenges regarding performance and energy efficiency within lifecycle monitoring. Taken together, our analysis suggests there is a sizable opportunity for FL to ",
    "path": "papers/24/02/2402.05968.json",
    "total_tokens": 839,
    "translated_title": "欧盟人工智能法案下的联邦学习优先事项",
    "translated_abstract": "AI监管时代已经来临，欧盟人工智能法案（AI Act）引领着潮流。我们的关键问题是，这将如何影响以数据隐私为优先并进行机器学习的联邦学习（FL），其与集中式学习的出发点根本不同。我们相信AI法案和未来的监管可能是推动FL走向主流采用的缺失催化剂。然而，这只能发生在FL社区重新优先考虑其研究重点的情况下。在我们的立场论文中，我们进行了首次跨学科分析（法律和机器学习），分析了AI法案对FL可能产生的影响，并通过定量和定性分析进行了一系列支持我们主要观点的观察。我们探讨了数据治理问题和对隐私的担忧。我们确定了在生命周期监视中性能和能源效率方面的新挑战。综合我们的分析，表明FL有着巨大的机会，",
    "tldr": "欧盟人工智能法案可能推动联邦学习朝主流采用方向发展，并提出了数据隐私、性能和能源效率等方面的新挑战。",
    "en_tdlr": "The European Union Artificial Intelligence Act could drive the adoption of Federated Learning and bring new challenges in areas such as data privacy, performance, and energy efficiency."
}