{
    "title": "Machine Learning Resistant Amorphous Silicon Physically Unclonable Functions (PUFs)",
    "abstract": "We investigate usage of nonlinear wave chaotic amorphous silicon (a-Si) cavities as physically unclonable functions (PUF). Machine learning attacks on integrated electronic PUFs have been demonstrated to be very effective at modeling PUF behavior. Such attacks on integrated a-Si photonic PUFs are investigated through application of algorithms including linear regression, k-nearest neighbor, decision tree ensembles (random forests and gradient boosted trees), and deep neural networks (DNNs). We found that DNNs performed the best among all the algorithms studied but still failed to completely break the a-Si PUF security which we quantify through a private information metric. Furthermore, machine learning resistance of a-Si PUFs were found to be directly related to the strength of their nonlinear response.",
    "link": "https://arxiv.org/abs/2402.02846",
    "context": "Title: Machine Learning Resistant Amorphous Silicon Physically Unclonable Functions (PUFs)\nAbstract: We investigate usage of nonlinear wave chaotic amorphous silicon (a-Si) cavities as physically unclonable functions (PUF). Machine learning attacks on integrated electronic PUFs have been demonstrated to be very effective at modeling PUF behavior. Such attacks on integrated a-Si photonic PUFs are investigated through application of algorithms including linear regression, k-nearest neighbor, decision tree ensembles (random forests and gradient boosted trees), and deep neural networks (DNNs). We found that DNNs performed the best among all the algorithms studied but still failed to completely break the a-Si PUF security which we quantify through a private information metric. Furthermore, machine learning resistance of a-Si PUFs were found to be directly related to the strength of their nonlinear response.",
    "path": "papers/24/02/2402.02846.json",
    "total_tokens": 961,
    "translated_title": "机器学习抗性非晶硅物理不可克隆函数 (PUFs) 的研究",
    "translated_abstract": "我们研究了非线性波动混沌非晶硅 (a-Si) 腔体作为物理不可克隆函数 (PUFs) 的应用。已经证明，对集成电子PUFs的机器学习攻击可以非常有效地对PUF行为进行建模。通过应用包括线性回归、k-最近邻、决策树集成 (随机森林和梯度提升树) 和深度神经网络 (DNNs) 在内的算法，我们对集成的非晶硅光学PUFs进行了攻击研究。我们发现，在所有研究的算法中，DNNs表现最好，但仍无法完全破解a-Si PUF的安全性，我们通过一个私密信息度量将其量化。此外，我们发现非晶硅PUFs的机器学习抗性与其非线性响应的强度直接相关。",
    "tldr": "这项研究调查了利用非晶硅材料制作物理不可克隆函数 (PUF) 的应用，通过使用机器学习算法分析攻击这些集成电路PUF的效果，发现深度神经网络 (DNNs) 是最有效的算法，但仍无法完全破解a-Si PUF的安全性，此外，研究发现非晶硅PUFs的机器学习抗性与其非线性响应的强度相关。",
    "en_tdlr": "This research investigates the usage of amorphous silicon (a-Si) for physically unclonable functions (PUFs), and analyzes the effectiveness of machine learning attacks on these integrated circuit PUFs. Deep neural networks (DNNs) are found to be the most effective algorithm but still unable to completely break the security of a-Si PUFs, and the machine learning resistance of a-Si PUFs is directly related to their nonlinear response strength."
}