{
    "title": "Assessing the importance of long-range correlations for deep-learning-based sleep staging",
    "abstract": "arXiv:2402.17779v1 Announce Type: cross  Abstract: This study aims to elucidate the significance of long-range correlations for deep-learning-based sleep staging. It is centered around S4Sleep(TS), a recently proposed model for automated sleep staging. This model utilizes electroencephalography (EEG) as raw time series input and relies on structured state space sequence (S4) models as essential model component. Although the model already surpasses state-of-the-art methods for a moderate number of 15 input epochs, recent literature results suggest potential benefits from incorporating very long correlations spanning hundreds of input epochs. In this submission, we explore the possibility of achieving further enhancements by systematically scaling up the model's input size, anticipating potential improvements in prediction accuracy. In contrast to findings in literature, our results demonstrate that augmenting the input size does not yield a significant enhancement in the performance of ",
    "link": "https://arxiv.org/abs/2402.17779",
    "context": "Title: Assessing the importance of long-range correlations for deep-learning-based sleep staging\nAbstract: arXiv:2402.17779v1 Announce Type: cross  Abstract: This study aims to elucidate the significance of long-range correlations for deep-learning-based sleep staging. It is centered around S4Sleep(TS), a recently proposed model for automated sleep staging. This model utilizes electroencephalography (EEG) as raw time series input and relies on structured state space sequence (S4) models as essential model component. Although the model already surpasses state-of-the-art methods for a moderate number of 15 input epochs, recent literature results suggest potential benefits from incorporating very long correlations spanning hundreds of input epochs. In this submission, we explore the possibility of achieving further enhancements by systematically scaling up the model's input size, anticipating potential improvements in prediction accuracy. In contrast to findings in literature, our results demonstrate that augmenting the input size does not yield a significant enhancement in the performance of ",
    "path": "papers/24/02/2402.17779.json",
    "total_tokens": 856,
    "translated_title": "评估深度学习睡眠分期中长程相关性的重要性",
    "translated_abstract": "本研究旨在阐明长程相关性对基于深度学习的睡眠分期的重要性。它围绕着最近提出的用于自动睡眠分期的S4Sleep(TS)模型展开。该模型利用脑电图（EEG）作为原始时间序列输入，并依赖于结构化状态空间序列（S4）模型作为基本的模型组成部分。尽管该模型已经超越了现有方法在适度数量的15个输入周期上的表现，但最近的文献结果暗示了通过纳入涵盖数百个输入周期的非常长相关性可能会带来潜在的好处。在本研究中，我们通过系统地扩大模型的输入尺寸来探讨实现进一步优化的可能性，预期预测准确性可能会得到提高。与文献中的研究结果相反，我们的结果表明增加输入尺寸并未显著提高",
    "tldr": "本研究旨在评估深度学习睡眠分期中长程相关性的重要性，通过扩大模型输入尺寸来探索进一步提升预测准确性的可能性。",
    "en_tdlr": "This study aims to assess the importance of long-range correlations for deep-learning-based sleep staging by exploring the possibility of further improving prediction accuracy through scaling up the model's input size."
}