{
    "title": "Markovletics: Methods and A Novel Application for Learning Continuous-Time Markov Chain Mixtures",
    "abstract": "arXiv:2402.17730v1 Announce Type: new  Abstract: Sequential data naturally arises from user engagement on digital platforms like social media, music streaming services, and web navigation, encapsulating evolving user preferences and behaviors through continuous information streams. A notable unresolved query in stochastic processes is learning mixtures of continuous-time Markov chains (CTMCs). While there is progress in learning mixtures of discrete-time Markov chains with recovery guarantees [GKV16,ST23,KTT2023], the continuous scenario uncovers unique unexplored challenges. The intrigue in CTMC mixtures stems from their potential to model intricate continuous-time stochastic processes prevalent in various fields including social media, finance, and biology.   In this study, we introduce a novel framework for exploring CTMCs, emphasizing the influence of observed trails' length and mixture parameters on problem regimes, which demands specific algorithms. Through thorough experimentati",
    "link": "https://arxiv.org/abs/2402.17730",
    "context": "Title: Markovletics: Methods and A Novel Application for Learning Continuous-Time Markov Chain Mixtures\nAbstract: arXiv:2402.17730v1 Announce Type: new  Abstract: Sequential data naturally arises from user engagement on digital platforms like social media, music streaming services, and web navigation, encapsulating evolving user preferences and behaviors through continuous information streams. A notable unresolved query in stochastic processes is learning mixtures of continuous-time Markov chains (CTMCs). While there is progress in learning mixtures of discrete-time Markov chains with recovery guarantees [GKV16,ST23,KTT2023], the continuous scenario uncovers unique unexplored challenges. The intrigue in CTMC mixtures stems from their potential to model intricate continuous-time stochastic processes prevalent in various fields including social media, finance, and biology.   In this study, we introduce a novel framework for exploring CTMCs, emphasizing the influence of observed trails' length and mixture parameters on problem regimes, which demands specific algorithms. Through thorough experimentati",
    "path": "papers/24/02/2402.17730.json",
    "total_tokens": 767,
    "translated_title": "马尔科夫力学：学习连续时间马尔可夫链混合的方法和新颖应用",
    "translated_abstract": "随机数据自然产生于数字平台上用户的参与，比如社交媒体、音乐流媒体服务和网页导航，通过连续信息流体现了用户偏好和行为的演化。在随机过程中一个尚未解决的问题是学习连续时间马尔可夫链混合（CTMCs）。虽然在学习具有恢复保证的离散时间马尔可夫链混合方面取得了进展，但连续情景揭示了独特尚未探索的挑战。CTMC混合的吸引力在于它们有潜力对各个领域普遍存在的复杂连续时间随机过程进行建模，包括社交媒体、金融和生物学。",
    "tldr": "本研究引入了一个新颖框架来探索CTMCs，强调观察到的轨迹长度和混合参数对问题情境的影响，这需要特定的算法。"
}