{
    "title": "Generative Nowcasting of Marine Fog Visibility in the Grand Banks area and Sable Island in Canada",
    "abstract": "This study presents the application of generative deep learning techniques to evaluate marine fog visibility nowcasting using the FATIMA (Fog and turbulence interactions in the marine atmosphere) campaign observations collected during July 2022 in the North Atlantic in the Grand Banks area and vicinity of Sable Island (SI), northeast of Canada. The measurements were collected using the Vaisala Forward Scatter Sensor model FD70 and Weather Transmitter model WXT50, and Gill R3A ultrasonic anemometer mounted on the Research Vessel Atlantic Condor. To perform nowcasting, the time series of fog visibility (Vis), wind speed, dew point depression, and relative humidity with respect to water were preprocessed to have lagged time step features. Generative nowcasting of Vis time series for lead times of 30 and 60 minutes were performed using conditional generative adversarial networks (cGAN) regression at visibility thresholds of Vis < 1 km and < 10 km. Extreme gradient boosting (XGBoost) was us",
    "link": "https://arxiv.org/abs/2402.06800",
    "context": "Title: Generative Nowcasting of Marine Fog Visibility in the Grand Banks area and Sable Island in Canada\nAbstract: This study presents the application of generative deep learning techniques to evaluate marine fog visibility nowcasting using the FATIMA (Fog and turbulence interactions in the marine atmosphere) campaign observations collected during July 2022 in the North Atlantic in the Grand Banks area and vicinity of Sable Island (SI), northeast of Canada. The measurements were collected using the Vaisala Forward Scatter Sensor model FD70 and Weather Transmitter model WXT50, and Gill R3A ultrasonic anemometer mounted on the Research Vessel Atlantic Condor. To perform nowcasting, the time series of fog visibility (Vis), wind speed, dew point depression, and relative humidity with respect to water were preprocessed to have lagged time step features. Generative nowcasting of Vis time series for lead times of 30 and 60 minutes were performed using conditional generative adversarial networks (cGAN) regression at visibility thresholds of Vis < 1 km and < 10 km. Extreme gradient boosting (XGBoost) was us",
    "path": "papers/24/02/2402.06800.json",
    "total_tokens": 845,
    "translated_title": "在加拿大大滩地区和萨布尔岛上进行海洋雾能见度的生成式预测",
    "translated_abstract": "本研究利用生成式深度学习方法，通过对2022年7月在大西洋北部大滩地区和加拿大东北部的萨布尔岛附近进行的FATIMA（海洋大气中的雾和湍流相互作用）观测数据进行海洋雾能见度预测。观测数据包括使用Vaisala前向散射传感器模型FD70、天气传输器模型WXT50以及Research Vessel Atlantic Condor上安装的Gill R3A超声风速仪收集的雾能见度、风速、露点差和相对湿度。预测过程中，通过对雾能见度、风速、露点差和相对湿度进行时滞处理，生成式对雾能见度进行了30分钟和60分钟的预测，并设定了雾能见度小于1公里和小于10公里两种可见度阈值。此外，还使用了极限梯度提升（XGBoost）方法。",
    "tldr": "本研究利用生成式深度学习方法在加拿大大滩地区和萨布尔岛上预测海洋雾能见度，为30分钟和60分钟的可见度阈值提供了生成预测。"
}