{
    "title": "Privacy-Enhancing Collaborative Information Sharing through Federated Learning -- A Case of the Insurance Industry",
    "abstract": "arXiv:2402.14983v1 Announce Type: new  Abstract: The report demonstrates the benefits (in terms of improved claims loss modeling) of harnessing the value of Federated Learning (FL) to learn a single model across multiple insurance industry datasets without requiring the datasets themselves to be shared from one company to another. The application of FL addresses two of the most pressing concerns: limited data volume and data variety, which are caused by privacy concerns, the rarity of claim events, the lack of informative rating factors, etc.. During each round of FL, collaborators compute improvements on the model using their local private data, and these insights are combined to update a global model. Such aggregation of insights allows for an increase to the effectiveness in forecasting claims losses compared to models individually trained at each collaborator. Critically, this approach enables machine learning collaboration without the need for raw data to leave the compute infrast",
    "link": "https://arxiv.org/abs/2402.14983",
    "context": "Title: Privacy-Enhancing Collaborative Information Sharing through Federated Learning -- A Case of the Insurance Industry\nAbstract: arXiv:2402.14983v1 Announce Type: new  Abstract: The report demonstrates the benefits (in terms of improved claims loss modeling) of harnessing the value of Federated Learning (FL) to learn a single model across multiple insurance industry datasets without requiring the datasets themselves to be shared from one company to another. The application of FL addresses two of the most pressing concerns: limited data volume and data variety, which are caused by privacy concerns, the rarity of claim events, the lack of informative rating factors, etc.. During each round of FL, collaborators compute improvements on the model using their local private data, and these insights are combined to update a global model. Such aggregation of insights allows for an increase to the effectiveness in forecasting claims losses compared to models individually trained at each collaborator. Critically, this approach enables machine learning collaboration without the need for raw data to leave the compute infrast",
    "path": "papers/24/02/2402.14983.json",
    "total_tokens": 839,
    "translated_title": "通过联邦学习增强隐私保护的协作信息共享--以保险行业为例",
    "translated_abstract": "这份报告展示了利用联邦学习（FL）的价值，通过在多个保险行业数据集之间学习单一模型而无需将数据集从一家公司分享给另一家公司，以改进赔偿损失建模的好处。FL的应用解决了两个最紧迫的问题：数据量有限和数据种类繁多，这些问题是由隐私顾虑、赔偿事件的罕见性、缺乏信息性评级因素等引起的。在每一轮FL中，合作者使用他们的本地私有数据计算模型的改进，这些见解被结合起来更新一个全局模型。这种见解的聚合相对于在每个合作者单独训练的模型，可以增加对赔偿损失预测的有效性。关键是，这种方法使得机器学习协作无需原始数据离开计算基础设施。",
    "tldr": "通过联邦学习实现跨多个保险行业数据集学习单一模型的方法，解决了数据隐私保护问题，提高了赔偿损失模型的预测准确性。",
    "en_tdlr": "The paper demonstrates the benefits of utilizing Federated Learning to learn a single model across multiple insurance industry datasets, addressing privacy concerns and improving the accuracy of claims loss modeling."
}