{
    "title": "Cas-DiffCom: Cascaded diffusion model for infant longitudinal super-resolution 3D medical image completion",
    "abstract": "arXiv:2402.13776v1 Announce Type: cross  Abstract: Early infancy is a rapid and dynamic neurodevelopmental period for behavior and neurocognition. Longitudinal magnetic resonance imaging (MRI) is an effective tool to investigate such a crucial stage by capturing the developmental trajectories of the brain structures. However, longitudinal MRI acquisition always meets a serious data-missing problem due to participant dropout and failed scans, making longitudinal infant brain atlas construction and developmental trajectory delineation quite challenging. Thanks to the development of an AI-based generative model, neuroimage completion has become a powerful technique to retain as much available data as possible. However, current image completion methods usually suffer from inconsistency within each individual subject in the time dimension, compromising the overall quality. To solve this problem, our paper proposed a two-stage cascaded diffusion model, Cas-DiffCom, for dense and longitudinal",
    "link": "https://arxiv.org/abs/2402.13776",
    "context": "Title: Cas-DiffCom: Cascaded diffusion model for infant longitudinal super-resolution 3D medical image completion\nAbstract: arXiv:2402.13776v1 Announce Type: cross  Abstract: Early infancy is a rapid and dynamic neurodevelopmental period for behavior and neurocognition. Longitudinal magnetic resonance imaging (MRI) is an effective tool to investigate such a crucial stage by capturing the developmental trajectories of the brain structures. However, longitudinal MRI acquisition always meets a serious data-missing problem due to participant dropout and failed scans, making longitudinal infant brain atlas construction and developmental trajectory delineation quite challenging. Thanks to the development of an AI-based generative model, neuroimage completion has become a powerful technique to retain as much available data as possible. However, current image completion methods usually suffer from inconsistency within each individual subject in the time dimension, compromising the overall quality. To solve this problem, our paper proposed a two-stage cascaded diffusion model, Cas-DiffCom, for dense and longitudinal",
    "path": "papers/24/02/2402.13776.json",
    "total_tokens": 882,
    "translated_title": "Cas-DiffCom: 婴儿纵向超分辨率3D医学图像补全的级联扩散模型",
    "translated_abstract": "早期婴儿期是行为和神经认知快速且动态发展的重要阶段。纵向磁共振成像（MRI）是一种有效的工具，可通过捕捉脑结构的发育轨迹来探究这个关键阶段。然而，由于受试者退出和扫描失败，纵向MRI采集总会遇到严重的数据缺失问题，这使得纵向婴儿脑图构建和发育轨迹描绘变得非常具有挑战性。感谢基于人工智能的生成模型的发展，神经影像补全已成为一种保留尽可能多可用数据的强大技术。然而，当前的图像补全方法通常在时间维度内的每个个体主体内存在不一致性，从而影响整体质量。为解决这一问题，我们的论文提出了一个两阶段级联扩散模型Cas-DiffCom，用于密集和纵向",
    "tldr": "本文提出了一个两阶段级联扩散模型Cas-DiffCom，用于解决婴儿纵向3D医学图像补全中存在的个体时间维度一致性不足的问题。"
}