{
    "title": "Hyperparameter Tuning for Causal Inference with Double Machine Learning: A Simulation Study",
    "abstract": "Proper hyperparameter tuning is essential for achieving optimal performance of modern machine learning (ML) methods in predictive tasks. While there is an extensive literature on tuning ML learners for prediction, there is only little guidance available on tuning ML learners for causal machine learning and how to select among different ML learners. In this paper, we empirically assess the relationship between the predictive performance of ML methods and the resulting causal estimation based on the Double Machine Learning (DML) approach by Chernozhukov et al. (2018). DML relies on estimating so-called nuisance parameters by treating them as supervised learning problems and using them as plug-in estimates to solve for the (causal) parameter. We conduct an extensive simulation study using data from the 2019 Atlantic Causal Inference Conference Data Challenge. We provide empirical insights on the role of hyperparameter tuning and other practical decisions for causal estimation with DML. Fi",
    "link": "https://arxiv.org/abs/2402.04674",
    "context": "Title: Hyperparameter Tuning for Causal Inference with Double Machine Learning: A Simulation Study\nAbstract: Proper hyperparameter tuning is essential for achieving optimal performance of modern machine learning (ML) methods in predictive tasks. While there is an extensive literature on tuning ML learners for prediction, there is only little guidance available on tuning ML learners for causal machine learning and how to select among different ML learners. In this paper, we empirically assess the relationship between the predictive performance of ML methods and the resulting causal estimation based on the Double Machine Learning (DML) approach by Chernozhukov et al. (2018). DML relies on estimating so-called nuisance parameters by treating them as supervised learning problems and using them as plug-in estimates to solve for the (causal) parameter. We conduct an extensive simulation study using data from the 2019 Atlantic Causal Inference Conference Data Challenge. We provide empirical insights on the role of hyperparameter tuning and other practical decisions for causal estimation with DML. Fi",
    "path": "papers/24/02/2402.04674.json",
    "total_tokens": 895,
    "translated_title": "用于双机器学习的因果推断的超参数调整：一项模拟研究",
    "translated_abstract": "在预测任务中，适当的超参数调整对于现代机器学习方法的最佳性能至关重要。尽管有大量关于为预测调整机器学习算法的文献，但关于对因果机器学习算法进行调整和在不同算法之间进行选择方面的指导非常有限。本文通过Chernozhukov等人（2018）的双机器学习（DML）方法，从实证角度评估了机器学习方法的预测性能与其产生的因果估计之间的关系。DML依赖于通过将其视为监督学习问题并将其用作插件估计来估计所谓的干扰参数，并利用它们来解决（因果）参数。我们使用2019年大西洋因果推断会议数据挑战的数据进行了广泛的模拟研究。我们提供了关于超参数调整和其他实际决策对于DML的因果估计的作用的实证见解。",
    "tldr": "这项研究通过模拟研究评估了在因果推断中使用双机器学习方法的预测性能与因果估计之间关系，并提供了超参数调整和其他实际决策对于DML的因果估计的实证见解。",
    "en_tdlr": "This study empirically assesses the relationship between the predictive performance and causal estimation in causal inference using Double Machine Learning (DML), and provides empirical insights on the role of hyperparameter tuning and other practical decisions for causal estimation with DML."
}