{
    "title": "A Multi-Fidelity Methodology for Reduced Order Models with High-Dimensional Inputs",
    "abstract": "arXiv:2402.17061v1 Announce Type: new  Abstract: In the early stages of aerospace design, reduced order models (ROMs) are crucial for minimizing computational costs associated with using physics-rich field information in many-query scenarios requiring multiple evaluations. The intricacy of aerospace design demands the use of high-dimensional design spaces to capture detailed features and design variability accurately. However, these spaces introduce significant challenges, including the curse of dimensionality, which stems from both high-dimensional inputs and outputs necessitating substantial training data and computational effort. To address these complexities, this study introduces a novel multi-fidelity, parametric, and non-intrusive ROM framework designed for high-dimensional contexts. It integrates machine learning techniques for manifold alignment and dimension reduction employing Proper Orthogonal Decomposition (POD) and Model-based Active Subspace with multi-fidelity regressio",
    "link": "https://arxiv.org/abs/2402.17061",
    "context": "Title: A Multi-Fidelity Methodology for Reduced Order Models with High-Dimensional Inputs\nAbstract: arXiv:2402.17061v1 Announce Type: new  Abstract: In the early stages of aerospace design, reduced order models (ROMs) are crucial for minimizing computational costs associated with using physics-rich field information in many-query scenarios requiring multiple evaluations. The intricacy of aerospace design demands the use of high-dimensional design spaces to capture detailed features and design variability accurately. However, these spaces introduce significant challenges, including the curse of dimensionality, which stems from both high-dimensional inputs and outputs necessitating substantial training data and computational effort. To address these complexities, this study introduces a novel multi-fidelity, parametric, and non-intrusive ROM framework designed for high-dimensional contexts. It integrates machine learning techniques for manifold alignment and dimension reduction employing Proper Orthogonal Decomposition (POD) and Model-based Active Subspace with multi-fidelity regressio",
    "path": "papers/24/02/2402.17061.json",
    "total_tokens": 818,
    "translated_title": "一个适用于高维输入的降阶模型多保真度方法论",
    "translated_abstract": "在航空航天设计的早期阶段，降阶模型（ROMs）对于在多次评估界面物理丰富的场信息的许多查询情景中最小化计算成本至关重要。航空航天设计的复杂性要求使用高维设计空间来准确捕获详细特征和设计变异。然而，这些空间引入了重要挑战，包括维度的诅咒，这是由于高维输入和输出需要大量训练数据和计算努力。为了解决这些复杂性，本研究介绍了一种针对高维背景设计的新颖的多保真度、参数化和非侵入式ROM框架。它集成了机器学习技术用于流形对齐和维度减少，采用Proper Orthogonal Decomposition（POD）和基于模型的主动子空间与多保真度回归。",
    "tldr": "该研究介绍了一种面向高维设计空间的新型降阶模型多保真度方法，集成了机器学习技术用于流形对齐和维度减少。",
    "en_tdlr": "This study introduces a novel multi-fidelity methodology for reduced order models in high-dimensional design spaces, integrating machine learning techniques for manifold alignment and dimension reduction."
}