{
    "title": "Classification Under Strategic Self-Selection",
    "abstract": "arXiv:2402.15274v1 Announce Type: new  Abstract: When users stand to gain from certain predictions, they are prone to act strategically to obtain favorable predictive outcomes. Whereas most works on strategic classification consider user actions that manifest as feature modifications, we study a novel setting in which users decide -- in response to the learned classifier -- whether to at all participate (or not). For learning approaches of increasing strategic awareness, we study the effects of self-selection on learning, and the implications of learning on the composition of the self-selected population. We then propose a differentiable framework for learning under self-selective behavior, which can be optimized effectively. We conclude with experiments on real data and simulated behavior that both complement our analysis and demonstrate the utility of our approach.",
    "link": "https://arxiv.org/abs/2402.15274",
    "context": "Title: Classification Under Strategic Self-Selection\nAbstract: arXiv:2402.15274v1 Announce Type: new  Abstract: When users stand to gain from certain predictions, they are prone to act strategically to obtain favorable predictive outcomes. Whereas most works on strategic classification consider user actions that manifest as feature modifications, we study a novel setting in which users decide -- in response to the learned classifier -- whether to at all participate (or not). For learning approaches of increasing strategic awareness, we study the effects of self-selection on learning, and the implications of learning on the composition of the self-selected population. We then propose a differentiable framework for learning under self-selective behavior, which can be optimized effectively. We conclude with experiments on real data and simulated behavior that both complement our analysis and demonstrate the utility of our approach.",
    "path": "papers/24/02/2402.15274.json",
    "total_tokens": 765,
    "translated_title": "在战略自我选择下的分类",
    "translated_abstract": "当用户可以从某些预测中获益时，他们往往会采取战略行动以获得有利的预测结果。大多数关于战略分类的研究都考虑用户行为表现为特征修改，而我们研究了一种新颖的情况，在这种情况下，用户在学习分类器的情况下决定是否参与（或不参与）。为了学习增加战略意识的方法，我们研究了自我选择对学习的影响，以及学习对自我选择人口构成的影响。然后，我们提出了一个可在自我选择行为下学习的可微分框架，可以有效优化。我们最后通过对真实数据和模拟行为进行实验，这些实验既可以补充我们的分析，又可以展示我们方法的实用性。",
    "tldr": "用户在学习分类器后决定是否参与的战略自我选择对学习效果和自我选择人口构成产生了影响，我们提出了一种可优化的可微分框架。",
    "en_tdlr": "User's strategic self-selection, where they decide whether to participate after learning the classifier, impacts learning outcomes and the composition of the selected population, we propose an optimized differentiable framework for this scenario."
}