{
    "title": "A Fine-tuning Enhanced RAG System with Quantized Influence Measure as AI Judge",
    "abstract": "arXiv:2402.17081v1 Announce Type: new  Abstract: This study presents an innovative enhancement to retrieval-augmented generation (RAG) systems by seamlessly integrating fine-tuned large language models (LLMs) with vector databases. This integration capitalizes on the combined strengths of structured data retrieval and the nuanced comprehension provided by advanced LLMs. Central to our approach are the LoRA and QLoRA methodologies, which stand at the forefront of model refinement through parameter-efficient fine-tuning and memory optimization. A novel feature of our research is the incorporation of user feedback directly into the training process, ensuring the model's continuous adaptation to user expectations and thus, improving its performance and applicability. Additionally, we introduce a Quantized Influence Measure (QIM) as an innovative \"AI Judge\" mechanism to enhance the precision of result selection, further refining the system's accuracy. Accompanied by an executive diagram and",
    "link": "https://arxiv.org/abs/2402.17081",
    "context": "Title: A Fine-tuning Enhanced RAG System with Quantized Influence Measure as AI Judge\nAbstract: arXiv:2402.17081v1 Announce Type: new  Abstract: This study presents an innovative enhancement to retrieval-augmented generation (RAG) systems by seamlessly integrating fine-tuned large language models (LLMs) with vector databases. This integration capitalizes on the combined strengths of structured data retrieval and the nuanced comprehension provided by advanced LLMs. Central to our approach are the LoRA and QLoRA methodologies, which stand at the forefront of model refinement through parameter-efficient fine-tuning and memory optimization. A novel feature of our research is the incorporation of user feedback directly into the training process, ensuring the model's continuous adaptation to user expectations and thus, improving its performance and applicability. Additionally, we introduce a Quantized Influence Measure (QIM) as an innovative \"AI Judge\" mechanism to enhance the precision of result selection, further refining the system's accuracy. Accompanied by an executive diagram and",
    "path": "papers/24/02/2402.17081.json",
    "total_tokens": 871,
    "translated_title": "通过量化影响度作为人工智能评委的精细调优增强版RAG系统",
    "translated_abstract": "本研究提出了一种创新的增强检索增强生成（RAG）系统的方法，通过将经过微调的大型语言模型（LLMs）与向量数据库无缝集成。这种集成利用了结构化数据检索的优势和先进LLMs提供的细致理解能力。我们方法的核心是LoRA和QLoRA方法，它们处于模型细化的前沿，通过参数高效微调和内存优化提高模型的性能。我们研究的一个新特性是直接将用户反馈纳入训练过程，确保模型持续适应用户期望，从而提高其性能和适用性。此外，我们引入了量化影响度（QIM）作为一种创新的“AI评委”机制，增强结果选择的精度，进一步提高系统的准确性。伴随着一个执行图和",
    "tldr": "本研究通过将经过微调的大型语言模型与向量数据库集成，引入了LoRA和QLoRA方法，并直接将用户反馈纳入训练过程，同时引入量化影响度作为“Innovative AI Judge”机制，以提高系统的精确性。",
    "en_tdlr": "This study integrates fine-tuned large language models with vector databases, introduces LoRA and QLoRA methods, incorporates user feedback into the training process, and introduces Quantized Influence Measure as an \"Innovative AI Judge\" mechanism to enhance system accuracy."
}