{
    "title": "Bayesian Causal Inference with Gaussian Process Networks",
    "abstract": "Causal discovery and inference from observational data is an essential problem in statistics posing both modeling and computational challenges. These are typically addressed by imposing strict assumptions on the joint distribution such as linearity. We consider the problem of the Bayesian estimation of the effects of hypothetical interventions in the Gaussian Process Network (GPN) model, a flexible causal framework which allows describing the causal relationships nonparametrically. We detail how to perform causal inference on GPNs by simulating the effect of an intervention across the whole network and propagating the effect of the intervention on downstream variables. We further derive a simpler computational approximation by estimating the intervention distribution as a function of local variables only, modeling the conditional distributions via additive Gaussian processes. We extend both frameworks beyond the case of a known causal graph, incorporating uncertainty about the causal s",
    "link": "https://arxiv.org/abs/2402.00623",
    "context": "Title: Bayesian Causal Inference with Gaussian Process Networks\nAbstract: Causal discovery and inference from observational data is an essential problem in statistics posing both modeling and computational challenges. These are typically addressed by imposing strict assumptions on the joint distribution such as linearity. We consider the problem of the Bayesian estimation of the effects of hypothetical interventions in the Gaussian Process Network (GPN) model, a flexible causal framework which allows describing the causal relationships nonparametrically. We detail how to perform causal inference on GPNs by simulating the effect of an intervention across the whole network and propagating the effect of the intervention on downstream variables. We further derive a simpler computational approximation by estimating the intervention distribution as a function of local variables only, modeling the conditional distributions via additive Gaussian processes. We extend both frameworks beyond the case of a known causal graph, incorporating uncertainty about the causal s",
    "path": "papers/24/02/2402.00623.json",
    "total_tokens": 842,
    "translated_title": "基于高斯过程网络的贝叶斯因果推断",
    "translated_abstract": "从观测数据中进行因果推断和推断是统计学中的一个重要问题，它既涉及建模问题，也涉及计算问题。通常情况下，人们会对联合分布做出严格的假设，如线性性。我们考虑在高斯过程网络（GPN）模型中，对假设干预效果的贝叶斯估计问题，这是一个灵活的因果框架，可以非参数地描述因果关系。我们详细介绍了如何通过在整个网络上模拟干预效果，并在下游变量上传播干预效果来进行GPN的因果推断。我们进一步推导了一个简化的计算近似方法，通过仅将干预分布估计为局部变量的函数，并通过加性高斯过程对条件分布进行建模。我们将这两个框架扩展到了不仅仅是已知因果图的情况下，并引入了对因果结构的不确定性。",
    "tldr": "以高斯过程网络为基础，通过模拟干预效果和传播干预效果，进行灵活的贝叶斯因果推断，同时以局部变量为函数估计干预分布并使用加性高斯过程对条件分布进行建模。",
    "en_tdlr": "Bayesian causal inference is performed on Gaussian Process Networks (GPNs) by simulating and propagating intervention effects. The intervention distribution is estimated using local variables and the conditional distributions are modeled using additive Gaussian processes, allowing for flexible nonparametric causal relationships."
}