{
    "title": "DABS-LS: Deep Atlas-Based Segmentation Using Regional Level Set Self-Supervision",
    "abstract": "arXiv:2402.10425v1 Announce Type: cross  Abstract: Cochlear implants (CIs) are neural prosthetics used to treat patients with severe-to-profound hearing loss. Patient-specific modeling of CI stimulation of the auditory nerve fiber (ANFs) can help audiologists improve the CI programming. These models require localization of the ANFs relative to surrounding anatomy and the CI. Localization is challenging because the ANFs are so small they are not directly visible in clinical imaging. In this work, we hypothesize the position of the ANFs can be accurately inferred from the location of the internal auditory canal (IAC), which has high contrast in CT, since the ANFs pass through this canal between the cochlea and the brain. Inspired by VoxelMorph, in this paper we propose a deep atlas-based IAC segmentation network. We create a single atlas in which the IAC and ANFs are pre-localized. Our network is trained to produce deformation fields (DFs) mapping coordinates from the atlas to new target",
    "link": "https://arxiv.org/abs/2402.10425",
    "context": "Title: DABS-LS: Deep Atlas-Based Segmentation Using Regional Level Set Self-Supervision\nAbstract: arXiv:2402.10425v1 Announce Type: cross  Abstract: Cochlear implants (CIs) are neural prosthetics used to treat patients with severe-to-profound hearing loss. Patient-specific modeling of CI stimulation of the auditory nerve fiber (ANFs) can help audiologists improve the CI programming. These models require localization of the ANFs relative to surrounding anatomy and the CI. Localization is challenging because the ANFs are so small they are not directly visible in clinical imaging. In this work, we hypothesize the position of the ANFs can be accurately inferred from the location of the internal auditory canal (IAC), which has high contrast in CT, since the ANFs pass through this canal between the cochlea and the brain. Inspired by VoxelMorph, in this paper we propose a deep atlas-based IAC segmentation network. We create a single atlas in which the IAC and ANFs are pre-localized. Our network is trained to produce deformation fields (DFs) mapping coordinates from the atlas to new target",
    "path": "papers/24/02/2402.10425.json",
    "total_tokens": 908,
    "translated_title": "DABS-LS: 使用区域水平集自监督的深度基于图谱分割",
    "translated_abstract": "齿周植入物（CIs）是用于治疗严重至深度听力丧失患者的神经假体。对CIs刺激听神经纤维（ANFs）进行患者特异性建模可以帮助听力学家改善CI编程。这些模型需要定位ANFs相对于周围解剖结构和CI的位置。定位具有挑战性，因为ANFs非常小，在临床成像中不能直接看到。在这项工作中，我们假设ANFs的位置可以从内听道（IAC）的位置准确推断出来，在CT中，IAC具有很高的对比度，因为ANFs在耳蜗和大脑之间通过这个管道。受VoxelMorph启发，在本文中，我们提出了一种基于深度图谱的IAC分割网络。我们创建一个单一的图谱，其中IAC和ANFs已经被预定位。我们的网络被训练以生成将坐标从图谱映射到新目标的变形场（DFs）。",
    "tldr": "本研究提出了一种使用深度基于图谱的IAC分割网络，通过将IAC和ANFs预先定位在单个图谱中进行训练，从而准确推断ANFs的位置。",
    "en_tdlr": "This study presents a deep atlas-based IAC segmentation network, which accurately infers the position of ANFs by training on a single atlas where IAC and ANFs are pre-localized."
}