{
    "title": "From Words to Molecules: A Survey of Large Language Models in Chemistry",
    "abstract": "In recent years, Large Language Models (LLMs) have achieved significant success in natural language processing (NLP) and various interdisciplinary areas. However, applying LLMs to chemistry is a complex task that requires specialized domain knowledge. This paper provides a thorough exploration of the nuanced methodologies employed in integrating LLMs into the field of chemistry, delving into the complexities and innovations at this interdisciplinary juncture. Specifically, our analysis begins with examining how molecular information is fed into LLMs through various representation and tokenization methods. We then categorize chemical LLMs into three distinct groups based on the domain and modality of their input data, and discuss approaches for integrating these inputs for LLMs. Furthermore, this paper delves into the pretraining objectives with adaptations to chemical LLMs. After that, we explore the diverse applications of LLMs in chemistry, including novel paradigms for their applica",
    "link": "https://rss.arxiv.org/abs/2402.01439",
    "context": "Title: From Words to Molecules: A Survey of Large Language Models in Chemistry\nAbstract: In recent years, Large Language Models (LLMs) have achieved significant success in natural language processing (NLP) and various interdisciplinary areas. However, applying LLMs to chemistry is a complex task that requires specialized domain knowledge. This paper provides a thorough exploration of the nuanced methodologies employed in integrating LLMs into the field of chemistry, delving into the complexities and innovations at this interdisciplinary juncture. Specifically, our analysis begins with examining how molecular information is fed into LLMs through various representation and tokenization methods. We then categorize chemical LLMs into three distinct groups based on the domain and modality of their input data, and discuss approaches for integrating these inputs for LLMs. Furthermore, this paper delves into the pretraining objectives with adaptations to chemical LLMs. After that, we explore the diverse applications of LLMs in chemistry, including novel paradigms for their applica",
    "path": "papers/24/02/2402.01439.json",
    "total_tokens": 895,
    "translated_title": "从词语到分子：大型语言模型在化学领域的调查",
    "translated_abstract": "在近年来，大型语言模型（LLMs）在自然语言处理（NLP）和各种跨学科领域取得了重要的成功。然而，将LLMs应用于化学是一个复杂的任务，需要专门的领域知识。本文对将LLMs整合到化学领域中所采用的微妙方法进行了全面的探索，深入探讨了这个跨学科交汇点的复杂性和创新性。具体而言，我们的分析从通过各种表示和标记化方法将分子信息输入LLMs开始。然后，我们根据输入数据的领域和模态将化学LLMs分为三个不同的组，并讨论将这些输入与LLMs整合的方法。此外，本文还探讨了适用于化学LLMs的预训练目标。在此之后，我们探讨了LLMs在化学中的多样化应用，包括它们的新范式的应用。",
    "tldr": "本论文调查了大型语言模型在化学领域的应用。研究内容涵盖了分子信息输入LLMs的表示和标记化方法、化学LLMs的不同组群及其整合方法、适用于化学LLMs的预训练目标等。此外，还探讨了LLMs在化学中的各种应用。",
    "en_tdlr": "This paper surveys the application of Large Language Models (LLMs) in the field of chemistry, including the methodologies of input representation, categorization and integration, as well as pretraining objectives. It also explores the diverse applications of LLMs in chemistry."
}