{
    "title": "Edu-ConvoKit: An Open-Source Library for Education Conversation Data",
    "abstract": "We introduce Edu-ConvoKit, an open-source library designed to handle pre-processing, annotation and analysis of conversation data in education. Resources for analyzing education conversation data are scarce, making the research challenging to perform and therefore hard to access. We address these challenges with Edu-ConvoKit. Edu-ConvoKit is open-source (https://github.com/stanfordnlp/edu-convokit ), pip-installable (https://pypi.org/project/edu-convokit/ ), with comprehensive documentation (https://edu-convokit.readthedocs.io/en/latest/ ). Our demo video is available at: https://youtu.be/zdcI839vAko?si=h9qlnl76ucSuXb8- . We include additional resources, such as Colab applications of Edu-ConvoKit to three diverse education datasets and a repository of Edu-ConvoKit related papers, that can be found in our GitHub repository.",
    "link": "https://arxiv.org/abs/2402.05111",
    "context": "Title: Edu-ConvoKit: An Open-Source Library for Education Conversation Data\nAbstract: We introduce Edu-ConvoKit, an open-source library designed to handle pre-processing, annotation and analysis of conversation data in education. Resources for analyzing education conversation data are scarce, making the research challenging to perform and therefore hard to access. We address these challenges with Edu-ConvoKit. Edu-ConvoKit is open-source (https://github.com/stanfordnlp/edu-convokit ), pip-installable (https://pypi.org/project/edu-convokit/ ), with comprehensive documentation (https://edu-convokit.readthedocs.io/en/latest/ ). Our demo video is available at: https://youtu.be/zdcI839vAko?si=h9qlnl76ucSuXb8- . We include additional resources, such as Colab applications of Edu-ConvoKit to three diverse education datasets and a repository of Edu-ConvoKit related papers, that can be found in our GitHub repository.",
    "path": "papers/24/02/2402.05111.json",
    "total_tokens": 810,
    "translated_title": "Edu-ConvoKit:一种用于教育会话数据的开源库",
    "translated_abstract": "我们介绍了Edu-ConvoKit，这是一个设计用于处理教育会话数据的预处理、注释和分析的开源库。教育会话数据的分析资源稀缺，使得研究变得困难，因此难以获取。我们通过Edu-ConvoKit来解决这些挑战。Edu-ConvoKit是开源的（https://github.com/stanfordnlp/edu-convokit），可以通过pip进行安装（https://pypi.org/project/edu-convokit/），并具有全面的文档（https://edu-convokit.readthedocs.io/en/latest/）。我们的演示视频可在以下链接中观看：https://youtu.be/zdcI839vAko?si=h9qlnl76ucSuXb8-。我们还在GitHub仓库中提供了附加资源，例如Edu-ConvoKit在三个不同教育数据集上的Colab应用程序以及Edu-ConvoKit相关论文的存储库。",
    "tldr": "Edu-ConvoKit是一种用于处理教育会话数据的开源库，它解决了教育会话数据分析资源稀缺的问题，提供了全面的文档和附加资源。",
    "en_tdlr": "Edu-ConvoKit is an open-source library designed to handle conversation data in education, addressing the scarcity of resources for analyzing such data. It provides comprehensive documentation and additional resources for researchers."
}