{
    "title": "Uncover the nature of overlapping community in cities",
    "abstract": "Urban spaces, though often perceived as discrete communities, are shared by various functional and social groups. Our study introduces a graph-based physics-aware deep learning framework, illuminating the intricate overlapping nature inherent in urban communities. Through analysis of individual mobile phone positioning data at Twin Cities metro area (TCMA) in Minnesota, USA, our findings reveal that 95.7 % of urban functional complexity stems from the overlapping structure of communities during weekdays. Significantly, our research not only quantifies these overlaps but also reveals their compelling correlations with income and racial indicators, unraveling the complex segregation patterns in U.S. cities. As the first to elucidate the overlapping nature of urban communities, this work offers a unique geospatial perspective on looking at urban structures, highlighting the nuanced interplay of socioeconomic dynamics within cities.",
    "link": "https://arxiv.org/abs/2402.00222",
    "context": "Title: Uncover the nature of overlapping community in cities\nAbstract: Urban spaces, though often perceived as discrete communities, are shared by various functional and social groups. Our study introduces a graph-based physics-aware deep learning framework, illuminating the intricate overlapping nature inherent in urban communities. Through analysis of individual mobile phone positioning data at Twin Cities metro area (TCMA) in Minnesota, USA, our findings reveal that 95.7 % of urban functional complexity stems from the overlapping structure of communities during weekdays. Significantly, our research not only quantifies these overlaps but also reveals their compelling correlations with income and racial indicators, unraveling the complex segregation patterns in U.S. cities. As the first to elucidate the overlapping nature of urban communities, this work offers a unique geospatial perspective on looking at urban structures, highlighting the nuanced interplay of socioeconomic dynamics within cities.",
    "path": "papers/24/02/2402.00222.json",
    "total_tokens": 873,
    "translated_title": "揭示城市中重叠社区的本质",
    "translated_abstract": "城市空间虽然常被视为离散社区，但实际上被不同功能和社会群体共享。本研究引入了一种基于图形的物理感知深度学习框架，揭示了城市社区中错综复杂的重叠本质。通过对美国明尼苏达州双城大都市区（TCMA）的个人移动电话定位数据进行分析，我们的研究发现，95.7％的城市功能复杂性源于工作日社区的重叠结构。更重要的是，我们的研究不仅量化了这些重叠，还揭示了它们与收入和种族指标之间的显著相关性，解开了美国城市中复杂的隔离模式。作为第一个阐明城市社区重叠本质的研究，本工作提供了一种独特的地理空间视角观察城市结构，突显了城市内社会经济动力的微妙相互作用。",
    "tldr": "本研究通过分析明尼苏达州双城地区的移动电话定位数据，揭示了城市社区中重叠的复杂本质，并发现其与收入和种族指标之间的显著相关性，解开了美国城市中复杂的隔离模式。",
    "en_tdlr": "This study investigates the nature of overlapping communities in urban areas by analyzing mobile phone positioning data in Minnesota, USA. The findings reveal the complex nature of overlaps and their compelling correlations with income and racial indicators, uncovering complex segregation patterns in US cities."
}