{
    "title": "VlogQA: Task, Dataset, and Baseline Models for Vietnamese Spoken-Based Machine Reading Comprehension",
    "abstract": "This paper presents the development process of a Vietnamese spoken language corpus for machine reading comprehension (MRC) tasks and provides insights into the challenges and opportunities associated with using real-world data for machine reading comprehension tasks. The existing MRC corpora in Vietnamese mainly focus on formal written documents such as Wikipedia articles, online newspapers, or textbooks. In contrast, the VlogQA consists of 10,076 question-answer pairs based on 1,230 transcript documents sourced from YouTube -- an extensive source of user-uploaded content, covering the topics of food and travel. By capturing the spoken language of native Vietnamese speakers in natural settings, an obscure corner overlooked in Vietnamese research, the corpus provides a valuable resource for future research in reading comprehension tasks for the Vietnamese language. Regarding performance evaluation, our deep-learning models achieved the highest F1 score of 75.34% on the test set, indicat",
    "link": "https://arxiv.org/abs/2402.02655",
    "context": "Title: VlogQA: Task, Dataset, and Baseline Models for Vietnamese Spoken-Based Machine Reading Comprehension\nAbstract: This paper presents the development process of a Vietnamese spoken language corpus for machine reading comprehension (MRC) tasks and provides insights into the challenges and opportunities associated with using real-world data for machine reading comprehension tasks. The existing MRC corpora in Vietnamese mainly focus on formal written documents such as Wikipedia articles, online newspapers, or textbooks. In contrast, the VlogQA consists of 10,076 question-answer pairs based on 1,230 transcript documents sourced from YouTube -- an extensive source of user-uploaded content, covering the topics of food and travel. By capturing the spoken language of native Vietnamese speakers in natural settings, an obscure corner overlooked in Vietnamese research, the corpus provides a valuable resource for future research in reading comprehension tasks for the Vietnamese language. Regarding performance evaluation, our deep-learning models achieved the highest F1 score of 75.34% on the test set, indicat",
    "path": "papers/24/02/2402.02655.json",
    "total_tokens": 979,
    "translated_title": "VlogQA: 越南口语机器阅读理解任务、数据集和基线模型",
    "translated_abstract": "本文介绍了一个用于机器阅读理解任务的越南口语语料库的开发过程，并提供了使用真实数据进行机器阅读理解任务时遇到的挑战和机遇的见解。现有的越南机器阅读理解语料库主要关注正式的书面文档，如维基百科文章、在线报纸或教科书。与之相反，VlogQA包含了10,076个问答对，基于从YouTube获取的1,230份剧本文档，YouTube是一个包含了用户上传内容的广泛资源，涵盖了食物和旅行等主题。通过捕捉越南本土人在自然环境中的口语表达，这是越南研究中被忽视的一个角落，该语料库为未来越南语阅读理解任务的研究提供了宝贵的资源。在性能评估方面，我们的深度学习模型在测试集上取得了最高的F1分数为75.34%，表明了其优秀的性能。",
    "tldr": "本文介绍了VlogQA：越南口语机器阅读理解任务、数据集和基线模型，并提供了使用真实数据进行任务的挑战和机遇的见解。VlogQA是一个基于来自YouTube的剧本文档的问答对数据集，涵盖了食物和旅行等主题。深度学习模型在测试集取得了75.34%的最高F1分数。",
    "en_tdlr": "This paper presents VlogQA, a task, dataset, and baseline models for Vietnamese spoken-based machine reading comprehension. It provides insights into the challenges and opportunities associated with using real-world data for machine reading comprehension tasks. The VlogQA dataset consists of question-answer pairs based on transcript documents sourced from YouTube, covering topics like food and travel. The deep learning models achieved a top F1 score of 75.34% on the test set."
}