{
    "title": "VerifiNER: Verification-augmented NER via Knowledge-grounded Reasoning with Large Language Models",
    "abstract": "arXiv:2402.18374v1 Announce Type: new  Abstract: Recent approaches in domain-specific named entity recognition (NER), such as biomedical NER, have shown remarkable advances. However, they still lack of faithfulness, producing erroneous predictions. We assume that knowledge of entities can be useful in verifying the correctness of the predictions. Despite the usefulness of knowledge, resolving such errors with knowledge is nontrivial, since the knowledge itself does not directly indicate the ground-truth label. To this end, we propose VerifiNER, a post-hoc verification framework that identifies errors from existing NER methods using knowledge and revises them into more faithful predictions. Our framework leverages the reasoning abilities of large language models to adequately ground on knowledge and the contextual information in the verification process. We validate effectiveness of VerifiNER through extensive experiments on biomedical datasets. The results suggest that VerifiNER can su",
    "link": "https://arxiv.org/abs/2402.18374",
    "context": "Title: VerifiNER: Verification-augmented NER via Knowledge-grounded Reasoning with Large Language Models\nAbstract: arXiv:2402.18374v1 Announce Type: new  Abstract: Recent approaches in domain-specific named entity recognition (NER), such as biomedical NER, have shown remarkable advances. However, they still lack of faithfulness, producing erroneous predictions. We assume that knowledge of entities can be useful in verifying the correctness of the predictions. Despite the usefulness of knowledge, resolving such errors with knowledge is nontrivial, since the knowledge itself does not directly indicate the ground-truth label. To this end, we propose VerifiNER, a post-hoc verification framework that identifies errors from existing NER methods using knowledge and revises them into more faithful predictions. Our framework leverages the reasoning abilities of large language models to adequately ground on knowledge and the contextual information in the verification process. We validate effectiveness of VerifiNER through extensive experiments on biomedical datasets. The results suggest that VerifiNER can su",
    "path": "papers/24/02/2402.18374.json",
    "total_tokens": 814,
    "translated_title": "VerifiNER: 通过大型语言模型基于知识驱动的推理增强的命名实体识别",
    "translated_abstract": "最近在特定领域命名实体识别（NER）中的方法，如生物医学NER，已经取得了显著进展。然而，它们仍然缺乏忠实性，会产生错误的预测。我们认为实体的知识可以在验证预测的正确性方面发挥作用。尽管知识的有用性，使用知识来纠正这些错误并不容易，因为知识本身并不直接指示出真实标签。因此，我们提出了VerifiNER，一个利用知识从现有NER方法中识别错误并将其修正为更忠实预测的后续验证框架。我们的框架利用大型语言模型的推理能力，在验证过程中充分基于知识和上下文信息。我们通过对生物医学数据集的广泛实验验证了VerifiNER的有效性。结果表明VerifiNER可以",
    "tldr": "VerifiNER是一个后续验证框架，通过知识识别并修正现有命名实体识别方法的错误，以实现更忠实的预测。",
    "en_tdlr": "VerifiNER is a post-hoc verification framework that identifies and corrects errors from existing named entity recognition methods using knowledge to achieve more faithful predictions."
}