{
    "title": "Collaborative non-parametric two-sample testing",
    "abstract": "This paper addresses the multiple two-sample test problem in a graph-structured setting, which is a common scenario in fields such as Spatial Statistics and Neuroscience. Each node $v$ in fixed graph deals with a two-sample testing problem between two node-specific probability density functions (pdfs), $p_v$ and $q_v$. The goal is to identify nodes where the null hypothesis $p_v = q_v$ should be rejected, under the assumption that connected nodes would yield similar test outcomes. We propose the non-parametric collaborative two-sample testing (CTST) framework that efficiently leverages the graph structure and minimizes the assumptions over $p_v$ and $q_v$. Our methodology integrates elements from f-divergence estimation, Kernel Methods, and Multitask Learning. We use synthetic experiments and a real sensor network detecting seismic activity to demonstrate that CTST outperforms state-of-the-art non-parametric statistical tests that apply at each node independently, hence disregard the g",
    "link": "https://arxiv.org/abs/2402.05715",
    "context": "Title: Collaborative non-parametric two-sample testing\nAbstract: This paper addresses the multiple two-sample test problem in a graph-structured setting, which is a common scenario in fields such as Spatial Statistics and Neuroscience. Each node $v$ in fixed graph deals with a two-sample testing problem between two node-specific probability density functions (pdfs), $p_v$ and $q_v$. The goal is to identify nodes where the null hypothesis $p_v = q_v$ should be rejected, under the assumption that connected nodes would yield similar test outcomes. We propose the non-parametric collaborative two-sample testing (CTST) framework that efficiently leverages the graph structure and minimizes the assumptions over $p_v$ and $q_v$. Our methodology integrates elements from f-divergence estimation, Kernel Methods, and Multitask Learning. We use synthetic experiments and a real sensor network detecting seismic activity to demonstrate that CTST outperforms state-of-the-art non-parametric statistical tests that apply at each node independently, hence disregard the g",
    "path": "papers/24/02/2402.05715.json",
    "total_tokens": 936,
    "translated_title": "协同非参数的两样本检验",
    "translated_abstract": "本文针对图结构设置中的多个两样本检验问题进行了研究，这是空间统计和神经科学等领域中的常见情景。在固定图中的每个节点v都涉及到两个特定节点概率密度函数（pdfs）p_v和q_v之间的两样本检验问题。我们的目标是在假设连接的节点会产生类似的检验结果的条件下，确定应拒绝零假设p_v = q_v的节点。我们提出了非参数的协同两样本检验（CTST）框架，该框架有效利用了图结构并最小化了对p_v和q_v的假设。我们的方法集成了f-分布估计、核方法和多任务学习的要点。我们使用合成实验和检测地震活动的真实传感器网络来证明CTST优于最先进的在每个节点独立应用的非参数统计检验方法，因此忽视了图结构的重要性。",
    "tldr": "本文提出了协同非参数的两样本检验（CTST）框架，该框架有效利用了图结构和最小化了对概率密度函数的假设，通过集成f-分布估计、核方法和多任务学习的要点，将传统的在每个节点独立应用的方法优化，对图结构中的多个两样本检验问题进行了更好的处理和分析。",
    "en_tdlr": "This paper introduces the collaborative non-parametric two-sample testing (CTST) framework, which efficiently utilizes the graph structure and minimizes assumptions about probability density functions. By integrating key elements from f-divergence estimation, Kernel Methods, and Multitask Learning, it improves upon traditional methods that apply independently at each node and provides better analysis and handling for multiple two-sample testing problems in graph-structured scenarios."
}