{
    "title": "Learning to Model Diverse Driving Behaviors in Highly Interactive Autonomous Driving Scenarios with Multi-Agent Reinforcement Learning",
    "abstract": "arXiv:2402.13481v1 Announce Type: cross  Abstract: Autonomous vehicles trained through Multi-Agent Reinforcement Learning (MARL) have shown impressive results in many driving scenarios. However, the performance of these trained policies can be impacted when faced with diverse driving styles and personalities, particularly in highly interactive situations. This is because conventional MARL algorithms usually operate under the assumption of fully cooperative behavior among all agents and focus on maximizing team rewards during training. To address this issue, we introduce the Personality Modeling Network (PeMN), which includes a cooperation value function and personality parameters to model the varied interactions in high-interactive scenarios. The PeMN also enables the training of a background traffic flow with diverse behaviors, thereby improving the performance and generalization of the ego vehicle. Our extensive experimental studies, which incorporate different personality parameters",
    "link": "https://arxiv.org/abs/2402.13481",
    "context": "Title: Learning to Model Diverse Driving Behaviors in Highly Interactive Autonomous Driving Scenarios with Multi-Agent Reinforcement Learning\nAbstract: arXiv:2402.13481v1 Announce Type: cross  Abstract: Autonomous vehicles trained through Multi-Agent Reinforcement Learning (MARL) have shown impressive results in many driving scenarios. However, the performance of these trained policies can be impacted when faced with diverse driving styles and personalities, particularly in highly interactive situations. This is because conventional MARL algorithms usually operate under the assumption of fully cooperative behavior among all agents and focus on maximizing team rewards during training. To address this issue, we introduce the Personality Modeling Network (PeMN), which includes a cooperation value function and personality parameters to model the varied interactions in high-interactive scenarios. The PeMN also enables the training of a background traffic flow with diverse behaviors, thereby improving the performance and generalization of the ego vehicle. Our extensive experimental studies, which incorporate different personality parameters",
    "path": "papers/24/02/2402.13481.json",
    "total_tokens": 793,
    "translated_title": "用多智能体强化学习在高度互动自动驾驶场景中学习建模多样的驾驶行为",
    "translated_abstract": "通过多智能体强化学习（MARL）训练的自动驾驶车辆在许多驾驶场景中展示出了令人印象深刻的结果。然而，在面对多样的驾驶风格和个性，特别是在高度互动的情况下，这些训练策略的性能可能会受到影响。为了解决这个问题，我们引入了Personality Modeling Network（PeMN），其中包括一个合作值函数和个性参数，用来建模高度互动场景中的各种交互。PeMN还可以训练具有不同行为的背景交通流，从而提高自车的性能和泛化能力。我们的广泛实验研究融入了不同的个性参数。",
    "tldr": "引入了Personality Modeling Network (PeMN)来模拟高度互动场景中各种驾驶交互，通过训练背景交通流改善自车性能和泛化能力"
}