{
    "title": "SIDU-TXT: An XAI Algorithm for NLP with a Holistic Assessment Approach",
    "abstract": "Explainable AI (XAI) aids in deciphering 'black-box' models. While several methods have been proposed and evaluated primarily in the image domain, the exploration of explainability in the text domain remains a growing research area. In this paper, we delve into the applicability of XAI methods for the text domain. In this context, the 'Similarity Difference and Uniqueness' (SIDU) XAI method, recognized for its superior capability in localizing entire salient regions in image-based classification is extended to textual data. The extended method, SIDU-TXT, utilizes feature activation maps from 'black-box' models to generate heatmaps at a granular, word-based level, thereby providing explanations that highlight contextually significant textual elements crucial for model predictions. Given the absence of a unified standard for assessing XAI methods, this study applies a holistic three-tiered comprehensive evaluation framework: Functionally-Grounded, Human-Grounded and Application-Grounded,",
    "link": "https://arxiv.org/abs/2402.03043",
    "context": "Title: SIDU-TXT: An XAI Algorithm for NLP with a Holistic Assessment Approach\nAbstract: Explainable AI (XAI) aids in deciphering 'black-box' models. While several methods have been proposed and evaluated primarily in the image domain, the exploration of explainability in the text domain remains a growing research area. In this paper, we delve into the applicability of XAI methods for the text domain. In this context, the 'Similarity Difference and Uniqueness' (SIDU) XAI method, recognized for its superior capability in localizing entire salient regions in image-based classification is extended to textual data. The extended method, SIDU-TXT, utilizes feature activation maps from 'black-box' models to generate heatmaps at a granular, word-based level, thereby providing explanations that highlight contextually significant textual elements crucial for model predictions. Given the absence of a unified standard for assessing XAI methods, this study applies a holistic three-tiered comprehensive evaluation framework: Functionally-Grounded, Human-Grounded and Application-Grounded,",
    "path": "papers/24/02/2402.03043.json",
    "total_tokens": 993,
    "translated_title": "SIDU-TXT: 一种具有整体评估方法的NLP可解释的人工智能算法",
    "translated_abstract": "可解释的人工智能（XAI）有助于解读“黑盒”模型。虽然已经提出并评估了多种主要用于图像领域的方法，但解释性在文本领域中的探索仍然是一个不断增长的研究领域。本文探讨了XAI方法在文本领域中的适用性。在这个背景下，我们扩展了一种被认为在基于图像的分类中定位整个显著区域能力优越的XAI方法——相似度差异和独特性（SIDU）的方法，将其应用于文本数据。扩展方法SIDU-TXT利用来自“黑盒”模型的特征激活图生成热力图，以词为单位提供解释，突出显示对模型预测至关重要的有上下文意义的文本元素。鉴于还没有统一的XAI评估标准，本研究应用了一个综合的三层评估框架：功能基础、人类基础和应用基础评估。",
    "tldr": "本论文探究了可解释的人工智能（XAI）方法在文本领域的适用性，并将相似度差异和独特性（SIDU）方法扩展到文本数据，提供了对模型预测关键的有上下文意义的文本元素的解释。本研究采用了一个综合的三层评估框架来评估XAI方法。",
    "en_tdlr": "This paper explores the applicability of Explainable AI (XAI) methods in the text domain and extends the Similarity Difference and Uniqueness (SIDU) method to textual data, providing explanations for contextually significant textual elements crucial for model predictions. The study applies a holistic three-tiered evaluation framework to assess XAI methods."
}