{
    "title": "HKD-SHO: A hybrid smart home system based on knowledge-based and data-driven services",
    "abstract": "arXiv:2402.15521v1 Announce Type: new  Abstract: A smart home is realized by setting up various services. Several methods have been proposed to create smart home services, which can be divided into knowledge-based and data-driven approaches. However, knowledge-based approaches usually require manual input from the inhabitant, which can be complicated if the physical phenomena of the concerned environment states are complex, and the inhabitant does not know how to adjust related actuators to achieve the target values of the states monitored by services. Moreover, machine learning-based data-driven approaches that we are interested in are like black boxes and cannot show the inhabitant in which situations certain services proposed certain actuators' states. To solve these problems, we propose a hybrid system called HKD-SHO (Hybrid Knowledge-based and Data-driven services based Smart HOme system), where knowledge-based and machine learning-based data-driven services are profitably integra",
    "link": "https://arxiv.org/abs/2402.15521",
    "context": "Title: HKD-SHO: A hybrid smart home system based on knowledge-based and data-driven services\nAbstract: arXiv:2402.15521v1 Announce Type: new  Abstract: A smart home is realized by setting up various services. Several methods have been proposed to create smart home services, which can be divided into knowledge-based and data-driven approaches. However, knowledge-based approaches usually require manual input from the inhabitant, which can be complicated if the physical phenomena of the concerned environment states are complex, and the inhabitant does not know how to adjust related actuators to achieve the target values of the states monitored by services. Moreover, machine learning-based data-driven approaches that we are interested in are like black boxes and cannot show the inhabitant in which situations certain services proposed certain actuators' states. To solve these problems, we propose a hybrid system called HKD-SHO (Hybrid Knowledge-based and Data-driven services based Smart HOme system), where knowledge-based and machine learning-based data-driven services are profitably integra",
    "path": "papers/24/02/2402.15521.json",
    "total_tokens": 831,
    "translated_title": "基于知识和数据驱动服务的混合智能家居系统 - HKD-SHO",
    "translated_abstract": "一个智能家居通过设置各种服务来实现。已经提出了几种用于创建智能家居服务的方法，可以分为基于知识和数据驱动的方法。然而，基于知识的方法通常需要居民的手动输入，如果所关注环境状态的物理现象复杂，而且居民不知道如何调整相关执行器以实现服务监视的状态的目标值，则可能会变得复杂。此外，我们感兴趣的基于机器学习的数据驱动方法就像黑匣子一样，无法向居民展示在哪些情况下某些服务提出了某些执行器状态。为了解决这些问题，我们提出了一个名为HKD-SHO（基于混合知识和数据驱动服务的智能家居系统）的混合系统。",
    "tldr": "提出了一个名为HKD-SHO的混合智能家居系统，将基于知识和基于机器学习的数据驱动服务有益地融合在一起，解决了智能家居系统中基于知识和数据驱动方法的问题。",
    "en_tdlr": "A hybrid smart home system called HKD-SHO is proposed to profitably integrate knowledge-based and machine learning-based data-driven services, addressing the issues of knowledge-based and data-driven approaches in smart home systems."
}