{
    "title": "GARNN: An Interpretable Graph Attentive Recurrent Neural Network for Predicting Blood Glucose Levels via Multivariate Time Series",
    "abstract": "arXiv:2402.16230v1 Announce Type: cross  Abstract: Accurate prediction of future blood glucose (BG) levels can effectively improve BG management for people living with diabetes, thereby reducing complications and improving quality of life. The state of the art of BG prediction has been achieved by leveraging advanced deep learning methods to model multi-modal data, i.e., sensor data and self-reported event data, organised as multi-variate time series (MTS). However, these methods are mostly regarded as ``black boxes'' and not entirely trusted by clinicians and patients. In this paper, we propose interpretable graph attentive recurrent neural networks (GARNNs) to model MTS, explaining variable contributions via summarizing variable importance and generating feature maps by graph attention mechanisms instead of post-hoc analysis. We evaluate GARNNs on four datasets, representing diverse clinical scenarios. Upon comparison with twelve well-established baseline methods, GARNNs not only ach",
    "link": "https://arxiv.org/abs/2402.16230",
    "context": "Title: GARNN: An Interpretable Graph Attentive Recurrent Neural Network for Predicting Blood Glucose Levels via Multivariate Time Series\nAbstract: arXiv:2402.16230v1 Announce Type: cross  Abstract: Accurate prediction of future blood glucose (BG) levels can effectively improve BG management for people living with diabetes, thereby reducing complications and improving quality of life. The state of the art of BG prediction has been achieved by leveraging advanced deep learning methods to model multi-modal data, i.e., sensor data and self-reported event data, organised as multi-variate time series (MTS). However, these methods are mostly regarded as ``black boxes'' and not entirely trusted by clinicians and patients. In this paper, we propose interpretable graph attentive recurrent neural networks (GARNNs) to model MTS, explaining variable contributions via summarizing variable importance and generating feature maps by graph attention mechanisms instead of post-hoc analysis. We evaluate GARNNs on four datasets, representing diverse clinical scenarios. Upon comparison with twelve well-established baseline methods, GARNNs not only ach",
    "path": "papers/24/02/2402.16230.json",
    "total_tokens": 805,
    "translated_title": "GARNN: 一种可解释的图注意力循环神经网络，用于通过多元时间序列预测血糖水平",
    "translated_abstract": "精确预测未来血糖（BG）水平可以有效改善糖尿病患者的血糖管理，从而减少并发症，提高生活质量。本文提出了可解释的图注意力循环神经网络（GARNNs），用于建模多元时间序列（MTS），通过总结变量重要性解释变量贡献，并通过图注意机制生成特征图，而不是进行事后分析。我们在代表不同临床场景的四个数据集上评估了GARNNs。与十二种公认的基准方法相比，GARNNs不仅实现了BG预测的最新技术水平，还更具解释性。",
    "tldr": "提出了一种可解释的图注意力循环神经网络（GARNNs），用于通过多元时间序列预测血糖水平，并实现了更具解释性的变量贡献总结和特征图生成。",
    "en_tdlr": "Introduced an interpretable graph attentive recurrent neural network (GARNNs) for predicting blood glucose levels via multivariate time series, achieving more interpretable variable contributions summarization and feature map generation."
}