{
    "title": "TrackGPT -- A generative pre-trained transformer for cross-domain entity trajectory forecasting",
    "abstract": "The forecasting of entity trajectories at future points in time is a critical capability gap in applications across both Commercial and Defense sectors. Transformers, and specifically Generative Pre-trained Transformer (GPT) networks have recently revolutionized several fields of Artificial Intelligence, most notably Natural Language Processing (NLP) with the advent of Large Language Models (LLM) like OpenAI's ChatGPT. In this research paper, we introduce TrackGPT, a GPT-based model for entity trajectory forecasting that has shown utility across both maritime and air domains, and we expect to perform well in others. TrackGPT stands as a pioneering GPT model capable of producing accurate predictions across diverse entity time series datasets, demonstrating proficiency in generating both long-term forecasts with sustained accuracy and short-term forecasts with high precision. We present benchmarks against state-of-the-art deep learning techniques, showing that TrackGPT's forecasting capa",
    "link": "https://arxiv.org/abs/2402.00066",
    "context": "Title: TrackGPT -- A generative pre-trained transformer for cross-domain entity trajectory forecasting\nAbstract: The forecasting of entity trajectories at future points in time is a critical capability gap in applications across both Commercial and Defense sectors. Transformers, and specifically Generative Pre-trained Transformer (GPT) networks have recently revolutionized several fields of Artificial Intelligence, most notably Natural Language Processing (NLP) with the advent of Large Language Models (LLM) like OpenAI's ChatGPT. In this research paper, we introduce TrackGPT, a GPT-based model for entity trajectory forecasting that has shown utility across both maritime and air domains, and we expect to perform well in others. TrackGPT stands as a pioneering GPT model capable of producing accurate predictions across diverse entity time series datasets, demonstrating proficiency in generating both long-term forecasts with sustained accuracy and short-term forecasts with high precision. We present benchmarks against state-of-the-art deep learning techniques, showing that TrackGPT's forecasting capa",
    "path": "papers/24/02/2402.00066.json",
    "total_tokens": 886,
    "translated_title": "TrackGPT -- 用于跨领域实体轨迹预测的生成式预训练变换器",
    "translated_abstract": "在商业和国防领域的应用中，对未来时间点的实体轨迹进行预测是一个关键的能力缺口。近年来，变换器和特别是生成式预训练变换器（GPT）网络已经在人工智能的几个领域革命化，其中最为著名的是使用开放AI的ChatGPT等大型语言模型（LLM）的自然语言处理（NLP）。在本研究论文中，我们介绍了TrackGPT，一种基于GPT的实体轨迹预测模型，该模型在海上和航空领域都显示出了实用性，并且我们预计在其他领域也能表现出色。TrackGPT是一种开创性的GPT模型，能够在不同的实体时间序列数据集上产生准确的预测，展示了长期预测具有持续准确性和短期预测具有高精度的能力。我们与最先进的深度学习技术进行的基准测试显示，TrackGPT的预测能力很高。",
    "tldr": "TrackGPT是一种基于GPT的实体轨迹预测模型，能够生成准确的预测结果，包括长期预测和短期预测，并在多个领域展现出良好的性能。",
    "en_tdlr": "TrackGPT is a GPT-based model for entity trajectory forecasting that can produce accurate predictions, including both long-term and short-term forecasts, and has shown strong performance in multiple domains."
}