{
    "title": "A hybrid iterative method based on MIONet for PDEs: Theory and numerical examples",
    "abstract": "We propose a hybrid iterative method based on MIONet for PDEs, which combines the traditional numerical iterative solver and the recent powerful machine learning method of neural operator, and further systematically analyze its theoretical properties, including the convergence condition, the spectral behavior, as well as the convergence rate, in terms of the errors of the discretization and the model inference. We show the theoretical results for the frequently-used smoothers, i.e. Richardson (damped Jacobi) and Gauss-Seidel. We give an upper bound of the convergence rate of the hybrid method w.r.t. the model correction period, which indicates a minimum point to make the hybrid iteration converge fastest. Several numerical examples including the hybrid Richardson (Gauss-Seidel) iteration for the 1-d (2-d) Poisson equation are presented to verify our theoretical results, and also reflect an excellent acceleration effect. As a meshless acceleration method, it is provided with enormous po",
    "link": "https://arxiv.org/abs/2402.07156",
    "context": "Title: A hybrid iterative method based on MIONet for PDEs: Theory and numerical examples\nAbstract: We propose a hybrid iterative method based on MIONet for PDEs, which combines the traditional numerical iterative solver and the recent powerful machine learning method of neural operator, and further systematically analyze its theoretical properties, including the convergence condition, the spectral behavior, as well as the convergence rate, in terms of the errors of the discretization and the model inference. We show the theoretical results for the frequently-used smoothers, i.e. Richardson (damped Jacobi) and Gauss-Seidel. We give an upper bound of the convergence rate of the hybrid method w.r.t. the model correction period, which indicates a minimum point to make the hybrid iteration converge fastest. Several numerical examples including the hybrid Richardson (Gauss-Seidel) iteration for the 1-d (2-d) Poisson equation are presented to verify our theoretical results, and also reflect an excellent acceleration effect. As a meshless acceleration method, it is provided with enormous po",
    "path": "papers/24/02/2402.07156.json",
    "total_tokens": 852,
    "translated_title": "基于MIONet的混合迭代方法用于PDEs: 理论和数值实例研究",
    "translated_abstract": "我们提出了一种基于MIONet的混合迭代方法用于PDEs，该方法结合了传统的数值迭代求解器和最近强大的神经操作符机器学习方法，并进一步系统地分析了它在离散化误差和模型推断误差方面的收敛条件、谱行为以及收敛速率等理论性质。我们对常用的平滑器，如Richardson（阻尼雅可比）和Gauss-Seidel，给出了理论结果。我们给出了混合方法相对于模型修正周期的收敛速度的上界，这表明了使混合迭代最快收敛的最小点。我们还通过几个数值实例，包括1维（2维）泊松方程的混合Richardson（Gauss-Seidel）迭代，验证了我们的理论结果，同时反映出了卓越的加速效果。作为一种无网格加速方法，它具备巨大的潜力。",
    "tldr": "基于MIONet的混合迭代方法结合了传统的数值迭代求解器和神经操作符机器学习方法，具备卓越的加速效果。",
    "en_tdlr": "A hybrid iterative method based on MIONet for PDEs combines traditional numerical iterative solvers with neural operator machine learning methods, resulting in excellent acceleration effects."
}