{
    "title": "Comparative Analysis of Data Preprocessing Methods, Feature Selection Techniques and Machine Learning Models for Improved Classification and Regression Performance on Imbalanced Genetic Data",
    "abstract": "arXiv:2402.14980v1 Announce Type: cross  Abstract: Rapid advancements in genome sequencing have led to the collection of vast amounts of genomics data. Researchers may be interested in using machine learning models on such data to predict the pathogenicity or clinical significance of a genetic mutation. However, many genetic datasets contain imbalanced target variables that pose challenges to machine learning models: observations are skewed/imbalanced in regression tasks or class-imbalanced in classification tasks. Genetic datasets are also often high-cardinal and contain skewed predictor variables, which poses further challenges. We aimed to investigate the effects of data preprocessing, feature selection techniques, and model selection on the performance of models trained on these datasets. We measured performance with 5-fold cross-validation and compared averaged r-squared and accuracy metrics across different combinations of techniques. We found that outliers/skew in predictor or t",
    "link": "https://arxiv.org/abs/2402.14980",
    "context": "Title: Comparative Analysis of Data Preprocessing Methods, Feature Selection Techniques and Machine Learning Models for Improved Classification and Regression Performance on Imbalanced Genetic Data\nAbstract: arXiv:2402.14980v1 Announce Type: cross  Abstract: Rapid advancements in genome sequencing have led to the collection of vast amounts of genomics data. Researchers may be interested in using machine learning models on such data to predict the pathogenicity or clinical significance of a genetic mutation. However, many genetic datasets contain imbalanced target variables that pose challenges to machine learning models: observations are skewed/imbalanced in regression tasks or class-imbalanced in classification tasks. Genetic datasets are also often high-cardinal and contain skewed predictor variables, which poses further challenges. We aimed to investigate the effects of data preprocessing, feature selection techniques, and model selection on the performance of models trained on these datasets. We measured performance with 5-fold cross-validation and compared averaged r-squared and accuracy metrics across different combinations of techniques. We found that outliers/skew in predictor or t",
    "path": "papers/24/02/2402.14980.json",
    "total_tokens": 885,
    "translated_title": "数据预处理方法、特征选择技术和机器学习模型在不平衡遗传数据上提高分类和回归性能的比较分析",
    "translated_abstract": "基因组测序技术的快速发展导致了大量基因组数据的收集。研究人员可能有兴趣在这些数据上使用机器学习模型来预测基因突变的致病性或临床意义。然而，许多遗传数据集包含不平衡的目标变量，这给机器学习模型带来挑战：在回归任务中观察结果倾斜/不平衡，在分类任务中类别不平衡。遗传数据集通常具有高基数和倾斜的预测变量，这进一步增加了挑战。我们旨在研究数据预处理、特征选择技术和模型选择对训练在这些数据集上的模型性能的影响。我们使用5折交叉验证测量性能，并比较不同技术组合下的平均r平方和准确率指标。我们发现预测变量或目标变量中的异常值/倾斜会对模型的性能产生影响。",
    "tldr": "研究比较了数据预处理、特征选择和模型选择对训练遗传数据集上模型性能的影响，发现异常值和倾斜会影响模型性能。"
}