{
    "title": "Survey of Privacy Threats and Countermeasures in Federated Learning",
    "abstract": "Federated learning is widely considered to be as a privacy-aware learning method because no training data is exchanged directly between clients. Nevertheless, there are threats to privacy in federated learning, and privacy countermeasures have been studied. However, we note that common and unique privacy threats among typical types of federated learning have not been categorized and described in a comprehensive and specific way. In this paper, we describe privacy threats and countermeasures for the typical types of federated learning; horizontal federated learning, vertical federated learning, and transfer federated learning.",
    "link": "https://arxiv.org/abs/2402.00342",
    "context": "Title: Survey of Privacy Threats and Countermeasures in Federated Learning\nAbstract: Federated learning is widely considered to be as a privacy-aware learning method because no training data is exchanged directly between clients. Nevertheless, there are threats to privacy in federated learning, and privacy countermeasures have been studied. However, we note that common and unique privacy threats among typical types of federated learning have not been categorized and described in a comprehensive and specific way. In this paper, we describe privacy threats and countermeasures for the typical types of federated learning; horizontal federated learning, vertical federated learning, and transfer federated learning.",
    "path": "papers/24/02/2402.00342.json",
    "total_tokens": 674,
    "translated_title": "联邦学习中隐私威胁和对策的调查",
    "translated_abstract": "联邦学习被广泛认为是一种注重隐私的学习方法，因为客户端之间没有直接交换训练数据。然而，联邦学习中存在隐私威胁，并且已经对隐私对策进行了研究。然而，我们注意到常见和独特的隐私威胁在典型类型的联邦学习中尚未以全面和具体的方式进行分类和描述。在本文中，我们描述了水平联邦学习、垂直联邦学习和迁移联邦学习的隐私威胁和对策。",
    "tldr": "本文调查了联邦学习中的隐私威胁和对策，并对水平联邦学习、垂直联邦学习和迁移联邦学习的典型类型进行了分类和描述。",
    "en_tdlr": "This paper surveys the privacy threats and countermeasures in federated learning, categorizing and describing them for the typical types of federated learning: horizontal, vertical, and transfer."
}