{
    "title": "Invertible Fourier Neural Operators for Tackling Both Forward and Inverse Problems",
    "abstract": "arXiv:2402.11722v1 Announce Type: new  Abstract: Fourier Neural Operator (FNO) is a popular operator learning method, which has demonstrated state-of-the-art performance across many tasks. However, FNO is mainly used in forward prediction, yet a large family of applications rely on solving inverse problems. In this paper, we propose an invertible Fourier Neural Operator (iFNO) that tackles both the forward and inverse problems. We designed a series of invertible Fourier blocks in the latent channel space to share the model parameters, efficiently exchange the information, and mutually regularize the learning for the bi-directional tasks. We integrated a variational auto-encoder to capture the intrinsic structures within the input space and to enable posterior inference so as to overcome challenges of illposedness, data shortage, noises, etc. We developed a three-step process for pre-training and fine tuning for efficient training. The evaluations on five benchmark problems have demonst",
    "link": "https://arxiv.org/abs/2402.11722",
    "context": "Title: Invertible Fourier Neural Operators for Tackling Both Forward and Inverse Problems\nAbstract: arXiv:2402.11722v1 Announce Type: new  Abstract: Fourier Neural Operator (FNO) is a popular operator learning method, which has demonstrated state-of-the-art performance across many tasks. However, FNO is mainly used in forward prediction, yet a large family of applications rely on solving inverse problems. In this paper, we propose an invertible Fourier Neural Operator (iFNO) that tackles both the forward and inverse problems. We designed a series of invertible Fourier blocks in the latent channel space to share the model parameters, efficiently exchange the information, and mutually regularize the learning for the bi-directional tasks. We integrated a variational auto-encoder to capture the intrinsic structures within the input space and to enable posterior inference so as to overcome challenges of illposedness, data shortage, noises, etc. We developed a three-step process for pre-training and fine tuning for efficient training. The evaluations on five benchmark problems have demonst",
    "path": "papers/24/02/2402.11722.json",
    "total_tokens": 910,
    "translated_title": "可逆傅立叶神经算子处理前向和反问题",
    "translated_abstract": "傅立叶神经算子（FNO）是一种流行的算子学习方法，已在许多任务中表现出色。然而，FNO主要用于前向预测，而许多应用程序依赖于解决反问题。在本文中，我们提出了一种可逆傅立叶神经算子（iFNO），旨在解决前向和反向问题。我们在潜在通道空间中设计了一系列可逆傅立叶块，以分享模型参数，有效交换信息，并相互正规化双向任务的学习。我们集成了变分自动编码器以捕获输入空间内在结构，并实现后验推断，以克服不适定性、数据短缺、噪声等挑战。我们开发了一个三步过程，用于预训练和微调以实现高效训练。对五个基准问题的评估已经证明...",
    "tldr": "本文提出了可逆傅立叶神经算子(iFNO)，通过设计可逆傅立叶块和集成变分自动编码器，实现同时处理前向与反向问题的能力，为双向任务的学习提供有效的参数共享和信息交换，克服了不适定性、数据短缺和噪声等挑战。",
    "en_tdlr": "This paper introduces invertible Fourier Neural Operator (iFNO) that tackles both forward and inverse problems by designing invertible Fourier blocks and integrating variational auto-encoder, providing efficient parameter sharing and information exchange for bi-directional tasks, overcoming challenges of illposedness, data shortage, and noises."
}