{
    "title": "Multi-line AI-assisted Code Authoring",
    "abstract": "CodeCompose is an AI-assisted code authoring tool powered by large language models (LLMs) that provides inline suggestions to 10's of thousands of developers at Meta. In this paper, we present how we scaled the product from displaying single-line suggestions to multi-line suggestions. This evolution required us to overcome several unique challenges in improving the usability of these suggestions for developers.   First, we discuss how multi-line suggestions can have a 'jarring' effect, as the LLM's suggestions constantly move around the developer's existing code, which would otherwise result in decreased productivity and satisfaction.   Second, multi-line suggestions take significantly longer to generate; hence we present several innovative investments we made to reduce the perceived latency for users. These model-hosting optimizations sped up multi-line suggestion latency by 2.5x.   Finally, we conduct experiments on 10's of thousands of engineers to understand how multi-line suggesti",
    "link": "https://arxiv.org/abs/2402.04141",
    "context": "Title: Multi-line AI-assisted Code Authoring\nAbstract: CodeCompose is an AI-assisted code authoring tool powered by large language models (LLMs) that provides inline suggestions to 10's of thousands of developers at Meta. In this paper, we present how we scaled the product from displaying single-line suggestions to multi-line suggestions. This evolution required us to overcome several unique challenges in improving the usability of these suggestions for developers.   First, we discuss how multi-line suggestions can have a 'jarring' effect, as the LLM's suggestions constantly move around the developer's existing code, which would otherwise result in decreased productivity and satisfaction.   Second, multi-line suggestions take significantly longer to generate; hence we present several innovative investments we made to reduce the perceived latency for users. These model-hosting optimizations sped up multi-line suggestion latency by 2.5x.   Finally, we conduct experiments on 10's of thousands of engineers to understand how multi-line suggesti",
    "path": "papers/24/02/2402.04141.json",
    "total_tokens": 876,
    "translated_title": "多行AI辅助代码创作",
    "translated_abstract": "CodeCompose是一款由大型语言模型（LLMs）驱动的AI辅助代码创作工具，为Meta的数万名开发人员提供内联建议。本文介绍了我们如何将该产品从显示单行建议扩展到多行建议。这一演进过程中，我们需要解决改进这些建议对开发人员可用性的多个独特挑战。首先，我们讨论了多行建议可能产生的“刺耳”效果，因为LLM的建议会不断移动开发人员已有的代码，从而降低生产力和满意度。其次，生成多行建议需要更长的时间；因此，我们提出了几项创新投资，以减少用户感知的延迟。这些模型托管优化将多行建议的延迟时间加快了2.5倍。最后，我们对数万名工程师进行实验，以了解多行建议对开发人员的影响。",
    "tldr": "这项研究介绍了CodeCompose，一款由大型语言模型驱动的AI辅助代码创作工具，将单行建议扩展为多行建议。作者克服了多个挑战，提高了多行建议的可用性，并进行了大规模实验来评估其对开发人员的影响。",
    "en_tdlr": "This research presents CodeCompose, an AI-assisted code authoring tool powered by large language models, which extends from single-line to multi-line suggestions. The authors overcome various challenges to improve the usability of the multi-line suggestions and conduct large-scale experiments to evaluate their impact on developers."
}