{
    "title": "Structure-Informed Protein Language Model",
    "abstract": "Protein language models are a powerful tool for learning protein representations through pre-training on vast protein sequence datasets. However, traditional protein language models lack explicit structural supervision, despite its relevance to protein function. To address this issue, we introduce the integration of remote homology detection to distill structural information into protein language models without requiring explicit protein structures as input. We evaluate the impact of this structure-informed training on downstream protein function prediction tasks. Experimental results reveal consistent improvements in function annotation accuracy for EC number and GO term prediction. Performance on mutant datasets, however, varies based on the relationship between targeted properties and protein structures. This underscores the importance of considering this relationship when applying structure-aware training to protein function prediction tasks. Code and model weights are available at",
    "link": "https://arxiv.org/abs/2402.05856",
    "context": "Title: Structure-Informed Protein Language Model\nAbstract: Protein language models are a powerful tool for learning protein representations through pre-training on vast protein sequence datasets. However, traditional protein language models lack explicit structural supervision, despite its relevance to protein function. To address this issue, we introduce the integration of remote homology detection to distill structural information into protein language models without requiring explicit protein structures as input. We evaluate the impact of this structure-informed training on downstream protein function prediction tasks. Experimental results reveal consistent improvements in function annotation accuracy for EC number and GO term prediction. Performance on mutant datasets, however, varies based on the relationship between targeted properties and protein structures. This underscores the importance of considering this relationship when applying structure-aware training to protein function prediction tasks. Code and model weights are available at",
    "path": "papers/24/02/2402.05856.json",
    "total_tokens": 820,
    "translated_title": "结构信息驱动的蛋白质语言模型",
    "translated_abstract": "蛋白质语言模型通过在广阔的蛋白质序列数据集上进行预训练，可以学习蛋白质表示。然而，传统的蛋白质语言模型缺乏明确的结构监督，尽管与蛋白质功能相关。为了解决这个问题，我们引入了远程同源性检测的集成，将结构信息融入蛋白质语言模型，而无需明确的蛋白质结构作为输入。我们评估了这种结构信息驱动训练对下游蛋白质功能预测任务的影响。实验结果显示，对于EC编号和GO术语预测的功能注释准确性均有一致的改善。然而，在突变数据集上的性能则根据目标属性和蛋白质结构的关系而变化。这强调了在应用结构感知训练于蛋白质功能预测任务时考虑这种关系的重要性。",
    "tldr": "该论文介绍了一种结构信息驱动的蛋白质语言模型，通过集成远程同源性检测，将结构信息融入模型，从而提高了蛋白质功能预测的准确性。",
    "en_tdlr": "This paper introduces a structure-informed protein language model that improves protein function prediction accuracy by integrating remote homology detection to distill structural information into the model."
}