{
    "title": "Predictive Linear Online Tracking for Unknown Targets",
    "abstract": "arXiv:2402.10036v1 Announce Type: cross  Abstract: In this paper, we study the problem of online tracking in linear control systems, where the objective is to follow a moving target. Unlike classical tracking control, the target is unknown, non-stationary, and its state is revealed sequentially, thus, fitting the framework of online non-stochastic control. We consider the case of quadratic costs and propose a new algorithm, called predictive linear online tracking (PLOT). The algorithm uses recursive least squares with exponential forgetting to learn a time-varying dynamic model of the target. The learned model is used in the optimal policy under the framework of receding horizon control. We show the dynamic regret of PLOT scales with $\\mathcal{O}(\\sqrt{TV_T})$, where $V_T$ is the total variation of the target dynamics and $T$ is the time horizon. Unlike prior work, our theoretical results hold for non-stationary targets. We implement PLOT on a real quadrotor and provide open-source so",
    "link": "https://arxiv.org/abs/2402.10036",
    "context": "Title: Predictive Linear Online Tracking for Unknown Targets\nAbstract: arXiv:2402.10036v1 Announce Type: cross  Abstract: In this paper, we study the problem of online tracking in linear control systems, where the objective is to follow a moving target. Unlike classical tracking control, the target is unknown, non-stationary, and its state is revealed sequentially, thus, fitting the framework of online non-stochastic control. We consider the case of quadratic costs and propose a new algorithm, called predictive linear online tracking (PLOT). The algorithm uses recursive least squares with exponential forgetting to learn a time-varying dynamic model of the target. The learned model is used in the optimal policy under the framework of receding horizon control. We show the dynamic regret of PLOT scales with $\\mathcal{O}(\\sqrt{TV_T})$, where $V_T$ is the total variation of the target dynamics and $T$ is the time horizon. Unlike prior work, our theoretical results hold for non-stationary targets. We implement PLOT on a real quadrotor and provide open-source so",
    "path": "papers/24/02/2402.10036.json",
    "total_tokens": 999,
    "translated_title": "预测性线性在线追踪未知目标",
    "translated_abstract": "本文研究了在线线性控制系统中的追踪问题，目标是跟随一个移动的目标。与经典的追踪控制不同，目标是未知的、非平稳的，并且它的状态逐步揭示，因此适合在线非随机控制的框架。我们考虑了二次成本的情况，并提出了一种新算法，称为预测性线性在线追踪（PLOT）。该算法使用具有指数遗忘的递归最小二乘法来学习目标的时变动态模型。所学模型在递推视线控制的框架下用于优化策略。我们证明了PLOT的动态遗憾与$\\mathcal{O}(\\sqrt{TV_T})$成比例，其中$V_T$是目标动力学的总变化量，$T$是时间长度。与先前的工作不同，我们的理论结果适用于非平稳目标。我们在一个真实的四旋翼机上实现了PLOT，并提供了开源代码。",
    "tldr": "本文提出了一种名为预测性线性在线追踪（PLOT）的算法，用于在线追踪未知目标。该算法使用具有指数遗忘的递归最小二乘法来学习目标的时变动态模型，并在递推视线控制的框架下使用所学模型进行最优策略。与先前的工作不同，我们的理论结果适用于非平稳目标。",
    "en_tdlr": "This paper proposes a new algorithm called Predictive Linear Online Tracking (PLOT) for online tracking of unknown targets. The algorithm uses recursive least squares with exponential forgetting to learn a time-varying dynamic model of the target and uses the learned model in the optimal policy under the framework of receding horizon control. Unlike prior work, our theoretical results hold for non-stationary targets."
}