{
    "title": "A Morphologically-Aware Dictionary-based Data Augmentation Technique for Machine Translation of Under-Represented Languages",
    "abstract": "The availability of parallel texts is crucial to the performance of machine translation models. However, most of the world's languages face the predominant challenge of data scarcity. In this paper, we propose strategies to synthesize parallel data relying on morpho-syntactic information and using bilingual lexicons along with a small amount of seed parallel data. Our methodology adheres to a realistic scenario backed by the small parallel seed data. It is linguistically informed, as it aims to create augmented data that is more likely to be grammatically correct. We analyze how our synthetic data can be combined with raw parallel data and demonstrate a consistent improvement in performance in our experiments on 14 languages (28 English <-> X pairs) ranging from well- to very low-resource ones. Our method leads to improvements even when using only five seed sentences and a bilingual lexicon.",
    "link": "https://arxiv.org/abs/2402.01939",
    "context": "Title: A Morphologically-Aware Dictionary-based Data Augmentation Technique for Machine Translation of Under-Represented Languages\nAbstract: The availability of parallel texts is crucial to the performance of machine translation models. However, most of the world's languages face the predominant challenge of data scarcity. In this paper, we propose strategies to synthesize parallel data relying on morpho-syntactic information and using bilingual lexicons along with a small amount of seed parallel data. Our methodology adheres to a realistic scenario backed by the small parallel seed data. It is linguistically informed, as it aims to create augmented data that is more likely to be grammatically correct. We analyze how our synthetic data can be combined with raw parallel data and demonstrate a consistent improvement in performance in our experiments on 14 languages (28 English <-> X pairs) ranging from well- to very low-resource ones. Our method leads to improvements even when using only five seed sentences and a bilingual lexicon.",
    "path": "papers/24/02/2402.01939.json",
    "total_tokens": 893,
    "translated_title": "一种对于少见语言机器翻译的词典数据增强技术",
    "translated_abstract": "平行文本的可用性对于机器翻译模型的性能至关重要。然而，世界上大多数语言面临数据稀缺的主要挑战。在本文中，我们提出了一种依赖于形态句法信息和使用双语词典以及少量种子平行数据合成平行数据的策略。我们的方法论遵循了一个由小规模平行种子数据支持的现实情境。它在语言学上是有文化常识的，因为它旨在创建更有可能是语法正确的增强数据。我们分析了如何将我们的合成数据与原始平行数据相结合，并在我们对包括14种语言（28个英语<->X对）在内的实验中展示了性能的一致提高，这些语言从资源充裕到资源极少的范围都有。即使只使用五个种子句子和一个双语词典，我们的方法也能带来改进。",
    "tldr": "本文提出了一种通过使用形态句法信息和双语词典来合成平行数据的方法，从而解决了少见语言机器翻译中数据稀缺的问题。实验证明，即使只使用少量种子数据和双语词典，该方法在14种语言上都能显著提高性能。",
    "en_tdlr": "This paper proposes a method for synthesizing parallel data in under-represented language machine translation using morpho-syntactic information and bilingual lexicons. The method demonstrates consistent performance improvements in 14 languages, even with a small amount of seed data and a bilingual lexicon."
}