{
    "title": "Learning reduced-order Quadratic-Linear models in Process Engineering using Operator Inference",
    "abstract": "arXiv:2402.17698v1 Announce Type: cross  Abstract: In this work, we address the challenge of efficiently modeling dynamical systems in process engineering. We use reduced-order model learning, specifically operator inference. This is a non-intrusive, data-driven method for learning dynamical systems from time-domain data. The application in our study is carbon dioxide methanation, an important reaction within the Power-to-X framework, to demonstrate its potential. The numerical results show the ability of the reduced-order models constructed with operator inference to provide a reduced yet accurate surrogate solution. This represents an important milestone towards the implementation of fast and reliable digital twin architectures.",
    "link": "https://arxiv.org/abs/2402.17698",
    "context": "Title: Learning reduced-order Quadratic-Linear models in Process Engineering using Operator Inference\nAbstract: arXiv:2402.17698v1 Announce Type: cross  Abstract: In this work, we address the challenge of efficiently modeling dynamical systems in process engineering. We use reduced-order model learning, specifically operator inference. This is a non-intrusive, data-driven method for learning dynamical systems from time-domain data. The application in our study is carbon dioxide methanation, an important reaction within the Power-to-X framework, to demonstrate its potential. The numerical results show the ability of the reduced-order models constructed with operator inference to provide a reduced yet accurate surrogate solution. This represents an important milestone towards the implementation of fast and reliable digital twin architectures.",
    "path": "papers/24/02/2402.17698.json",
    "total_tokens": 695,
    "translated_title": "在过程工程中使用算子推断学习降阶二次-线性模型",
    "translated_abstract": "在这项工作中，我们解决了在过程工程中高效建模动态系统的挑战。我们使用降阶模型学习，具体来说是算子推断。这是一种非侵入式、数据驱动的从时域数据学习动态系统的方法。我们的研究应用是二氧化碳甲烷化反应，这是电力转化技术框架中的重要反应，以展示其潜力。数值结果表明，用算子推断构建的降阶模型能够提供一个简化但准确的替代解决方案。这标志着实现快速可靠数字孪生架构的重要里程碑。",
    "tldr": "使用算子推断学习的降阶模型在过程工程中建模动态系统，为实现快速可靠的数字孪生架构迈出重要一步。",
    "en_tdlr": "Learning reduced-order models using operator inference in process engineering for modeling dynamical systems is a significant step towards implementing fast and reliable digital twin architectures."
}