{
    "title": "Large language model empowered participatory urban planning",
    "abstract": "Participatory urban planning is the mainstream of modern urban planning and involves the active engagement of different stakeholders. However, the traditional participatory paradigm encounters challenges in time and manpower, while the generative planning tools fail to provide adjustable and inclusive solutions. This research introduces an innovative urban planning approach integrating Large Language Models (LLMs) within the participatory process. The framework, based on the crafted LLM agent, consists of role-play, collaborative generation, and feedback iteration, solving a community-level land-use task catering to 1000 distinct interests. Empirical experiments in diverse urban communities exhibit LLM's adaptability and effectiveness across varied planning scenarios. The results were evaluated on four metrics, surpassing human experts in satisfaction and inclusion, and rivaling state-of-the-art reinforcement learning methods in service and ecology. Further analysis shows the advantage",
    "link": "https://arxiv.org/abs/2402.01698",
    "context": "Title: Large language model empowered participatory urban planning\nAbstract: Participatory urban planning is the mainstream of modern urban planning and involves the active engagement of different stakeholders. However, the traditional participatory paradigm encounters challenges in time and manpower, while the generative planning tools fail to provide adjustable and inclusive solutions. This research introduces an innovative urban planning approach integrating Large Language Models (LLMs) within the participatory process. The framework, based on the crafted LLM agent, consists of role-play, collaborative generation, and feedback iteration, solving a community-level land-use task catering to 1000 distinct interests. Empirical experiments in diverse urban communities exhibit LLM's adaptability and effectiveness across varied planning scenarios. The results were evaluated on four metrics, surpassing human experts in satisfaction and inclusion, and rivaling state-of-the-art reinforcement learning methods in service and ecology. Further analysis shows the advantage",
    "path": "papers/24/02/2402.01698.json",
    "total_tokens": 942,
    "translated_title": "大型语言模型赋能参与式城市规划",
    "translated_abstract": "参与式城市规划是现代城市规划的主流，涉及各个利益相关者的积极参与。然而，传统的参与式范式在时间和人力上面临挑战，而生成式规划工具在提供可调整和包容性解决方案方面失败。本研究介绍了一种创新的城市规划方法，将大型语言模型（LLMs）整合到参与过程中。该框架基于精心设计的LLM代理，包括角色扮演、协作生成和反馈迭代，解决了一个服务于1000个不同利益的社区级土地利用任务。在各种城市社区的实证实验表明，LLM在不同规划场景上的适应性和有效性。结果根据四个指标进行评估，在满意度和包容性方面超过人类专家，并在服务和生态方面与最先进的强化学习方法相媲美。进一步分析显示了该方法的优势。",
    "tldr": "本研究将大型语言模型（LLMs）应用于城市规划的参与式过程中，通过角色扮演、协作生成和反馈迭代，解决了社区级土地利用任务。实证实验表明LLM在不同规划场景上具有适应性和有效性，能够超过人类专家满意度和包容性，并与最先进的强化学习方法在服务和生态方面媲美。",
    "en_tdlr": "This research applies Large Language Models (LLMs) in the participatory process of urban planning, solving community-level land-use tasks through role-play, collaborative generation, and feedback iteration. Empirical experiments show that LLM exhibits adaptability and effectiveness in various planning scenarios, surpassing human experts in satisfaction and inclusion, and rivaling state-of-the-art reinforcement learning methods in service and ecology."
}