{
    "title": "DiffPLF: A Conditional Diffusion Model for Probabilistic Forecasting of EV Charging Load",
    "abstract": "arXiv:2402.13548v1 Announce Type: new  Abstract: Due to the vast electric vehicle (EV) penetration to distribution grid, charging load forecasting is essential to promote charging station operation and demand-side management.However, the stochastic charging behaviors and associated exogenous factors render future charging load patterns quite volatile and hard to predict. Accordingly, we devise a novel Diffusion model termed DiffPLF for Probabilistic Load Forecasting of EV charging, which can explicitly approximate the predictive load distribution conditioned on historical data and related covariates. Specifically, we leverage a denoising diffusion model, which can progressively convert the Gaussian prior to real time-series data by learning a reversal of the diffusion process. Besides, we couple such diffusion model with a cross-attention-based conditioning mechanism to execute conditional generation for possible charging demand profiles. We also propose a task-informed fine-tuning tec",
    "link": "https://arxiv.org/abs/2402.13548",
    "context": "Title: DiffPLF: A Conditional Diffusion Model for Probabilistic Forecasting of EV Charging Load\nAbstract: arXiv:2402.13548v1 Announce Type: new  Abstract: Due to the vast electric vehicle (EV) penetration to distribution grid, charging load forecasting is essential to promote charging station operation and demand-side management.However, the stochastic charging behaviors and associated exogenous factors render future charging load patterns quite volatile and hard to predict. Accordingly, we devise a novel Diffusion model termed DiffPLF for Probabilistic Load Forecasting of EV charging, which can explicitly approximate the predictive load distribution conditioned on historical data and related covariates. Specifically, we leverage a denoising diffusion model, which can progressively convert the Gaussian prior to real time-series data by learning a reversal of the diffusion process. Besides, we couple such diffusion model with a cross-attention-based conditioning mechanism to execute conditional generation for possible charging demand profiles. We also propose a task-informed fine-tuning tec",
    "path": "papers/24/02/2402.13548.json",
    "total_tokens": 846,
    "translated_title": "DiffPLF：一种用于电动汽车充电负荷概率预测的条件扩散模型",
    "translated_abstract": "由于电动汽车（EV）对配电网的深度渗透，充电负荷预测对于推动充电站运营和需求侧管理至关重要。然而，随机充电行为和相关外生因素使得未来的充电负载模式变化剧烈且难以预测。因此，我们设计了一种称为DiffPLF的新颖扩散模型，用于电动汽车充电的概率负载预测，可以明确地近似于基于历史数据和相关协变量的预测负载分布。具体来说，我们利用去噪扩散模型，通过学习扩散过程的逆转，逐渐将高斯先验转换为实时数据。此外，我们将这种扩散模型与基于交叉注意力的调节机制相结合，执行可能的充电需求配置的条件生成。我们还提出了一种任务感知的微调技术。",
    "tldr": "提出了DiffPLF模型，用于电动汽车充电的概率负载预测，结合了去噪扩散模型和交叉注意力机制，执行条件生成充电需求配置。",
    "en_tdlr": "Proposed DiffPLF model for probabilistic load forecasting of EV charging, integrating denoising diffusion model and cross-attention mechanism for conditional generation of charging demand profiles."
}