{
    "title": "GATE X-E : A Challenge Set for Gender-Fair Translations from Weakly-Gendered Languages",
    "abstract": "arXiv:2402.14277v1 Announce Type: cross  Abstract: Neural Machine Translation (NMT) continues to improve in quality and adoption, yet the inadvertent perpetuation of gender bias remains a significant concern. Despite numerous studies on gender bias in translations into English from weakly gendered-languages, there are no benchmarks for evaluating this phenomenon or for assessing mitigation strategies. To address this gap, we introduce GATE X-E, an extension to the GATE (Rarrick et al., 2023) corpus, that consists of human translations from Turkish, Hungarian, Finnish, and Persian into English. Each translation is accompanied by feminine, masculine, and neutral variants. The dataset, which contains between 1250 and 1850 instances for each of the four language pairs, features natural sentences with a wide range of sentence lengths and domains, challenging translation rewriters on various linguistic phenomena. Additionally, we present a translation gender rewriting solution built with GPT",
    "link": "https://arxiv.org/abs/2402.14277",
    "context": "Title: GATE X-E : A Challenge Set for Gender-Fair Translations from Weakly-Gendered Languages\nAbstract: arXiv:2402.14277v1 Announce Type: cross  Abstract: Neural Machine Translation (NMT) continues to improve in quality and adoption, yet the inadvertent perpetuation of gender bias remains a significant concern. Despite numerous studies on gender bias in translations into English from weakly gendered-languages, there are no benchmarks for evaluating this phenomenon or for assessing mitigation strategies. To address this gap, we introduce GATE X-E, an extension to the GATE (Rarrick et al., 2023) corpus, that consists of human translations from Turkish, Hungarian, Finnish, and Persian into English. Each translation is accompanied by feminine, masculine, and neutral variants. The dataset, which contains between 1250 and 1850 instances for each of the four language pairs, features natural sentences with a wide range of sentence lengths and domains, challenging translation rewriters on various linguistic phenomena. Additionally, we present a translation gender rewriting solution built with GPT",
    "path": "papers/24/02/2402.14277.json",
    "total_tokens": 973,
    "translated_title": "GATE X-E：弱性别语言的性别公平翻译挑战集",
    "translated_abstract": "arXiv:2402.14277v1 公告类型：跨领域 摘要：神经机器翻译（NMT）在质量和采用上持续改善，但性别偏见的无意延续仍然是一个重要关注点。尽管有大量关于从弱性别语言翻译成英语的性别偏见的研究，但目前还没有用于评估这一现象或评估缓解策略的基准。为了弥补这一空白，我们引入了GATE X-E，这是GATE（Rarrick等人，2023）语料库的扩展，由人类翻译组成，从土耳其语、匈牙利语、芬兰语和波斯语翻译成英语。每种翻译都附有女性、男性和中性变体。该数据集每种语言对之间包含1250到1850个实例，包含具有各种句子长度和领域的自然句子，挑战着翻译重写者在各种语言现象上。此外，我们还提出了一个使用GPT构建的翻译性别重写解决方案。",
    "tldr": "引入了GATE X-E挑战集，包含了从土耳其语、匈牙利语、芬兰语和波斯语翻译成英语的人类翻译，旨在评估弱性别语言到英语的翻译中的性别偏见并提出缓解策略。",
    "en_tdlr": "Introduced GATE X-E challenge set consisting of human translations from Turkish, Hungarian, Finnish, and Persian into English to evaluate gender bias in translations from weakly-gendered languages into English and propose mitigation strategies."
}