{
    "title": "Positive concave deep equilibrium models",
    "abstract": "Deep equilibrium (DEQ) models are widely recognized as a memory efficient alternative to standard neural networks, achieving state-of-the-art performance in language modeling and computer vision tasks. These models solve a fixed point equation instead of explicitly computing the output, which sets them apart from standard neural networks. However, existing DEQ models often lack formal guarantees of the existence and uniqueness of the fixed point, and the convergence of the numerical scheme used for computing the fixed point is not formally established. As a result, DEQ models are potentially unstable in practice. To address these drawbacks, we introduce a novel class of DEQ models called positive concave deep equilibrium (pcDEQ) models. Our approach, which is based on nonlinear Perron-Frobenius theory, enforces nonnegative weights and activation functions that are concave on the positive orthant. By imposing these constraints, we can easily ensure the existence and uniqueness of the fi",
    "link": "https://arxiv.org/abs/2402.04029",
    "context": "Title: Positive concave deep equilibrium models\nAbstract: Deep equilibrium (DEQ) models are widely recognized as a memory efficient alternative to standard neural networks, achieving state-of-the-art performance in language modeling and computer vision tasks. These models solve a fixed point equation instead of explicitly computing the output, which sets them apart from standard neural networks. However, existing DEQ models often lack formal guarantees of the existence and uniqueness of the fixed point, and the convergence of the numerical scheme used for computing the fixed point is not formally established. As a result, DEQ models are potentially unstable in practice. To address these drawbacks, we introduce a novel class of DEQ models called positive concave deep equilibrium (pcDEQ) models. Our approach, which is based on nonlinear Perron-Frobenius theory, enforces nonnegative weights and activation functions that are concave on the positive orthant. By imposing these constraints, we can easily ensure the existence and uniqueness of the fi",
    "path": "papers/24/02/2402.04029.json",
    "total_tokens": 853,
    "translated_title": "正凹深度均衡模型",
    "translated_abstract": "深度均衡（DEQ）模型被广泛认为是标准神经网络的一种内存效率高的替代方案，在语言建模和计算机视觉任务中实现了最先进的性能。这些模型通过求解一个固定点方程而不是显式地计算输出，使它们与标准神经网络有所不同。然而，现有的DEQ模型往往缺乏对固定点存在性和唯一性的形式保证，并且计算固定点的数值方案的收敛性也没有得到形式上的证明。因此，在实践中DEQ模型可能是不稳定的。为了解决这些缺点，我们引入了一种新颖的DEQ模型类，称为正凹深度均衡（pcDEQ）模型。我们的方法基于非线性Perron-Frobenius理论，强制施加非负权重和在正半轴上是凹函数的激活函数。通过引入这些约束，我们可以轻松地确保固定点的存在性和唯一性。",
    "tldr": "引入了一种新颖的正凹深度均衡（pcDEQ）模型，通过引入非负权重和凹函数的激活函数，确保了模型的存在性和唯一性。",
    "en_tdlr": "A novel class of positive concave deep equilibrium (pcDEQ) models is introduced, ensuring the existence and uniqueness of the model by enforcing nonnegative weights and concave activation functions."
}