{
    "title": "Gradient Alignment with Prototype Feature for Fully Test-time Adaptation",
    "abstract": "arXiv:2402.09004v1 Announce Type: cross Abstract: In context of Test-time Adaptation(TTA), we propose a regularizer, dubbed Gradient Alignment with Prototype feature (GAP), which alleviates the inappropriate guidance from entropy minimization loss from misclassified pseudo label. We developed a gradient alignment loss to precisely manage the adaptation process, ensuring that changes made for some data don't negatively impact the model's performance on other data. We introduce a prototype feature of a class as a proxy measure of the negative impact. To make GAP regularizer feasible under the TTA constraints, where model can only access test data without labels, we tailored its formula in two ways: approximating prototype features with weight vectors of the classifier, calculating gradient without back-propagation. We demonstrate GAP significantly improves TTA methods across various datasets, which proves its versatility and effectiveness.",
    "link": "https://arxiv.org/abs/2402.09004",
    "context": "Title: Gradient Alignment with Prototype Feature for Fully Test-time Adaptation\nAbstract: arXiv:2402.09004v1 Announce Type: cross Abstract: In context of Test-time Adaptation(TTA), we propose a regularizer, dubbed Gradient Alignment with Prototype feature (GAP), which alleviates the inappropriate guidance from entropy minimization loss from misclassified pseudo label. We developed a gradient alignment loss to precisely manage the adaptation process, ensuring that changes made for some data don't negatively impact the model's performance on other data. We introduce a prototype feature of a class as a proxy measure of the negative impact. To make GAP regularizer feasible under the TTA constraints, where model can only access test data without labels, we tailored its formula in two ways: approximating prototype features with weight vectors of the classifier, calculating gradient without back-propagation. We demonstrate GAP significantly improves TTA methods across various datasets, which proves its versatility and effectiveness.",
    "path": "papers/24/02/2402.09004.json",
    "total_tokens": 863,
    "translated_title": "使用原型特征进行梯度对齐的完全测试时间自适应",
    "translated_abstract": "在测试时间自适应（TTA）的背景下，我们提出了一种正则化方法，称为梯度对齐与原型特征（GAP），它可以减轻由于错误分类伪标签的熵最小化损失而导致的不适当引导。我们开发了一个梯度对齐损失，以精确地管理适应过程，确保对某些数据进行的更改不会对模型在其他数据上的性能产生负面影响。我们引入了一个类的原型特征作为负面影响的代理测量。为了使在TTA约束下GAP正则化方法可行，即模型只能访问没有标签的测试数据，我们通过两种方式修改了其公式：用分类器的权重向量近似原型特征，不使用反向传播计算梯度。我们证明了GAP在各种数据集上显著改善了TTA方法，证明了其多功能性和有效性。",
    "tldr": "在测试时间自适应中，我们提出了一种名为GAP的正则化方法，通过梯度对齐和原型特征，减轻了来自于错误分类伪标签熵最小化损失的不适当引导，显著改善了TTA方法。",
    "en_tdlr": "In the context of Test-time Adaptation (TTA), we propose a regularizer called GAP, which uses gradient alignment and prototype features to alleviate the inappropriate guidance from entropy minimization loss caused by misclassified pseudo labels, and significantly improves TTA methods."
}