{
    "title": "Bidirectional Uncertainty-Based Active Learning for Open Set Annotation",
    "abstract": "arXiv:2402.15198v1 Announce Type: new  Abstract: Active learning (AL) in open set scenarios presents a novel challenge of identifying the most valuable examples in an unlabeled data pool that comprises data from both known and unknown classes. Traditional methods prioritize selecting informative examples with low confidence, with the risk of mistakenly selecting unknown-class examples with similarly low confidence. Recent methods favor the most probable known-class examples, with the risk of picking simple already mastered examples. In this paper, we attempt to query examples that are both likely from known classes and highly informative, and propose a \\textit{Bidirectional Uncertainty-based Active Learning} (BUAL) framework. Specifically, we achieve this by first pushing the unknown class examples toward regions with high-confidence predictions with our proposed \\textit{Random Label Negative Learning} method. Then, we propose a \\textit{Bidirectional Uncertainty sampling} strategy by j",
    "link": "https://arxiv.org/abs/2402.15198",
    "context": "Title: Bidirectional Uncertainty-Based Active Learning for Open Set Annotation\nAbstract: arXiv:2402.15198v1 Announce Type: new  Abstract: Active learning (AL) in open set scenarios presents a novel challenge of identifying the most valuable examples in an unlabeled data pool that comprises data from both known and unknown classes. Traditional methods prioritize selecting informative examples with low confidence, with the risk of mistakenly selecting unknown-class examples with similarly low confidence. Recent methods favor the most probable known-class examples, with the risk of picking simple already mastered examples. In this paper, we attempt to query examples that are both likely from known classes and highly informative, and propose a \\textit{Bidirectional Uncertainty-based Active Learning} (BUAL) framework. Specifically, we achieve this by first pushing the unknown class examples toward regions with high-confidence predictions with our proposed \\textit{Random Label Negative Learning} method. Then, we propose a \\textit{Bidirectional Uncertainty sampling} strategy by j",
    "path": "papers/24/02/2402.15198.json",
    "total_tokens": 910,
    "translated_title": "开放集注释的双向不确定性主动学习",
    "translated_abstract": "开放集场景下的主动学习(AL)面临着一个新挑战，即确定在一个包含已知和未知类别数据的未标记数据池中识别最有价值的示例。传统方法优先选择置信度较低的信息量丰富的示例，存在误选置信度同样较低的未知类别示例的风险。最近的方法更青睐最有可能属于已知类别的示例，但存在选取已经掌握的简单示例的风险。在本文中，我们尝试查询既有可能来自已知类别又高度信息丰富的示例，并提出了一种\\textit{双向不确定性主动学习}（BUAL）框架。具体来说，我们首先通过我们提出的\\textit{随机标签负学习}方法将未知类别示例推向高置信度预测区域。然后，我们提出一种\\textit{双向不确定性采样}策略...",
    "tldr": "本文提出了一种双向不确定性主动学习（BUAL）框架，通过随机标签负学习方法和双向不确定性采样策略，旨在同时筛选既可能属于已知类别又高度信息丰富的示例，解决了在开放集场景下确定最有价值示例的挑战。",
    "en_tdlr": "This paper introduces a Bidirectional Uncertainty-based Active Learning (BUAL) framework, which aims to select examples that are likely from known classes and highly informative by utilizing Random Label Negative Learning method and Bidirectional Uncertainty sampling strategy, addressing the challenge of identifying the most valuable examples in open set scenarios."
}