{
    "title": "SOCIALITE-LLAMA: An Instruction-Tuned Model for Social Scientific Tasks",
    "abstract": "Social science NLP tasks, such as emotion or humor detection, are required to capture the semantics along with the implicit pragmatics from text, often with limited amounts of training data. Instruction tuning has been shown to improve the many capabilities of large language models (LLMs) such as commonsense reasoning, reading comprehension, and computer programming. However, little is known about the effectiveness of instruction tuning on the social domain where implicit pragmatic cues are often needed to be captured. We explore the use of instruction tuning for social science NLP tasks and introduce Socialite-Llama -- an open-source, instruction-tuned Llama. On a suite of 20 social science tasks, Socialite-Llama improves upon the performance of Llama as well as matches or improves upon the performance of a state-of-the-art, multi-task finetuned model on a majority of them. Further, Socialite-Llama also leads to improvement on 5 out of 6 related social tasks as compared to Llama, sugg",
    "link": "https://arxiv.org/abs/2402.01980",
    "context": "Title: SOCIALITE-LLAMA: An Instruction-Tuned Model for Social Scientific Tasks\nAbstract: Social science NLP tasks, such as emotion or humor detection, are required to capture the semantics along with the implicit pragmatics from text, often with limited amounts of training data. Instruction tuning has been shown to improve the many capabilities of large language models (LLMs) such as commonsense reasoning, reading comprehension, and computer programming. However, little is known about the effectiveness of instruction tuning on the social domain where implicit pragmatic cues are often needed to be captured. We explore the use of instruction tuning for social science NLP tasks and introduce Socialite-Llama -- an open-source, instruction-tuned Llama. On a suite of 20 social science tasks, Socialite-Llama improves upon the performance of Llama as well as matches or improves upon the performance of a state-of-the-art, multi-task finetuned model on a majority of them. Further, Socialite-Llama also leads to improvement on 5 out of 6 related social tasks as compared to Llama, sugg",
    "path": "papers/24/02/2402.01980.json",
    "total_tokens": 875,
    "translated_title": "SOCIALITE-LLAMA：社会科学任务的指导调优模型",
    "translated_abstract": "社会科学的自然语言处理任务，如情绪或幽默检测，需要从文本中捕捉语义和隐含的语用信息，通常只有有限的训练数据。指导调优已经被证明可以改善大型语言模型（LLM）的许多能力，例如常识推理、阅读理解和计算机编程。然而，在需要捕捉隐含的语用线索的社交领域，对指导调优的效果了解甚少。我们探索了将指导调优用于社会科学的自然语言处理任务，并介绍了 Socialite-Llama - 一个开源的、经过指导调优的 Llama 模型。在一套包含20个社会科学任务的测试中，Socialite-Llama 在性能上优于 Llama，并且在大多数任务上与最先进的多任务微调模型的性能相匹配或得到提升。此外，与 Llama 相比，Socialite-Llama 在6个相关的社会任务中的5个任务上也有所改进，这表明指导调优在这些任务上也会带来改善。",
    "tldr": "社会科学的自然语言处理任务需要捕捉语义和隐含的语用信息，指导调优模型Socialite-Llama在这些任务上表现出卓越的性能和提升。",
    "en_tdlr": "Social science NLP tasks require capturing semantics and implicit pragmatic information. The instruction-tuned model, Socialite-Llama, shows exceptional performance and improvement in these tasks."
}