{
    "title": "Cameras as Rays: Pose Estimation via Ray Diffusion",
    "abstract": "arXiv:2402.14817v1 Announce Type: cross  Abstract: Estimating camera poses is a fundamental task for 3D reconstruction and remains challenging given sparse views (<10). In contrast to existing approaches that pursue top-down prediction of global parametrizations of camera extrinsics, we propose a distributed representation of camera pose that treats a camera as a bundle of rays. This representation allows for a tight coupling with spatial image features improving pose precision. We observe that this representation is naturally suited for set-level level transformers and develop a regression-based approach that maps image patches to corresponding rays. To capture the inherent uncertainties in sparse-view pose inference, we adapt this approach to learn a denoising diffusion model which allows us to sample plausible modes while improving performance. Our proposed methods, both regression- and diffusion-based, demonstrate state-of-the-art performance on camera pose estimation on CO3D while",
    "link": "https://arxiv.org/abs/2402.14817",
    "context": "Title: Cameras as Rays: Pose Estimation via Ray Diffusion\nAbstract: arXiv:2402.14817v1 Announce Type: cross  Abstract: Estimating camera poses is a fundamental task for 3D reconstruction and remains challenging given sparse views (<10). In contrast to existing approaches that pursue top-down prediction of global parametrizations of camera extrinsics, we propose a distributed representation of camera pose that treats a camera as a bundle of rays. This representation allows for a tight coupling with spatial image features improving pose precision. We observe that this representation is naturally suited for set-level level transformers and develop a regression-based approach that maps image patches to corresponding rays. To capture the inherent uncertainties in sparse-view pose inference, we adapt this approach to learn a denoising diffusion model which allows us to sample plausible modes while improving performance. Our proposed methods, both regression- and diffusion-based, demonstrate state-of-the-art performance on camera pose estimation on CO3D while",
    "path": "papers/24/02/2402.14817.json",
    "total_tokens": 878,
    "translated_title": "摄像头作为射线: 通过射线扩散进行姿势估计",
    "translated_abstract": "估计相机姿势是3D重建的基本任务，鉴于视图稀疏（<10），该任务仍具有挑战性。与现有方法不同，后者追求相机外参的全局参数化的自上而下预测，我们提出了一种将相机姿势视为射线束的分布表示。这种表示允许与空间图像特征紧密耦合，提高了姿势精度。我们观察到，这种表示自然适用于集合级别的Transformer，并开发了一种基于回归的方法，将图像块映射到相应的射线上。为了捕捉稀疏视角姿势推断中固有的不确定性，我们调整了这种方法，学习了一个去噪扩散模型，使我们能够采样合理的模式，同时提高性能。我们提出的方法，既是基于回归，也是基于扩散的，在CO3D相机姿势估计方面展现出了最先进的性能。",
    "tldr": "提出了一种将相机姿势视为射线束的分布表示方法，结合空间图像特征，开发了基于回归和扩散的姿势估计方法，在CO3D数据集上取得了最先进的性能。",
    "en_tdlr": "A distributed representation method treating camera pose as bundles of rays, combined with spatial image features, and developed regression-based and diffusion-based pose estimation methods, achieving state-of-the-art performance on the CO3D dataset."
}