{
    "title": "A Study of Shape Modeling Against Noise",
    "abstract": "arXiv:2402.15587v1 Announce Type: cross  Abstract: Shape modeling is a challenging task with many potential applications in computer vision and medical imaging. There are many shape modeling methods in the literature, each with its advantages and applications. However, many shape modeling methods have difficulties handling shapes that have missing pieces or outliers. In this regard, this paper introduces shape denoising, a fundamental problem in shape modeling that lies at the core of many computer vision and medical imaging applications and has not received enough attention in the literature. The paper introduces six types of noise that can be used to perturb shapes as well as an objective measure for the noise level and for comparing methods on their shape denoising capabilities. Finally, the paper evaluates seven methods capable of accomplishing this task, of which six are based on deep learning, including some generative models.",
    "link": "https://arxiv.org/abs/2402.15587",
    "context": "Title: A Study of Shape Modeling Against Noise\nAbstract: arXiv:2402.15587v1 Announce Type: cross  Abstract: Shape modeling is a challenging task with many potential applications in computer vision and medical imaging. There are many shape modeling methods in the literature, each with its advantages and applications. However, many shape modeling methods have difficulties handling shapes that have missing pieces or outliers. In this regard, this paper introduces shape denoising, a fundamental problem in shape modeling that lies at the core of many computer vision and medical imaging applications and has not received enough attention in the literature. The paper introduces six types of noise that can be used to perturb shapes as well as an objective measure for the noise level and for comparing methods on their shape denoising capabilities. Finally, the paper evaluates seven methods capable of accomplishing this task, of which six are based on deep learning, including some generative models.",
    "path": "papers/24/02/2402.15587.json",
    "total_tokens": 899,
    "translated_title": "对抗噪声的形状建模研究",
    "translated_abstract": "形状建模是一项具有挑战性的任务，在计算机视觉和医学影像等领域有许多潜在的应用。文献中存在许多形状建模方法，每种方法都具有其优点和应用。然而，许多形状建模方法在处理具有缺失部分或异常值的形状时存在困难。在这方面，本文介绍了形状去噪，这是形状建模中的一个基本问题，位于许多计算机视觉和医学影像应用的核心位置，在文献中未能获得足够关注。本文介绍了可以用来扰动形状的六种噪声类型，以及噪声水平的客观度量和用于比较方法在形状去噪能力方面的指标。最后，本文评估了七种能够完成此任务的方法，其中六种基于深度学习，包括一些生成模型。",
    "tldr": "该论文介绍了对抗噪声的形状建模研究中的形状去噪问题，并提出了六种扰动形状的噪声类型以及用于比较方法在形状去噪能力上的客观度量，评估了包括一些生成模型在内的七种能够完成形状去噪任务的方法。",
    "en_tdlr": "This paper introduces the shape denoising problem in the study of shape modeling against noise, presenting six types of noise to perturb shapes and an objective measure for comparing methods on their shape denoising capabilities, evaluating seven methods capable of achieving shape denoising, including some generative models."
}