{
    "title": "Transfer Learning With Densenet201 Architecture Model For Potato Leaf Disease Classification",
    "abstract": "Potato plants are plants that are beneficial to humans. Like other plants in general, potato plants also have diseases; if this disease is not treated immediately, there will be a significant decrease in food production. Therefore, it is necessary to detect diseases quickly and precisely so that disease control can be carried out effectively and efficiently. Classification of potato leaf disease can be done directly. Still, the symptoms cannot always explain the type of disease that attacks potato leaves because there are many types of diseases with symptoms that look the same. Humans also have deficiencies in determining the results of identification of potato leaf disease, so sometimes the results of identification between individuals can be different. Therefore, the use of Deep Learning for the classification process of potato leaf disease is expected to shorten the time and have a high classification accuracy. This study uses a deep learning method with the DenseNet201 architecture",
    "link": "https://arxiv.org/abs/2402.03347",
    "context": "Title: Transfer Learning With Densenet201 Architecture Model For Potato Leaf Disease Classification\nAbstract: Potato plants are plants that are beneficial to humans. Like other plants in general, potato plants also have diseases; if this disease is not treated immediately, there will be a significant decrease in food production. Therefore, it is necessary to detect diseases quickly and precisely so that disease control can be carried out effectively and efficiently. Classification of potato leaf disease can be done directly. Still, the symptoms cannot always explain the type of disease that attacks potato leaves because there are many types of diseases with symptoms that look the same. Humans also have deficiencies in determining the results of identification of potato leaf disease, so sometimes the results of identification between individuals can be different. Therefore, the use of Deep Learning for the classification process of potato leaf disease is expected to shorten the time and have a high classification accuracy. This study uses a deep learning method with the DenseNet201 architecture",
    "path": "papers/24/02/2402.03347.json",
    "total_tokens": 749,
    "translated_title": "使用Densenet201架构模型的迁移学习进行土豆叶病分类",
    "translated_abstract": "土豆植物对人类有益。像其他植物一样，土豆植物也会生病；如果不及时治疗，食物产量将显著下降。因此，需要快速准确地检测病害，以便有效高效地进行病害控制。土豆叶病的分类可以直接进行，但症状并不能始终解释攻击土豆叶的病害类型，因为有很多种病害的症状看起来一样。人类在确定土豆叶病鉴定结果时也存在问题，因此，有时个体间的鉴定结果可能不同。因此，使用深度学习进行土豆叶病分类的方法有望缩短时间并具有较高的分类准确性。本研究使用了DenseNet201架构的深度学习方法。",
    "tldr": "本文使用Densenet201架构模型，结合迁移学习方法，进行土豆叶病分类。"
}