{
    "title": "Position Paper: Generalized grammar rules and structure-based generalization beyond classical equivariance for lexical tasks and transduction",
    "abstract": "Compositional generalization is one of the main properties which differentiates lexical learning in humans from state-of-art neural networks. We propose a general framework for building models that can generalize compositionally using the concept of Generalized Grammar Rules (GGRs), a class of symmetry-based compositional constraints for transduction tasks, which we view as a transduction analogue of equivariance constraints in physics-inspired tasks. Besides formalizing generalized notions of symmetry for language transduction, our framework is general enough to contain many existing works as special cases. We present ideas on how GGRs might be implemented, and in the process draw connections to reinforcement learning and other areas of research.",
    "link": "https://rss.arxiv.org/abs/2402.01629",
    "context": "Title: Position Paper: Generalized grammar rules and structure-based generalization beyond classical equivariance for lexical tasks and transduction\nAbstract: Compositional generalization is one of the main properties which differentiates lexical learning in humans from state-of-art neural networks. We propose a general framework for building models that can generalize compositionally using the concept of Generalized Grammar Rules (GGRs), a class of symmetry-based compositional constraints for transduction tasks, which we view as a transduction analogue of equivariance constraints in physics-inspired tasks. Besides formalizing generalized notions of symmetry for language transduction, our framework is general enough to contain many existing works as special cases. We present ideas on how GGRs might be implemented, and in the process draw connections to reinforcement learning and other areas of research.",
    "path": "papers/24/02/2402.01629.json",
    "total_tokens": 824,
    "translated_title": "《论文标题：广义语法规则和基于结构的一般化——对于词汇任务和转导的经典等变性之外的一般化的立场论文》",
    "translated_abstract": "组合一般化是人类学习词汇与现有神经网络之间的主要差异之一。我们提出了一个通用框架，用于构建能够使用广义语法规则（GGRs）进行组合一般化的模型，GGRs是一类基于对称性的转导任务的组合约束，我们将其视为受物理学任务中等变性约束启发的转导类比。除了为语言转导形式化广义的对称性概念之外，我们的框架足够通用，可以包含许多现有工作作为特例。我们提出了关于如何实现GGRs的想法，并在此过程中与强化学习和其他研究领域建立了联系。",
    "tldr": "这篇论文提出了一个通用框架，其中使用广义语法规则（GGRs）来实现组合一般化，将其视为转导任务中的对称性约束。该框架不仅形式化了语言转导的广义对称性概念，还与强化学习和其他研究领域有关联。",
    "en_tdlr": "This paper presents a general framework using Generalized Grammar Rules (GGRs) to achieve compositional generalization, treating them as symmetry constraints in transduction tasks. The framework formalizes the generalized notions of symmetry for language transduction and establishes connections with reinforcement learning and other research areas."
}