{
    "title": "N-1 Reduced Optimal Power Flow Using Augmented Hierarchical Graph Neural Network",
    "abstract": "Optimal power flow (OPF) is used to perform generation redispatch in power system real-time operations. N-1 OPF can ensure safe grid operations under diverse contingency scenarios. For large and intricate power networks with numerous variables and constraints, achieving an optimal solution for real-time N-1 OPF necessitates substantial computational resources. To mitigate this challenge, machine learning (ML) is introduced as an additional tool for predicting congested or heavily loaded lines dynamically. In this paper, an advanced ML model known as the augmented hierarchical graph neural network (AHGNN) was proposed to predict critical congested lines and create N-1 reduced OPF (N-1 ROPF). The proposed AHGNN-enabled N-1 ROPF can result in a remarkable reduction in computing time while retaining the solution quality. Several variations of GNN-based ML models are also implemented as benchmark to demonstrate effectiveness of the proposed AHGNN approach. Case studies prove the proposed AH",
    "link": "https://arxiv.org/abs/2402.06226",
    "context": "Title: N-1 Reduced Optimal Power Flow Using Augmented Hierarchical Graph Neural Network\nAbstract: Optimal power flow (OPF) is used to perform generation redispatch in power system real-time operations. N-1 OPF can ensure safe grid operations under diverse contingency scenarios. For large and intricate power networks with numerous variables and constraints, achieving an optimal solution for real-time N-1 OPF necessitates substantial computational resources. To mitigate this challenge, machine learning (ML) is introduced as an additional tool for predicting congested or heavily loaded lines dynamically. In this paper, an advanced ML model known as the augmented hierarchical graph neural network (AHGNN) was proposed to predict critical congested lines and create N-1 reduced OPF (N-1 ROPF). The proposed AHGNN-enabled N-1 ROPF can result in a remarkable reduction in computing time while retaining the solution quality. Several variations of GNN-based ML models are also implemented as benchmark to demonstrate effectiveness of the proposed AHGNN approach. Case studies prove the proposed AH",
    "path": "papers/24/02/2402.06226.json",
    "total_tokens": 951,
    "translated_title": "使用增强型分层图神经网络实现N-1优化潮流的降维",
    "translated_abstract": "优化潮流（OPF）用于在电力系统实时运行中进行发电重调。N-1 OPF可以确保在各种事故情况下安全运行电网。对于变量和约束众多的大型复杂电力网络，实时N-1 OPF的最优解需要大量计算资源。为了解决这个挑战，引入机器学习（ML）作为预测拥塞或负载过重线路的额外工具。本文提出了一种先进的ML模型，称为增强型分层图神经网络（AHGNN），用于预测关键的拥塞线路并创建N-1优化潮流的降维（N-1 ROPF）。所提出的AHGNN启用的N-1 ROPF能够显著减少计算时间，同时保持解的质量。还实现了几种基于GNN的ML模型作为基准，以证明所提出的AHGNN方法的有效性。案例研究证明了所提出的AHGNN的有效性。",
    "tldr": "本文提出了一种使用增强型分层图神经网络（AHGNN）的方法来预测关键拥塞线路并创建N-1优化潮流的降维（N-1 ROPF）。实验结果表明，AHGNN启用的N-1 ROPF在保持解的质量的同时，能够显著减少计算时间。",
    "en_tdlr": "This paper proposes a method using an augmented hierarchical graph neural network (AHGNN) to predict critical congested lines and create N-1 reduced optimal power flow (N-1 ROPF). Experimental results show that the AHGNN-enabled N-1 ROPF can significantly reduce computational time while maintaining solution quality."
}