{
    "title": "Improving Demonstration Diversity by Human-Free Fusing for Text-to-SQL",
    "abstract": "arXiv:2402.10663v1 Announce Type: new  Abstract: Currently, the in-context learning method based on large language models (LLMs) has become the mainstream of text-to-SQL research. Previous works have discussed how to select demonstrations related to the user question from a human-labeled demonstration pool. However, human labeling suffers from the limitations of insufficient diversity and high labeling overhead. Therefore, in this paper, we discuss how to measure and improve the diversity of the demonstrations for text-to-SQL. We present a metric to measure the diversity of the demonstrations and analyze the insufficient of the existing labeled data by experiments. Based on the above discovery, we propose fusing iteratively for demonstrations (Fused) to build a high-diversity demonstration pool through human-free multiple-iteration synthesis, improving diversity and lowering label cost. Our method achieves an average improvement of 3.2% and 5.0% with and without human labeling on sever",
    "link": "https://arxiv.org/abs/2402.10663",
    "context": "Title: Improving Demonstration Diversity by Human-Free Fusing for Text-to-SQL\nAbstract: arXiv:2402.10663v1 Announce Type: new  Abstract: Currently, the in-context learning method based on large language models (LLMs) has become the mainstream of text-to-SQL research. Previous works have discussed how to select demonstrations related to the user question from a human-labeled demonstration pool. However, human labeling suffers from the limitations of insufficient diversity and high labeling overhead. Therefore, in this paper, we discuss how to measure and improve the diversity of the demonstrations for text-to-SQL. We present a metric to measure the diversity of the demonstrations and analyze the insufficient of the existing labeled data by experiments. Based on the above discovery, we propose fusing iteratively for demonstrations (Fused) to build a high-diversity demonstration pool through human-free multiple-iteration synthesis, improving diversity and lowering label cost. Our method achieves an average improvement of 3.2% and 5.0% with and without human labeling on sever",
    "path": "papers/24/02/2402.10663.json",
    "total_tokens": 846,
    "translated_title": "通过无需人类参与的融合方法改善文本到SQL的演示多样性",
    "translated_abstract": "目前，基于大型语言模型（LLMs）的上下文学习方法已成为文本到SQL研究的主流。先前的工作讨论了如何从人标记的演示池中选择与用户问题相关的演示。然而，人工标注存在着多样性不足和标注成本高的限制。因此，在本文中，我们讨论了如何衡量和改善文本到SQL演示的多样性。我们提出了一个度量演示多样性的指标，并通过实验分析了现有标记数据的不足之处。基于上述发现，我们提出了一种通过无需人类参与的多次迭代合成来构建高多样性演示池的融合方法（Fused），提高了多样性并降低标注成本。我们的方法在有/无人类标注的情况下平均提高了3.2%和5.0%。",
    "tldr": "本文提出了一种通过无需人类参与的多次迭代合成来改善文本到SQL演示的多样性，并构建了高多样性演示池，提高了多样性并降低标注成本。",
    "en_tdlr": "This paper proposes an approach to improve the diversity of demonstrations for text-to-SQL by human-free multiple-iteration synthesis, constructing a high-diversity demonstration pool, thus enhancing diversity and reducing labeling costs."
}