{
    "title": "A mathematical model for simultaneous personnel shift planning and unrelated parallel machine scheduling",
    "abstract": "arXiv:2402.15670v1 Announce Type: new  Abstract: This paper addresses a production scheduling problem derived from an industrial use case, focusing on unrelated parallel machine scheduling with the personnel availability constraint. The proposed model optimizes the production plan over a multi-period scheduling horizon, accommodating variations in personnel shift hours within each time period. It assumes shared personnel among machines, with one personnel required per machine for setup and supervision during job processing. Available personnel are fewer than the machines, thus limiting the number of machines that can operate in parallel. The model aims to minimize the total production time considering machine-dependent processing times and sequence-dependent setup times. The model handles practical scenarios like machine eligibility constraints and production time windows. A Mixed Integer Linear Programming (MILP) model is introduced to formulate the problem, taking into account both c",
    "link": "https://arxiv.org/abs/2402.15670",
    "context": "Title: A mathematical model for simultaneous personnel shift planning and unrelated parallel machine scheduling\nAbstract: arXiv:2402.15670v1 Announce Type: new  Abstract: This paper addresses a production scheduling problem derived from an industrial use case, focusing on unrelated parallel machine scheduling with the personnel availability constraint. The proposed model optimizes the production plan over a multi-period scheduling horizon, accommodating variations in personnel shift hours within each time period. It assumes shared personnel among machines, with one personnel required per machine for setup and supervision during job processing. Available personnel are fewer than the machines, thus limiting the number of machines that can operate in parallel. The model aims to minimize the total production time considering machine-dependent processing times and sequence-dependent setup times. The model handles practical scenarios like machine eligibility constraints and production time windows. A Mixed Integer Linear Programming (MILP) model is introduced to formulate the problem, taking into account both c",
    "path": "papers/24/02/2402.15670.json",
    "total_tokens": 766,
    "translated_title": "一种用于同时人员轮班规划和无关并行机器调度的数学模型",
    "translated_abstract": "本文针对产生于工业应用案例的生产调度问题进行研究，重点关注带有人员可用性约束的无关并行机器调度。所提出的模型在多期调度周期内优化生产计划，容纳每个时间段内人员轮班时间的变化。模型假设机器之间共享人员，每台机器在作业处理期间需要一个人员进行设置和监督。可用人员少于机器数量，因此限制了能够并行操作的机器数量。该模型旨在最小化考虑机器相关处理时间和顺序相关设置时间的总生产时间。模型处理了诸如机器合格约束和生产时间窗口之类的实际场景。引入了混合整数线性规划（MILP）模型来表述问题，考虑了c",
    "tldr": "一种针对生产调度问题的数学模型，同时考虑人员轮班规划和无关机器调度，并通过MILP模型最小化总生产时间。",
    "en_tdlr": "A mathematical model addressing production scheduling problem integrating personnel shift planning and unrelated machine scheduling, aiming to minimize total production time using MILP formulation."
}