{
    "title": "Attraction Via Prices and Information",
    "abstract": "arXiv:2402.11754v1 Announce Type: new  Abstract: We study the ramifications of increased commitment power for information provision in an oligopolistic market with search frictions. Although prices are posted and, therefore, guide search, if firms cannot commit to information provision policies, there is no active search at equilibrium so consumers visit (and purchase from) at most one firm. If firms can guide search by both their prices and information policies, there exists a unique symmetric equilibrium exhibiting price dispersion and active search. Nevertheless, when the market is thin, consumers prefer the former case, which features intense price competition. Firms always prefer the latter.",
    "link": "https://arxiv.org/abs/2402.11754",
    "context": "Title: Attraction Via Prices and Information\nAbstract: arXiv:2402.11754v1 Announce Type: new  Abstract: We study the ramifications of increased commitment power for information provision in an oligopolistic market with search frictions. Although prices are posted and, therefore, guide search, if firms cannot commit to information provision policies, there is no active search at equilibrium so consumers visit (and purchase from) at most one firm. If firms can guide search by both their prices and information policies, there exists a unique symmetric equilibrium exhibiting price dispersion and active search. Nevertheless, when the market is thin, consumers prefer the former case, which features intense price competition. Firms always prefer the latter.",
    "path": "papers/24/02/2402.11754.json",
    "total_tokens": 717,
    "translated_title": "通过价格和信息吸引",
    "translated_abstract": "我们研究了在一个存在搜索摩擦的寡头市场中，增加承诺能力对信息提供的影响。尽管价格被公布并引导搜索，但如果公司无法承诺信息提供政策，那么在均衡状态下没有积极的搜索，因此消费者最多只会访问（并从中购买）一个公司。如果公司可以通过它们的价格和信息政策引导搜索，那么存在一个独特的对称均衡，表现出价格分散和积极的搜索。然而，当市场稀疏时，消费者更喜欢前一种情况，因为它表现出激烈的价格竞争。而公司总是更喜欢后者。",
    "tldr": "增加承诺能力对信息提供的影响，当市场稀疏时，消费者更喜欢激烈的价格竞争，而公司总是更喜欢同时指导搜索的情况。",
    "en_tdlr": "The increased commitment power for information provision has effects on consumer preferences in oligopolistic markets, with consumers preferring intense price competition when the market is thin and firms always favoring the scenario where they can guide both prices and search."
}