{
    "title": "Forecasting Imports in OECD Member Countries and Iran by Using Neural Network Algorithms of LSTM",
    "abstract": "Artificial Neural Networks (ANN) which are a branch of artificial intelligence, have shown their high value in lots of applications and are used as a suitable forecasting method. Therefore, this study aims at forecasting imports in OECD member selected countries and Iran for 20 seasons from 2021 to 2025 by means of ANN. Data related to the imports of such countries collected over 50 years from 1970 to 2019 from valid resources including World Bank, WTO, IFM,the data turned into seasonal data to increase the number of collected data for better performance and high accuracy of the network by using Diz formula that there were totally 200 data related to imports. This study has used LSTM to analyse data in Pycharm. 75% of data considered as training data and 25% considered as test data and the results of the analysis were forecasted with 99% accuracy which revealed the validity and reliability of the output. Since the imports is consumption function and since the consumption is influenced ",
    "link": "https://arxiv.org/abs/2402.01648",
    "context": "Title: Forecasting Imports in OECD Member Countries and Iran by Using Neural Network Algorithms of LSTM\nAbstract: Artificial Neural Networks (ANN) which are a branch of artificial intelligence, have shown their high value in lots of applications and are used as a suitable forecasting method. Therefore, this study aims at forecasting imports in OECD member selected countries and Iran for 20 seasons from 2021 to 2025 by means of ANN. Data related to the imports of such countries collected over 50 years from 1970 to 2019 from valid resources including World Bank, WTO, IFM,the data turned into seasonal data to increase the number of collected data for better performance and high accuracy of the network by using Diz formula that there were totally 200 data related to imports. This study has used LSTM to analyse data in Pycharm. 75% of data considered as training data and 25% considered as test data and the results of the analysis were forecasted with 99% accuracy which revealed the validity and reliability of the output. Since the imports is consumption function and since the consumption is influenced ",
    "path": "papers/24/02/2402.01648.json",
    "total_tokens": 849,
    "translated_title": "利用LSTM神经网络算法预测OECD成员国和伊朗的进口",
    "translated_abstract": "人工神经网络（ANN）作为人工智能的一个分支，在许多应用中展示了其高价值，并被用作一种适合的预测方法。因此，本研究旨在利用ANN预测选定的OECD成员国和伊朗在2021年到2025年的20个季度的进口情况。从1970年至2019年，通过使用世界银行、世界贸易组织、国际货币基金组织等有效资源收集了这些国家进口相关的数据，并将数据转化为季度数据，以增加收集数据量，以提高网络性能和准确性。本研究使用LSTM在PyCharm中分析数据。其中75%的数据被视为训练数据，25%被视为测试数据，分析结果以99%的准确率进行预测，显示了输出的有效性和可靠性。由于进口是一个消费函数，而消费受到...",
    "tldr": "这项研究利用LSTM神经网络算法预测了选定的OECD成员国和伊朗在2021年到2025年的进口情况，结果表明其准确性达到了99%。",
    "en_tdlr": "This study utilized LSTM neural network algorithm to forecast imports in selected OECD member countries and Iran from 2021 to 2025, achieving a 99% accuracy rate."
}