{
    "title": "Protect and Extend -- Using GANs for Synthetic Data Generation of Time-Series Medical Records",
    "abstract": "arXiv:2402.14042v1 Announce Type: cross  Abstract: Preservation of private user data is of paramount importance for high Quality of Experience (QoE) and acceptability, particularly with services treating sensitive data, such as IT-based health services. Whereas anonymization techniques were shown to be prone to data re-identification, synthetic data generation has gradually replaced anonymization since it is relatively less time and resource-consuming and more robust to data leakage. Generative Adversarial Networks (GANs) have been used for generating synthetic datasets, especially GAN frameworks adhering to the differential privacy phenomena. This research compares state-of-the-art GAN-based models for synthetic data generation to generate time-series synthetic medical records of dementia patients which can be distributed without privacy concerns. Predictive modeling, autocorrelation, and distribution analysis are used to assess the Quality of Generating (QoG) of the generated data. T",
    "link": "https://arxiv.org/abs/2402.14042",
    "context": "Title: Protect and Extend -- Using GANs for Synthetic Data Generation of Time-Series Medical Records\nAbstract: arXiv:2402.14042v1 Announce Type: cross  Abstract: Preservation of private user data is of paramount importance for high Quality of Experience (QoE) and acceptability, particularly with services treating sensitive data, such as IT-based health services. Whereas anonymization techniques were shown to be prone to data re-identification, synthetic data generation has gradually replaced anonymization since it is relatively less time and resource-consuming and more robust to data leakage. Generative Adversarial Networks (GANs) have been used for generating synthetic datasets, especially GAN frameworks adhering to the differential privacy phenomena. This research compares state-of-the-art GAN-based models for synthetic data generation to generate time-series synthetic medical records of dementia patients which can be distributed without privacy concerns. Predictive modeling, autocorrelation, and distribution analysis are used to assess the Quality of Generating (QoG) of the generated data. T",
    "path": "papers/24/02/2402.14042.json",
    "total_tokens": 887,
    "translated_title": "使用GANs生成合成数据延伸与保护——基于时间序列医疗记录",
    "translated_abstract": "arXiv:2402.14042v1 公告类型:交叉摘要: 保护私人用户数据对于高质量体验(QoE)和可接受性至关重要，尤其是对于处理敏感数据的服务，如基于IT的健康服务。尽管已经显示匿名化技术容易被数据重新识别，但合成数据生成逐渐取代了匿名化，因为它相对耗时和资源耗费较少，并且更能抵抗数据泄漏。生成对抗网络(GANs)已被用于生成合成数据集，特别是遵循差分隐私现象的GAN框架。本研究比较了用于生成时间序列合成痴呆患者医疗记录的最新GAN基模型，这些数据可以在不涉及隐私问题的情况下分发。 预测建模、自相关性和分布分析被用来评估生成数据的生成质量(QoG)。",
    "tldr": "本研究使用GANs生成了时间序列合成痴呆患者医疗记录的数据集，并比较了不同GAN模型在生成合成数据方面的质量，实现了在不涉及隐私问题的情况下保护用户数据并延伸数据应用。",
    "en_tdlr": "This study utilized GANs to generate a dataset of synthetic time-series medical records for dementia patients, compared different GAN models in terms of data quality generation, achieving the protection and extension of data applications without privacy concerns."
}