{
    "title": "A Comprehensive Survey of Convolutions in Deep Learning: Applications, Challenges, and Future Trends",
    "abstract": "arXiv:2402.15490v1 Announce Type: new  Abstract: In today's digital age, Convolutional Neural Networks (CNNs), a subset of Deep Learning (DL), are widely used for various computer vision tasks such as image classification, object detection, and image segmentation. There are numerous types of CNNs designed to meet specific needs and requirements, including 1D, 2D, and 3D CNNs, as well as dilated, grouped, attention, depthwise convolutions, and NAS, among others. Each type of CNN has its unique structure and characteristics, making it suitable for specific tasks. It's crucial to gain a thorough understanding and perform a comparative analysis of these different CNN types to understand their strengths and weaknesses. Furthermore, studying the performance, limitations, and practical applications of each type of CNN can aid in the development of new and improved architectures in the future. We also dive into the platforms and frameworks that researchers utilize for their research or develop",
    "link": "https://arxiv.org/abs/2402.15490",
    "context": "Title: A Comprehensive Survey of Convolutions in Deep Learning: Applications, Challenges, and Future Trends\nAbstract: arXiv:2402.15490v1 Announce Type: new  Abstract: In today's digital age, Convolutional Neural Networks (CNNs), a subset of Deep Learning (DL), are widely used for various computer vision tasks such as image classification, object detection, and image segmentation. There are numerous types of CNNs designed to meet specific needs and requirements, including 1D, 2D, and 3D CNNs, as well as dilated, grouped, attention, depthwise convolutions, and NAS, among others. Each type of CNN has its unique structure and characteristics, making it suitable for specific tasks. It's crucial to gain a thorough understanding and perform a comparative analysis of these different CNN types to understand their strengths and weaknesses. Furthermore, studying the performance, limitations, and practical applications of each type of CNN can aid in the development of new and improved architectures in the future. We also dive into the platforms and frameworks that researchers utilize for their research or develop",
    "path": "papers/24/02/2402.15490.json",
    "total_tokens": 878,
    "translated_title": "深度学习中卷积的全面调查：应用、挑战和未来趋势",
    "translated_abstract": "在当今数字时代，卷积神经网络 (CNNs) 在计算机视觉任务中广泛应用，如图像分类、物体检测和图像分割。有许多类型的CNNs旨在满足特定需求和要求，包括1D、2D和3D CNNs，以及扩张的、分组的、注意力的、深度可分的卷积和NAS等。每种类型的CNN具有其独特的结构和特点，使其适用于特定任务。深入了解并对这些不同类型的CNN进行比较分析是至关重要的，以了解它们的优势和劣势。此外，研究每种类型CNN的性能、限制和实际应用可以帮助未来开发新的改进架构。我们还探讨了研究人员用于研究或开发的平台和框架。",
    "tldr": "深度学习中的卷积应用广泛，有许多类型的CNNs可满足特定需求，通过比较分析不同类型的CNNs，可以更好地了解它们的优势和劣势，并促进未来新架构的发展。",
    "en_tdlr": "Convolutions in deep learning are widely used, with various types of CNNs designed to meet specific needs. Comparative analysis of these CNN types can help understand their strengths and weaknesses, leading to the development of new architectures in the future."
}