{
    "title": "AgentMD: Empowering Language Agents for Risk Prediction with Large-Scale Clinical Tool Learning",
    "abstract": "arXiv:2402.13225v1 Announce Type: cross  Abstract: Clinical calculators play a vital role in healthcare by offering accurate evidence-based predictions for various purposes such as prognosis. Nevertheless, their widespread utilization is frequently hindered by usability challenges, poor dissemination, and restricted functionality. Augmenting large language models with extensive collections of clinical calculators presents an opportunity to overcome these obstacles and improve workflow efficiency, but the scalability of the manual curation process poses a significant challenge. In response, we introduce AgentMD, a novel language agent capable of curating and applying clinical calculators across various clinical contexts. Using the published literature, AgentMD has automatically curated a collection of 2,164 diverse clinical calculators with executable functions and structured documentation, collectively named RiskCalcs. Manual evaluations show that RiskCalcs tools achieve an accuracy of",
    "link": "https://arxiv.org/abs/2402.13225",
    "context": "Title: AgentMD: Empowering Language Agents for Risk Prediction with Large-Scale Clinical Tool Learning\nAbstract: arXiv:2402.13225v1 Announce Type: cross  Abstract: Clinical calculators play a vital role in healthcare by offering accurate evidence-based predictions for various purposes such as prognosis. Nevertheless, their widespread utilization is frequently hindered by usability challenges, poor dissemination, and restricted functionality. Augmenting large language models with extensive collections of clinical calculators presents an opportunity to overcome these obstacles and improve workflow efficiency, but the scalability of the manual curation process poses a significant challenge. In response, we introduce AgentMD, a novel language agent capable of curating and applying clinical calculators across various clinical contexts. Using the published literature, AgentMD has automatically curated a collection of 2,164 diverse clinical calculators with executable functions and structured documentation, collectively named RiskCalcs. Manual evaluations show that RiskCalcs tools achieve an accuracy of",
    "path": "papers/24/02/2402.13225.json",
    "total_tokens": 874,
    "translated_title": "AgentMD：为大规模临床工具学习赋能语言代理以进行风险预测",
    "translated_abstract": "临床计算器通过为诸如预后等各种目的提供准确的基于证据的预测，在医疗保健中发挥着至关重要的作用。然而，它们的广泛利用常常受到易用性挑战、信息传播不畅和功能受限的阻碍。将大型语言模型与广泛的临床计算器集合相结合，为克服这些障碍并提高工作流效率提供了机会，但手动筛选过程的可扩展性是一个重大挑战。为此，我们引入了AgentMD，一种能够在各种临床背景下策划和应用临床计算器的新型语言代理。AgentMD利用已发表的文献，自动筛选了一组包含2,164个多样化临床计算器的集合，具有可执行功能和结构化文档，统称为RiskCalcs。人工评估显示RiskCalcs工具达到了一定精度。",
    "tldr": "AgentMD是一种新型语言代理，能够自动筛选和应用包含2,164个临床计算器的RiskCalcs集合，为克服临床工具易用性挑战和提高工作流效率提供了机会。",
    "en_tdlr": "AgentMD is a novel language agent that can automatically curate and apply a collection of 2,164 clinical calculators called RiskCalcs, providing an opportunity to overcome usability challenges and improve workflow efficiency in clinical settings."
}