{
    "title": "The effect of diversity on group decision-making",
    "abstract": "We explore different aspects of cognitive diversity and its effect on the success of group deliberation. To evaluate this, we use 500 dialogues from small, online groups discussing the Wason Card Selection task - the DeliData corpus. Leveraging the corpus, we perform quantitative analysis evaluating three different measures of cognitive diversity. First, we analyse the effect of group size as a proxy measure for diversity. Second, we evaluate the effect of the size of the initial idea pool. Finally, we look into the content of the discussion by analysing discussed solutions, discussion patterns, and how conversational probing can improve those characteristics.   Despite the reputation of groups for compounding bias, we show that small groups can, through dialogue, overcome intuitive biases and improve individual decision-making. Across a large sample and different operationalisations, we consistently find that greater cognitive diversity is associated with more successful group deliber",
    "link": "https://rss.arxiv.org/abs/2402.01427",
    "context": "Title: The effect of diversity on group decision-making\nAbstract: We explore different aspects of cognitive diversity and its effect on the success of group deliberation. To evaluate this, we use 500 dialogues from small, online groups discussing the Wason Card Selection task - the DeliData corpus. Leveraging the corpus, we perform quantitative analysis evaluating three different measures of cognitive diversity. First, we analyse the effect of group size as a proxy measure for diversity. Second, we evaluate the effect of the size of the initial idea pool. Finally, we look into the content of the discussion by analysing discussed solutions, discussion patterns, and how conversational probing can improve those characteristics.   Despite the reputation of groups for compounding bias, we show that small groups can, through dialogue, overcome intuitive biases and improve individual decision-making. Across a large sample and different operationalisations, we consistently find that greater cognitive diversity is associated with more successful group deliber",
    "path": "papers/24/02/2402.01427.json",
    "total_tokens": 843,
    "translated_title": "多样性对群体决策的影响",
    "translated_abstract": "我们研究了认知多样性的不同方面以及其对群体协商成功的影响。我们使用了500个小型在线团队讨论瓦索卡片选择任务的对话记录进行评估 - DeliData语料库。利用该语料库，我们进行了定量分析，评估了认知多样性的三种不同度量。首先，我们分析了群体规模作为多样性的代理度量的影响。其次，我们评估了初始想法池的大小对结果的影响。最后，我们通过分析讨论的解决方案、讨论模式以及谈话探究如何改善这些特征来研究讨论内容。尽管群体因为加重偏见而名声不佳，我们表明小团队可以通过对话克服直觉偏见，提高个体决策能力。在大样本和不同操作中，我们始终发现认知多样性与群体协商的成功性有关",
    "tldr": "研究探讨认知多样性及其对群体决策成功的影响。通过分析500个团队讨论的对话记录，我们发现较大的认知多样性与更成功的群体决策相关。",
    "en_tdlr": "This paper investigates the impact of cognitive diversity on group decision-making and finds that greater cognitive diversity is associated with more successful group deliberation, as shown by an analysis of 500 dialogues from small, online groups."
}