{
    "title": "On the Detection of Reviewer-Author Collusion Rings From Paper Bidding",
    "abstract": "A major threat to the peer-review systems of computer science conferences is the existence of \"collusion rings\" between reviewers. In such collusion rings, reviewers who have also submitted their own papers to the conference work together to manipulate the conference's paper assignment, with the aim of being assigned to review each other's papers. The most straightforward way that colluding reviewers can manipulate the paper assignment is by indicating their interest in each other's papers through strategic paper bidding. One potential approach to solve this important problem would be to detect the colluding reviewers from their manipulated bids, after which the conference can take appropriate action. While prior work has has developed effective techniques to detect other kinds of fraud, no research has yet established that detecting collusion rings is even possible. In this work, we tackle the question of whether it is feasible to detect collusion rings from the paper bidding. To answ",
    "link": "https://arxiv.org/abs/2402.07860",
    "context": "Title: On the Detection of Reviewer-Author Collusion Rings From Paper Bidding\nAbstract: A major threat to the peer-review systems of computer science conferences is the existence of \"collusion rings\" between reviewers. In such collusion rings, reviewers who have also submitted their own papers to the conference work together to manipulate the conference's paper assignment, with the aim of being assigned to review each other's papers. The most straightforward way that colluding reviewers can manipulate the paper assignment is by indicating their interest in each other's papers through strategic paper bidding. One potential approach to solve this important problem would be to detect the colluding reviewers from their manipulated bids, after which the conference can take appropriate action. While prior work has has developed effective techniques to detect other kinds of fraud, no research has yet established that detecting collusion rings is even possible. In this work, we tackle the question of whether it is feasible to detect collusion rings from the paper bidding. To answ",
    "path": "papers/24/02/2402.07860.json",
    "total_tokens": 715,
    "translated_title": "论文竞标中检测作者与审稿人勾结的方法研究",
    "translated_abstract": "计算机科学会议的同行评审系统面临的主要威胁是审稿人之间存在的\"勾结团体\"。在这种勾结团体中，提交了自己的论文的审稿人合作，试图通过操纵会议的论文分配，以便被指派为彼此论文的审稿人。纵观现有的研究，虽然已经发展出了有效的技术来检测其他种类的欺诈行为，但尚未有研究证明检测勾结团体的可能性。本研究解决了如何从论文竞标中检测勾结团体的问题。",
    "tldr": "本文研究了如何从论文竞标中检测勾结团体，以解决同行评审系统中的欺诈问题。",
    "en_tdlr": "This paper investigates how to detect collusion rings from paper bidding to address the issue of fraud in peer-review systems."
}