{
    "title": "PolyNet: Learning Diverse Solution Strategies for Neural Combinatorial Optimization",
    "abstract": "arXiv:2402.14048v1 Announce Type: cross  Abstract: Reinforcement learning-based methods for constructing solutions to combinatorial optimization problems are rapidly approaching the performance of human-designed algorithms. To further narrow the gap, learning-based approaches must efficiently explore the solution space during the search process. Recent approaches artificially increase exploration by enforcing diverse solution generation through handcrafted rules, however, these rules can impair solution quality and are difficult to design for more complex problems. In this paper, we introduce PolyNet, an approach for improving exploration of the solution space by learning complementary solution strategies. In contrast to other works, PolyNet uses only a single-decoder and a training schema that does not enforce diverse solution generation through handcrafted rules. We evaluate PolyNet on four combinatorial optimization problems and observe that the implicit diversity mechanism allows P",
    "link": "https://arxiv.org/abs/2402.14048",
    "context": "Title: PolyNet: Learning Diverse Solution Strategies for Neural Combinatorial Optimization\nAbstract: arXiv:2402.14048v1 Announce Type: cross  Abstract: Reinforcement learning-based methods for constructing solutions to combinatorial optimization problems are rapidly approaching the performance of human-designed algorithms. To further narrow the gap, learning-based approaches must efficiently explore the solution space during the search process. Recent approaches artificially increase exploration by enforcing diverse solution generation through handcrafted rules, however, these rules can impair solution quality and are difficult to design for more complex problems. In this paper, we introduce PolyNet, an approach for improving exploration of the solution space by learning complementary solution strategies. In contrast to other works, PolyNet uses only a single-decoder and a training schema that does not enforce diverse solution generation through handcrafted rules. We evaluate PolyNet on four combinatorial optimization problems and observe that the implicit diversity mechanism allows P",
    "path": "papers/24/02/2402.14048.json",
    "total_tokens": 774,
    "translated_title": "PolyNet：学习神经组合优化的多样化解决策略",
    "translated_abstract": "强化学习方法用于构建组合优化问题解决方案，迅速接近人类设计的算法性能。为了进一步缩小差距，基于学习的方法在搜索过程中必须高效地探索解空间。最近的方法通过强制实施多样化解生成来人为增加探索，然而，这些规则可能损害解决方案质量，并且难以为更复杂的问题设计。本文介绍了PolyNet，一种通过学习互补解决策略来改善解空间探索的方法。与其他作品不同，PolyNet仅使用单个解码器，并且训练图式不通过人为规则强制实施多样化解生成。我们在四个组合优化问题上评估PolyNet，并观察到隐式多样性机制允许P",
    "tldr": "PolyNet通过学习互补解决策略来改善解空间探索，避免了人为规则导致解决方案质量下降的问题。",
    "en_tdlr": "PolyNet improves the exploration of solution space by learning complementary solution strategies, avoiding the issue of solution quality degradation caused by handcrafted rules."
}