{
    "title": "Are Large Language Models Rational Investors?",
    "abstract": "arXiv:2402.12713v1 Announce Type: new  Abstract: Large Language Models (LLMs) are progressively being adopted in financial analysis to harness their extensive knowledge base for interpreting complex market data and trends. However, their application in the financial domain is challenged by intrinsic biases (i.e., risk-preference bias) and a superficial grasp of market intricacies, underscoring the need for a thorough assessment of their financial insight. This study introduces a novel framework, Financial Bias Indicators (FBI), to critically evaluate the financial rationality of LLMs, focusing on their ability to discern and navigate the subtleties of financial information and to identify any irrational biases that might skew market analysis.   Our research adopts an innovative methodology to measure financial rationality, integrating principles of behavioral finance to scrutinize the biases and decision-making patterns of LLMs. We conduct a comprehensive evaluation of 19 leading LLMs,",
    "link": "https://arxiv.org/abs/2402.12713",
    "context": "Title: Are Large Language Models Rational Investors?\nAbstract: arXiv:2402.12713v1 Announce Type: new  Abstract: Large Language Models (LLMs) are progressively being adopted in financial analysis to harness their extensive knowledge base for interpreting complex market data and trends. However, their application in the financial domain is challenged by intrinsic biases (i.e., risk-preference bias) and a superficial grasp of market intricacies, underscoring the need for a thorough assessment of their financial insight. This study introduces a novel framework, Financial Bias Indicators (FBI), to critically evaluate the financial rationality of LLMs, focusing on their ability to discern and navigate the subtleties of financial information and to identify any irrational biases that might skew market analysis.   Our research adopts an innovative methodology to measure financial rationality, integrating principles of behavioral finance to scrutinize the biases and decision-making patterns of LLMs. We conduct a comprehensive evaluation of 19 leading LLMs,",
    "path": "papers/24/02/2402.12713.json",
    "total_tokens": 828,
    "translated_title": "大型语言模型是理性投资者吗？",
    "translated_abstract": "大型语言模型（LLMs）正逐渐被引入金融分析领域，利用其丰富的知识库来解释复杂的市场数据和趋势。然而，它们在金融领域的应用受到固有偏见（即风险偏好偏见）和对市场复杂性的肤浅理解的挑战，强调了对它们的金融洞察力进行全面评估的必要性。本研究引入了一个新颖的框架，金融偏见指标（FBI），以对LLMs的金融合理性进行批判性评估，重点关注它们辨别和导航金融信息的微妙之处的能力，并识别可能扭曲市场分析的任何非理性偏见。",
    "tldr": "本研究引入了金融偏见指标（FBI）框架来评估大型语言模型（LLMs）的金融合理性，着重检验它们对金融信息的辨别和市场分析中可能存在的非理性偏见。",
    "en_tdlr": "This study introduces the Financial Bias Indicators (FBI) framework to evaluate the financial rationality of Large Language Models (LLMs), focusing on their ability to discern financial information and identify potential irrational biases in market analysis."
}