{
    "title": "The Heterogeneous Aggregate Valence Analysis (HAVAN) Model: A Flexible Approach to Modeling Unobserved Heterogeneity in Discrete Choice Analysis",
    "abstract": "This paper introduces the Heterogeneous Aggregate Valence Analysis (HAVAN) model, a novel class of discrete choice models. We adopt the term \"valence'' to encompass any latent quantity used to model consumer decision-making (e.g., utility, regret, etc.). Diverging from traditional models that parameterize heterogeneous preferences across various product attributes, HAVAN models (pronounced \"haven\") instead directly characterize alternative-specific heterogeneous preferences. This innovative perspective on consumer heterogeneity affords unprecedented flexibility and significantly reduces simulation burdens commonly associated with mixed logit models. In a simulation experiment, the HAVAN model demonstrates superior predictive performance compared to state-of-the-art artificial neural networks. This finding underscores the potential for HAVAN models to improve discrete choice modeling capabilities.",
    "link": "https://arxiv.org/abs/2402.00184",
    "context": "Title: The Heterogeneous Aggregate Valence Analysis (HAVAN) Model: A Flexible Approach to Modeling Unobserved Heterogeneity in Discrete Choice Analysis\nAbstract: This paper introduces the Heterogeneous Aggregate Valence Analysis (HAVAN) model, a novel class of discrete choice models. We adopt the term \"valence'' to encompass any latent quantity used to model consumer decision-making (e.g., utility, regret, etc.). Diverging from traditional models that parameterize heterogeneous preferences across various product attributes, HAVAN models (pronounced \"haven\") instead directly characterize alternative-specific heterogeneous preferences. This innovative perspective on consumer heterogeneity affords unprecedented flexibility and significantly reduces simulation burdens commonly associated with mixed logit models. In a simulation experiment, the HAVAN model demonstrates superior predictive performance compared to state-of-the-art artificial neural networks. This finding underscores the potential for HAVAN models to improve discrete choice modeling capabilities.",
    "path": "papers/24/02/2402.00184.json",
    "total_tokens": 781,
    "translated_title": "HAVAN模型：一种灵活的离散选择分析中未观测异质性建模方法",
    "translated_abstract": "本文介绍了一种新型的离散选择模型，名为HAVAN模型（Heterogeneous Aggregate Valence Analysis）。我们采用“valence”这个术语来表示用于建模消费者决策的任何潜在量（如效用、后悔等）。与传统的在各个产品属性之间参数化异质偏好的模型不同，HAVAN模型直接刻画了特定备选的异质偏好。这种对消费者异质性的创新视角提供了前所未有的灵活性，并显著减少了混合logit模型中常见的模拟负担。在一个模拟实验中，HAVAN模型显示出优于最先进的人工神经网络的预测性能。这一发现强调了HAVAN模型改进离散选择建模能力的潜力。",
    "tldr": "本文引入了HAVAN模型，一种灵活的离散选择分析中未观测异质性建模方法。与传统模型不同，HAVAN模型直接刻画了备选项的异质偏好，并在模拟实验中表现出优于神经网络的预测性能。"
}