{
    "title": "Generative Echo Chamber? Effects of LLM-Powered Search Systems on Diverse Information Seeking",
    "abstract": "Large language models (LLMs) powered conversational search systems have already been used by hundreds of millions of people, and are believed to bring many benefits over conventional search. However, while decades of research and public discourse interrogated the risk of search systems in increasing selective exposure and creating echo chambers -- limiting exposure to diverse opinions and leading to opinion polarization, little is known about such a risk of LLM-powered conversational search. We conduct two experiments to investigate: 1) whether and how LLM-powered conversational search increases selective exposure compared to conventional search; 2) whether and how LLMs with opinion biases that either reinforce or challenge the user's view change the effect. Overall, we found that participants engaged in more biased information querying with LLM-powered conversational search, and an opinionated LLM reinforcing their views exacerbated this bias. These results present critical implicatio",
    "link": "https://arxiv.org/abs/2402.05880",
    "context": "Title: Generative Echo Chamber? Effects of LLM-Powered Search Systems on Diverse Information Seeking\nAbstract: Large language models (LLMs) powered conversational search systems have already been used by hundreds of millions of people, and are believed to bring many benefits over conventional search. However, while decades of research and public discourse interrogated the risk of search systems in increasing selective exposure and creating echo chambers -- limiting exposure to diverse opinions and leading to opinion polarization, little is known about such a risk of LLM-powered conversational search. We conduct two experiments to investigate: 1) whether and how LLM-powered conversational search increases selective exposure compared to conventional search; 2) whether and how LLMs with opinion biases that either reinforce or challenge the user's view change the effect. Overall, we found that participants engaged in more biased information querying with LLM-powered conversational search, and an opinionated LLM reinforcing their views exacerbated this bias. These results present critical implicatio",
    "path": "papers/24/02/2402.05880.json",
    "total_tokens": 834,
    "translated_title": "生成性回音室？LLM驱动的搜索系统对多样化信息搜索的影响",
    "translated_abstract": "数亿人已经使用过大型语言模型（LLM）驱动的对话式搜索系统，并且相信这些系统相比传统搜索带来了许多好处。然而，虽然几十年的研究和公共讨论都调查了搜索系统在增加选择性曝光和产生回音室方面的风险，即限制接触多样化意见并导致意见偏执，但对于LLM驱动的对话式搜索的这种风险知之甚少。我们进行了两个实验来研究：1）LLM驱动的对话式搜索相较于传统搜索是否以及如何增加选择性曝光；2）具有支持或挑战用户观点的意见偏见的LLM如何改变这种影响。总体而言，我们发现参与者在LLM驱动的对话式搜索中更倾向于进行偏见的信息查询，并且支持他们观点的有偏见的LLM加剧了这种偏差。这些结果呈现了重要的意义。",
    "tldr": "LLM驱动的对话式搜索系统增加了选择性曝光，且支持用户观点的有偏见LLM加剧了这种偏差。",
    "en_tdlr": "LLM-powered conversational search systems increase selective exposure, and an opinionated LLM reinforcing the user's views exacerbates this bias."
}