{
    "title": "Dynamic Multi-Network Mining of Tensor Time Series",
    "abstract": "arXiv:2402.11773v1 Announce Type: cross  Abstract: Subsequence clustering of time series is an essential task in data mining, and interpreting the resulting clusters is also crucial since we generally do not have prior knowledge of the data. Thus, given a large collection of tensor time series consisting of multiple modes, including timestamps, how can we achieve subsequence clustering for tensor time series and provide interpretable insights? In this paper, we propose a new method, Dynamic Multi-network Mining (DMM), that converts a tensor time series into a set of segment groups of various lengths (i.e., clusters) characterized by a dependency network constrained with l1-norm. Our method has the following properties. (a) Interpretable: it characterizes the cluster with multiple networks, each of which is a sparse dependency network of a corresponding non-temporal mode, and thus provides visible and interpretable insights into the key relationships. (b) Accurate: it discovers the clus",
    "link": "https://arxiv.org/abs/2402.11773",
    "context": "Title: Dynamic Multi-Network Mining of Tensor Time Series\nAbstract: arXiv:2402.11773v1 Announce Type: cross  Abstract: Subsequence clustering of time series is an essential task in data mining, and interpreting the resulting clusters is also crucial since we generally do not have prior knowledge of the data. Thus, given a large collection of tensor time series consisting of multiple modes, including timestamps, how can we achieve subsequence clustering for tensor time series and provide interpretable insights? In this paper, we propose a new method, Dynamic Multi-network Mining (DMM), that converts a tensor time series into a set of segment groups of various lengths (i.e., clusters) characterized by a dependency network constrained with l1-norm. Our method has the following properties. (a) Interpretable: it characterizes the cluster with multiple networks, each of which is a sparse dependency network of a corresponding non-temporal mode, and thus provides visible and interpretable insights into the key relationships. (b) Accurate: it discovers the clus",
    "path": "papers/24/02/2402.11773.json",
    "total_tokens": 831,
    "translated_title": "张量时间序列的动态多网络挖掘",
    "translated_abstract": "时间序列的子序列聚类是数据挖掘中的一个重要任务，解释结果聚类也至关重要，因为通常我们没有关于数据的先验知识。因此，面对由包含时间戳在内的多种模式组成的大量张量时间序列，我们如何为张量时间序列实现子序列聚类并提供可解释的见解？在本文中，我们提出了一种新方法，即动态多网络挖掘（DMM），它将张量时间序列转换为由l1范数约束的一组各种长度的段组（即聚类）特征化的依赖网络。我们的方法具有以下特性。(a) 可解释性：它使用多个网络对聚类进行特征描述，每个网络是相应非时间模式的稀疏依赖网络，从而提供可见且可解释的关键关系见解。 (b) 精确性：它发现了聚类。。。",
    "tldr": "提出了一种新方法，Dynamic Multi-network Mining (DMM)，能够将张量时间序列转换为不同长度的段组，通过稀疏依赖网络提供聚类的可解释性和精确性。"
}