{
    "title": "Integrating LLMs for Explainable Fault Diagnosis in Complex Systems",
    "abstract": "This paper introduces an integrated system designed to enhance the explainability of fault diagnostics in complex systems, such as nuclear power plants, where operator understanding is critical for informed decision-making. By combining a physics-based diagnostic tool with a Large Language Model, we offer a novel solution that not only identifies faults but also provides clear, understandable explanations of their causes and implications. The system's efficacy is demonstrated through application to a molten salt facility, showcasing its ability to elucidate the connections between diagnosed faults and sensor data, answer operator queries, and evaluate historical sensor anomalies. Our approach underscores the importance of merging model-based diagnostics with advanced AI to improve the reliability and transparency of autonomous systems.",
    "link": "https://arxiv.org/abs/2402.06695",
    "context": "Title: Integrating LLMs for Explainable Fault Diagnosis in Complex Systems\nAbstract: This paper introduces an integrated system designed to enhance the explainability of fault diagnostics in complex systems, such as nuclear power plants, where operator understanding is critical for informed decision-making. By combining a physics-based diagnostic tool with a Large Language Model, we offer a novel solution that not only identifies faults but also provides clear, understandable explanations of their causes and implications. The system's efficacy is demonstrated through application to a molten salt facility, showcasing its ability to elucidate the connections between diagnosed faults and sensor data, answer operator queries, and evaluate historical sensor anomalies. Our approach underscores the importance of merging model-based diagnostics with advanced AI to improve the reliability and transparency of autonomous systems.",
    "path": "papers/24/02/2402.06695.json",
    "total_tokens": 833,
    "translated_title": "在复杂系统中集成LLMs以实现可解释的故障诊断",
    "translated_abstract": "本文介绍了一个集成系统，旨在增强复杂系统中故障诊断的可解释性，如核电站，在这些系统中，操作员的理解对于明智的决策至关重要。通过将基于物理的诊断工具与大型语言模型结合起来，我们提供了一种新颖的解决方案，不仅能够识别故障，还能清晰易懂地解释其原因和影响。通过应用于熔盐设施，展示了该系统揭示了诊断故障与传感器数据之间的联系、回答操作员的查询以及评估历史传感器异常的能力。我们的方法强调了将基于模型的诊断与先进的人工智能相结合，以提高自主系统的可靠性和透明度的重要性。",
    "tldr": "本研究介绍了一种集成系统，通过将基于物理的诊断工具与大型语言模型相结合，帮助复杂系统实现可解释的故障诊断。该系统不仅能够识别故障，还能够提供清晰易懂的故障原因和影响解释，提高自主系统的可靠性和透明度。",
    "en_tdlr": "This paper introduces an integrated system that combines physics-based diagnostic tools with Large Language Models to enhance the explainability of fault diagnosis in complex systems. The system not only identifies faults but also provides clear and understandable explanations of their causes and implications, improving the reliability and transparency of autonomous systems."
}