{
    "title": "Low-Resource Counterspeech Generation for Indic Languages: The Case of Bengali and Hindi",
    "abstract": "With the rise of online abuse, the NLP community has begun investigating the use of neural architectures to generate counterspeech that can \"counter\" the vicious tone of such abusive speech and dilute/ameliorate their rippling effect over the social network. However, most of the efforts so far have been primarily focused on English. To bridge the gap for low-resource languages such as Bengali and Hindi, we create a benchmark dataset of 5,062 abusive speech/counterspeech pairs, of which 2,460 pairs are in Bengali and 2,602 pairs are in Hindi. We implement several baseline models considering various interlingual transfer mechanisms with different configurations to generate suitable counterspeech to set up an effective benchmark. We observe that the monolingual setup yields the best performance. Further, using synthetic transfer, language models can generate counterspeech to some extent; specifically, we notice that transferability is better when languages belong to the same language fami",
    "link": "https://arxiv.org/abs/2402.07262",
    "context": "Title: Low-Resource Counterspeech Generation for Indic Languages: The Case of Bengali and Hindi\nAbstract: With the rise of online abuse, the NLP community has begun investigating the use of neural architectures to generate counterspeech that can \"counter\" the vicious tone of such abusive speech and dilute/ameliorate their rippling effect over the social network. However, most of the efforts so far have been primarily focused on English. To bridge the gap for low-resource languages such as Bengali and Hindi, we create a benchmark dataset of 5,062 abusive speech/counterspeech pairs, of which 2,460 pairs are in Bengali and 2,602 pairs are in Hindi. We implement several baseline models considering various interlingual transfer mechanisms with different configurations to generate suitable counterspeech to set up an effective benchmark. We observe that the monolingual setup yields the best performance. Further, using synthetic transfer, language models can generate counterspeech to some extent; specifically, we notice that transferability is better when languages belong to the same language fami",
    "path": "papers/24/02/2402.07262.json",
    "total_tokens": 1020,
    "translated_title": "低资源情况下对印度语言进行对抗言论生成：以孟加拉语和印地语为例",
    "translated_abstract": "随着网络虐待的兴起，自然语言处理（NLP）社区已经开始研究使用神经架构生成对抗言论，以“反制”这种滥用言论的恶劣语气，以此来减轻/改进其对社交网络的影响。然而，到目前为止，大部分工作都着重于英语。为了填补孟加拉语和印地语等低资源语言的差距，我们创建了一个由5062个虐待言论/对抗言论对组成的基准数据集，其中2460对语料是孟加拉语，2602对语料是印地语。我们使用不同配置的几个基线模型来考虑各种跨语言转移机制，以生成适当的对抗言论，从而建立一个有效的基准。我们观察到，单语设置的性能最佳。此外，使用合成转移，语言模型可以在一定程度上生成对抗言论；具体而言，我们注意到当语言属于同一语言家族时，可迁移性更好。",
    "tldr": "该论文针对低资源语言如孟加拉语和印地语，创建了一个包含5062个虐待言论/对抗言论对的基准数据集，并实现了几种基线模型，以生成适当的对抗言论。观察发现，单语设置的性能最佳，并且通过使用合成转移，语言模型可以在一定程度上生成对抗言论，尤其是当语言属于同一语言家族时，可迁移性更好。",
    "en_tdlr": "This paper focuses on low-resource languages such as Bengali and Hindi, and creates a benchmark dataset of abusive speech/counterspeech pairs. Several baseline models are implemented to generate suitable counterspeech, and it is observed that monolingual setup performs the best. Furthermore, language models can generate counterspeech to some extent using synthetic transfer, with better transferability when the languages belong to the same language family."
}