{
    "title": "Neural Style Transfer with Twin-Delayed DDPG for Shared Control of Robotic Manipulators",
    "abstract": "Neural Style Transfer (NST) refers to a class of algorithms able to manipulate an element, most often images, to adopt the appearance or style of another one. Each element is defined as a combination of Content and Style: the Content can be conceptually defined as the what and the Style as the how of said element. In this context, we propose a custom NST framework for transferring a set of styles to the motion of a robotic manipulator, e.g., the same robotic task can be carried out in an angry, happy, calm, or sad way. An autoencoder architecture extracts and defines the Content and the Style of the target robot motions. A Twin Delayed Deep Deterministic Policy Gradient (TD3) network generates the robot control policy using the loss defined by the autoencoder. The proposed Neural Policy Style Transfer TD3 (NPST3) alters the robot motion by introducing the trained style. Such an approach can be implemented either offline, for carrying out autonomous robot motions in dynamic environments",
    "link": "https://arxiv.org/abs/2402.00722",
    "context": "Title: Neural Style Transfer with Twin-Delayed DDPG for Shared Control of Robotic Manipulators\nAbstract: Neural Style Transfer (NST) refers to a class of algorithms able to manipulate an element, most often images, to adopt the appearance or style of another one. Each element is defined as a combination of Content and Style: the Content can be conceptually defined as the what and the Style as the how of said element. In this context, we propose a custom NST framework for transferring a set of styles to the motion of a robotic manipulator, e.g., the same robotic task can be carried out in an angry, happy, calm, or sad way. An autoencoder architecture extracts and defines the Content and the Style of the target robot motions. A Twin Delayed Deep Deterministic Policy Gradient (TD3) network generates the robot control policy using the loss defined by the autoencoder. The proposed Neural Policy Style Transfer TD3 (NPST3) alters the robot motion by introducing the trained style. Such an approach can be implemented either offline, for carrying out autonomous robot motions in dynamic environments",
    "path": "papers/24/02/2402.00722.json",
    "total_tokens": 978,
    "translated_title": "基于双延迟DDPG的神经风格转移用于机器人操纵器的共享控制",
    "translated_abstract": "神经风格转移（NST）是一类能够使元素（通常为图像）采用另一个元素的外观或风格的算法。每个元素由内容和风格组成：内容可以概念上定义为元素的“是什么”，而风格则是元素的“如何”。在这个背景下，我们提出了一个定制的NST框架，用于将一组风格转移到机器人操纵器的运动中，例如，相同的机器人任务可以采用愤怒、快乐、平静或悲伤的方式执行。一个自动编码器架构提取和定义目标机器人运动的内容和风格。双延迟深度确定性策略梯度（TD3）网络使用自动编码器定义的损失生成机器人控制策略。所提出的神经策略风格转移TD3（NPST3）通过引入训练风格来改变机器人运动。这种方法可以在动态环境中以在线或离线的方式实现自主机器人运动。",
    "tldr": "本论文提出了一种基于神经风格转移和TD3网络的共享控制方法，可以将多种风格应用于机器人操纵器的运动中。该方法通过使用自动编码器和双延迟深度确定性策略梯度网络来生成机器人控制策略，实现了机器人运动的风格转移。"
}