{
    "title": "On Practical Diversified Recommendation with Controllable Category Diversity Framework",
    "abstract": "Recommender systems have made significant strides in various industries, primarily driven by extensive efforts to enhance recommendation accuracy. However, this pursuit of accuracy has inadvertently given rise to echo chamber/filter bubble effects. Especially in industry, it could impair user's experiences and prevent user from accessing a wider range of items. One of the solutions is to take diversity into account. However, most of existing works focus on user's explicit preferences, while rarely exploring user's non-interaction preferences. These neglected non-interaction preferences are especially important for broadening user's interests in alleviating echo chamber/filter bubble effects.Therefore, in this paper, we first define diversity as two distinct definitions, i.e., user-explicit diversity (U-diversity) and user-item non-interaction diversity (N-diversity) based on user historical behaviors. Then, we propose a succinct and effective method, named as Controllable Category Dive",
    "link": "https://arxiv.org/abs/2402.03801",
    "context": "Title: On Practical Diversified Recommendation with Controllable Category Diversity Framework\nAbstract: Recommender systems have made significant strides in various industries, primarily driven by extensive efforts to enhance recommendation accuracy. However, this pursuit of accuracy has inadvertently given rise to echo chamber/filter bubble effects. Especially in industry, it could impair user's experiences and prevent user from accessing a wider range of items. One of the solutions is to take diversity into account. However, most of existing works focus on user's explicit preferences, while rarely exploring user's non-interaction preferences. These neglected non-interaction preferences are especially important for broadening user's interests in alleviating echo chamber/filter bubble effects.Therefore, in this paper, we first define diversity as two distinct definitions, i.e., user-explicit diversity (U-diversity) and user-item non-interaction diversity (N-diversity) based on user historical behaviors. Then, we propose a succinct and effective method, named as Controllable Category Dive",
    "path": "papers/24/02/2402.03801.json",
    "total_tokens": 838,
    "translated_title": "实用的多样化推荐系统与可控制的类别多样性框架",
    "translated_abstract": "推荐系统在各个行业取得了重大进展，主要是通过努力提高推荐准确性。然而，这种追求准确性的努力不经意间引发了回音室/过滤泡效应。特别是在工业界，它可能损害用户的体验，阻止用户访问更广泛的项目。其中一个解决方案是考虑多样性。然而，大部分现有研究都着重于用户的显式偏好，很少探索用户的非交互偏好。这些被忽视的非交互偏好对于拓宽用户兴趣、缓解回音室/过滤泡效应尤为重要。因此，在本文中，我们首先基于用户的历史行为将多样性定义为两个不同的定义，即用户显式多样性（U-diversity）和用户-项目非交互多样性（N-diversity）。然后，我们提出了一种简明有效的方法，名为可控制的类别多样化框架（Controllable Category Dive）。",
    "tldr": "本文提出了一个具有可控制类别多样性框架的实用的多样化推荐系统。该系统通过考虑用户的非交互偏好，扩大用户的兴趣范围，缓解回音室/过滤泡效应。"
}