{
    "title": "A Learning-Based Caching Mechanism for Edge Content Delivery",
    "abstract": "With the advent of 5G networks and the rise of the Internet of Things (IoT), Content Delivery Networks (CDNs) are increasingly extending into the network edge. This shift introduces unique challenges, particularly due to the limited cache storage and the diverse request patterns at the edge. These edge environments can host traffic classes characterized by varied object-size distributions and object-access patterns. Such complexity makes it difficult for traditional caching strategies, which often rely on metrics like request frequency or time intervals, to be effective. Despite these complexities, the optimization of edge caching is crucial. Improved byte hit rates at the edge not only alleviate the load on the network backbone but also minimize operational costs and expedite content delivery to end-users.   In this paper, we introduce HR-Cache, a comprehensive learning-based caching framework grounded in the principles of Hazard Rate (HR) ordering, a rule originally formulated to com",
    "link": "https://arxiv.org/abs/2402.02795",
    "context": "Title: A Learning-Based Caching Mechanism for Edge Content Delivery\nAbstract: With the advent of 5G networks and the rise of the Internet of Things (IoT), Content Delivery Networks (CDNs) are increasingly extending into the network edge. This shift introduces unique challenges, particularly due to the limited cache storage and the diverse request patterns at the edge. These edge environments can host traffic classes characterized by varied object-size distributions and object-access patterns. Such complexity makes it difficult for traditional caching strategies, which often rely on metrics like request frequency or time intervals, to be effective. Despite these complexities, the optimization of edge caching is crucial. Improved byte hit rates at the edge not only alleviate the load on the network backbone but also minimize operational costs and expedite content delivery to end-users.   In this paper, we introduce HR-Cache, a comprehensive learning-based caching framework grounded in the principles of Hazard Rate (HR) ordering, a rule originally formulated to com",
    "path": "papers/24/02/2402.02795.json",
    "total_tokens": 865,
    "translated_title": "基于学习的边缘内容传递缓存机制",
    "translated_abstract": "随着5G网络的兴起和物联网(IoT)的发展，内容传递网络(CDNs)越来越多地扩展到网络边缘。这种转变带来了独特的挑战，特别是由于边缘的有限缓存存储和多样化的请求模式。边缘环境可以托管具有不同对象大小分布和对象访问模式的流量类别。这种复杂性使得传统的缓存策略很难发挥作用，传统策略通常依赖于请求频率或时间间隔等指标。尽管存在这些复杂性，优化边缘缓存至关重要。在边缘实现更高的字节命中率不仅可以减轻网络骨干的负载，还可以最小化运营成本并加快内容传递给最终用户。在本文中，我们介绍了一种名为HR-Cache的综合学习缓存框架，它基于危险率(Hazard Rate)排序原则，这是一种最初用来计算待命时间的规则。",
    "tldr": "基于学习的边缘缓存框架HR-Cache能够优化边缘缓存，提高字节命中率，降低网络负载，并加速内容传递给用户。",
    "en_tdlr": "The learning-based edge caching framework HR-Cache optimizes edge caching, improves byte hit rates, reduces network load, and accelerates content delivery to end-users."
}