{
    "title": "Self-DC: When to retrieve and When to generate? Self Divide-and-Conquer for Compositional Unknown Questions",
    "abstract": "arXiv:2402.13514v1 Announce Type: cross  Abstract: Retrieve-then-read and generate-then-read are two typical solutions to handle unknown and known questions in open-domain question-answering, while the former retrieves necessary external knowledge and the later prompt the large language models to generate internal known knowledge encoded in the parameters. However, few of previous works consider the compositional unknown questions, which consist of several known or unknown sub-questions. Thus, simple binary classification (known or unknown) becomes sub-optimal and inefficient since it will call external retrieval excessively for each compositional unknown question. To this end, we propose the first Compositional unknown Question-Answering dataset (CuQA), and introduce a Self Divide-and-Conquer (Self-DC) framework to empower LLMs to adaptively call different methods on-demand, resulting in better performance and efficiency. Experimental results on two datasets (CuQA and FreshQA) demonst",
    "link": "https://arxiv.org/abs/2402.13514",
    "context": "Title: Self-DC: When to retrieve and When to generate? Self Divide-and-Conquer for Compositional Unknown Questions\nAbstract: arXiv:2402.13514v1 Announce Type: cross  Abstract: Retrieve-then-read and generate-then-read are two typical solutions to handle unknown and known questions in open-domain question-answering, while the former retrieves necessary external knowledge and the later prompt the large language models to generate internal known knowledge encoded in the parameters. However, few of previous works consider the compositional unknown questions, which consist of several known or unknown sub-questions. Thus, simple binary classification (known or unknown) becomes sub-optimal and inefficient since it will call external retrieval excessively for each compositional unknown question. To this end, we propose the first Compositional unknown Question-Answering dataset (CuQA), and introduce a Self Divide-and-Conquer (Self-DC) framework to empower LLMs to adaptively call different methods on-demand, resulting in better performance and efficiency. Experimental results on two datasets (CuQA and FreshQA) demonst",
    "path": "papers/24/02/2402.13514.json",
    "total_tokens": 849,
    "translated_title": "自我分而治之：何时检索、何时生成？面向组合未知问题的自我分而治之算法",
    "translated_abstract": "检索-然后阅读和生成-然后阅读是处理开放域问答中未知和已知问题的两种典型解决方案，前者检索必要的外部知识，后者则促使大型语言模型生成参数中编码的内部已知知识。然而，过去很少有作品考虑到组合未知问题，这些问题由几个已知或未知的子问题组成。因此，简单的二元分类（已知或未知）变得次优和低效，因为它会对每个组合未知问题过度调用外部检索。为此，我们提出了第一个组合未知问题问答数据集（CuQA），并引入了一个自我分而治之（Self-DC）框架，使大型语言模型能够自适应地调用不同的方法，从而提高性能和效率。实验结果在两个数据集（CuQA和FreshQA）上表明……",
    "tldr": "提出了面向组合未知问题的自我分而治之算法，引入了第一个组合未知问题问答数据集（CuQA），通过自适应调用不同方法实现更好的性能和效率。"
}