{
    "title": "Deep Nonlinear Hyperspectral Unmixing Using Multi-task Learning",
    "abstract": "Nonlinear hyperspectral unmixing has recently received considerable attention, as linear mixture models do not lead to an acceptable resolution in some problems. In fact, most nonlinear unmixing methods are designed by assuming specific assumptions on the nonlinearity model which subsequently limits the unmixing performance. In this paper, we propose an unsupervised nonlinear unmixing approach based on deep learning by incorporating a general nonlinear model with no special assumptions. This model consists of two branches. In the first branch, endmembers are learned by reconstructing the rows of hyperspectral images using some hidden layers, and in the second branch, abundance values are learned based on the columns of respective images. Then, using multi-task learning, we introduce an auxiliary task to enforce the two branches to work together. This technique can be considered as a regularizer mitigating overfitting, which improves the performance of the total network. Extensive exper",
    "link": "https://arxiv.org/abs/2402.03398",
    "context": "Title: Deep Nonlinear Hyperspectral Unmixing Using Multi-task Learning\nAbstract: Nonlinear hyperspectral unmixing has recently received considerable attention, as linear mixture models do not lead to an acceptable resolution in some problems. In fact, most nonlinear unmixing methods are designed by assuming specific assumptions on the nonlinearity model which subsequently limits the unmixing performance. In this paper, we propose an unsupervised nonlinear unmixing approach based on deep learning by incorporating a general nonlinear model with no special assumptions. This model consists of two branches. In the first branch, endmembers are learned by reconstructing the rows of hyperspectral images using some hidden layers, and in the second branch, abundance values are learned based on the columns of respective images. Then, using multi-task learning, we introduce an auxiliary task to enforce the two branches to work together. This technique can be considered as a regularizer mitigating overfitting, which improves the performance of the total network. Extensive exper",
    "path": "papers/24/02/2402.03398.json",
    "total_tokens": 870,
    "translated_title": "深度非线性高光谱解混使用多任务学习",
    "translated_abstract": "非线性高光谱解混近年来受到了广泛关注，因为线性混合模型在一些问题上无法达到可接受的分辨率。事实上，大多数非线性解混方法都是通过假设特定的非线性模型而设计的，这限制了解混性能。在本文中，我们提出了一种基于深度学习的无监督非线性解混方法，将通用的非线性模型与没有特殊假设的方法相结合。该模型由两个分支组成。在第一个分支中，通过重构高光谱图像的行来学习端元，使用一些隐藏层，然后在第二个分支中，根据相应图像的列来学习丰度值。然后，通过多任务学习，我们引入了一个辅助任务来促使这两个分支共同工作。这种技术可以被视为一个正则化器，用于减轻过拟合，从而提高整个网络的性能。",
    "tldr": "本文提出了一种基于深度学习的无监督非线性高光谱解混方法，通过将通用的非线性模型与无特殊假设的方法相结合，使用多任务学习来提高解混性能。"
}