{
    "title": "The Impact of AI Tool on Engineering at ANZ Bank An Emperical Study on GitHub Copilot within Coporate Environment",
    "abstract": "The increasing popularity of AI, particularly Large Language Models (LLMs), has significantly impacted various domains, including Software Engineering. This study explores the integration of AI tools in software engineering practices within a large organization. We focus on ANZ Bank, which employs over 5000 engineers covering all aspects of the software development life cycle. This paper details an experiment conducted using GitHub Copilot, a notable AI tool, within a controlled environment to evaluate its effectiveness in real-world engineering tasks. Additionally, this paper shares initial findings on the productivity improvements observed after GitHub Copilot was adopted on a large scale, with about 1000 engineers using it. ANZ Bank's six-week experiment with GitHub Copilot included two weeks of preparation and four weeks of active testing. The study evaluated participant sentiment and the tool's impact on productivity, code quality, and security. Initially, participants used GitHub",
    "link": "https://arxiv.org/abs/2402.05636",
    "context": "Title: The Impact of AI Tool on Engineering at ANZ Bank An Emperical Study on GitHub Copilot within Coporate Environment\nAbstract: The increasing popularity of AI, particularly Large Language Models (LLMs), has significantly impacted various domains, including Software Engineering. This study explores the integration of AI tools in software engineering practices within a large organization. We focus on ANZ Bank, which employs over 5000 engineers covering all aspects of the software development life cycle. This paper details an experiment conducted using GitHub Copilot, a notable AI tool, within a controlled environment to evaluate its effectiveness in real-world engineering tasks. Additionally, this paper shares initial findings on the productivity improvements observed after GitHub Copilot was adopted on a large scale, with about 1000 engineers using it. ANZ Bank's six-week experiment with GitHub Copilot included two weeks of preparation and four weeks of active testing. The study evaluated participant sentiment and the tool's impact on productivity, code quality, and security. Initially, participants used GitHub",
    "path": "papers/24/02/2402.05636.json",
    "total_tokens": 994,
    "translated_title": "AI工具对澳新银行工程的影响——关于GitHub Copilot在企业环境中的实证研究",
    "translated_abstract": "人工智能，特别是大型语言模型（LLMs），的日益流行已经对包括软件工程在内的各个领域产生了重大影响。本研究探讨了在大型组织中将AI工具整合到软件工程实践中的情况。我们的焦点是澳新银行，该银行拥有超过5000名工程师，涵盖软件开发生命周期的各个方面。本文详细介绍了在受控环境中使用一款著名的AI工具GitHub Copilot进行实验，以评估其在实际工程任务中的有效性。此外，本文分享了在大规模采用GitHub Copilot后观察到的生产力改善的初步发现，约有1000名工程师在使用该工具。澳新银行对GitHub Copilot进行了为期六周的实验，其中包括两周的准备和四周的主动测试。该研究评估了参与者的情绪以及该工具对生产力、代码质量和安全性的影响。最初，参与者使用GitHub Copilot进行迭代和改进，同时记录其反馈和体验。",
    "tldr": "本研究探讨了在澳新银行这样一个大型组织中，将AI工具GitHub Copilot整合到软件工程实践中的实证研究。通过在受控环境中进行的实验，评估了该工具在实际工程任务中的有效性，并发现在大规模采用后对生产力的改善是显著的。",
    "en_tdlr": "This study explores the integration of the AI tool GitHub Copilot in software engineering practices within ANZ Bank, a large organization. Through a controlled experiment, the effectiveness of the tool in real-world engineering tasks was evaluated, and significant improvements in productivity were observed after its widespread adoption."
}