{
    "title": "EmoWear: Exploring Emotional Teasers for Voice Message Interaction on Smartwatches",
    "abstract": "Voice messages, by nature, prevent users from gauging the emotional tone without fully diving into the audio content. This hinders the shared emotional experience at the pre-retrieval stage. Research scarcely explored \"Emotional Teasers\"-pre-retrieval cues offering a glimpse into an awaiting message's emotional tone without disclosing its content. We introduce EmoWear, a smartwatch voice messaging system enabling users to apply 30 animation teasers on message bubbles to reflect emotions. EmoWear eases senders' choice by prioritizing emotions based on semantic and acoustic processing. EmoWear was evaluated in comparison with a mirroring system using color-coded message bubbles as emotional cues (N=24). Results showed EmoWear significantly enhanced emotional communication experience in both receiving and sending messages. The animated teasers were considered intuitive and valued for diverse expressions. Desirable interaction qualities and practical implications are distilled for future d",
    "link": "https://arxiv.org/abs/2402.07174",
    "context": "Title: EmoWear: Exploring Emotional Teasers for Voice Message Interaction on Smartwatches\nAbstract: Voice messages, by nature, prevent users from gauging the emotional tone without fully diving into the audio content. This hinders the shared emotional experience at the pre-retrieval stage. Research scarcely explored \"Emotional Teasers\"-pre-retrieval cues offering a glimpse into an awaiting message's emotional tone without disclosing its content. We introduce EmoWear, a smartwatch voice messaging system enabling users to apply 30 animation teasers on message bubbles to reflect emotions. EmoWear eases senders' choice by prioritizing emotions based on semantic and acoustic processing. EmoWear was evaluated in comparison with a mirroring system using color-coded message bubbles as emotional cues (N=24). Results showed EmoWear significantly enhanced emotional communication experience in both receiving and sending messages. The animated teasers were considered intuitive and valued for diverse expressions. Desirable interaction qualities and practical implications are distilled for future d",
    "path": "papers/24/02/2402.07174.json",
    "total_tokens": 821,
    "translated_title": "EmoWear: 探索智能手表上声音信息交互的情感提示",
    "translated_abstract": "语音信息本质上使用户无法在完全听取音频内容之前判断情感语调，这阻碍了在预检索阶段的共享情感体验。研究很少探索\"情感提示\"——在不透露内容的情况下提供有关待收听信息情感语调的暗示。我们引入了EmoWear，一种智能手表语音信息系统，允许用户在信息气泡上应用30种动画提示来反映情感。EmoWear通过基于语义和声学处理的方式来帮助发送者选择情感。通过将EmoWear与使用彩色信息气泡作为情感提示的镜像系统进行比较(N=24)，我们评估了EmoWear。结果表明，EmoWear显著增强了接收和发送消息时的情感交流体验。动画提示被认为直观且具有多种表达方式。我们总结出了可行的交互质量和实际应用的未来前景。",
    "tldr": "EmoWear是一种智能手表语音信息系统，通过使用动画提示反映情感，显著增强了情感交流体验。",
    "en_tdlr": "EmoWear is a smartwatch voice messaging system that significantly enhances emotional communication experience by using animated teasers to reflect emotions."
}