{
    "title": "Enhancing Rolling Horizon Production Planning Through Stochastic Optimization Evaluated by Means of Simulation",
    "abstract": "arXiv:2402.14506v1 Announce Type: new  Abstract: Production planning must account for uncertainty in a production system, arising from fluctuating demand forecasts. Therefore, this article focuses on the integration of updated customer demand into the rolling horizon planning cycle. We use scenario-based stochastic programming to solve capacitated lot sizing problems under stochastic demand in a rolling horizon environment. This environment is replicated using a discrete event simulation-optimization framework, where the optimization problem is periodically solved, leveraging the latest demand information to continually adjust the production plan. We evaluate the stochastic optimization approach and compare its performance to solving a deterministic lot sizing model, using expected demand figures as input, as well as to standard Material Requirements Planning (MRP). In the simulation study, we analyze three different customer behaviors related to forecasting, along with four levels of ",
    "link": "https://arxiv.org/abs/2402.14506",
    "context": "Title: Enhancing Rolling Horizon Production Planning Through Stochastic Optimization Evaluated by Means of Simulation\nAbstract: arXiv:2402.14506v1 Announce Type: new  Abstract: Production planning must account for uncertainty in a production system, arising from fluctuating demand forecasts. Therefore, this article focuses on the integration of updated customer demand into the rolling horizon planning cycle. We use scenario-based stochastic programming to solve capacitated lot sizing problems under stochastic demand in a rolling horizon environment. This environment is replicated using a discrete event simulation-optimization framework, where the optimization problem is periodically solved, leveraging the latest demand information to continually adjust the production plan. We evaluate the stochastic optimization approach and compare its performance to solving a deterministic lot sizing model, using expected demand figures as input, as well as to standard Material Requirements Planning (MRP). In the simulation study, we analyze three different customer behaviors related to forecasting, along with four levels of ",
    "path": "papers/24/02/2402.14506.json",
    "total_tokens": 841,
    "translated_title": "通过模拟评估的随机优化来增强滚动视界生产计划",
    "translated_abstract": "生产计划必须考虑到生产系统中的不确定性，源自需求预测的波动。因此，本文集中在将更新的客户需求整合到滚动视界规划周期中。我们使用基于场景的随机规划来解决滚动视界环境下的有能力批量规模问题。该环境通过离散事件模拟优化框架复制，其中对定期解决的优化问题，利用最新的需求信息不断调整生产计划。我们评估了随机优化方法，并将其性能与使用预期需求数据作为输入解决确定性批量规模模型以及标准物料需求计划（MRP）进行了比较。在模拟研究中，我们分析了与预测相关的三种不同客户行为，以及四个水平的需求波动。",
    "tldr": "本文通过将更新的客户需求整合到滚动视界规划周期中，使用场景-based的随机规划来解决有能力批量规模问题，在离散事件模拟-优化框架中不断调整生产计划，提升了生产计划的滚动视界。"
}