{
    "title": "AMEND: A Mixture of Experts Framework for Long-tailed Trajectory Prediction",
    "abstract": "arXiv:2402.08698v1 Announce Type: cross Abstract: Accurate prediction of pedestrians' future motions is critical for intelligent driving systems. Developing models for this task requires rich datasets containing diverse sets of samples. However, the existing naturalistic trajectory prediction datasets are generally imbalanced in favor of simpler samples and lack challenging scenarios. Such a long-tail effect causes prediction models to underperform on the tail portion of the data distribution containing safety-critical scenarios. Previous methods tackle the long-tail problem using methods such as contrastive learning and class-conditioned hypernetworks. These approaches, however, are not modular and cannot be applied to many machine learning architectures. In this work, we propose a modular model-agnostic framework for trajectory prediction that leverages a specialized mixture of experts. In our approach, each expert is trained with a specialized skill with respect to a particular part",
    "link": "https://arxiv.org/abs/2402.08698",
    "context": "Title: AMEND: A Mixture of Experts Framework for Long-tailed Trajectory Prediction\nAbstract: arXiv:2402.08698v1 Announce Type: cross Abstract: Accurate prediction of pedestrians' future motions is critical for intelligent driving systems. Developing models for this task requires rich datasets containing diverse sets of samples. However, the existing naturalistic trajectory prediction datasets are generally imbalanced in favor of simpler samples and lack challenging scenarios. Such a long-tail effect causes prediction models to underperform on the tail portion of the data distribution containing safety-critical scenarios. Previous methods tackle the long-tail problem using methods such as contrastive learning and class-conditioned hypernetworks. These approaches, however, are not modular and cannot be applied to many machine learning architectures. In this work, we propose a modular model-agnostic framework for trajectory prediction that leverages a specialized mixture of experts. In our approach, each expert is trained with a specialized skill with respect to a particular part",
    "path": "papers/24/02/2402.08698.json",
    "total_tokens": 791,
    "translated_title": "AMEND：一种用于长尾轨迹预测的专家混合框架",
    "translated_abstract": "准确地预测行人未来的动向对于智能驾驶系统至关重要。开发这个任务的模型需要包含多样样本的丰富数据集。然而，现有的自然轨迹预测数据集通常对简单样本偏重，并缺乏具有挑战性的场景。这种长尾效应导致预测模型在包含安全关键场景的数据分布的尾部部分表现不佳。以前的方法使用对比学习和类条件超网络等方法解决了长尾问题。然而，这些方法不是模块化的，不能应用于许多机器学习架构。在这项工作中，我们提出了一种模块化的模型无关的轨迹预测框架，利用专门的专家混合。在我们的方法中，每个专家都通过针对特定部分的特殊技能进行训练。",
    "tldr": "本研究提出了一种模块化的模型无关的轨迹预测框架，使用专家混合来解决长尾效应问题，提高对于包含挑战性场景的数据的预测性能。"
}