{
    "title": "Human-Centric Aware UAV Trajectory Planning in Search and Rescue Missions Employing Multi-Objective Reinforcement Learning with AHP and Similarity-Based Experience Replay",
    "abstract": "arXiv:2402.18487v1 Announce Type: cross  Abstract: The integration of Unmanned Aerial Vehicles (UAVs) into Search and Rescue (SAR) missions presents a promising avenue for enhancing operational efficiency and effectiveness. However, the success of these missions is not solely dependent on the technical capabilities of the drones but also on their acceptance and interaction with humans on the ground. This paper explores the effect of human-centric factor in UAV trajectory planning for SAR missions. We introduce a novel approach based on the reinforcement learning augmented with Analytic Hierarchy Process and novel similarity-based experience replay to optimize UAV trajectories, balancing operational objectives with human comfort and safety considerations. Additionally, through a comprehensive survey, we investigate the impact of gender cues and anthropomorphism in UAV design on public acceptance and trust, revealing significant implications for drone interaction strategies in SAR. Our c",
    "link": "https://arxiv.org/abs/2402.18487",
    "context": "Title: Human-Centric Aware UAV Trajectory Planning in Search and Rescue Missions Employing Multi-Objective Reinforcement Learning with AHP and Similarity-Based Experience Replay\nAbstract: arXiv:2402.18487v1 Announce Type: cross  Abstract: The integration of Unmanned Aerial Vehicles (UAVs) into Search and Rescue (SAR) missions presents a promising avenue for enhancing operational efficiency and effectiveness. However, the success of these missions is not solely dependent on the technical capabilities of the drones but also on their acceptance and interaction with humans on the ground. This paper explores the effect of human-centric factor in UAV trajectory planning for SAR missions. We introduce a novel approach based on the reinforcement learning augmented with Analytic Hierarchy Process and novel similarity-based experience replay to optimize UAV trajectories, balancing operational objectives with human comfort and safety considerations. Additionally, through a comprehensive survey, we investigate the impact of gender cues and anthropomorphism in UAV design on public acceptance and trust, revealing significant implications for drone interaction strategies in SAR. Our c",
    "path": "papers/24/02/2402.18487.json",
    "total_tokens": 925,
    "translated_title": "人本关注的多目标强化学习与AHP及基于相似性经验回放的无人机轨迹规划在搜索和救援任务中的应用",
    "translated_abstract": "集成无人机（UAVs）到搜索和救援（SAR）任务中为提高操作效率和效果提供了一个有前景的途径。然而，这些任务的成功不仅仅取决于无人机的技术能力，也取决于它们与地面人员的接受和互动。本文探讨了人本因素在SAR任务中无人机轨迹规划中的作用。我们引入了一种基于强化学习的新方法，该方法使用层次分析过程和新的基于相似性的经验回放优化无人机轨迹，平衡操作目标与人类舒适性和安全考虑。此外，通过一项全面的调查，我们研究了在无人机设计中性别暗示和拟人化对公众接受和信任的影响，揭示了对SAR中无人机互动策略具有重要意义的重要影响。",
    "tldr": "该论文探讨了人本关注因素在搜索和救援任务中无人机轨迹规划中的作用，引入了基于强化学习、AHP和基于相似性经验回放的新方法优化无人机轨迹，平衡了运营目标与人类舒适和安全考虑。",
    "en_tdlr": "This paper explores the role of human-centric factors in UAV trajectory planning for search and rescue missions, introduces a new approach based on reinforcement learning, AHP, and similarity-based experience replay to optimize UAV trajectories, balancing operational objectives with human comfort and safety considerations."
}