{
    "title": "Detection of Machine-Generated Text: Literature Survey",
    "abstract": "Since language models produce fake text quickly and easily, there is an oversupply of such content in the public domain. The degree of sophistication and writing style has reached a point where differentiating between human authored and machine-generated content is nearly impossible. As a result, works generated by language models rather than human authors have gained significant media attention and stirred controversy.Concerns regarding the possible influence of advanced language models on society have also arisen, needing a fuller knowledge of these processes. Natural language generation (NLG) and generative pre-trained transformer (GPT) models have revolutionized a variety of sectors: the scope not only permeated throughout journalism and customer service but also reached academia. To mitigate the hazardous implications that may arise from the use of these models, preventative measures must be implemented, such as providing human agents with the capacity to distinguish between artif",
    "link": "https://arxiv.org/abs/2402.01642",
    "context": "Title: Detection of Machine-Generated Text: Literature Survey\nAbstract: Since language models produce fake text quickly and easily, there is an oversupply of such content in the public domain. The degree of sophistication and writing style has reached a point where differentiating between human authored and machine-generated content is nearly impossible. As a result, works generated by language models rather than human authors have gained significant media attention and stirred controversy.Concerns regarding the possible influence of advanced language models on society have also arisen, needing a fuller knowledge of these processes. Natural language generation (NLG) and generative pre-trained transformer (GPT) models have revolutionized a variety of sectors: the scope not only permeated throughout journalism and customer service but also reached academia. To mitigate the hazardous implications that may arise from the use of these models, preventative measures must be implemented, such as providing human agents with the capacity to distinguish between artif",
    "path": "papers/24/02/2402.01642.json",
    "total_tokens": 859,
    "translated_title": "机器生成文本的检测：文献综述",
    "translated_abstract": "由于语言模型能够快速轻松地产生虚假文本，公共领域中出现了大量此类内容。在不断提升的复杂度和写作风格下，几乎无法区分人类撰写和机器生成的内容。因此，与人工作者相比，语言模型生成的作品引起了巨大的媒体关注并引起了争议。对于先进语言模型可能对社会产生的影响的担忧也应运而生，需要对这些过程有更充分的了解。自然语言生成（NLG）和生成预训练转换器（GPT）模型已经在各个领域引起了革命性的影响：其范围不仅渗透到新闻报道和客户服务，还涉及到学术界。为了减轻使用这些模型可能带来的危险影响，必须采取预防措施，例如为人类操作员提供区分虚假文本和真实文本的能力。",
    "tldr": "这项论文对机器生成文本的检测进行了文献综述，指出了语言模型生成的虚假文本大量存在于公共领域，因此需要采取预防措施来应对其可能带来的危险影响。",
    "en_tdlr": "This paper presents a literature survey on the detection of machine-generated text, highlighting the abundance of fake text produced by language models in the public domain and the need for preventative measures to mitigate its potential harmful implications."
}