{
    "title": "The prices of renewable commodities: A robust stationarity analysis",
    "abstract": "This paper addresses the problem of testing for persistence in the effects of the shocks affecting the prices of renewable commodities, which have potential implications on stabilization policies and economic forecasting, among other areas. A robust methodology is employed that enables the determination of the potential presence and number of instant/gradual structural changes in the series, stationarity testing conditional on the number of changes detected, and the detection of change points. This procedure is applied to the annual real prices of eighteen renewable commodities over the period of 1900-2018. Results indicate that most of the series display non-linear features, including quadratic patterns and regime transitions that often coincide with well-known political and economic episodes. The conclusions of stationarity testing suggest that roughly half of the series are integrated. Stationarity fails to be rejected for grains, whereas most livestock and textile commodities do re",
    "link": "https://rss.arxiv.org/abs/2402.01005",
    "context": "Title: The prices of renewable commodities: A robust stationarity analysis\nAbstract: This paper addresses the problem of testing for persistence in the effects of the shocks affecting the prices of renewable commodities, which have potential implications on stabilization policies and economic forecasting, among other areas. A robust methodology is employed that enables the determination of the potential presence and number of instant/gradual structural changes in the series, stationarity testing conditional on the number of changes detected, and the detection of change points. This procedure is applied to the annual real prices of eighteen renewable commodities over the period of 1900-2018. Results indicate that most of the series display non-linear features, including quadratic patterns and regime transitions that often coincide with well-known political and economic episodes. The conclusions of stationarity testing suggest that roughly half of the series are integrated. Stationarity fails to be rejected for grains, whereas most livestock and textile commodities do re",
    "path": "papers/24/02/2402.01005.json",
    "total_tokens": 792,
    "translated_title": "可再生商品的价格:一个强健的平稳性分析",
    "translated_abstract": "本文解决了测试可再生商品价格受冲击的持久性问题，这对稳定政策和经济预测等领域具有潜在影响。采用了一种强健的方法，可以确定系列中潜在存在的即时/渐进性结构变化的数量，并根据检测到的变化点进行条件平稳性测试。该方法应用于1900年至2018年间的十八种可再生商品的年度实际价格。结果表明，大部分系列显示出非线性特征，包括二次模式和常常与众所周知的政治和经济事件相吻合的体制转变。平稳性测试的结论表明，大约一半的系列是整合的。对粮食而言，平稳性不被拒绝，而大多数牲畜和纺织品则被拒绝。",
    "tldr": "本文通过对可再生商品价格的冲击的持久性进行稳健分析，发现大部分系列显示出非线性特征和体制转变，并得出约一半的系列是整合的结论。",
    "en_tdlr": "This paper conducts a robust analysis on the persistence of shocks affecting the prices of renewable commodities, finding non-linear features, regime transitions, and concluding that approximately half of the series are integrated."
}