{
    "title": "Fisher information dissipation for time inhomogeneous stochastic differential equations",
    "abstract": "We provide a Lyapunov convergence analysis for time-inhomogeneous variable coefficient stochastic differential equations (SDEs). Three typical examples include overdamped, irreversible drift, and underdamped Langevin dynamics. We first formula the probability transition equation of Langevin dynamics as a modified gradient flow of the Kullback-Leibler divergence in the probability space with respect to time-dependent optimal transport metrics. This formulation contains both gradient and non-gradient directions depending on a class of time-dependent target distribution. We then select a time-dependent relative Fisher information functional as a Lyapunov functional. We develop a time-dependent Hessian matrix condition, which guarantees the convergence of the probability density function of the SDE. We verify the proposed conditions for several time-inhomogeneous Langevin dynamics. For the overdamped Langevin dynamics, we prove the $O(t^{-1/2})$ convergence in $L^1$ distance for the simula",
    "link": "https://rss.arxiv.org/abs/2402.01036",
    "context": "Title: Fisher information dissipation for time inhomogeneous stochastic differential equations\nAbstract: We provide a Lyapunov convergence analysis for time-inhomogeneous variable coefficient stochastic differential equations (SDEs). Three typical examples include overdamped, irreversible drift, and underdamped Langevin dynamics. We first formula the probability transition equation of Langevin dynamics as a modified gradient flow of the Kullback-Leibler divergence in the probability space with respect to time-dependent optimal transport metrics. This formulation contains both gradient and non-gradient directions depending on a class of time-dependent target distribution. We then select a time-dependent relative Fisher information functional as a Lyapunov functional. We develop a time-dependent Hessian matrix condition, which guarantees the convergence of the probability density function of the SDE. We verify the proposed conditions for several time-inhomogeneous Langevin dynamics. For the overdamped Langevin dynamics, we prove the $O(t^{-1/2})$ convergence in $L^1$ distance for the simula",
    "path": "papers/24/02/2402.01036.json",
    "total_tokens": 952,
    "translated_title": "时间不齐次随机微分方程的费舍尔信息耗散",
    "translated_abstract": "我们为时间不齐次变系数随机微分方程(SDEs)提供了一个Lyapunov收敛性分析。三个典型的例子包括过阻尼、不可逆漂移和欠阻尼Langevin动力学。我们首先将Langevin动力学的概率转移方程构造为概率空间中关于时间依赖的最优传输度量的Kullback-Leibler散度的修正梯度流。这个公式包含了梯度和非梯度方向，取决于一类时间依赖的目标分布。然后我们选择一个时间依赖的相对费舍尔信息泛函作为Lyapunov函数。我们发展了一个时间依赖的Hessian矩阵条件，保证了SDE的概率密度函数的收敛性。我们验证了几个时间不齐次Langevin动力学的所提出的条件。对于过阻尼Langevin动力学，我们证明了在$L^1$距离上的$O(t^{-1/2})$收敛。",
    "tldr": "本文提供了时间不齐次随机微分方程的费舍尔信息耗散方法。通过将Langevin动力学的概率转移方程构造为关于时间依赖的最优传输度量的修正梯度流，我们得到了概率密度函数的收敛性保证，并在几个时间不齐次Langevin动力学中进行了验证。"
}