{
    "title": "\"Which LLM should I use?\": Evaluating LLMs for tasks performed by Undergraduate Computer Science Students in India",
    "abstract": "This study evaluates the effectiveness of various large language models (LLMs) in performing tasks common among undergraduate computer science students. Although a number of research studies in the computing education community have explored the possibility of using LLMs for a variety of tasks, there is a lack of comprehensive research comparing different LLMs and evaluating which LLMs are most effective for different tasks. Our research systematically assesses some of the publicly available LLMs such as Google Bard, ChatGPT, GitHub Copilot Chat, and Microsoft Copilot across diverse tasks commonly encountered by undergraduate computer science students. These tasks include code generation, explanation, project ideation, content generation, class assignments, and email composition. Evaluation for these tasks was carried out by junior and senior students in computer science, and provides insights into the models' strengths and limitations. This study aims to guide students in selecting su",
    "link": "https://arxiv.org/abs/2402.01687",
    "context": "Title: \"Which LLM should I use?\": Evaluating LLMs for tasks performed by Undergraduate Computer Science Students in India\nAbstract: This study evaluates the effectiveness of various large language models (LLMs) in performing tasks common among undergraduate computer science students. Although a number of research studies in the computing education community have explored the possibility of using LLMs for a variety of tasks, there is a lack of comprehensive research comparing different LLMs and evaluating which LLMs are most effective for different tasks. Our research systematically assesses some of the publicly available LLMs such as Google Bard, ChatGPT, GitHub Copilot Chat, and Microsoft Copilot across diverse tasks commonly encountered by undergraduate computer science students. These tasks include code generation, explanation, project ideation, content generation, class assignments, and email composition. Evaluation for these tasks was carried out by junior and senior students in computer science, and provides insights into the models' strengths and limitations. This study aims to guide students in selecting su",
    "path": "papers/24/02/2402.01687.json",
    "total_tokens": 826,
    "translated_title": "“我应该使用哪个LLM？”：评估用于印度本科计算机科学学生任务的LLMs",
    "translated_abstract": "本研究评估了各种大型语言模型（LLMs）在本科计算机科学学生常见任务中的效果。尽管计算机教育界的许多研究已经探讨了使用LLMs执行各种任务的可能性，但缺乏对不同LLMs进行综合比较和评估哪个LLMs对不同任务最有效的研究。我们的研究系统地评估了一些公开可用的LLMs，例如Google Bard，ChatGPT，GitHub Copilot Chat和Microsoft Copilot在本科计算机科学学生常遇到的不同任务中的表现。这些任务包括代码生成，解释，项目构思，内容生成，课程作业和电子邮件撰写。计算机科学的高年级和低年级学生进行了这些任务的评估，并提供了对模型的优点和局限性的见解。该研究旨在指导学生选择适合他们的LLM。",
    "tldr": "本研究评估了各种LLMs在本科计算机科学学生常见任务中的效果，并指导学生选择适合他们的LLM.",
    "en_tdlr": "This study evaluates the effectiveness of various LLMs in tasks performed by undergraduate computer science students, providing guidance for students in selecting the most suitable LLM."
}