{
    "title": "Monetary Policy and the Gendered Labor Market Dynamics: Evidence from Developing Economies",
    "abstract": "Using a Taylor rule amended with official reserves movements, we derive country-specific monetary shocks and employ a local projections-estimator for tracking gender-disaggregated labor-market responses in 99 developing economies from 2009 to 2021. Results show that women experience more negative post-shock employment responses than men, contributing to a deepening of the gender gaps on the labor market. After the shock, women leave the labor market more so than men, which results in an apparently intact or even improved unemployment outcome for women. We find limited evidence of sector-specific reaction to interest rates. Additionally, we identify an intense worsening of women-s position on the labor market in high-growth environments as well under monetary policy tightening. Developing Asia and Latin America experience the most significant detrimental effects on women's employment, Africa exhibits a slower manifestation of the monetary shocks-impact and developing Europe shows the mi",
    "link": "https://arxiv.org/abs/2402.05729",
    "context": "Title: Monetary Policy and the Gendered Labor Market Dynamics: Evidence from Developing Economies\nAbstract: Using a Taylor rule amended with official reserves movements, we derive country-specific monetary shocks and employ a local projections-estimator for tracking gender-disaggregated labor-market responses in 99 developing economies from 2009 to 2021. Results show that women experience more negative post-shock employment responses than men, contributing to a deepening of the gender gaps on the labor market. After the shock, women leave the labor market more so than men, which results in an apparently intact or even improved unemployment outcome for women. We find limited evidence of sector-specific reaction to interest rates. Additionally, we identify an intense worsening of women-s position on the labor market in high-growth environments as well under monetary policy tightening. Developing Asia and Latin America experience the most significant detrimental effects on women's employment, Africa exhibits a slower manifestation of the monetary shocks-impact and developing Europe shows the mi",
    "path": "papers/24/02/2402.05729.json",
    "total_tokens": 879,
    "translated_title": "货币政策与性别化劳动力市场动态：发展中国家的证据",
    "translated_abstract": "使用修改后的泰勒准则和官方外汇储备运动，我们得出了各国特定的货币冲击，并采用局部投影估计法跟踪了2009年至2021年间99个发展中国家的性别分解劳动力市场反应。结果表明，女性在冲击后的就业反应比男性更为消极，导致性别差距在劳动力市场上加剧。在冲击后，女性离开劳动力市场的情况比男性更多，这导致女性的失业状况表面上保持不变甚至有所改善。我们发现对利率的部门特定反应证据有限。此外，我们还确定，在高增长环境和货币政策收紧下，女性在劳动力市场的地位明显恶化。发展中国家的亚洲和拉丁美洲对女性就业造成了最严重的负面影响，非洲表现出货币冲击影响的较慢显现，发展欧洲表现为中等程度的恶化。",
    "tldr": "这项研究通过分析99个发展中国家的数据，发现女性在货币政策冲击下的就业反应比男性更为消极，导致性别差距加剧。尤其是在高增长环境和货币政策收紧情况下，女性的就业情况明显恶化。"
}