{
    "title": "Teacher-Student Learning on Complexity in Intelligent Routing",
    "abstract": "arXiv:2402.15665v1 Announce Type: cross  Abstract: Customer service is often the most time-consuming aspect for e-commerce websites, with each contact typically taking 10-15 minutes. Effectively routing customers to appropriate agents without transfers is therefore crucial for e-commerce success. To this end, we have developed a machine learning framework that predicts the complexity of customer contacts and routes them to appropriate agents accordingly. The framework consists of two parts. First, we train a teacher model to score the complexity of a contact based on the post-contact transcripts. Then, we use the teacher model as a data annotator to provide labels to train a student model that predicts the complexity based on pre-contact data only. Our experiments show that such a framework is successful and can significantly improve customer experience. We also propose a useful metric called complexity AUC that evaluates the effectiveness of customer service at a statistical level.",
    "link": "https://arxiv.org/abs/2402.15665",
    "context": "Title: Teacher-Student Learning on Complexity in Intelligent Routing\nAbstract: arXiv:2402.15665v1 Announce Type: cross  Abstract: Customer service is often the most time-consuming aspect for e-commerce websites, with each contact typically taking 10-15 minutes. Effectively routing customers to appropriate agents without transfers is therefore crucial for e-commerce success. To this end, we have developed a machine learning framework that predicts the complexity of customer contacts and routes them to appropriate agents accordingly. The framework consists of two parts. First, we train a teacher model to score the complexity of a contact based on the post-contact transcripts. Then, we use the teacher model as a data annotator to provide labels to train a student model that predicts the complexity based on pre-contact data only. Our experiments show that such a framework is successful and can significantly improve customer experience. We also propose a useful metric called complexity AUC that evaluates the effectiveness of customer service at a statistical level.",
    "path": "papers/24/02/2402.15665.json",
    "total_tokens": 844,
    "translated_title": "在智能路由中的师生学习复杂性",
    "translated_abstract": "客户服务通常是电子商务网站中最耗时的环节，每次联系通常需要花费10-15分钟。有效地将客户引导到合适的代理商，避免转接是电子商务成功的关键。为此，我们开发了一个机器学习框架，用于预测客户联系的复杂性并相应地将其引导到合适的代理商。该框架分为两部分。首先，我们训练一个师傅模型，根据联系后的对话文本评分来评估联系的复杂性。然后，我们使用师傅模型作为数据标注者，为训练一个只根据联系前数据预测复杂性的学生模型提供标签。我们的实验表明，这样的框架是成功的，并且可以显著改善客户体验。我们还提出了一个称为复杂性AUC的有用度量标准，用于在统计水平上评估客户服务的有效性。",
    "tldr": "通过机器学习框架中的师生模型，成功预测客户联系的复杂性并将其引导到合适的代理商，提高了客户体验，并提出了复杂性AUC度量标准。",
    "en_tdlr": "Successfully predicting the complexity of customer contacts and routing them to appropriate agents using a teacher-student model in a machine learning framework improved customer experience, and introducing the complexity AUC metric for evaluating customer service effectiveness."
}