{
    "title": "Deep-Learning Channel Estimation for IRS-Assisted Integrated Sensing and Communication System",
    "abstract": "arXiv:2402.09441v1 Announce Type: cross  Abstract: Integrated sensing and communication (ISAC), and intelligent reflecting surface (IRS) are envisioned as revolutionary technologies to enhance spectral and energy efficiencies for next wireless system generations. For the first time, this paper focuses on the channel estimation problem in an IRS-assisted ISAC system. This problem is challenging due to the lack of signal processing capacity in passive IRS, as well as the presence of mutual interference between sensing and communication (SAC) signals in ISAC systems. A three-stage approach is proposed to decouple the estimation problem into sub-ones, including the estimation of the direct SAC channels in the first stage, reflected communication channel in the second stage, and reflected sensing channel in the third stage. The proposed three-stage approach is based on a deep-learning framework, which involves two different convolutional neural network (CNN) architectures to estimate the ch",
    "link": "https://arxiv.org/abs/2402.09441",
    "context": "Title: Deep-Learning Channel Estimation for IRS-Assisted Integrated Sensing and Communication System\nAbstract: arXiv:2402.09441v1 Announce Type: cross  Abstract: Integrated sensing and communication (ISAC), and intelligent reflecting surface (IRS) are envisioned as revolutionary technologies to enhance spectral and energy efficiencies for next wireless system generations. For the first time, this paper focuses on the channel estimation problem in an IRS-assisted ISAC system. This problem is challenging due to the lack of signal processing capacity in passive IRS, as well as the presence of mutual interference between sensing and communication (SAC) signals in ISAC systems. A three-stage approach is proposed to decouple the estimation problem into sub-ones, including the estimation of the direct SAC channels in the first stage, reflected communication channel in the second stage, and reflected sensing channel in the third stage. The proposed three-stage approach is based on a deep-learning framework, which involves two different convolutional neural network (CNN) architectures to estimate the ch",
    "path": "papers/24/02/2402.09441.json",
    "total_tokens": 912,
    "translated_title": "基于深度学习的智能反射表面辅助集成感知与通信系统的信道估计",
    "translated_abstract": "本文首次关注智能反射表面辅助集成感知与通信系统中的信道估计问题。由于被动智能反射表面缺乏信号处理能力，并且在集成感知与通信系统中存在感知和通信信号之间的互相干扰，这个问题具有挑战性。我们提出了一个三阶段的方法来解决这个估计问题，其中包括在第一阶段估计直接感知和通信信道，在第二阶段估计反射通信信道，在第三阶段估计反射感知信道。所提出的三阶段方法基于一个深度学习框架，其中包括两种不同的卷积神经网络结构来进行信道估计。",
    "tldr": "本文针对智能反射表面辅助集成感知与通信系统中的信道估计问题，提出了一个基于深度学习的三阶段方法。该方法通过解耦问题，分别估计直接感知和通信信道、反射通信信道和反射感知信道，以应对智能反射表面的信号处理能力不足和感知与通信信号之间的互相干扰。",
    "en_tdlr": "This paper proposes a deep-learning based three-stage approach to address the challenging channel estimation problem in an intelligent reflecting surface-assisted integrated sensing and communication system. The approach decouples the estimation problem and estimates the direct sensing and communication channels, reflected communication channels, and reflected sensing channels separately, aiming to overcome the lack of signal processing capacity in the reflecting surface and the mutual interference between sensing and communication signals."
}