{
    "title": "Adversarial-Robust Transfer Learning for Medical Imaging via Domain Assimilation",
    "abstract": "arXiv:2402.16005v1 Announce Type: cross  Abstract: In the field of Medical Imaging, extensive research has been dedicated to leveraging its potential in uncovering critical diagnostic features in patients. Artificial Intelligence (AI)-driven medical diagnosis relies on sophisticated machine learning and deep learning models to analyze, detect, and identify diseases from medical images. Despite the remarkable performance of these models, characterized by high accuracy, they grapple with trustworthiness issues. The introduction of a subtle perturbation to the original image empowers adversaries to manipulate the prediction output, redirecting it to other targeted or untargeted classes. Furthermore, the scarcity of publicly available medical images, constituting a bottleneck for reliable training, has led contemporary algorithms to depend on pretrained models grounded on a large set of natural images -- a practice referred to as transfer learning. However, a significant {\\em domain discre",
    "link": "https://arxiv.org/abs/2402.16005",
    "context": "Title: Adversarial-Robust Transfer Learning for Medical Imaging via Domain Assimilation\nAbstract: arXiv:2402.16005v1 Announce Type: cross  Abstract: In the field of Medical Imaging, extensive research has been dedicated to leveraging its potential in uncovering critical diagnostic features in patients. Artificial Intelligence (AI)-driven medical diagnosis relies on sophisticated machine learning and deep learning models to analyze, detect, and identify diseases from medical images. Despite the remarkable performance of these models, characterized by high accuracy, they grapple with trustworthiness issues. The introduction of a subtle perturbation to the original image empowers adversaries to manipulate the prediction output, redirecting it to other targeted or untargeted classes. Furthermore, the scarcity of publicly available medical images, constituting a bottleneck for reliable training, has led contemporary algorithms to depend on pretrained models grounded on a large set of natural images -- a practice referred to as transfer learning. However, a significant {\\em domain discre",
    "path": "papers/24/02/2402.16005.json",
    "total_tokens": 831,
    "translated_title": "通过领域同化实现医学图像的敌对稳健迁移学习",
    "translated_abstract": "在医学图像领域，人们致力于利用其潜力来揭示患者的关键诊断特征。人工智能驱动的医学诊断依赖于复杂的机器学习和深度学习模型，用于分析、检测和识别医学图像中的疾病。尽管这些模型表现出高准确性的显著性能，但它们仍然面临着信任问题。对原始图像引入微小扰动使对手能够操纵预测输出，将其重定向到其他目标或非目标类别。此外，公开可用的医学图像稀缺，构成可靠训练的瓶颈，这导致当代算法依赖于基于大量自然图像的预训练模型 -- 一种称为迁移学习的实践。",
    "tldr": "该论文着力于解决医学图像领域中机器学习模型的敌对攻击问题与训练数据稀缺问题，并利用领域同化的方法来增强模型的稳健性。",
    "en_tdlr": "This paper focuses on addressing adversarial attacks and data scarcity issues in machine learning models for medical imaging, and enhancing the robustness of models using domain assimilation."
}