{
    "title": "Towards Agile Robots: Intuitive Robot Position Speculation with Neural Networks",
    "abstract": "arXiv:2402.16281v1 Announce Type: cross  Abstract: The robot position speculation, which determines where the chassis should move, is one key step to control the mobile manipulators. The target position must ensure the feasibility of chassis movement and manipulability, which is guaranteed by randomized sampling and kinematic checking in traditional methods. Addressing the demands of agile robotics, this paper proposes a robot position speculation network(RPSN), a learning-based approach to enhance the agility of mobile manipulators. The RPSN incorporates a differentiable inverse kinematic algorithm and a neural network. Through end-to-end training, the RPSN can speculate positions with a high success rate. We apply the RPSN to mobile manipulators disassembling end-of-life electric vehicle batteries (EOL-EVBs). Extensive experiments on various simulated environments and physical mobile manipulators demonstrate that the probability of the initial position provided by RPSN being the idea",
    "link": "https://arxiv.org/abs/2402.16281",
    "context": "Title: Towards Agile Robots: Intuitive Robot Position Speculation with Neural Networks\nAbstract: arXiv:2402.16281v1 Announce Type: cross  Abstract: The robot position speculation, which determines where the chassis should move, is one key step to control the mobile manipulators. The target position must ensure the feasibility of chassis movement and manipulability, which is guaranteed by randomized sampling and kinematic checking in traditional methods. Addressing the demands of agile robotics, this paper proposes a robot position speculation network(RPSN), a learning-based approach to enhance the agility of mobile manipulators. The RPSN incorporates a differentiable inverse kinematic algorithm and a neural network. Through end-to-end training, the RPSN can speculate positions with a high success rate. We apply the RPSN to mobile manipulators disassembling end-of-life electric vehicle batteries (EOL-EVBs). Extensive experiments on various simulated environments and physical mobile manipulators demonstrate that the probability of the initial position provided by RPSN being the idea",
    "path": "papers/24/02/2402.16281.json",
    "total_tokens": 811,
    "translated_title": "朝着敏捷机器人：利用神经网络进行直观的机器人位置推测",
    "translated_abstract": "机器人位置推测是控制移动操作器械的关键步骤之一，以确定底盘应该移动到哪里。为了满足敏捷机器人技术的需求，本文提出了一个机器人位置推测网络(RPSN)，这是一种基于学习的方法，旨在增强移动操作器械的敏捷性。RPSN将可微分的逆运动学算法和神经网络相结合。通过端到端训练，RPSN能够高成功率地推测位置。我们将RPSN应用于分解末期电动汽车电池的移动操作器械。在各种模拟环境和实际移动操作器械上进行了大量实验证明，RPSN提供的初始位置可能是理想位置的概率",
    "tldr": "本文提出了一种机器人位置推测网络(RPSN)，通过将可微分的逆运动学算法和神经网络结合，能够高成功率地推测移动操作器械的位置。",
    "en_tdlr": "This paper proposes a robot position speculation network (RPSN) which combines differentiable inverse kinematic algorithm and neural network to speculate positions with a high success rate for mobile manipulators."
}