{
    "title": "Instance Segmentation XXL-CT Challenge of a Historic Airplane",
    "abstract": "Instance segmentation of compound objects in XXL-CT imagery poses a unique challenge in non-destructive testing. This complexity arises from the lack of known reference segmentation labels, limited applicable segmentation tools, as well as partially degraded image quality. To asses recent advancements in the field of machine learning-based image segmentation, the \"Instance Segmentation XXL-CT Challenge of a Historic Airplane\" was conducted. The challenge aimed to explore automatic or interactive instance segmentation methods for an efficient delineation of the different aircraft components, such as screws, rivets, metal sheets or pressure tubes. We report the organization and outcome of this challenge and describe the capabilities and limitations of the submitted segmentation methods.",
    "link": "https://arxiv.org/abs/2402.02928",
    "context": "Title: Instance Segmentation XXL-CT Challenge of a Historic Airplane\nAbstract: Instance segmentation of compound objects in XXL-CT imagery poses a unique challenge in non-destructive testing. This complexity arises from the lack of known reference segmentation labels, limited applicable segmentation tools, as well as partially degraded image quality. To asses recent advancements in the field of machine learning-based image segmentation, the \"Instance Segmentation XXL-CT Challenge of a Historic Airplane\" was conducted. The challenge aimed to explore automatic or interactive instance segmentation methods for an efficient delineation of the different aircraft components, such as screws, rivets, metal sheets or pressure tubes. We report the organization and outcome of this challenge and describe the capabilities and limitations of the submitted segmentation methods.",
    "path": "papers/24/02/2402.02928.json",
    "total_tokens": 776,
    "translated_title": "历史飞机的XXL-CT实例分割挑战",
    "translated_abstract": "在无损检测中，复合对象的XXL-CT成像实例分割面临独特的挑战。这种复杂性来源于缺乏已知的参考分割标签、适用的分割工具有限以及部分退化的图像质量。为了评估机器学习图像分割领域的最新进展，进行了“历史飞机的XXL-CT实例分割挑战”。该挑战旨在探索自动或交互式实例分割方法，以有效勾勒出飞机的不同组件，例如螺钉、铆钉、金属板或压力管。我们报告了这个挑战的组织和结果，并描述了提交的分割方法的能力和局限性。",
    "tldr": "该论文介绍了一个历史飞机的XXL-CT实例分割挑战，该挑战旨在评估机器学习图像分割领域的最新进展，并探索了自动或交互式实例分割方法在有效勾勒飞机组件的能力和局限性。",
    "en_tdlr": "This paper presents a challenge for instance segmentation of a historic airplane using XXL-CT, aiming to evaluate the latest advancements in machine learning-based image segmentation and explore the capabilities and limitations of automatic or interactive methods for delineating aircraft components."
}