{
    "title": "Vehicle Behavior Prediction by Episodic-Memory Implanted NDT",
    "abstract": "In autonomous driving, predicting the behavior (turning left, stopping, etc.) of target vehicles is crucial for the self-driving vehicle to make safe decisions and avoid accidents. Existing deep learning-based methods have shown excellent and accurate performance, but the black-box nature makes it untrustworthy to apply them in practical use. In this work, we explore the interpretability of behavior prediction of target vehicles by an Episodic Memory implanted Neural Decision Tree (abbrev. eMem-NDT). The structure of eMem-NDT is constructed by hierarchically clustering the text embedding of vehicle behavior descriptions. eMem-NDT is a neural-backed part of a pre-trained deep learning model by changing the soft-max layer of the deep model to eMem-NDT, for grouping and aligning the memory prototypes of the historical vehicle behavior features in training data on a neural decision tree. Each leaf node of eMem-NDT is modeled by a neural network for aligning the behavior memory prototypes. ",
    "link": "https://arxiv.org/abs/2402.08423",
    "context": "Title: Vehicle Behavior Prediction by Episodic-Memory Implanted NDT\nAbstract: In autonomous driving, predicting the behavior (turning left, stopping, etc.) of target vehicles is crucial for the self-driving vehicle to make safe decisions and avoid accidents. Existing deep learning-based methods have shown excellent and accurate performance, but the black-box nature makes it untrustworthy to apply them in practical use. In this work, we explore the interpretability of behavior prediction of target vehicles by an Episodic Memory implanted Neural Decision Tree (abbrev. eMem-NDT). The structure of eMem-NDT is constructed by hierarchically clustering the text embedding of vehicle behavior descriptions. eMem-NDT is a neural-backed part of a pre-trained deep learning model by changing the soft-max layer of the deep model to eMem-NDT, for grouping and aligning the memory prototypes of the historical vehicle behavior features in training data on a neural decision tree. Each leaf node of eMem-NDT is modeled by a neural network for aligning the behavior memory prototypes. ",
    "path": "papers/24/02/2402.08423.json",
    "total_tokens": 926,
    "translated_title": "通过植入记忆的Neural Decision Tree实现车辆行为预测",
    "translated_abstract": "在自动驾驶中，预测目标车辆的行为（左转、停车等）对于自动驾驶车辆做出安全决策和避免事故至关重要。现有的基于深度学习的方法已经展示出了优秀而准确的性能，但是黑盒的特性使得它们难以在实际应用中得到信任。本文通过植入记忆的Neural Decision Tree（简称eMem-NDT）探索目标车辆行为预测的可解释性。eMem-NDT的结构通过对车辆行为描述的文本嵌入进行分层聚类构建。eMem-NDT是预训练深度学习模型的一个神经支持部分，通过将深度模型的软最大层替换为eMem-NDT，在神经决策树上对训练数据中历史车辆行为特征的行为记忆原型进行分组和对齐。eMem-NDT的每个叶节点由神经网络建模，用于对齐行为记忆原型。",
    "tldr": "本文通过植入记忆的Neural Decision Tree（eMem-NDT）探索目标车辆行为预测的可解释性，并且在神经决策树中对历史车辆行为特征的行为记忆原型进行分组和对齐。"
}