{
    "title": "Knowledge-Driven Deep Learning Paradigms for Wireless Network Optimization in 6G",
    "abstract": "In the sixth-generation (6G) networks, newly emerging diversified services of massive users in dynamic network environments are required to be satisfied by multi-dimensional heterogeneous resources. The resulting large-scale complicated network optimization problems are beyond the capability of model-based theoretical methods due to the overwhelming computational complexity and the long processing time. Although with fast online inference and universal approximation ability, data-driven deep learning (DL) heavily relies on abundant training data and lacks interpretability. To address these issues, a new paradigm called knowledge-driven DL has emerged, aiming to integrate proven domain knowledge into the construction of neural networks, thereby exploiting the strengths of both methods. This article provides a systematic review of knowledge-driven DL in wireless networks. Specifically, a holistic framework of knowledge-driven DL in wireless networks is proposed, where knowledge sources, ",
    "link": "https://arxiv.org/abs/2402.01665",
    "context": "Title: Knowledge-Driven Deep Learning Paradigms for Wireless Network Optimization in 6G\nAbstract: In the sixth-generation (6G) networks, newly emerging diversified services of massive users in dynamic network environments are required to be satisfied by multi-dimensional heterogeneous resources. The resulting large-scale complicated network optimization problems are beyond the capability of model-based theoretical methods due to the overwhelming computational complexity and the long processing time. Although with fast online inference and universal approximation ability, data-driven deep learning (DL) heavily relies on abundant training data and lacks interpretability. To address these issues, a new paradigm called knowledge-driven DL has emerged, aiming to integrate proven domain knowledge into the construction of neural networks, thereby exploiting the strengths of both methods. This article provides a systematic review of knowledge-driven DL in wireless networks. Specifically, a holistic framework of knowledge-driven DL in wireless networks is proposed, where knowledge sources, ",
    "path": "papers/24/02/2402.01665.json",
    "total_tokens": 823,
    "translated_title": "基于知识驱动的深度学习范式在6G无线网络优化中的应用",
    "translated_abstract": "在第六代（6G）网络中，需要通过多维异构资源满足新兴的大规模用户和动态网络环境的多样化服务。由此引发的大规模复杂的网络优化问题超出了基于模型的理论方法的能力范围，因为计算复杂度极高且处理时间很长。尽管数据驱动的深度学习（DL）具有快速在线推理和通用逼近能力，但它严重依赖丰富的训练数据且缺乏解释性。为了解决这些问题，出现了一种新的范式，称为知识驱动的DL，旨在将已证明的领域知识整合到神经网络的构建中，从而充分利用两种方法的优势。本文系统地回顾了知识驱动的DL在无线网络中的应用。具体而言，提出了一个综合的知识驱动的DL在无线网络中的框架，",
    "tldr": "基于知识驱动的深度学习范式在6G无线网络优化中的应用通过整合领域知识和神经网络构建来解决复杂的网络优化问题。"
}