{
    "title": "Mask-up: Investigating Biases in Face Re-identification for Masked Faces",
    "abstract": "arXiv:2402.13771v1 Announce Type: cross  Abstract: AI based Face Recognition Systems (FRSs) are now widely distributed and deployed as MLaaS solutions all over the world, moreso since the COVID-19 pandemic for tasks ranging from validating individuals' faces while buying SIM cards to surveillance of citizens. Extensive biases have been reported against marginalized groups in these systems and have led to highly discriminatory outcomes. The post-pandemic world has normalized wearing face masks but FRSs have not kept up with the changing times. As a result, these systems are susceptible to mask based face occlusion. In this study, we audit four commercial and nine open-source FRSs for the task of face re-identification between different varieties of masked and unmasked images across five benchmark datasets (total 14,722 images). These simulate a realistic validation/surveillance task as deployed in all major countries around the world. Three of the commercial and five of the open-source ",
    "link": "https://arxiv.org/abs/2402.13771",
    "context": "Title: Mask-up: Investigating Biases in Face Re-identification for Masked Faces\nAbstract: arXiv:2402.13771v1 Announce Type: cross  Abstract: AI based Face Recognition Systems (FRSs) are now widely distributed and deployed as MLaaS solutions all over the world, moreso since the COVID-19 pandemic for tasks ranging from validating individuals' faces while buying SIM cards to surveillance of citizens. Extensive biases have been reported against marginalized groups in these systems and have led to highly discriminatory outcomes. The post-pandemic world has normalized wearing face masks but FRSs have not kept up with the changing times. As a result, these systems are susceptible to mask based face occlusion. In this study, we audit four commercial and nine open-source FRSs for the task of face re-identification between different varieties of masked and unmasked images across five benchmark datasets (total 14,722 images). These simulate a realistic validation/surveillance task as deployed in all major countries around the world. Three of the commercial and five of the open-source ",
    "path": "papers/24/02/2402.13771.json",
    "total_tokens": 890,
    "translated_title": "Mask-up: 探究戴口罩人脸再识别中的偏见",
    "translated_abstract": "AI基于的人脸识别系统（FRSs）目前已被广泛分发，并部署为遍布全球的MLaaS解决方案，尤其是自COVID-19大流行以来，用于验证个人购买SIM卡时的面部，到对公民进行监视。已经报告了这些系统对边缘化群体存在广泛的偏见，并导致高度歧视性的结果。后疫情时代已经使戴口罩变得正常，但FRSs并没有跟上潮流。因此，这些系统容易受到基于口罩的脸部遮盖的影响。在这项研究中，我们审计了四个商业FRSs和九个开源FRSs，用于在五个基准数据集（共14,722张图像）之间对不同类型的戴口罩和不戴口罩图像进行人脸再识别的任务。这些数据集模拟了部署在全球主要国家中的现实验证/监视任务。其中三个商业和五个开源的...",
    "tldr": "研究审计了商业和开源人脸识别系统在戴口罩人脸再识别中的偏见，揭示了这些系统在应对戴口罩带来的挑战方面的不足。"
}