{
    "title": "Data augmentation method for modeling health records with applications to clopidogrel treatment failure detection",
    "abstract": "arXiv:2402.18046v1 Announce Type: new  Abstract: We present a novel data augmentation method to address the challenge of data scarcity in modeling longitudinal patterns in Electronic Health Records (EHR) of patients using natural language processing (NLP) algorithms. The proposed method generates augmented data by rearranging the orders of medical records within a visit where the order of elements are not obvious, if any. Applying the proposed method to the clopidogrel treatment failure detection task enabled up to 5.3% absolute improvement in terms of ROC-AUC (from 0.908 without augmentation to 0.961 with augmentation) when it was used during the pre-training procedure. It was also shown that the augmentation helped to improve performance during fine-tuning procedures, especially when the amount of labeled training data is limited.",
    "link": "https://arxiv.org/abs/2402.18046",
    "context": "Title: Data augmentation method for modeling health records with applications to clopidogrel treatment failure detection\nAbstract: arXiv:2402.18046v1 Announce Type: new  Abstract: We present a novel data augmentation method to address the challenge of data scarcity in modeling longitudinal patterns in Electronic Health Records (EHR) of patients using natural language processing (NLP) algorithms. The proposed method generates augmented data by rearranging the orders of medical records within a visit where the order of elements are not obvious, if any. Applying the proposed method to the clopidogrel treatment failure detection task enabled up to 5.3% absolute improvement in terms of ROC-AUC (from 0.908 without augmentation to 0.961 with augmentation) when it was used during the pre-training procedure. It was also shown that the augmentation helped to improve performance during fine-tuning procedures, especially when the amount of labeled training data is limited.",
    "path": "papers/24/02/2402.18046.json",
    "total_tokens": 804,
    "translated_title": "数据增强方法用于建模健康记录，并应用于氯吡格雷治疗失败检测",
    "translated_abstract": "我们提出了一种新颖的数据增强方法，以解决在利用自然语言处理（NLP）算法对患者的电子健康记录（EHR）中建模纵向模式时所面临的数据稀缺性挑战。该方法通过重新排列就诊过程中医疗记录的顺序来生成增强数据，其中元素的顺序不明显，如果有的话。将该方法应用于氯吡格雷治疗失败检测任务时，在预训练过程中使用该方法使得 ROC-AUC 绝对改进达到了 5.3%（从未进行增强的 0.908 改进为使用增强的 0.961）。研究还表明，在标记训练数据量有限时，增强有助于改善微调过程的性能。",
    "tldr": "提出了一种新颖的数据增强方法，可改善电子健康记录中纵向模式建模的数据稀缺性问题，并在氯吡格雷治疗失败检测任务中取得显著的性能提升。"
}