{
    "title": "Exploring Public Opinion on Responsible AI Through The Lens of Cultural Consensus Theory",
    "abstract": "As the societal implications of Artificial Intelligence (AI) continue to grow, the pursuit of responsible AI necessitates public engagement in its development and governance processes. This involvement is crucial for capturing diverse perspectives and promoting equitable practices and outcomes. We applied Cultural Consensus Theory (CCT) to a nationally representative survey dataset on various aspects of AI to discern beliefs and attitudes about responsible AI in the United States. Our results offer valuable insights by identifying shared and contrasting views on responsible AI. Furthermore, these findings serve as critical reference points for developers and policymakers, enabling them to more effectively consider individual variances and group-level cultural perspectives when making significant decisions and addressing the public's concerns.",
    "link": "https://arxiv.org/abs/2402.00029",
    "context": "Title: Exploring Public Opinion on Responsible AI Through The Lens of Cultural Consensus Theory\nAbstract: As the societal implications of Artificial Intelligence (AI) continue to grow, the pursuit of responsible AI necessitates public engagement in its development and governance processes. This involvement is crucial for capturing diverse perspectives and promoting equitable practices and outcomes. We applied Cultural Consensus Theory (CCT) to a nationally representative survey dataset on various aspects of AI to discern beliefs and attitudes about responsible AI in the United States. Our results offer valuable insights by identifying shared and contrasting views on responsible AI. Furthermore, these findings serve as critical reference points for developers and policymakers, enabling them to more effectively consider individual variances and group-level cultural perspectives when making significant decisions and addressing the public's concerns.",
    "path": "papers/24/02/2402.00029.json",
    "total_tokens": 803,
    "translated_title": "通过文化共识理论探索公众对负责任人工智能的看法",
    "translated_abstract": "随着人工智能（AI）的社会影响不断增长，追求负责任的人工智能需要公众参与其发展和治理过程。这种参与对于捕捉各种观点和促进公平实践和结果至关重要。我们应用文化共识理论（CCT）对一份关于人工智能各个方面的全国代表性调查数据集进行分析，以了解美国关于负责任人工智能的信念和态度。我们的结果通过识别共享和对比的负责任人工智能观点提供了宝贵的洞见。此外，在制定重要决策和解决公众关切时，这些发现可作为开发者和政策制定者的关键参考点，使他们能够更有效地考虑个体差异和群体文化观点。",
    "tldr": "应用文化共识理论，研究发现美国公众对负责任人工智能存在共享和对比的观点，这为开发者和政策制定者在决策过程中更有效地考虑个体差异和群体文化观点提供了重要参考。",
    "en_tdlr": "Applying Cultural Consensus Theory, this study explores diverse perspectives on responsible AI among the US public, providing valuable reference for developers and policymakers to consider individual variances and group-level cultural perspectives in decision-making."
}