{
    "title": "Computational Experiments Meet Large Language Model Based Agents: A Survey and Perspective",
    "abstract": "Computational experiments have emerged as a valuable method for studying complex systems, involving the algorithmization of counterfactuals. However, accurately representing real social systems in Agent-based Modeling (ABM) is challenging due to the diverse and intricate characteristics of humans, including bounded rationality and heterogeneity. To address this limitation, the integration of Large Language Models (LLMs) has been proposed, enabling agents to possess anthropomorphic abilities such as complex reasoning and autonomous learning. These agents, known as LLM-based Agent, offer the potential to enhance the anthropomorphism lacking in ABM. Nonetheless, the absence of explicit explainability in LLMs significantly hinders their application in the social sciences. Conversely, computational experiments excel in providing causal analysis of individual behaviors and complex phenomena. Thus, combining computational experiments with LLM-based Agent holds substantial research potential. ",
    "link": "https://arxiv.org/abs/2402.00262",
    "context": "Title: Computational Experiments Meet Large Language Model Based Agents: A Survey and Perspective\nAbstract: Computational experiments have emerged as a valuable method for studying complex systems, involving the algorithmization of counterfactuals. However, accurately representing real social systems in Agent-based Modeling (ABM) is challenging due to the diverse and intricate characteristics of humans, including bounded rationality and heterogeneity. To address this limitation, the integration of Large Language Models (LLMs) has been proposed, enabling agents to possess anthropomorphic abilities such as complex reasoning and autonomous learning. These agents, known as LLM-based Agent, offer the potential to enhance the anthropomorphism lacking in ABM. Nonetheless, the absence of explicit explainability in LLMs significantly hinders their application in the social sciences. Conversely, computational experiments excel in providing causal analysis of individual behaviors and complex phenomena. Thus, combining computational experiments with LLM-based Agent holds substantial research potential. ",
    "path": "papers/24/02/2402.00262.json",
    "total_tokens": 850,
    "translated_title": "计算实验证明遇到基于大型语言模型的智能体：一项调查和展望",
    "translated_abstract": "计算实验已经成为研究复杂系统的有价值方法，涉及对反事实情况的算法化。然而，由于人类的多样性和复杂特性（包括有限理性和异质性），准确地表示真实社会系统在基于代理模型的建模中具有挑战性。为了解决这个局限性，提出了将大型语言模型（LLM）整合到模型中，使代理能够具备人类特征，比如复杂推理和自主学习能力。这些被称为LLM-based Agent的智能体有潜力增强基于代理模型的人类特征。然而，LLM中缺乏明确解释性极大地限制了它们在社会科学中的应用。相反，计算实验在提供个体行为和复杂现象的因果分析方面表现卓越。因此，将计算实验与基于LLM的智能体相结合具有重大的研究潜力。",
    "tldr": "本调查和展望介绍了将计算实验与基于大型语言模型的智能体相结合的研究方法，并讨论了这种方法对解决社会科学中的问题具有的潜力。",
    "en_tdlr": "This survey and perspective introduce the research approach of combining computational experiments with LLM-based agents, and discuss the potential of this approach in addressing problems in social sciences."
}