{
    "title": "Decidable Reasoning About Time in Finite-Domain Situation Calculus Theories",
    "abstract": "Representing time is crucial for cyber-physical systems and has been studied extensively in the Situation Calculus. The most commonly used approach represents time by adding a real-valued fluent $\\mathit{time}(a)$ that attaches a time point to each action and consequently to each situation. We show that in this approach, checking whether there is a reachable situation that satisfies a given formula is undecidable, even if the domain of discourse is restricted to a finite set of objects. We present an alternative approach based on well-established results from timed automata theory by introducing clocks as real-valued fluents with restricted successor state axioms and comparison operators. %that only allow comparisons against fixed rationals. With this restriction, we can show that the reachability problem for finite-domain basic action theories is decidable. Finally, we apply our results on Golog program realization by presenting a decidable procedure for determining an action sequence",
    "link": "https://arxiv.org/abs/2402.03164",
    "context": "Title: Decidable Reasoning About Time in Finite-Domain Situation Calculus Theories\nAbstract: Representing time is crucial for cyber-physical systems and has been studied extensively in the Situation Calculus. The most commonly used approach represents time by adding a real-valued fluent $\\mathit{time}(a)$ that attaches a time point to each action and consequently to each situation. We show that in this approach, checking whether there is a reachable situation that satisfies a given formula is undecidable, even if the domain of discourse is restricted to a finite set of objects. We present an alternative approach based on well-established results from timed automata theory by introducing clocks as real-valued fluents with restricted successor state axioms and comparison operators. %that only allow comparisons against fixed rationals. With this restriction, we can show that the reachability problem for finite-domain basic action theories is decidable. Finally, we apply our results on Golog program realization by presenting a decidable procedure for determining an action sequence",
    "path": "papers/24/02/2402.03164.json",
    "total_tokens": 897,
    "translated_title": "有限域情境演算理论中有关时间的可判定推理",
    "translated_abstract": "时间的表达对于智能物理系统至关重要，并在情境演算中得到了广泛研究。最常用的方法是通过添加一个实值fluents $\\mathit{time}(a)$ 来表示时间，这个fluents将一个时间点与每个动作以及每个情境相连。我们证明了在这种方法中，即使领域范围被限制在一个有限对象集上，检查是否存在一个可达情境满足给定公式的问题是不可判定的。我们提出了一种基于定时自动机理论的替代方法，通过引入钟表作为具有受限的继任状态公理和比较操作符的实值fluents。通过这种限制，我们可以证明有限域基本动作理论的可达性问题是可判定的。最后，我们将我们的结果应用于Golog程序实现，通过提供一种可判定的过程来确定一个行动序列",
    "tldr": "本论文研究了有限域情境演算理论中关于时间的可判定推理。通过引入具有受限状态公理和比较操作符的钟表作为实值fluents，解决了检查可达情境是否满足给定公式的问题的不可判定性，并给出了一个可判定的过程来确定行动序列。"
}