{
    "title": "Enhanced sampling of robust molecular datasets with uncertainty-based collective variables",
    "abstract": "Generating a data set that is representative of the accessible configuration space of a molecular system is crucial for the robustness of machine learned interatomic potentials (MLIP). However, the complexity of molecular systems, characterized by intricate potential energy surfaces (PESs) with numerous local minima and energy barriers, presents a significant challenge. Traditional methods of data generation, such as random sampling or exhaustive exploration, are either intractable or may not capture rare, but highly informative configurations. In this study, we propose a method that leverages uncertainty as the collective variable (CV) to guide the acquisition of chemically-relevant data points, focusing on regions of the configuration space where ML model predictions are most uncertain. This approach employs a Gaussian Mixture Model-based uncertainty metric from a single model as the CV for biased molecular dynamics simulations. The effectiveness of our approach in overcoming energy ",
    "link": "https://arxiv.org/abs/2402.03753",
    "context": "Title: Enhanced sampling of robust molecular datasets with uncertainty-based collective variables\nAbstract: Generating a data set that is representative of the accessible configuration space of a molecular system is crucial for the robustness of machine learned interatomic potentials (MLIP). However, the complexity of molecular systems, characterized by intricate potential energy surfaces (PESs) with numerous local minima and energy barriers, presents a significant challenge. Traditional methods of data generation, such as random sampling or exhaustive exploration, are either intractable or may not capture rare, but highly informative configurations. In this study, we propose a method that leverages uncertainty as the collective variable (CV) to guide the acquisition of chemically-relevant data points, focusing on regions of the configuration space where ML model predictions are most uncertain. This approach employs a Gaussian Mixture Model-based uncertainty metric from a single model as the CV for biased molecular dynamics simulations. The effectiveness of our approach in overcoming energy ",
    "path": "papers/24/02/2402.03753.json",
    "total_tokens": 780,
    "translated_title": "基于不确定性的集体变量增强采样稳健分子数据集",
    "translated_abstract": "生成一个代表分子系统可访问构型空间的数据集对于机器学习得到的原子间相互作用势函数(MLIP)的稳健性至关重要。然而，由于分子系统的复杂性，其潜在能面(PESs)呈现出众多局部极小值和能垒，导致了一个很大的挑战。传统的数据生成方法，如随机采样或全面探索，要么难以处理，要么无法捕捉到稀有但高度信息化的构型。在本研究中，我们提出了一种利用不确定性作为集体变量(CV)引导采集化学相关数据点、关注ML模型预测最不确定区域的方法。该方法使用了基于高斯混合模型的不确定性度量作为有偏分子动力学模拟的CV。我们的方法在克服能量的效果上是有效的。",
    "tldr": "本研究提出了一种基于不确定性的集体变量方法，通过引导采集化学相关数据点、关注模型预测最不确定的区域，进行了稳健分子数据集的增强采样。"
}