{
    "title": "Choosing the Right Path for AI Integration in Engineering Companies: A Strategic Guide",
    "abstract": "The Engineering, Procurement and Construction (EPC) businesses operating within the energy sector are recognizing the increasing importance of Artificial Intelligence (AI). Many EPC companies and their clients have realized the benefits of applying AI to their businesses in order to reduce manual work, drive productivity, and streamline future operations of engineered installations in a highly competitive industry. The current AI market offers various solutions and services to support this industry, but organizations must understand how to acquire AI technology in the most beneficial way based on their business strategy and available resources. This paper presents a framework for EPC companies in their transformation towards AI. Our work is based on examples of project execution of AI-based products development at one of the biggest EPC contractors worldwide and on insights from EPC vendor companies already integrating AI into their engineering solutions. The paper covers the entire li",
    "link": "https://arxiv.org/abs/2402.00011",
    "context": "Title: Choosing the Right Path for AI Integration in Engineering Companies: A Strategic Guide\nAbstract: The Engineering, Procurement and Construction (EPC) businesses operating within the energy sector are recognizing the increasing importance of Artificial Intelligence (AI). Many EPC companies and their clients have realized the benefits of applying AI to their businesses in order to reduce manual work, drive productivity, and streamline future operations of engineered installations in a highly competitive industry. The current AI market offers various solutions and services to support this industry, but organizations must understand how to acquire AI technology in the most beneficial way based on their business strategy and available resources. This paper presents a framework for EPC companies in their transformation towards AI. Our work is based on examples of project execution of AI-based products development at one of the biggest EPC contractors worldwide and on insights from EPC vendor companies already integrating AI into their engineering solutions. The paper covers the entire li",
    "path": "papers/24/02/2402.00011.json",
    "total_tokens": 889,
    "translated_title": "在工程公司中选择正确的AI整合路径：战略指南",
    "translated_abstract": "在能源领域的工程采购建设（EPC）业务中，人工智能（AI）的重要性日益被认同。许多EPC公司及其客户已意识到应用AI对业务进行自动化、提高生产力并简化未来操作的好处，以在竞争激烈的行业中保持竞争力。当前的AI市场提供了各种解决方案和服务来支持这个行业，但组织必须根据其业务战略和可用资源的情况，了解如何以最有益的方式获取AI技术。本文提出了一个面向EPC公司的转型AI框架。我们的工作基于全球最大的EPC承包商之一的基于AI的产品开发项目执行的案例，并结合已经将AI整合到其工程解决方案中的EPC供应商公司的见解。本文涵盖了整个li阶段。",
    "tldr": "本文为EPC公司提供了一个转向AI的框架，旨在帮助他们根据自身业务战略和资源状况，以最有效的方式获取AI技术。这是基于全球最大的EPC承包商之一在基于AI的产品开发项目执行中的经验和已将AI整合到工程解决方案中的EPC供应商公司的见解。"
}