{
    "title": "Learning Dual-arm Object Rearrangement for Cartesian Robots",
    "abstract": "arXiv:2402.13634v1 Announce Type: cross  Abstract: This work focuses on the dual-arm object rearrangement problem abstracted from a realistic industrial scenario of Cartesian robots. The goal of this problem is to transfer all the objects from sources to targets with the minimum total completion time. To achieve the goal, the core idea is to develop an effective object-to-arm task assignment strategy for minimizing the cumulative task execution time and maximizing the dual-arm cooperation efficiency. One of the difficulties in the task assignment is the scalability problem. As the number of objects increases, the computation time of traditional offline-search-based methods grows strongly for computational complexity. Encouraged by the adaptability of reinforcement learning (RL) in long-sequence task decisions, we propose an online task assignment decision method based on RL, and the computation time of our method only increases linearly with the number of objects. Further, we design an",
    "link": "https://arxiv.org/abs/2402.13634",
    "context": "Title: Learning Dual-arm Object Rearrangement for Cartesian Robots\nAbstract: arXiv:2402.13634v1 Announce Type: cross  Abstract: This work focuses on the dual-arm object rearrangement problem abstracted from a realistic industrial scenario of Cartesian robots. The goal of this problem is to transfer all the objects from sources to targets with the minimum total completion time. To achieve the goal, the core idea is to develop an effective object-to-arm task assignment strategy for minimizing the cumulative task execution time and maximizing the dual-arm cooperation efficiency. One of the difficulties in the task assignment is the scalability problem. As the number of objects increases, the computation time of traditional offline-search-based methods grows strongly for computational complexity. Encouraged by the adaptability of reinforcement learning (RL) in long-sequence task decisions, we propose an online task assignment decision method based on RL, and the computation time of our method only increases linearly with the number of objects. Further, we design an",
    "path": "papers/24/02/2402.13634.json",
    "total_tokens": 819,
    "translated_title": "学习笛卡尔机器人的双臂物体重新排列",
    "translated_abstract": "这项工作专注于从笛卡尔机器人现实工业场景中抽象出的双臂物体重新排列问题。该问题的目标是以最短的总完成时间将所有物体从来源地转移到目标地。为了实现这一目标，核心思想是开发一种有效的物体-臂任务分配策略，以最小化累积任务执行时间并最大化双臂协作效率。在任务分配中的一个困难是可伸缩性问题，随着物体数量的增加，传统的基于离线搜索的方法的计算时间会由于计算复杂性而大幅增长。受强化学习（RL）在长序列任务决策中的适应性启发，我们提出了一种基于RL的在线任务分配决策方法，我们的方法的计算时间随物体数量的增加仅呈线性增长。",
    "tldr": "提出了一种基于强化学习的在线任务分配决策方法，计算时间随着物体数量的增加仅呈线性增长，以解决笛卡尔机器人双臂物体重新排列问题。",
    "en_tdlr": "Proposed an online task assignment decision method based on reinforcement learning, with computation time increasing linearly with the number of objects, to address the dual-arm object rearrangement problem for Cartesian robots."
}