{
    "title": "Improved Forecasting Using a PSO-RDV Framework to Enhance Artificial Neural Network",
    "abstract": "arXiv:2402.18576v1 Announce Type: cross  Abstract: Decision making and planning have long relied heavily on AI-driven forecasts. The government and the general public are working to minimize the risks while maximizing benefits in the face of potential future public health uncertainties. This study used an improved method of forecasting utilizing the Random Descending Velocity Inertia Weight (RDV IW) technique to improve the convergence of Particle Swarm Optimization (PSO) and the accuracy of Artificial Neural Network (ANN). The IW technique, inspired by the motions of a golf ball, modified the particles' velocities as they approached the solution point to a parabolically descending structure. Simulation results revealed that the proposed forecasting model with [0.4, 0.9] combination of alpha and alpha_dump exhibits a 6.36% improvement in position error and 11.75% improvement in computational time compared to the old model, thus, improving its convergence. It reached the optimum level a",
    "link": "https://arxiv.org/abs/2402.18576",
    "context": "Title: Improved Forecasting Using a PSO-RDV Framework to Enhance Artificial Neural Network\nAbstract: arXiv:2402.18576v1 Announce Type: cross  Abstract: Decision making and planning have long relied heavily on AI-driven forecasts. The government and the general public are working to minimize the risks while maximizing benefits in the face of potential future public health uncertainties. This study used an improved method of forecasting utilizing the Random Descending Velocity Inertia Weight (RDV IW) technique to improve the convergence of Particle Swarm Optimization (PSO) and the accuracy of Artificial Neural Network (ANN). The IW technique, inspired by the motions of a golf ball, modified the particles' velocities as they approached the solution point to a parabolically descending structure. Simulation results revealed that the proposed forecasting model with [0.4, 0.9] combination of alpha and alpha_dump exhibits a 6.36% improvement in position error and 11.75% improvement in computational time compared to the old model, thus, improving its convergence. It reached the optimum level a",
    "path": "papers/24/02/2402.18576.json",
    "total_tokens": 900,
    "translated_title": "利用PSO-RDV框架改善人工神经网络的预测能力",
    "translated_abstract": "决策和规划长期以来一直严重依赖于基于人工智能的预测。政府和公众在潜在未来公共卫生不确定性面临风险最小化和利益最大化。本研究利用改进的预测方法，利用随机下降速度惯性权重（RDV IW）技术来提高粒子群优化（PSO）的收敛和人工神经网络（ANN）的准确性。 受高尔夫球运动启发，IW技术修改了粒子接近解决方案点时的速度，使其呈现抛物线下降结构。 仿真结果显示，建议的预测模型使用[0.4, 0.9]的alpha和alpha_dump组合，相对于旧模型在位置误差上有6.36％的改进，计算时间上有11.75％的改进，从而提高了其收敛性。 它达到了最优水平。",
    "tldr": "本研究提出利用PSO-RDV框架改进预测方法，通过采用随机下降速度惯性权重（RDV IW）技术提高了粒子群优化（PSO）的收敛性和人工神经网络（ANN）的准确性。",
    "en_tdlr": "This study proposes an improved forecasting method utilizing a PSO-RDV framework to enhance the convergence of Particle Swarm Optimization (PSO) and the accuracy of Artificial Neural Network (ANN) by incorporating the Random Descending Velocity Inertia Weight (RDV IW) technique."
}