{
    "title": "Neural optimal controller for stochastic systems via pathwise HJB operator",
    "abstract": "arXiv:2402.15592v1 Announce Type: cross  Abstract: The aim of this work is to develop deep learning-based algorithms for high-dimensional stochastic control problems based on physics-informed learning and dynamic programming. Unlike classical deep learning-based methods relying on a probabilistic representation of the solution to the Hamilton--Jacobi--Bellman (HJB) equation, we introduce a pathwise operator associated with the HJB equation so that we can define a problem of physics-informed learning. According to whether the optimal control has an explicit representation, two numerical methods are proposed to solve the physics-informed learning problem. We provide an error analysis on how the truncation, approximation and optimization errors affect the accuracy of these methods. Numerical results on various applications are presented to illustrate the performance of the proposed algorithms.",
    "link": "https://arxiv.org/abs/2402.15592",
    "context": "Title: Neural optimal controller for stochastic systems via pathwise HJB operator\nAbstract: arXiv:2402.15592v1 Announce Type: cross  Abstract: The aim of this work is to develop deep learning-based algorithms for high-dimensional stochastic control problems based on physics-informed learning and dynamic programming. Unlike classical deep learning-based methods relying on a probabilistic representation of the solution to the Hamilton--Jacobi--Bellman (HJB) equation, we introduce a pathwise operator associated with the HJB equation so that we can define a problem of physics-informed learning. According to whether the optimal control has an explicit representation, two numerical methods are proposed to solve the physics-informed learning problem. We provide an error analysis on how the truncation, approximation and optimization errors affect the accuracy of these methods. Numerical results on various applications are presented to illustrate the performance of the proposed algorithms.",
    "path": "papers/24/02/2402.15592.json",
    "total_tokens": 769,
    "translated_title": "基于路径HJB算子的随机系统神经最优控制器",
    "translated_abstract": "本文旨在基于基于物理信息学习和动态规划，为高维随机控制问题开发基于深度学习的算法。与依赖于Hamilton-Jacobi-Bellman（HJB）方程解的概率表示的经典深度学习方法不同，我们引入了与HJB方程相关的路径算子，从而可以定义一个基于物理信息学习的问题。根据最优控制是否具有显式表示，提出了两种数值方法来解决基于物理信息学习的问题。我们对截断、近似和优化误差如何影响这些方法的准确性进行了误差分析。通过在各种应用程序上展示数值结果，说明了所提算法的性能。",
    "tldr": "本文提出了一种基于路径HJB算子的随机系统神经最优控制器的算法，通过引入基于物理信息学习的方法解决高维随机控制问题，展示了其在各种应用程序上的性能。",
    "en_tdlr": "This paper presents an algorithm for neural optimal controller for stochastic systems based on pathwise HJB operator, solving high-dimensional stochastic control problems using physics-informed learning method, and demonstrates its performance on various applications."
}