{
    "title": "Developing and Evaluating a Design Method for Positive Artificial Intelligence",
    "abstract": "As artificial intelligence (AI) continues advancing, ensuring positive societal impacts becomes critical, especially as AI systems become increasingly ubiquitous in various aspects of life. However, developing \"AI for good\" poses substantial challenges around aligning systems with complex human values. Presently, we lack mature methods for addressing these challenges. This article presents and evaluates the Positive AI design method aimed at addressing this gap. The method provides a human-centered process to translate wellbeing aspirations into concrete practices. First, we explain the method's four key steps: contextualizing, operationalizing, optimizing, and implementing wellbeing supported by continuous measurement for feedback cycles. We then present a multiple case study where novice designers applied the method, revealing strengths and weaknesses related to efficacy and usability. Next, an expert evaluation study assessed the quality of the resulting concepts, rating them modera",
    "link": "https://rss.arxiv.org/abs/2402.01499",
    "context": "Title: Developing and Evaluating a Design Method for Positive Artificial Intelligence\nAbstract: As artificial intelligence (AI) continues advancing, ensuring positive societal impacts becomes critical, especially as AI systems become increasingly ubiquitous in various aspects of life. However, developing \"AI for good\" poses substantial challenges around aligning systems with complex human values. Presently, we lack mature methods for addressing these challenges. This article presents and evaluates the Positive AI design method aimed at addressing this gap. The method provides a human-centered process to translate wellbeing aspirations into concrete practices. First, we explain the method's four key steps: contextualizing, operationalizing, optimizing, and implementing wellbeing supported by continuous measurement for feedback cycles. We then present a multiple case study where novice designers applied the method, revealing strengths and weaknesses related to efficacy and usability. Next, an expert evaluation study assessed the quality of the resulting concepts, rating them modera",
    "path": "papers/24/02/2402.01499.json",
    "total_tokens": 908,
    "translated_title": "开发和评估正向人工智能设计方法",
    "translated_abstract": "随着人工智能的不断发展，确保人工智能系统对社会产生积极影响变得至关重要，尤其是在人工智能系统在各个方面日益普及的情况下。然而，开发“AI for good”在与复杂人类价值观保持一致方面存在巨大挑战。目前，我们缺乏成熟的方法来解决这些挑战。本文介绍和评估了正向人工智能设计方法，旨在填补这一空白。该方法提供了一个以人为中心的流程，将幸福愿景转化为具体实践。首先，我们解释了该方法的四个关键步骤：情境化、操作化、优化化和实现福祉，同时支持持续测量和反馈循环。然后，我们提出了一个多个案例研究，其中初学者设计师应用了该方法，揭示了与效力和可用性相关的优点和缺点。接下来，一项专家评估研究评估了所得概念的质量，将其评为中等水平。",
    "tldr": "这项研究提出并评估了一种正向人工智能设计方法，用于确保人工智能系统对社会产生积极影响。该方法通过以人为中心的流程，将幸福愿景转化为具体实践，并通过持续的测量和反馈循环进行支持。",
    "en_tdlr": "This research presents and evaluates a design method for positive artificial intelligence that aims to ensure positive societal impacts. The method translates wellbeing aspirations into concrete practices through a human-centered process and is supported by continuous measurement and feedback cycles."
}