{
    "title": "TransGPT: Multi-modal Generative Pre-trained Transformer for Transportation",
    "abstract": "Natural language processing (NLP) is a key component of intelligent transportation systems (ITS), but it faces many challenges in the transportation domain, such as domain-specific knowledge and data, and multi-modal inputs and outputs. This paper presents TransGPT, a novel (multi-modal) large language model for the transportation domain, which consists of two independent variants: TransGPT-SM for single-modal data and TransGPT-MM for multi-modal data. TransGPT-SM is finetuned on a single-modal Transportation dataset (STD) that contains textual data from various sources in the transportation domain. TransGPT-MM is finetuned on a multi-modal Transportation dataset (MTD) that we manually collected from three areas of the transportation domain: driving tests, traffic signs, and landmarks. We evaluate TransGPT on several benchmark datasets for different tasks in the transportation domain, and show that it outperforms baseline models on most tasks. We also showcase the potential application",
    "link": "https://arxiv.org/abs/2402.07233",
    "context": "Title: TransGPT: Multi-modal Generative Pre-trained Transformer for Transportation\nAbstract: Natural language processing (NLP) is a key component of intelligent transportation systems (ITS), but it faces many challenges in the transportation domain, such as domain-specific knowledge and data, and multi-modal inputs and outputs. This paper presents TransGPT, a novel (multi-modal) large language model for the transportation domain, which consists of two independent variants: TransGPT-SM for single-modal data and TransGPT-MM for multi-modal data. TransGPT-SM is finetuned on a single-modal Transportation dataset (STD) that contains textual data from various sources in the transportation domain. TransGPT-MM is finetuned on a multi-modal Transportation dataset (MTD) that we manually collected from three areas of the transportation domain: driving tests, traffic signs, and landmarks. We evaluate TransGPT on several benchmark datasets for different tasks in the transportation domain, and show that it outperforms baseline models on most tasks. We also showcase the potential application",
    "path": "papers/24/02/2402.07233.json",
    "total_tokens": 861,
    "translated_title": "TransGPT：用于交通的多模式生成预训练Transformer",
    "translated_abstract": "自然语言处理（NLP）是智能交通系统（ITS）的关键组成部分，但在交通领域面临着许多挑战，如专业领域知识与数据，多模式输入和输出。本文提出了TransGPT，一种面向交通领域的新型（多模式）大语言模型，由两个独立的变体组成：TransGPT-SM用于单模式数据和TransGPT-MM用于多模式数据。TransGPT-SM在包含来自交通领域各种来源的文本数据的单模式交通数据集（STD）上进行微调。TransGPT-MM在我们手动收集的交通领域的三个领域（驾驶测试、交通标志和地标）的多模式交通数据集（MTD）上细调。我们对TransGPT在交通领域的几个基准数据集上进行评估，并展示了它在大多数任务上优于基准模型。我们还展示了该模型的潜在应用。",
    "tldr": "TransGPT是一种面向交通领域的新型多模式生成预训练Transformer，使用单模式和多模式数据进行微调，在交通领域的各种任务中优于基准模型。",
    "en_tdlr": "TransGPT is a novel multi-modal generative pre-trained Transformer for the transportation domain, which is fine-tuned on single-modal and multi-modal data and outperforms baseline models in various tasks in the transportation field."
}