{
    "title": "An advanced data fabric architecture leveraging homomorphic encryption and federated learning",
    "abstract": "arXiv:2402.09795v1 Announce Type: cross  Abstract: Data fabric is an automated and AI-driven data fusion approach to accomplish data management unification without moving data to a centralized location for solving complex data problems. In a Federated learning architecture, the global model is trained based on the learned parameters of several local models that eliminate the necessity of moving data to a centralized repository for machine learning. This paper introduces a secure approach for medical image analysis using federated learning and partially homomorphic encryption within a distributed data fabric architecture. With this method, multiple parties can collaborate in training a machine-learning model without exchanging raw data but using the learned or fused features. The approach complies with laws and regulations such as HIPAA and GDPR, ensuring the privacy and security of the data. The study demonstrates the method's effectiveness through a case study on pituitary tumor class",
    "link": "https://arxiv.org/abs/2402.09795",
    "context": "Title: An advanced data fabric architecture leveraging homomorphic encryption and federated learning\nAbstract: arXiv:2402.09795v1 Announce Type: cross  Abstract: Data fabric is an automated and AI-driven data fusion approach to accomplish data management unification without moving data to a centralized location for solving complex data problems. In a Federated learning architecture, the global model is trained based on the learned parameters of several local models that eliminate the necessity of moving data to a centralized repository for machine learning. This paper introduces a secure approach for medical image analysis using federated learning and partially homomorphic encryption within a distributed data fabric architecture. With this method, multiple parties can collaborate in training a machine-learning model without exchanging raw data but using the learned or fused features. The approach complies with laws and regulations such as HIPAA and GDPR, ensuring the privacy and security of the data. The study demonstrates the method's effectiveness through a case study on pituitary tumor class",
    "path": "papers/24/02/2402.09795.json",
    "total_tokens": 874,
    "translated_title": "一种利用同态加密和联邦学习的先进数据融合架构",
    "translated_abstract": "数据融合是一种自动化和人工智能驱动的数据管理统一方法，旨在解决复杂的数据问题而无需将数据移动到集中位置。在联邦学习架构中，全局模型是基于多个本地模型的学习参数进行训练的，从而消除了将数据移动到集中存储库进行机器学习的必要性。本文介绍了一种安全的方法，使用联邦学习和部分同态加密在分布式数据融合架构中进行医学图像分析。通过该方法，多个参与方可以在训练机器学习模型时进行协作，而无需交换原始数据，而是使用学习或融合的特征。该方法符合HIPAA和GDPR等法律法规，确保数据的隐私和安全性。通过对垂体瘤分类的案例研究，证明了该方法的有效性。",
    "tldr": "该论文介绍了一种利用同态加密和联邦学习的先进数据融合架构，在不将数据移动到集中位置的情况下，实现了安全的医学图像分析。这种方法可以在保护数据隐私和安全性的同时，多个参与方进行机器学习模型的协作训练。",
    "en_tdlr": "This paper presents an advanced data fusion architecture that leverages homomorphic encryption and federated learning for secure medical image analysis without centralizing the data. Multiple parties can collaborate in training machine learning models while preserving data privacy and security."
}