{
    "title": "VIXEN: Visual Text Comparison Network for Image Difference Captioning",
    "abstract": "arXiv:2402.19119v1 Announce Type: cross  Abstract: We present VIXEN - a technique that succinctly summarizes in text the visual differences between a pair of images in order to highlight any content manipulation present. Our proposed network linearly maps image features in a pairwise manner, constructing a soft prompt for a pretrained large language model. We address the challenge of low volume of training data and lack of manipulation variety in existing image difference captioning (IDC) datasets by training on synthetically manipulated images from the recent InstructPix2Pix dataset generated via prompt-to-prompt editing framework. We augment this dataset with change summaries produced via GPT-3. We show that VIXEN produces state-of-the-art, comprehensible difference captions for diverse image contents and edit types, offering a potential mitigation against misinformation disseminated via manipulated image content. Code and data are available at http://github.com/alexblck/vixen",
    "link": "https://arxiv.org/abs/2402.19119",
    "context": "Title: VIXEN: Visual Text Comparison Network for Image Difference Captioning\nAbstract: arXiv:2402.19119v1 Announce Type: cross  Abstract: We present VIXEN - a technique that succinctly summarizes in text the visual differences between a pair of images in order to highlight any content manipulation present. Our proposed network linearly maps image features in a pairwise manner, constructing a soft prompt for a pretrained large language model. We address the challenge of low volume of training data and lack of manipulation variety in existing image difference captioning (IDC) datasets by training on synthetically manipulated images from the recent InstructPix2Pix dataset generated via prompt-to-prompt editing framework. We augment this dataset with change summaries produced via GPT-3. We show that VIXEN produces state-of-the-art, comprehensible difference captions for diverse image contents and edit types, offering a potential mitigation against misinformation disseminated via manipulated image content. Code and data are available at http://github.com/alexblck/vixen",
    "path": "papers/24/02/2402.19119.json",
    "total_tokens": 829,
    "translated_title": "VIXEN: 图像差异字幕的视觉文本比较网络",
    "translated_abstract": "我们提出了VIXEN - 一种能够用文本简洁地总结一对图像之间的视觉差异，以突出其中的任何内容操作的技术。我们的网络以成对的方式线性映射图像特征，构建出一个软提示，用于预训练大型语言模型。我们通过在最近的InstructPix2Pix数据集中利用提示到提示编辑框架生成的合成操作图像来训练，解决了现有图像差异字幕（IDC）数据集中训练数据量少，操作类型多样性不足的挑战。我们通过GPT-3生成的变化摘要来扩充这个数据集。我们展示了VIXEN能为不同图像内容和编辑类型生成最新的易懂的差异字幕，为防止通过操纵图像内容传播的信息错误提供潜在的缓解方法。代码和数据可在http://github.com/alexblck/vixen获取。",
    "tldr": "提出了一种名为VIXEN的技术，能够用文本简洁地总结一对图像之间的视觉差异，为突出内容操作提供潜在的缓解方法"
}