{
    "title": "Towards Spatially-Lucid AI Classification in Non-Euclidean Space: An Application for MxIF Oncology Data",
    "abstract": "arXiv:2402.14974v1 Announce Type: cross  Abstract: Given multi-category point sets from different place-types, our goal is to develop a spatially-lucid classifier that can distinguish between two classes based on the arrangements of their points. This problem is important for many applications, such as oncology, for analyzing immune-tumor relationships and designing new immunotherapies. It is challenging due to spatial variability and interpretability needs. Previously proposed techniques require dense training data or have limited ability to handle significant spatial variability within a single place-type. Most importantly, these deep neural network (DNN) approaches are not designed to work in non-Euclidean space, particularly point sets. Existing non-Euclidean DNN methods are limited to one-size-fits-all approaches. We explore a spatial ensemble framework that explicitly uses different training strategies, including weighted-distance learning rate and spatial domain adaptation, on v",
    "link": "https://arxiv.org/abs/2402.14974",
    "context": "Title: Towards Spatially-Lucid AI Classification in Non-Euclidean Space: An Application for MxIF Oncology Data\nAbstract: arXiv:2402.14974v1 Announce Type: cross  Abstract: Given multi-category point sets from different place-types, our goal is to develop a spatially-lucid classifier that can distinguish between two classes based on the arrangements of their points. This problem is important for many applications, such as oncology, for analyzing immune-tumor relationships and designing new immunotherapies. It is challenging due to spatial variability and interpretability needs. Previously proposed techniques require dense training data or have limited ability to handle significant spatial variability within a single place-type. Most importantly, these deep neural network (DNN) approaches are not designed to work in non-Euclidean space, particularly point sets. Existing non-Euclidean DNN methods are limited to one-size-fits-all approaches. We explore a spatial ensemble framework that explicitly uses different training strategies, including weighted-distance learning rate and spatial domain adaptation, on v",
    "path": "papers/24/02/2402.14974.json",
    "total_tokens": 876,
    "translated_title": "在非欧几里得空间中实现空间透明的AI分类：MxIF肿瘤数据应用",
    "translated_abstract": "针对来自不同地点类型的多类别点集，我们的目标是开发一个空间透明的分类器，可以根据点的排列区分两个类别。这个问题对于许多应用非常重要，比如肿瘤学，用于分析免疫-肿瘤关系和设计新的免疫治疗方法。这个问题具有挑战性，因为需要考虑空间变化和可解释性需求。以前提出的技术要求密集的训练数据，或者在处理单个地点类型内的显著空间变异性方面能力有限。最重要的是，这些深度神经网络（DNN）方法没有设计用于在非欧几里得空间中工作，特别是点集。现有的非欧几里得DNN方法局限于一刀切的方法。我们探索了一种空间集合框架，明确使用不同的训练策略，包括加权距离学习率和空间域自适应。",
    "tldr": "发展了一个使用空间集合框架的分类器，可以根据点的排列在非欧几里得空间中区分两个类别，对于肿瘤学等应用具有重要意义",
    "en_tdlr": "Developed a classifier using a spatial ensemble framework that can distinguish between two classes based on the arrangement of points in non-Euclidean space, with importance for applications such as oncology."
}