{
    "title": "Assessment of low-carbon tourism development from multi-aspect analysis: A case study of the Yellow River Basin, China",
    "abstract": "arXiv:2402.11579v1 Announce Type: new  Abstract: Climate change has become an unavoidable problem in achieving sustainable development. As one of the major industries worldwide, tourism can make a significant contribution to mitigating climate change. The main objective of the paper is to assess the development level of low-carbon tourism from multi-aspect, using the Yellow River Basin as an example. Firstly, this study quantified tourism carbon dioxide emissions and tourism economy, and analyzed their evolution characteristics. The interaction and coordination degree between tourism carbon dioxide emissions and tourism economy were then analyzed using the improved coupling coordination degree model. Finally, this study analyzed the change in total factor productivity of low-carbon tourism by calculating the Malmquist-Luenberger productivity index. The results showed that: (1) The tourism industry in the Yellow River Basin has the characteristics of the initial environmental Kuznets cu",
    "link": "https://arxiv.org/abs/2402.11579",
    "context": "Title: Assessment of low-carbon tourism development from multi-aspect analysis: A case study of the Yellow River Basin, China\nAbstract: arXiv:2402.11579v1 Announce Type: new  Abstract: Climate change has become an unavoidable problem in achieving sustainable development. As one of the major industries worldwide, tourism can make a significant contribution to mitigating climate change. The main objective of the paper is to assess the development level of low-carbon tourism from multi-aspect, using the Yellow River Basin as an example. Firstly, this study quantified tourism carbon dioxide emissions and tourism economy, and analyzed their evolution characteristics. The interaction and coordination degree between tourism carbon dioxide emissions and tourism economy were then analyzed using the improved coupling coordination degree model. Finally, this study analyzed the change in total factor productivity of low-carbon tourism by calculating the Malmquist-Luenberger productivity index. The results showed that: (1) The tourism industry in the Yellow River Basin has the characteristics of the initial environmental Kuznets cu",
    "path": "papers/24/02/2402.11579.json",
    "total_tokens": 833,
    "translated_title": "从多方面分析评估低碳旅游发展：以中国黄河流域为例",
    "translated_abstract": "气候变化已成为实现可持续发展无法回避的问题。作为全球主要产业之一，旅游业可以在减缓气候变化方面发挥重要作用。本文的主要目标是以黄河流域为例，从多个方面评估低碳旅游发展水平。首先，该研究量化了旅游业二氧化碳排放和旅游经济，并分析了它们的演变特征。然后，使用改进的耦合协调度模型分析了旅游业二氧化碳排放和旅游经济之间的互动和协调程度。最后，通过计算Malmquist-Luenberger生产率指数，分析了低碳旅游的总要素生产率变化。结果显示：（1）黄河流域的旅游业具有初始环境库兹涅茨曲线的特征。",
    "tldr": "评估低碳旅游发展水平，借助黄河流域案例，从碳排放、经济影响和生产率三个方面进行综合分析。"
}