{
    "title": "DPBalance: Efficient and Fair Privacy Budget Scheduling for Federated Learning as a Service",
    "abstract": "arXiv:2402.09715v1 Announce Type: cross  Abstract: Federated learning (FL) has emerged as a prevalent distributed machine learning scheme that enables collaborative model training without aggregating raw data. Cloud service providers further embrace Federated Learning as a Service (FLaaS), allowing data analysts to execute their FL training pipelines over differentially-protected data. Due to the intrinsic properties of differential privacy, the enforced privacy level on data blocks can be viewed as a privacy budget that requires careful scheduling to cater to diverse training pipelines. Existing privacy budget scheduling studies prioritize either efficiency or fairness individually. In this paper, we propose DPBalance, a novel privacy budget scheduling mechanism that jointly optimizes both efficiency and fairness. We first develop a comprehensive utility function incorporating data analyst-level dominant shares and FL-specific performance metrics. A sequential allocation mechanism is ",
    "link": "https://arxiv.org/abs/2402.09715",
    "context": "Title: DPBalance: Efficient and Fair Privacy Budget Scheduling for Federated Learning as a Service\nAbstract: arXiv:2402.09715v1 Announce Type: cross  Abstract: Federated learning (FL) has emerged as a prevalent distributed machine learning scheme that enables collaborative model training without aggregating raw data. Cloud service providers further embrace Federated Learning as a Service (FLaaS), allowing data analysts to execute their FL training pipelines over differentially-protected data. Due to the intrinsic properties of differential privacy, the enforced privacy level on data blocks can be viewed as a privacy budget that requires careful scheduling to cater to diverse training pipelines. Existing privacy budget scheduling studies prioritize either efficiency or fairness individually. In this paper, we propose DPBalance, a novel privacy budget scheduling mechanism that jointly optimizes both efficiency and fairness. We first develop a comprehensive utility function incorporating data analyst-level dominant shares and FL-specific performance metrics. A sequential allocation mechanism is ",
    "path": "papers/24/02/2402.09715.json",
    "total_tokens": 911,
    "translated_title": "DPBalance：高效和公平的隐私预算调度机制用于作为一项服务的联邦学习",
    "translated_abstract": "联邦学习（FL）作为一种流行的分布式机器学习方案，实现了在不聚合原始数据的情况下进行协作模型训练。云服务提供商进一步采用联邦学习作为一项服务（FLaaS），允许数据分析师在具有差分隐私保护的数据上执行他们的FL训练流程。由于差分隐私的固有特性，对数据块强制执行的隐私级别可以视为需要进行精心调度以满足不同训练流程的隐私预算。现有的隐私预算调度研究分别优先考虑效率或公平性。在本文中，我们提出了DPBalance，一种新颖的隐私预算调度机制，同时优化了效率和公平性。我们首先开发了一个综合的效用函数，将数据分析师级别的主导份额和FL特定的性能指标结合起来。然后，我们设计了一个顺序分配机制。",
    "tldr": "本文提出了DPBalance，一种新颖的隐私预算调度机制，用于联邦学习作为一项服务（FLaaS）。该机制在效率和公平性之间进行了优化，通过综合考虑数据分析师级别的主导份额和FL特定的性能指标，实现了隐私预算的精确调度。",
    "en_tdlr": "This paper proposes DPBalance, a novel privacy budget scheduling mechanism for Federated Learning as a Service (FLaaS). The mechanism optimizes both efficiency and fairness by considering the dominant shares of data analysts and FL-specific performance metrics, achieving accurate scheduling of privacy budgets."
}