{
    "title": "DynGMA: a robust approach for learning stochastic differential equations from data",
    "abstract": "arXiv:2402.14475v1 Announce Type: new  Abstract: Learning unknown stochastic differential equations (SDEs) from observed data is a significant and challenging task with applications in various fields. Current approaches often use neural networks to represent drift and diffusion functions, and construct likelihood-based loss by approximating the transition density to train these networks. However, these methods often rely on one-step stochastic numerical schemes, necessitating data with sufficiently high time resolution. In this paper, we introduce novel approximations to the transition density of the parameterized SDE: a Gaussian density approximation inspired by the random perturbation theory of dynamical systems, and its extension, the dynamical Gaussian mixture approximation (DynGMA). Benefiting from the robust density approximation, our method exhibits superior accuracy compared to baseline methods in learning the fully unknown drift and diffusion functions and computing the invari",
    "link": "https://arxiv.org/abs/2402.14475",
    "context": "Title: DynGMA: a robust approach for learning stochastic differential equations from data\nAbstract: arXiv:2402.14475v1 Announce Type: new  Abstract: Learning unknown stochastic differential equations (SDEs) from observed data is a significant and challenging task with applications in various fields. Current approaches often use neural networks to represent drift and diffusion functions, and construct likelihood-based loss by approximating the transition density to train these networks. However, these methods often rely on one-step stochastic numerical schemes, necessitating data with sufficiently high time resolution. In this paper, we introduce novel approximations to the transition density of the parameterized SDE: a Gaussian density approximation inspired by the random perturbation theory of dynamical systems, and its extension, the dynamical Gaussian mixture approximation (DynGMA). Benefiting from the robust density approximation, our method exhibits superior accuracy compared to baseline methods in learning the fully unknown drift and diffusion functions and computing the invari",
    "path": "papers/24/02/2402.14475.json",
    "total_tokens": 720,
    "translated_title": "DynGMA：一种从数据学习随机微分方程的稳健方法",
    "translated_abstract": "从观测数据中学习未知的随机微分方程（SDEs）是一项重要且具有挑战性的任务，应用于各个领域。本文引入了新的近似参数化SDE转移密度的方法：受动力系统随机摄动理论启发的高斯密度近似，以及它的扩展，动力高斯混合近似（DynGMA）。受益于稳健的密度近似，我们的方法在学习完全未知的漂移和扩散函数以及计算矩不变性方面表现出优越的准确性。",
    "tldr": "DynGMA方法通过引入新的密度近似，优于基准方法在学习完全未知的漂移和扩散函数以及计算不变性方面的准确性。",
    "en_tdlr": "The DynGMA method outperforms baseline approaches in learning fully unknown drift and diffusion functions as well as computing invariance by introducing a novel density approximation."
}