{
    "title": "Application analysis of ai technology combined with spiral CT scanning in early lung cancer screening",
    "abstract": "At present, the incidence and fatality rate of lung cancer in China rank first among all malignant tumors. Despite the continuous development and improvement of China's medical level, the overall 5-year survival rate of lung cancer patients is still lower than 20% and is staged. A number of studies have confirmed that early diagnosis and treatment of early stage lung cancer is of great significance to improve the prognosis of patients. In recent years, artificial intelligence technology has gradually begun to be applied in oncology. ai is used in cancer screening, clinical diagnosis, radiation therapy (image acquisition, at-risk organ segmentation, image calibration and delivery) and other aspects of rapid development. However, whether medical ai can be socialized depends on the public's attitude and acceptance to a certain extent. However, at present, there are few studies on the diagnosis of early lung cancer by AI technology combined with SCT scanning. In view of this, this study ap",
    "link": "https://arxiv.org/abs/2402.04267",
    "context": "Title: Application analysis of ai technology combined with spiral CT scanning in early lung cancer screening\nAbstract: At present, the incidence and fatality rate of lung cancer in China rank first among all malignant tumors. Despite the continuous development and improvement of China's medical level, the overall 5-year survival rate of lung cancer patients is still lower than 20% and is staged. A number of studies have confirmed that early diagnosis and treatment of early stage lung cancer is of great significance to improve the prognosis of patients. In recent years, artificial intelligence technology has gradually begun to be applied in oncology. ai is used in cancer screening, clinical diagnosis, radiation therapy (image acquisition, at-risk organ segmentation, image calibration and delivery) and other aspects of rapid development. However, whether medical ai can be socialized depends on the public's attitude and acceptance to a certain extent. However, at present, there are few studies on the diagnosis of early lung cancer by AI technology combined with SCT scanning. In view of this, this study ap",
    "path": "papers/24/02/2402.04267.json",
    "total_tokens": 940,
    "translated_title": "人工智能技术结合螺旋CT扫描在早期肺癌筛查中的应用分析",
    "translated_abstract": "目前，中国肺癌的发病率和死亡率在所有恶性肿瘤中名列前茅。尽管中国医疗水平不断发展和提高，但肺癌患者的总体5年生存率仍然低于20％，并且分期进行。大量研究证实，早期诊断和治疗早期肺癌对于改善患者预后具有重要意义。近年来，人工智能技术逐渐开始应用于肿瘤学中。ai在肿瘤筛查，临床诊断，放疗（图像获取，风险器官分割，图像校准和传递）等方面迅速发展。然而，医疗ai能否实现社会化，在一定程度上取决于公众的态度和接受程度。然而，目前关于结合AI技术和SCT扫描进行早期肺癌诊断的研究很少。鉴于此，本研究利用人工智能技术与螺旋CT扫描联合进行肺癌早期诊断的方法进行了系统分析和应用研究。",
    "tldr": "本研究系统分析了人工智能技术结合螺旋CT扫描在早期肺癌筛查中的应用，并证实早期诊断对于改善患者预后具有重要意义。"
}