{
    "title": "Advancing GenAI Assisted Programming--A Comparative Study on Prompt Efficiency and Code Quality Between GPT-4 and GLM-4",
    "abstract": "arXiv:2402.12782v1 Announce Type: cross  Abstract: This study aims to explore the best practices for utilizing GenAI as a programming tool, through a comparative analysis between GPT-4 and GLM-4. By evaluating prompting strategies at different levels of complexity, we identify that simplest and straightforward prompting strategy yields best code generation results. Additionally, adding a CoT-like preliminary confirmation step would further increase the success rate. Our results reveal that while GPT-4 marginally outperforms GLM-4, the difference is minimal for average users. In our simplified evaluation model, we see a remarkable 30 to 100-fold increase in code generation efficiency over traditional coding norms. Our GenAI Coding Workshop highlights the effectiveness and accessibility of the prompting methodology developed in this study. We observe that GenAI-assisted coding would trigger a paradigm shift in programming landscape, which necessitates developers to take on new roles revo",
    "link": "https://arxiv.org/abs/2402.12782",
    "context": "Title: Advancing GenAI Assisted Programming--A Comparative Study on Prompt Efficiency and Code Quality Between GPT-4 and GLM-4\nAbstract: arXiv:2402.12782v1 Announce Type: cross  Abstract: This study aims to explore the best practices for utilizing GenAI as a programming tool, through a comparative analysis between GPT-4 and GLM-4. By evaluating prompting strategies at different levels of complexity, we identify that simplest and straightforward prompting strategy yields best code generation results. Additionally, adding a CoT-like preliminary confirmation step would further increase the success rate. Our results reveal that while GPT-4 marginally outperforms GLM-4, the difference is minimal for average users. In our simplified evaluation model, we see a remarkable 30 to 100-fold increase in code generation efficiency over traditional coding norms. Our GenAI Coding Workshop highlights the effectiveness and accessibility of the prompting methodology developed in this study. We observe that GenAI-assisted coding would trigger a paradigm shift in programming landscape, which necessitates developers to take on new roles revo",
    "path": "papers/24/02/2402.12782.json",
    "total_tokens": 1012,
    "translated_title": "推进GenAI辅助编程--GPT-4和GLM-4之间提示效率和代码质量的比较研究",
    "translated_abstract": "本研究旨在通过对GPT-4和GLM-4之间的比较分析，探讨利用GenAI作为编程工具的最佳实践。通过评估不同复杂性水平上的提示策略，我们发现最简单直接的提示策略产生了最佳的代码生成结果。此外，添加类似CoT的初步确认步骤将进一步提高成功率。我们的结果表明，虽然GPT-4在某种程度上优于GLM-4，但对于普通用户来说差异微乎其微。在我们简化的评估模型中，我们看到代码生成效率相对传统编码规范显著增加了30到100倍。我们的GenAI编码研讨会突显了本研究开发的提示方法的有效性和可访问性。我们观察到GenAI辅助编码将引发编程领域的范式转变，这需要开发人员承担新角色。",
    "tldr": "本研究通过比较GPT-4和GLM-4，发现最简单直接的提示策略能够产生最佳的代码生成结果，并且指出虽然GPT-4略优于GLM-4，但对于普通用户差异微乎其微。研究还展示了相对传统编码规范30到100倍的代码生成效率增加，并强调了GenAI辅助编码将引发编程领域范式转变的重要性。",
    "en_tdlr": "This study compares GPT-4 and GLM-4 and finds that the simplest prompting strategy yields the best code generation results, indicating a minimal difference between GPT-4 and GLM-4 for average users. The research also demonstrates a significant increase in code generation efficiency of 30 to 100 times over traditional norms and highlights the importance of the paradigm shift in the programming landscape triggered by GenAI-assisted coding."
}