{
    "title": "Approximating Optimal Morphing Attacks using Template Inversion",
    "abstract": "Recent works have demonstrated the feasibility of inverting face recognition systems, enabling to recover convincing face images using only their embeddings. We leverage such template inversion models to develop a novel type ofdeep morphing attack based on inverting a theoretical optimal morph embedding, which is obtained as an average of the face embeddings of source images. We experiment with two variants of this approach: the first one exploits a fully self-contained embedding-to-image inversion model, while the second leverages the synthesis network of a pretrained StyleGAN network for increased morph realism. We generate morphing attacks from several source datasets and study the effectiveness of those attacks against several face recognition networks. We showcase that our method can compete with and regularly beat the previous state of the art for deep-learning based morph generation in terms of effectiveness, both in white-box and black-box attack scenarios, and is additionally ",
    "link": "https://arxiv.org/abs/2402.00695",
    "context": "Title: Approximating Optimal Morphing Attacks using Template Inversion\nAbstract: Recent works have demonstrated the feasibility of inverting face recognition systems, enabling to recover convincing face images using only their embeddings. We leverage such template inversion models to develop a novel type ofdeep morphing attack based on inverting a theoretical optimal morph embedding, which is obtained as an average of the face embeddings of source images. We experiment with two variants of this approach: the first one exploits a fully self-contained embedding-to-image inversion model, while the second leverages the synthesis network of a pretrained StyleGAN network for increased morph realism. We generate morphing attacks from several source datasets and study the effectiveness of those attacks against several face recognition networks. We showcase that our method can compete with and regularly beat the previous state of the art for deep-learning based morph generation in terms of effectiveness, both in white-box and black-box attack scenarios, and is additionally ",
    "path": "papers/24/02/2402.00695.json",
    "total_tokens": 849,
    "translated_title": "近似优化模板反演的形态攻击",
    "translated_abstract": "最近的研究论文表明，可以通过反演人脸识别系统来恢复逼真的人脸图像。我们利用这样的模板反演模型，开发了一种基于反演理论上的优化形态嵌入的新型深度形态攻击方法，该方法通过对源图像的人脸嵌入求平均得到。我们尝试了两种变种：第一种利用完全自适应的嵌入转图像反演模型，而第二种利用预训练StyleGAN网络的合成网络增加形态的逼真度。我们从多个源数据集生成形态攻击，并研究这些攻击对多个人脸识别系统的有效性。我们展示了我们的方法在白盒和黑盒攻击场景中在有效性方面与以往基于深度学习的形态生成的最新技术相竞争并经常超越它们。",
    "tldr": "本文提出了一种基于模板反演的形态攻击方法，可以通过反演优化形态嵌入恢复逼真的人脸图像。该方法在白盒和黑盒攻击场景中表现出与以往技术相竞争并超越其的有效性。",
    "en_tdlr": "This paper proposes a morphing attack method based on template inversion, which can recover convincing face images by inverting optimized morph embeddings. The method demonstrates competitive and surpassing effectiveness compared to previous techniques in both white-box and black-box attack scenarios."
}