{
    "title": "Link-aware link prediction over temporal graph by pattern recognition",
    "abstract": "A temporal graph can be considered as a stream of links, each of which represents an interaction between two nodes at a certain time. On temporal graphs, link prediction is a common task, which aims to answer whether the query link is true or not. To do this task, previous methods usually focus on the learning of representations of the two nodes in the query link. We point out that the learned representation by their models may encode too much information with side effects for link prediction because they have not utilized the information of the query link, i.e., they are link-unaware. Based on this observation, we propose a link-aware model: historical links and the query link are input together into the following model layers to distinguish whether this input implies a reasonable pattern that ends with the query link. During this process, we focus on the modeling of link evolution patterns rather than node representations. Experiments on six datasets show that our model achieves stro",
    "link": "https://arxiv.org/abs/2402.07199",
    "context": "Title: Link-aware link prediction over temporal graph by pattern recognition\nAbstract: A temporal graph can be considered as a stream of links, each of which represents an interaction between two nodes at a certain time. On temporal graphs, link prediction is a common task, which aims to answer whether the query link is true or not. To do this task, previous methods usually focus on the learning of representations of the two nodes in the query link. We point out that the learned representation by their models may encode too much information with side effects for link prediction because they have not utilized the information of the query link, i.e., they are link-unaware. Based on this observation, we propose a link-aware model: historical links and the query link are input together into the following model layers to distinguish whether this input implies a reasonable pattern that ends with the query link. During this process, we focus on the modeling of link evolution patterns rather than node representations. Experiments on six datasets show that our model achieves stro",
    "path": "papers/24/02/2402.07199.json",
    "total_tokens": 850,
    "translated_title": "基于模式识别的时间图链接感知链接预测",
    "translated_abstract": "一个时间图可以被视为一系列链接的流，每个链接代表了两个节点在某个时间点的交互。在时间图上，链接预测是一个常见任务，旨在回答查询链接是否为真。为了完成这个任务，之前的方法通常专注于学习查询链接中两个节点的表示。我们指出，由于之前的模型没有利用查询链接的信息，学习到的表示可能会编码过多的信息并对链接预测产生副作用，即它们不具有链接感知性。基于这个观察，我们提出了一个链接感知模型：历史链接和查询链接一起输入到模型层中，以区分该输入是否暗示了一个以查询链接结尾的合理模式。在这个过程中，我们关注的是链接演化模式的建模，而不是节点表示。在六个数据集上的实验证明，我们的模型取得了很好的效果。",
    "tldr": "提出了一种链接感知模型，通过将历史链接和查询链接一起输入模型层来进行链接预测。与之前的方法不同，该模型关注链接演化模式的建模而非节点表示。实验证明该模型在六个数据集上取得了很好的效果。",
    "en_tdlr": "A link-aware model is proposed for link prediction over temporal graph by inputting historical links and query link together into the model layers. Unlike previous methods, this model focuses on modeling link evolution patterns rather than node representations. Experiments demonstrate the effectiveness of the model on six datasets."
}