{
    "title": "Analysis and Mortality Prediction using Multiclass Classification for Older Adults with Type 2 Diabetes",
    "abstract": "arXiv:2402.10999v1 Announce Type: cross  Abstract: Designing proper treatment plans to manage diabetes requires health practitioners to pay heed to the individuals remaining life along with the comorbidities affecting them. Older adults with Type 2 Diabetes Mellitus (T2DM) are prone to experience premature death or even hypoglycaemia. The structured dataset utilized has 68 potential mortality predictors for 275,190 diabetic U.S. military Veterans aged 65 years or older. A new target variable is invented by combining the two original target variables. Outliers are handled by discretizing the continuous variables. Categorical variables have been dummy encoded. Class balancing is achieved by random under-sampling. A benchmark regression model is built using Multinomial Logistic Regression with LASSO. Chi-Squared and Information Gain are the filter-based feature selection techniques utilized. Classifiers such as Multinomial Logistic Regression, Random Forest, Extreme Gradient Boosting (XGB",
    "link": "https://arxiv.org/abs/2402.10999",
    "context": "Title: Analysis and Mortality Prediction using Multiclass Classification for Older Adults with Type 2 Diabetes\nAbstract: arXiv:2402.10999v1 Announce Type: cross  Abstract: Designing proper treatment plans to manage diabetes requires health practitioners to pay heed to the individuals remaining life along with the comorbidities affecting them. Older adults with Type 2 Diabetes Mellitus (T2DM) are prone to experience premature death or even hypoglycaemia. The structured dataset utilized has 68 potential mortality predictors for 275,190 diabetic U.S. military Veterans aged 65 years or older. A new target variable is invented by combining the two original target variables. Outliers are handled by discretizing the continuous variables. Categorical variables have been dummy encoded. Class balancing is achieved by random under-sampling. A benchmark regression model is built using Multinomial Logistic Regression with LASSO. Chi-Squared and Information Gain are the filter-based feature selection techniques utilized. Classifiers such as Multinomial Logistic Regression, Random Forest, Extreme Gradient Boosting (XGB",
    "path": "papers/24/02/2402.10999.json",
    "total_tokens": 880,
    "translated_title": "分析和预测2型糖尿病老年患者的多类分类死亡率",
    "translated_abstract": "设计合适的治疗方案来管理糖尿病要求医护人员注意患者剩余的生命以及影响他们的合并症。本研究利用了一个包含68个潜在死亡预测因子的结构化数据集，针对275,190名年龄在65岁或以上的美国退伍军人进行了研究。通过将两个原始目标变量组合起来创造了一个新的目标变量。通过离散化连续变量来处理异常值，对分类变量进行了虚拟编码。通过随机欠采样实现了类平衡。使用带LASSO的多项式逻辑回归建立了基准回归模型。采用卡方检验和信息增益作为基于过滤的特征选择技术。分类器包括多项式逻辑回归、随机森林、极端梯度提升（XGB）。",
    "tldr": "设计治疗方案需注意患者剩余生命和合并症，研究利用大规模数据集构建多类分类模型来预测老年2型糖尿病患者的死亡率。"
}