{
    "title": "AlphaRank: An Artificial Intelligence Approach for Ranking and Selection Problems",
    "abstract": "We introduce AlphaRank, an artificial intelligence approach to address the fixed-budget ranking and selection (R&S) problems. We formulate the sequential sampling decision as a Markov decision process and propose a Monte Carlo simulation-based rollout policy that utilizes classic R&S procedures as base policies for efficiently learning the value function of stochastic dynamic programming. We accelerate online sample-allocation by using deep reinforcement learning to pre-train a neural network model offline based on a given prior. We also propose a parallelizable computing framework for large-scale problems, effectively combining \"divide and conquer\" and \"recursion\" for enhanced scalability and efficiency. Numerical experiments demonstrate that the performance of AlphaRank is significantly improved over the base policies, which could be attributed to AlphaRank's superior capability on the trade-off among mean, variance, and induced correlation overlooked by many existing policies.",
    "link": "https://rss.arxiv.org/abs/2402.00907",
    "context": "Title: AlphaRank: An Artificial Intelligence Approach for Ranking and Selection Problems\nAbstract: We introduce AlphaRank, an artificial intelligence approach to address the fixed-budget ranking and selection (R&S) problems. We formulate the sequential sampling decision as a Markov decision process and propose a Monte Carlo simulation-based rollout policy that utilizes classic R&S procedures as base policies for efficiently learning the value function of stochastic dynamic programming. We accelerate online sample-allocation by using deep reinforcement learning to pre-train a neural network model offline based on a given prior. We also propose a parallelizable computing framework for large-scale problems, effectively combining \"divide and conquer\" and \"recursion\" for enhanced scalability and efficiency. Numerical experiments demonstrate that the performance of AlphaRank is significantly improved over the base policies, which could be attributed to AlphaRank's superior capability on the trade-off among mean, variance, and induced correlation overlooked by many existing policies.",
    "path": "papers/24/02/2402.00907.json",
    "total_tokens": 959,
    "translated_title": "AlphaRank:用于排名和选择问题的人工智能方法",
    "translated_abstract": "我们介绍了AlphaRank，一种用于解决固定预算的排名和选择问题的人工智能方法。我们将顺序采样决策定义为马尔可夫决策过程，并提出基于蒙特卡洛仿真的滚动策略，利用经典的排名和选择程序作为基准策略，以有效学习随机动态规划的价值函数。我们通过使用深度强化学习在给定先验的情况下离线预训练神经网络模型，加速在线样本分配。我们还提出了一个可并行计算的框架，用于解决大规模问题，有效地结合了“分而治之”和“递归”，提高了可扩展性和效率。数值实验证明，AlphaRank的性能明显优于基准策略，这可以归因于AlphaRank在众多现有策略中忽视的均值、方差和诱导相关性之间的优越能力。",
    "tldr": "AlphaRank是一种用于解决固定预算的排名和选择问题的人工智能方法。它通过利用经典的排名和选择程序作为基准策略，以有效学习随机动态规划的价值函数，采用深度强化学习加速在线样本分配，并提出可并行计算的框架用于解决大规模问题。AlphaRank在均值、方差和诱导相关性之间取得了优越的平衡，显著提高了性能。",
    "en_tdlr": "AlphaRank is an artificial intelligence approach for addressing fixed-budget ranking and selection problems. It utilizes classic ranking and selection procedures as base policies to efficiently learn the value function of stochastic dynamic programming. It also uses deep reinforcement learning to accelerate online sample allocation and proposes a parallelizable computing framework for large-scale problems. AlphaRank achieves a superior trade-off among mean, variance, and induced correlation, significantly improving performance."
}