{
    "title": "Similarity-based Neighbor Selection for Graph LLMs",
    "abstract": "Text-attributed graphs (TAGs) present unique challenges for direct processing by Language Learning Models (LLMs), yet their extensive commonsense knowledge and robust reasoning capabilities offer great promise for node classification in TAGs. Prior research in this field has grappled with issues such as over-squashing, heterophily, and ineffective graph information integration, further compounded by inconsistencies in dataset partitioning and underutilization of advanced LLMs. To address these challenges, we introduce Similarity-based Neighbor Selection (SNS). Using SimCSE and advanced neighbor selection techniques, SNS effectively improves the quality of selected neighbors, thereby improving graph representation and alleviating issues like over-squashing and heterophily. Besides, as an inductive and training-free approach, SNS demonstrates superior generalization and scalability over traditional GNN methods. Our comprehensive experiments, adhering to standard dataset partitioning prac",
    "link": "https://arxiv.org/abs/2402.03720",
    "context": "Title: Similarity-based Neighbor Selection for Graph LLMs\nAbstract: Text-attributed graphs (TAGs) present unique challenges for direct processing by Language Learning Models (LLMs), yet their extensive commonsense knowledge and robust reasoning capabilities offer great promise for node classification in TAGs. Prior research in this field has grappled with issues such as over-squashing, heterophily, and ineffective graph information integration, further compounded by inconsistencies in dataset partitioning and underutilization of advanced LLMs. To address these challenges, we introduce Similarity-based Neighbor Selection (SNS). Using SimCSE and advanced neighbor selection techniques, SNS effectively improves the quality of selected neighbors, thereby improving graph representation and alleviating issues like over-squashing and heterophily. Besides, as an inductive and training-free approach, SNS demonstrates superior generalization and scalability over traditional GNN methods. Our comprehensive experiments, adhering to standard dataset partitioning prac",
    "path": "papers/24/02/2402.03720.json",
    "total_tokens": 878,
    "translated_title": "基于相似性的邻居选择用于图形LLMs",
    "translated_abstract": "文本属性图（TAGs）在直接处理语言学习模型（LLMs）时面临独特挑战，但它们的广泛常识知识和强大的推理能力为TAGs中的节点分类提供了极大的希望。先前的研究在这一领域中已经解决了过度压缩、异质性和信息集成不当等问题，同时还受到数据集分区的不一致性和高级LLMs的低利用率的影响。为了解决这些挑战，我们引入了基于相似性的邻居选择（SNS）。使用SimCSE和高级邻居选择技术，SNS有效提高了所选邻居的质量，从而改善了图形表示并减轻了过度压缩和异质性等问题。此外，作为一种归纳和无需训练的方法，SNS在传统GNN方法上展示了更强的泛化和可伸缩性。我们的全面实验符合标准的数据集分区实践。",
    "tldr": "基于相似性的邻居选择（SNS）通过改善所选邻居的质量，改善了图形表示，并提高了泛化性能和可扩展性，解决了处理文本属性图（TAGs）的挑战。",
    "en_tdlr": "Similarity-based Neighbor Selection (SNS) addresses the challenges of processing text-attributed graphs (TAGs) by improving graph representation through higher quality neighbor selection, and demonstrates superior generalization and scalability compared to traditional GNN methods."
}