{
    "title": "Informativeness of Reward Functions in Reinforcement Learning",
    "abstract": "Reward functions are central in specifying the task we want a reinforcement learning agent to perform. Given a task and desired optimal behavior, we study the problem of designing informative reward functions so that the designed rewards speed up the agent's convergence. In particular, we consider expert-driven reward design settings where an expert or teacher seeks to provide informative and interpretable rewards to a learning agent. Existing works have considered several different reward design formulations; however, the key challenge is formulating a reward informativeness criterion that adapts w.r.t. the agent's current policy and can be optimized under specified structural constraints to obtain interpretable rewards. In this paper, we propose a novel reward informativeness criterion, a quantitative measure that captures how the agent's current policy will improve if it receives rewards from a specific reward function. We theoretically showcase the utility of the proposed informati",
    "link": "https://arxiv.org/abs/2402.07019",
    "context": "Title: Informativeness of Reward Functions in Reinforcement Learning\nAbstract: Reward functions are central in specifying the task we want a reinforcement learning agent to perform. Given a task and desired optimal behavior, we study the problem of designing informative reward functions so that the designed rewards speed up the agent's convergence. In particular, we consider expert-driven reward design settings where an expert or teacher seeks to provide informative and interpretable rewards to a learning agent. Existing works have considered several different reward design formulations; however, the key challenge is formulating a reward informativeness criterion that adapts w.r.t. the agent's current policy and can be optimized under specified structural constraints to obtain interpretable rewards. In this paper, we propose a novel reward informativeness criterion, a quantitative measure that captures how the agent's current policy will improve if it receives rewards from a specific reward function. We theoretically showcase the utility of the proposed informati",
    "path": "papers/24/02/2402.07019.json",
    "total_tokens": 885,
    "translated_title": "强化学习中奖励函数的信息性",
    "translated_abstract": "奖励函数在指定我们期望强化学习代理执行的任务中起着关键作用。在给定任务和期望的最优行为的情况下，我们研究了如何设计信息丰富的奖励函数，以加快代理的收敛速度。特别是，我们考虑了专家驱动的奖励设计设置，其中专家或教师希望为学习代理提供信息丰富且可解释的奖励。已有的研究考虑了多种不同的奖励设计形式，然而关键挑战是制定一个奖励信息性准则，该准则能够根据代理的当前策略进行调整，并且可以在指定的结构约束下进行优化，以获得可解释的奖励。在本文中，我们提出了一种新的奖励信息性准则，一种定量度量，用于捕捉代理的当前策略如果从特定的奖励函数中获得奖励将如何改善。我们在理论上展示了所提出的信息性准则的实用性。",
    "tldr": "本文研究了在强化学习中设计信息丰富的奖励函数的问题，提出了一种新的奖励信息性准则来评估代理的当前策略在接受特定奖励函数的奖励后的改善情况。"
}