{
    "title": "Curriculum Learning Meets Directed Acyclic Graph for Multimodal Emotion Recognition",
    "abstract": "arXiv:2402.17269v1 Announce Type: new  Abstract: Emotion recognition in conversation (ERC) is a crucial task in natural language processing and affective computing. This paper proposes MultiDAG+CL, a novel approach for Multimodal Emotion Recognition in Conversation (ERC) that employs Directed Acyclic Graph (DAG) to integrate textual, acoustic, and visual features within a unified framework. The model is enhanced by Curriculum Learning (CL) to address challenges related to emotional shifts and data imbalance. Curriculum learning facilitates the learning process by gradually presenting training samples in a meaningful order, thereby improving the model's performance in handling emotional variations and data imbalance. Experimental results on the IEMOCAP and MELD datasets demonstrate that the MultiDAG+CL models outperform baseline models.",
    "link": "https://arxiv.org/abs/2402.17269",
    "context": "Title: Curriculum Learning Meets Directed Acyclic Graph for Multimodal Emotion Recognition\nAbstract: arXiv:2402.17269v1 Announce Type: new  Abstract: Emotion recognition in conversation (ERC) is a crucial task in natural language processing and affective computing. This paper proposes MultiDAG+CL, a novel approach for Multimodal Emotion Recognition in Conversation (ERC) that employs Directed Acyclic Graph (DAG) to integrate textual, acoustic, and visual features within a unified framework. The model is enhanced by Curriculum Learning (CL) to address challenges related to emotional shifts and data imbalance. Curriculum learning facilitates the learning process by gradually presenting training samples in a meaningful order, thereby improving the model's performance in handling emotional variations and data imbalance. Experimental results on the IEMOCAP and MELD datasets demonstrate that the MultiDAG+CL models outperform baseline models.",
    "path": "papers/24/02/2402.17269.json",
    "total_tokens": 729,
    "translated_title": "课程学习遇见有向无环图进行多模态情感识别",
    "translated_abstract": "这篇论文提出了一种新颖的方法，称为MultiDAG+CL，用于会话中的多模态情感识别（ERC），它利用有向无环图（DAG）在一个统一的框架内集成文本、声音和视觉特征。模型通过课程学习（CL）进行增强，以应对情感变化和数据不平衡带来的挑战。课程学习通过逐渐以有意义的顺序呈现训练样本来促进学习过程，从而提高模型处理情绪变化和数据不平衡的性能。在IEMOCAP和MELD数据集上的实验结果表明，MultiDAG+CL模型优于基线模型。",
    "tldr": "使用有向无环图和课程学习相结合的新方法，提升多模态情感识别模型在处理情感变化和数据不平衡方面的性能。",
    "en_tdlr": "A novel approach integrating Directed Acyclic Graph and Curriculum Learning improves the performance of multimodal emotion recognition models in handling emotional variations and data imbalance."
}