{
    "title": "ATLAS: A Model of Short-term European Electricity Market Processes under Uncertainty - Balancing Modules",
    "abstract": "arXiv:2402.12859v1 Announce Type: new  Abstract: The ATLAS model simulates the various stages of the electricity market chain in Europe, including the formulation of offers by different market actors, the coupling of European markets, strategic optimization of production portfolios and, finally, real-time system balancing processes. ATLAS was designed to simulate the various electricity markets and processes that occur from the day ahead timeframe to real-time with a high level of detail. Its main aim is to capture impacts from imperfect actor coordination, evolving forecast errors and a high-level of technical constraints--both regarding different production units and the different market constraints. This working paper describes the simulated balancing processes in detail and is the second part of the ATLAS documentation.",
    "link": "https://arxiv.org/abs/2402.12859",
    "context": "Title: ATLAS: A Model of Short-term European Electricity Market Processes under Uncertainty - Balancing Modules\nAbstract: arXiv:2402.12859v1 Announce Type: new  Abstract: The ATLAS model simulates the various stages of the electricity market chain in Europe, including the formulation of offers by different market actors, the coupling of European markets, strategic optimization of production portfolios and, finally, real-time system balancing processes. ATLAS was designed to simulate the various electricity markets and processes that occur from the day ahead timeframe to real-time with a high level of detail. Its main aim is to capture impacts from imperfect actor coordination, evolving forecast errors and a high-level of technical constraints--both regarding different production units and the different market constraints. This working paper describes the simulated balancing processes in detail and is the second part of the ATLAS documentation.",
    "path": "papers/24/02/2402.12859.json",
    "total_tokens": 721,
    "translated_title": "ATLAS: 不确定性下欧洲短期电力市场过程模型 - 平衡模块",
    "translated_abstract": "ATLAS模型模拟了欧洲电力市场链条的各个阶段，包括不同市场参与者提出报价、欧洲市场耦合、生产组合的战略优化，以及实时系统平衡过程。ATLAS旨在以高度细节模拟从提前到实时发生的各种电力市场和过程。其主要目标是捕捉不完善的参与者协调、不断演变的预测误差以及高水平的技术约束对不同生产单元和不同市场约束的影响。",
    "tldr": "ATLAS模型旨在模拟欧洲电力市场中从提前到实时发生的各种过程，主要关注不完善的参与者协调、预测误差演变和技术约束对市场的影响。",
    "en_tdlr": "The ATLAS model aims to simulate various processes occurring in the European electricity market from day-ahead to real-time, focusing on the impact of imperfect actor coordination, evolving forecast errors, and technical constraints on the market."
}