{
    "title": "A padroniza\\c{c}\\~ao de frota e suas consequ\\^encias para as companhias a\\'ereas",
    "abstract": "arXiv:2402.12402v1 Announce Type: new  Abstract: This study addresses the growing standardization of airline fleets, highlighting that frequent passengers are more likely to fly on the same aircraft model more often. The objective is to analyze the fleet management of airlines and the impact of a reduced variety of models on company operations. The benefits of standardization, such as operational efficiency, and the risks, such as vulnerability to specific model failures, are discussed. The work reviews international scientific literature on the subject, identifying consensus and disagreements that suggest areas for future research. It also includes a study on the Brazilian market, examining how standardization affects operational costs and profitability in terms of model, family, and aircraft manufacturer. Furthermore, the relationship between fleet standardization and the business model of the companies is investigated, concluding that the advantages of standardization are not exclus",
    "link": "https://arxiv.org/abs/2402.12402",
    "context": "Title: A padroniza\\c{c}\\~ao de frota e suas consequ\\^encias para as companhias a\\'ereas\nAbstract: arXiv:2402.12402v1 Announce Type: new  Abstract: This study addresses the growing standardization of airline fleets, highlighting that frequent passengers are more likely to fly on the same aircraft model more often. The objective is to analyze the fleet management of airlines and the impact of a reduced variety of models on company operations. The benefits of standardization, such as operational efficiency, and the risks, such as vulnerability to specific model failures, are discussed. The work reviews international scientific literature on the subject, identifying consensus and disagreements that suggest areas for future research. It also includes a study on the Brazilian market, examining how standardization affects operational costs and profitability in terms of model, family, and aircraft manufacturer. Furthermore, the relationship between fleet standardization and the business model of the companies is investigated, concluding that the advantages of standardization are not exclus",
    "path": "papers/24/02/2402.12402.json",
    "total_tokens": 908,
    "translated_title": "航空公司机队标准化及其对公司的影响",
    "translated_abstract": "本研究探讨了航空公司机队标准化的增长现象，并强调经常乘客更有可能经常乘坐相同机型。其目的是分析航空公司的机队管理以及机型多样性减少对公司运营的影响。讨论了标准化的好处，如运营效率，以及风险，如对特定机型故障的脆弱性。该研究回顾了关于这一主题的国际科学文献，识别了一致和分歧之处，提出了未来研究的方向。还包括了对巴西市场的研究，考察了标准化如何影响模型、家族和飞机制造商方面的运营成本和盈利能力。此外，还调查了机队标准化与公司商业模式之间的关系，得出结论：标准化的优势并不是排它性的。",
    "tldr": "研究分析了航空公司机队标准化对公司运营的影响，探讨了标准化带来的运营效率和特定机型故障风险，提出了未来研究方向，并调查了巴西市场上的具体影响，得出结论称标准化的优势并不是排它性的。",
    "en_tdlr": "The study analyzes the impact of fleet standardization on airline operations, discusses the operational efficiency and specific model failure risks brought by standardization, suggests future research directions, investigates the specific effects in the Brazilian market, and concludes that the advantages of standardization are not exclusive."
}