{
    "title": "Temporal Analysis of Drifting Hashtags in Textual Data Streams: A Graph-Based Application",
    "abstract": "arXiv:2402.10230v1 Announce Type: cross  Abstract: Social media has played an important role since its emergence. People use the internet to express opinions about anything, making social media platforms a social sensor. Initially supported by Twitter, the hashtags are now in use on several social media platforms. Hashtags are helpful to tag, track, and group posts on similar topics. In this paper, we analyze hashtag drifts over time using concepts from graph analysis and textual data streams using the Girvan-Newman method to uncover hashtag communities in annual snapshots. More specifically, we analyzed the #mybodymychoice hashtag between 2018 and 2022. In addition, we offer insights about some hashtags found in the study. Furthermore, our approach can be useful for monitoring changes over time in opinions and sentiment patterns about an entity on social media. Even though the hashtag #mybodymychoice was initially coupled with women's rights, abortion, and bodily autonomy, we observe ",
    "link": "https://arxiv.org/abs/2402.10230",
    "context": "Title: Temporal Analysis of Drifting Hashtags in Textual Data Streams: A Graph-Based Application\nAbstract: arXiv:2402.10230v1 Announce Type: cross  Abstract: Social media has played an important role since its emergence. People use the internet to express opinions about anything, making social media platforms a social sensor. Initially supported by Twitter, the hashtags are now in use on several social media platforms. Hashtags are helpful to tag, track, and group posts on similar topics. In this paper, we analyze hashtag drifts over time using concepts from graph analysis and textual data streams using the Girvan-Newman method to uncover hashtag communities in annual snapshots. More specifically, we analyzed the #mybodymychoice hashtag between 2018 and 2022. In addition, we offer insights about some hashtags found in the study. Furthermore, our approach can be useful for monitoring changes over time in opinions and sentiment patterns about an entity on social media. Even though the hashtag #mybodymychoice was initially coupled with women's rights, abortion, and bodily autonomy, we observe ",
    "path": "papers/24/02/2402.10230.json",
    "total_tokens": 936,
    "translated_title": "在文本数据流中漂移标签的时间分析：基于图的应用",
    "translated_abstract": "社交媒体自出现以来就发挥着重要作用。人们利用互联网表达对任何事物的看法，使社交媒体平台成为社会传感器。最初由Twitter支持，现在已在多个社交媒体平台上使用标签。标签有助于标记、跟踪和对类似主题的帖子进行分组。在本文中，我们使用图分析和文本数据流的概念，运用Girvan-Newman方法来分析随时间漂移的标签，并在年度快照中揭示标签社区。更具体地，我们分析了2018年至2022年间的＃mybodymychoice标签。此外，我们提供了在研究中发现的一些标签的见解。此外，我们的方法可用于监测社交媒体上关于某个实体的意见和情感模式随时间的变化。尽管＃mybodymychoice标签最初与妇女权利、堕胎和身体自主有关，我们观察到",
    "tldr": "本文利用图分析和文本数据流的概念，在年度快照中分析了随时间漂移的标签，揭示了标签社区，特别是针对＃mybodymychoice标签的分析，并为监测社交媒体中关于实体的意见和情感模式随时间变化提供了有用的方法。"
}