{
    "title": "HyperPlanes: Hypernetwork Approach to Rapid NeRF Adaptation",
    "abstract": "Neural radiance fields (NeRFs) are a widely accepted standard for synthesizing new 3D object views from a small number of base images. However, NeRFs have limited generalization properties, which means that we need to use significant computational resources to train individual architectures for each item we want to represent. To address this issue, we propose a few-shot learning approach based on the hypernetwork paradigm that does not require gradient optimization during inference. The hypernetwork gathers information from the training data and generates an update for universal weights. As a result, we have developed an efficient method for generating a high-quality 3D object representation from a small number of images in a single step. This has been confirmed by direct comparison with the state-of-the-art solutions and a comprehensive ablation study.",
    "link": "https://rss.arxiv.org/abs/2402.01524",
    "context": "Title: HyperPlanes: Hypernetwork Approach to Rapid NeRF Adaptation\nAbstract: Neural radiance fields (NeRFs) are a widely accepted standard for synthesizing new 3D object views from a small number of base images. However, NeRFs have limited generalization properties, which means that we need to use significant computational resources to train individual architectures for each item we want to represent. To address this issue, we propose a few-shot learning approach based on the hypernetwork paradigm that does not require gradient optimization during inference. The hypernetwork gathers information from the training data and generates an update for universal weights. As a result, we have developed an efficient method for generating a high-quality 3D object representation from a small number of images in a single step. This has been confirmed by direct comparison with the state-of-the-art solutions and a comprehensive ablation study.",
    "path": "papers/24/02/2402.01524.json",
    "total_tokens": 771,
    "translated_title": "超平面：快速 NeRF 自适应的超网络方法",
    "translated_abstract": "神经辐射场（Neural radiance fields，NeRF）是一种广泛接受的标准，用于从少量基础图像合成新的三维物体视图。然而，NeRF 的泛化能力有限，这意味着我们需要使用大量计算资源来训练每个要表示的物体的独立架构。为解决这个问题，我们提出了一种基于超网络范式的少样本学习方法，在推断过程中不需要梯度优化。超网络从训练数据中收集信息并为通用权重生成更新。结果，我们开发出了一种通过单一步骤从少量图像生成高质量三维物体表示的高效方法。通过与最先进的解决方案进行直接比较和全面的消融研究进行了确认。",
    "tldr": "本论文提出了一种基于超网络的少样本学习方法，利用其在训练过程中生成通用权重的更新，实现了从少量图像中快速生成高质量三维物体表示的效果。",
    "en_tdlr": "This paper proposes a hypernetwork-based few-shot learning method that generates updates for universal weights during training, enabling rapid generation of high-quality 3D object representations from a small number of images."
}