{
    "title": "Understanding Missingness in Time-series Electronic Health Records for Individualized Representation",
    "abstract": "arXiv:2402.15730v1 Announce Type: new  Abstract: With the widespread of machine learning models for healthcare applications, there is increased interest in building applications for personalized medicine. Despite the plethora of proposed research for personalized medicine, very few focus on representing missingness and learning from the missingness patterns in time-series Electronic Health Records (EHR) data. The lack of focus on missingness representation in an individualized way limits the full utilization of machine learning applications towards true personalization. In this brief communication, we highlight new insights into patterns of missingness with real-world examples and implications of missingness in EHRs. The insights in this work aim to bridge the gap between theoretical assumptions and practical observations in real-world EHRs. We hope this work will open new doors for exploring directions for better representation in predictive modelling for true personalization.",
    "link": "https://arxiv.org/abs/2402.15730",
    "context": "Title: Understanding Missingness in Time-series Electronic Health Records for Individualized Representation\nAbstract: arXiv:2402.15730v1 Announce Type: new  Abstract: With the widespread of machine learning models for healthcare applications, there is increased interest in building applications for personalized medicine. Despite the plethora of proposed research for personalized medicine, very few focus on representing missingness and learning from the missingness patterns in time-series Electronic Health Records (EHR) data. The lack of focus on missingness representation in an individualized way limits the full utilization of machine learning applications towards true personalization. In this brief communication, we highlight new insights into patterns of missingness with real-world examples and implications of missingness in EHRs. The insights in this work aim to bridge the gap between theoretical assumptions and practical observations in real-world EHRs. We hope this work will open new doors for exploring directions for better representation in predictive modelling for true personalization.",
    "path": "papers/24/02/2402.15730.json",
    "total_tokens": 805,
    "translated_title": "了解时间序列电子健康记录中的缺失性，用于个性化表示",
    "translated_abstract": "随着机器学习模型在医疗应用中的广泛应用，建立个性化医学应用的兴趣逐渐增加。尽管已经有大量关于个性化医学的研究提出，但很少有研究关注如何从时间序列电子健康记录（EHR）数据中表示缺失性并学习缺失性模式。对缺失性表示缺乏个性化关注，限制了机器学习应用在真正个性化方向上的充分利用。本简要交流突出了缺失性模式的新见解，提供了真实案例和EHR中缺失性的影响。本工作的见解旨在弥合理论假设与实际观察之间在实际EHR中的差距。我们希望这项工作能为探索更好的预测建模表示方向打开新的大门。",
    "tldr": "该研究围绕在时间序列电子健康记录中对缺失性进行个性化表示展开，为真正个性化的预测建模提供了新见解。",
    "en_tdlr": "This study focuses on individualized representation of missingness in time-series electronic health records, providing new insights for true personalized predictive modeling."
}