{
    "title": "Counterfactual Generation with Answer Set Programming",
    "abstract": "Machine learning models that automate decision-making are increasingly being used in consequential areas such as loan approvals, pretrial bail approval, hiring, and many more. Unfortunately, most of these models are black-boxes, i.e., they are unable to reveal how they reach these prediction decisions. A need for transparency demands justification for such predictions. An affected individual might also desire explanations to understand why a decision was made. Ethical and legal considerations may further require informing the individual of changes in the input attribute that could be made to produce a desirable outcome. This paper focuses on the latter problem of automatically generating counterfactual explanations. We propose a framework Counterfactual Generation with s(CASP) (CFGS) that utilizes answer set programming (ASP) and the s(CASP) goal-directed ASP system to automatically generate counterfactual explanations from rules generated by rule-based machine learning (RBML) algorith",
    "link": "https://arxiv.org/abs/2402.04382",
    "context": "Title: Counterfactual Generation with Answer Set Programming\nAbstract: Machine learning models that automate decision-making are increasingly being used in consequential areas such as loan approvals, pretrial bail approval, hiring, and many more. Unfortunately, most of these models are black-boxes, i.e., they are unable to reveal how they reach these prediction decisions. A need for transparency demands justification for such predictions. An affected individual might also desire explanations to understand why a decision was made. Ethical and legal considerations may further require informing the individual of changes in the input attribute that could be made to produce a desirable outcome. This paper focuses on the latter problem of automatically generating counterfactual explanations. We propose a framework Counterfactual Generation with s(CASP) (CFGS) that utilizes answer set programming (ASP) and the s(CASP) goal-directed ASP system to automatically generate counterfactual explanations from rules generated by rule-based machine learning (RBML) algorith",
    "path": "papers/24/02/2402.04382.json",
    "total_tokens": 787,
    "translated_title": "使用答案集编程的反事实生成",
    "translated_abstract": "在贷款审批、保释审批、招聘等领域，越来越多地使用自动决策的机器学习模型。然而，大多数模型都是黑匣子，即无法揭示其预测决策的过程。出于透明度的需求，对这些预测需要进行解释。受影响的个体可能还希望解释为什么做出了某个决策。道德和法律考虑进一步要求告知个体可以进行哪些输入属性的更改以产生期望的结果。本文重点研究自动生成反事实解释这一问题。我们提出了一个名为反事实生成与s(CASP) (CFGS)的框架，利用答案集编程(ASP)和s(CASP)目标导向ASP系统，从基于规则的机器学习(RBML)算法生成的规则中自动生成反事实解释。",
    "tldr": "本文提出了一个通过答案集编程自动生成反事实解释的框架，以应对机器学习模型决策的透明度和合理性需求。",
    "en_tdlr": "This paper proposes a framework for automatically generating counterfactual explanations using answer set programming, to address the transparency and justification requirements of machine learning models in decision-making."
}