{
    "title": "The general solution to an autoregressive law of motion",
    "abstract": "In this article we provide a complete description of the set of all solutions to an autoregressive law of motion in a finite-dimensional complex vector space. Every solution is shown to be the sum of three parts, each corresponding to a directed flow of time. One part flows forward from the arbitrarily distant past; one flows backward from the arbitrarily distant future; and one flows outward from time zero. The three parts are obtained by applying three complementary spectral projections to the solution, these corresponding to a separation of the eigenvalues of the autoregressive operator according to whether they are inside, outside or on the unit circle. We provide a finite-dimensional parametrization of the set of all solutions.",
    "link": "https://arxiv.org/abs/2402.01966",
    "context": "Title: The general solution to an autoregressive law of motion\nAbstract: In this article we provide a complete description of the set of all solutions to an autoregressive law of motion in a finite-dimensional complex vector space. Every solution is shown to be the sum of three parts, each corresponding to a directed flow of time. One part flows forward from the arbitrarily distant past; one flows backward from the arbitrarily distant future; and one flows outward from time zero. The three parts are obtained by applying three complementary spectral projections to the solution, these corresponding to a separation of the eigenvalues of the autoregressive operator according to whether they are inside, outside or on the unit circle. We provide a finite-dimensional parametrization of the set of all solutions.",
    "path": "papers/24/02/2402.01966.json",
    "total_tokens": 664,
    "translated_title": "自回归运动的一般解决方案",
    "translated_abstract": "在本文中，我们提供了一个有限维复向量空间中自回归运动的全部解的完整描述。我们证明每个解都可以分解为三个部分，分别对应于时间的正向流动、负向流动和从时间零开始的外向流动。这三个部分是通过将解应用三个互补的谱投影获得的，这些谱投影根据自回归算子的特征值是在、外或者在单位圆上将其分离。我们提供了对所有解的有限维参数化。",
    "tldr": "本文通过对自回归运动的解进行分析，提供了一个完整的描述，并给出了解的分解方式和参数化方法。",
    "en_tdlr": "In this article, we provide a complete description of the set of all solutions to an autoregressive law of motion and a finite-dimensional parametrization. We show that every solution can be decomposed into three parts corresponding to different flows of time, and these parts are obtained by applying spectral projections based on the eigenvalues of the autoregressive operator."
}