{
    "title": "Semi-supervised Medical Image Segmentation Method Based on Cross-pseudo Labeling Leveraging Strong and Weak Data Augmentation Strategies",
    "abstract": "arXiv:2402.11273v1 Announce Type: cross  Abstract: Traditional supervised learning methods have historically encountered certain constraints in medical image segmentation due to the challenging collection process, high labeling cost, low signal-to-noise ratio, and complex features characterizing biomedical images. This paper proposes a semi-supervised model, DFCPS, which innovatively incorporates the Fixmatch concept. This significantly enhances the model's performance and generalizability through data augmentation processing, employing varied strategies for unlabeled data. Concurrently, the model design gives appropriate emphasis to the generation, filtration, and refinement processes of pseudo-labels. The novel concept of cross-pseudo-supervision is introduced, integrating consistency learning with self-training. This enables the model to fully leverage pseudo-labels from multiple perspectives, thereby enhancing training diversity. The DFCPS model is compared with both baseline and a",
    "link": "https://arxiv.org/abs/2402.11273",
    "context": "Title: Semi-supervised Medical Image Segmentation Method Based on Cross-pseudo Labeling Leveraging Strong and Weak Data Augmentation Strategies\nAbstract: arXiv:2402.11273v1 Announce Type: cross  Abstract: Traditional supervised learning methods have historically encountered certain constraints in medical image segmentation due to the challenging collection process, high labeling cost, low signal-to-noise ratio, and complex features characterizing biomedical images. This paper proposes a semi-supervised model, DFCPS, which innovatively incorporates the Fixmatch concept. This significantly enhances the model's performance and generalizability through data augmentation processing, employing varied strategies for unlabeled data. Concurrently, the model design gives appropriate emphasis to the generation, filtration, and refinement processes of pseudo-labels. The novel concept of cross-pseudo-supervision is introduced, integrating consistency learning with self-training. This enables the model to fully leverage pseudo-labels from multiple perspectives, thereby enhancing training diversity. The DFCPS model is compared with both baseline and a",
    "path": "papers/24/02/2402.11273.json",
    "total_tokens": 928,
    "translated_title": "基于交叉伪标记的半监督医学图像分割方法，利用强弱数据增强策略",
    "translated_abstract": "传统的监督学习方法在医学图像分割中历史上遇到了某些约束，由于挑战性的收集过程、高昂的标记成本、低信噪比和复杂特征，这些特征描述了生物医学图像。本论文提出了一种半监督模型DFCPS，该模型创新性地结合了Fixmatch概念。通过数据增强处理，采用各种策略处理未标记数据，显著提高了模型的性能和泛化能力。同时，模型设计着重于伪标签的生成、过滤和细化过程。引入了交叉伪监督的新概念，将一致性学习与自我训练相结合。这使得模型能够充分利用多个角度的伪标签，从而增强训练的多样性。DFCPS模型与基准线和一个进行了比较",
    "tldr": "本文提出了一种半监督模型DFCPS，创新地融合了Fixmatch概念，通过数据增强处理提高了模型性能和泛化能力，同时引入了交叉伪监督概念，使模型能够充分利用多个角度的伪标签，增强训练的多样性。",
    "en_tdlr": "This paper proposes a semi-supervised model DFCPS, which innovatively incorporates the Fixmatch concept, improves model performance and generalizability through data augmentation processing, and introduces the concept of cross-pseudo-supervision, enabling the model to fully leverage pseudo-labels from multiple perspectives to enhance training diversity."
}