{
    "title": "Not flexible enough? Impacts of electric carsharing on a power sector with variable renewables",
    "abstract": "arXiv:2402.19380v1 Announce Type: new  Abstract: Electrifying the car fleet is a major strategy for mitigating greenhouse gas emissions in the transport sector. However, electrification alone will not solve all the negative externalities associated with cars. In light of other problems such as street space as well as concerns about the use of mineral resources for battery electric cars, reducing the car fleet size would be beneficial, particularly in cities. Carsharing could offer a way to reconcile current car usage habits with a reduction in the car fleet size. However, it could also reduce the potential of electric cars to align their grid interactions with variable renewable electricity generation. We investigate how electric carsharing may impact the power sector in the future. We combine three open-source quantitative methods, including sequence clustering of car travel diaries, a probabilistic tool to generate synthetic electric vehicle time series, and an optimization model of ",
    "link": "https://arxiv.org/abs/2402.19380",
    "context": "Title: Not flexible enough? Impacts of electric carsharing on a power sector with variable renewables\nAbstract: arXiv:2402.19380v1 Announce Type: new  Abstract: Electrifying the car fleet is a major strategy for mitigating greenhouse gas emissions in the transport sector. However, electrification alone will not solve all the negative externalities associated with cars. In light of other problems such as street space as well as concerns about the use of mineral resources for battery electric cars, reducing the car fleet size would be beneficial, particularly in cities. Carsharing could offer a way to reconcile current car usage habits with a reduction in the car fleet size. However, it could also reduce the potential of electric cars to align their grid interactions with variable renewable electricity generation. We investigate how electric carsharing may impact the power sector in the future. We combine three open-source quantitative methods, including sequence clustering of car travel diaries, a probabilistic tool to generate synthetic electric vehicle time series, and an optimization model of ",
    "path": "papers/24/02/2402.19380.json",
    "total_tokens": 852,
    "translated_title": "电动汽车共享对具有可变可再生能源的电力部门的影响",
    "translated_abstract": "电动化汽车车队是减缓交通部门温室气体排放的主要策略。然而，仅仅电动化并不能解决与汽车相关的所有负面外部性。在考虑到其他问题，如街道空间以及对用于电池电动汽车的矿物资源的担忧时，减少汽车车队规模将是有益的，尤其是在城市中。汽车共享可以提供一种调和当前汽车使用习惯与减少汽车车队规模之间的途径。然而，它也可能减少电动汽车与可变可再生电力的网格互动潜力。我们研究了电动汽车共享可能如何影响未来的电力部门。我们结合了三种开源定量方法，包括对汽车行程日记进行序列聚类、生成合成电动车时间序列的概率工具，以及一个优化模型。",
    "tldr": "电动汽车共享对未来电力部门的影响进行了研究，结合了三种开源定量方法，旨在提供一种调和当前汽车使用习惯与减少汽车车队规模之间的途径。"
}