{
    "title": "Position Aware 60 GHz mmWave Beamforming for V2V Communications Utilizing Deep Learning",
    "abstract": "Beamforming techniques are considered as essential parts to compensate the severe path loss in millimeter-wave (mmWave) communications by adopting large antenna arrays and formulating narrow beams to obtain satisfactory received powers. However, performing accurate beam alignment over such narrow beams for efficient link configuration by traditional beam selection approaches, mainly relied on channel state information, typically impose significant latency and computing overheads, which is often infeasible in vehicle-to-vehicle (V2V) communications like highly dynamic scenarios. In contrast, utilizing out-of-band contextual information, such as vehicular position information, is a potential alternative to reduce such overheads. In this context, this paper presents a deep learning-based solution on utilizing the vehicular position information for predicting the optimal beams having sufficient mmWave received powers so that the best V2V line-of-sight links can be ensured proactively. Afte",
    "link": "https://rss.arxiv.org/abs/2402.01259",
    "context": "Title: Position Aware 60 GHz mmWave Beamforming for V2V Communications Utilizing Deep Learning\nAbstract: Beamforming techniques are considered as essential parts to compensate the severe path loss in millimeter-wave (mmWave) communications by adopting large antenna arrays and formulating narrow beams to obtain satisfactory received powers. However, performing accurate beam alignment over such narrow beams for efficient link configuration by traditional beam selection approaches, mainly relied on channel state information, typically impose significant latency and computing overheads, which is often infeasible in vehicle-to-vehicle (V2V) communications like highly dynamic scenarios. In contrast, utilizing out-of-band contextual information, such as vehicular position information, is a potential alternative to reduce such overheads. In this context, this paper presents a deep learning-based solution on utilizing the vehicular position information for predicting the optimal beams having sufficient mmWave received powers so that the best V2V line-of-sight links can be ensured proactively. Afte",
    "path": "papers/24/02/2402.01259.json",
    "total_tokens": 859,
    "translated_title": "利用深度学习的位置感知60 GHz毫米波波束成形技术用于车辆到车辆通信",
    "translated_abstract": "波束成形技术是通过采用大规模天线阵列和生成窄波束来弥补毫米波通信中的严重路径损耗，以获得令人满意的接收功率的重要部分。然而，传统的波束选择方法主要依赖于信道状态信息来进行准确的波束对准，并为高效的链路配置带来显著的延迟和计算开销，在车辆到车辆（V2V）通信中如高度动态的场景中通常是不可行的。相比之下，利用带外上下文信息（如车辆位置信息）是减少这种开销的潜在替代方法。在这个背景下，本文提出了一种基于深度学习的解决方案，利用车辆位置信息来预测具有足够毫米波接收功率的最佳波束，从而可以主动确保最佳的V2V直视链路。",
    "tldr": "本文提出了一种利用深度学习的方法，通过预测具有足够毫米波接收功率的最佳波束，使用车辆位置信息来实现车辆到车辆通信中的高效链路配置。",
    "en_tdlr": "This paper presents a deep learning-based method utilizing vehicular position information to predict the optimal beams with sufficient mmWave received powers for efficient link configuration in vehicle-to-vehicle communications."
}