{
    "title": "Scalable Virtual Valuations Combinatorial Auction Design by Combining Zeroth-Order and First-Order Optimization Method",
    "abstract": "arXiv:2402.11904v1 Announce Type: cross  Abstract: Automated auction design seeks to discover empirically high-revenue and incentive-compatible mechanisms using machine learning. Ensuring dominant strategy incentive compatibility (DSIC) is crucial, and the most effective approach is to confine the mechanism to Affine Maximizer Auctions (AMAs). Nevertheless, existing AMA-based approaches encounter challenges such as scalability issues (arising from combinatorial candidate allocations) and the non-differentiability of revenue. In this paper, to achieve a scalable AMA-based method, we further restrict the auction mechanism to Virtual Valuations Combinatorial Auctions (VVCAs), a subset of AMAs with significantly fewer parameters. Initially, we employ a parallelizable dynamic programming algorithm to compute the winning allocation of a VVCA. Subsequently, we propose a novel optimization method that combines both zeroth-order and first-order techniques to optimize the VVCA parameters. Extens",
    "link": "https://arxiv.org/abs/2402.11904",
    "context": "Title: Scalable Virtual Valuations Combinatorial Auction Design by Combining Zeroth-Order and First-Order Optimization Method\nAbstract: arXiv:2402.11904v1 Announce Type: cross  Abstract: Automated auction design seeks to discover empirically high-revenue and incentive-compatible mechanisms using machine learning. Ensuring dominant strategy incentive compatibility (DSIC) is crucial, and the most effective approach is to confine the mechanism to Affine Maximizer Auctions (AMAs). Nevertheless, existing AMA-based approaches encounter challenges such as scalability issues (arising from combinatorial candidate allocations) and the non-differentiability of revenue. In this paper, to achieve a scalable AMA-based method, we further restrict the auction mechanism to Virtual Valuations Combinatorial Auctions (VVCAs), a subset of AMAs with significantly fewer parameters. Initially, we employ a parallelizable dynamic programming algorithm to compute the winning allocation of a VVCA. Subsequently, we propose a novel optimization method that combines both zeroth-order and first-order techniques to optimize the VVCA parameters. Extens",
    "path": "papers/24/02/2402.11904.json",
    "total_tokens": 886,
    "translated_title": "通过结合零阶和一阶优化方法设计可扩展的虚拟估值组合拍卖",
    "translated_abstract": "arXiv:2402.11904v1 公告类型: 交叉论坛 摘要: 自动化拍卖设计旨在利用机器学习发现高收入和激励兼容的机制。确保主导战略激励兼容性（DSIC）至关重要，而最有效的方法是将机制限制在仿射最大化拍卖（AMAs）范围内。然而，现有的基于AMA的方法面临挑战，如可扩展性问题（由组合候选分配导致）和收入的不可微性。在本文中，为了实现可扩展的AMA方法，我们进一步将拍卖机制限制在虚拟估值组合拍卖（VVCAs）范围内，这是具有更少参数的AMAs子集。最初，我们使用可并行化的动态规划算法计算VVCA的获胜分配。随后，我们提出了一种结合了零阶和一阶技术的新型优化方法来优化VVCA参数。",
    "tldr": "本文提出了一种结合零阶和一阶优化方法，设计了可扩展的虚拟估值组合拍卖，以解决组合候选分配的可缩放性问题。"
}