{
    "title": "Beware of Words: Evaluating the Lexical Richness of Conversational Large Language Models",
    "abstract": "arXiv:2402.15518v1 Announce Type: new  Abstract: The performance of conversational Large Language Models (LLMs) in general, and of ChatGPT in particular, is currently being evaluated on many different tasks, from logical reasoning or maths to answering questions on a myriad of topics. Instead, much less attention is being devoted to the study of the linguistic features of the texts generated by these LLMs. This is surprising since LLMs are models for language, and understanding how they use the language is important. Indeed, conversational LLMs are poised to have a significant impact on the evolution of languages as they may eventually dominate the creation of new text. This means that for example, if conversational LLMs do not use a word it may become less and less frequent and eventually stop being used altogether. Therefore, evaluating the linguistic features of the text they produce and how those depend on the model parameters is the first step toward understanding the potential im",
    "link": "https://arxiv.org/abs/2402.15518",
    "context": "Title: Beware of Words: Evaluating the Lexical Richness of Conversational Large Language Models\nAbstract: arXiv:2402.15518v1 Announce Type: new  Abstract: The performance of conversational Large Language Models (LLMs) in general, and of ChatGPT in particular, is currently being evaluated on many different tasks, from logical reasoning or maths to answering questions on a myriad of topics. Instead, much less attention is being devoted to the study of the linguistic features of the texts generated by these LLMs. This is surprising since LLMs are models for language, and understanding how they use the language is important. Indeed, conversational LLMs are poised to have a significant impact on the evolution of languages as they may eventually dominate the creation of new text. This means that for example, if conversational LLMs do not use a word it may become less and less frequent and eventually stop being used altogether. Therefore, evaluating the linguistic features of the text they produce and how those depend on the model parameters is the first step toward understanding the potential im",
    "path": "papers/24/02/2402.15518.json",
    "total_tokens": 786,
    "translated_title": "当心言辞：评估会话式大型语言模型的词汇丰富度",
    "translated_abstract": "在很多不同任务中正在评估会话式大型语言模型（LLMs）的性能，特别是ChatGPT，从逻辑推理或数学到回答各种主题的问题。然而，对这些LLMs生成的文本的语言特征的研究却少之又少。这是令人惊讶的，因为LLMs是语言模型，了解它们如何使用语言是重要的。事实上，会话式LLMs可能对语言的演变产生重要影响，因为它们最终可能主导新文本的创作。因此，评估它们生成的文本的语言特征以及这些特征如何取决于模型参数是了解潜在影响的第一步。",
    "tldr": "评估会话式大型语言模型生成文本的语言特征以及这些特征如何取决于模型参数是理解其潜在影响的关键一步。",
    "en_tdlr": "Evaluating the linguistic features of the text produced by conversational Large Language Models and how those features depend on the model parameters is crucial to understanding their potential impact."
}