{
    "title": "Large Language Models for Data Annotation: A Survey",
    "abstract": "arXiv:2402.13446v1 Announce Type: new  Abstract: Data annotation is the labeling or tagging of raw data with relevant information, essential for improving the efficacy of machine learning models. The process, however, is labor-intensive and expensive. The emergence of advanced Large Language Models (LLMs), exemplified by GPT-4, presents an unprecedented opportunity to revolutionize and automate the intricate process of data annotation. While existing surveys have extensively covered LLM architecture, training, and general applications, this paper uniquely focuses on their specific utility for data annotation. This survey contributes to three core aspects: LLM-Based Data Annotation, Assessing LLM-generated Annotations, and Learning with LLM-generated annotations. Furthermore, the paper includes an in-depth taxonomy of methodologies employing LLMs for data annotation, a comprehensive review of learning strategies for models incorporating LLM-generated annotations, and a detailed discussi",
    "link": "https://arxiv.org/abs/2402.13446",
    "context": "Title: Large Language Models for Data Annotation: A Survey\nAbstract: arXiv:2402.13446v1 Announce Type: new  Abstract: Data annotation is the labeling or tagging of raw data with relevant information, essential for improving the efficacy of machine learning models. The process, however, is labor-intensive and expensive. The emergence of advanced Large Language Models (LLMs), exemplified by GPT-4, presents an unprecedented opportunity to revolutionize and automate the intricate process of data annotation. While existing surveys have extensively covered LLM architecture, training, and general applications, this paper uniquely focuses on their specific utility for data annotation. This survey contributes to three core aspects: LLM-Based Data Annotation, Assessing LLM-generated Annotations, and Learning with LLM-generated annotations. Furthermore, the paper includes an in-depth taxonomy of methodologies employing LLMs for data annotation, a comprehensive review of learning strategies for models incorporating LLM-generated annotations, and a detailed discussi",
    "path": "papers/24/02/2402.13446.json",
    "total_tokens": 881,
    "translated_title": "大型语言模型用于数据标注：一项调查",
    "translated_abstract": "数据标注是将原始数据标记或打标签与相关信息，对于提高机器学习模型的有效性至关重要。然而，这一过程劳动密集且昂贵。先进的大型语言模型（LLMs）的出现，例如GPT-4，为革新和自动化数据标注的复杂过程提供了前所未有的机遇。虽然现有的调查已经广泛涵盖了LLM的架构、训练和一般应用，但本文独特地关注它们在数据标注中的具体效用。该调查对LLM-Based数据标注、评估LLM生成的标注以及使用LLM生成的标注学习这三个核心方面做出了贡献。此外，论文包括了一种使用LLMs进行数据标注的方法学深度分类法，一个对整合LLM生成的标注的模型的学习策略进行全面审查，以及对其进行详细讨论。",
    "tldr": "大型语言模型的出现为自动化数据标注提供机遇，该调查独特关注LLM在数据标注中的效用，贡献主要集中在LLM-Based数据标注、评估LLM生成的标注以及使用LLM生成的标注学习等三个核心方面。",
    "en_tdlr": "The emergence of advanced Large Language Models (LLMs) like GPT-4 presents an opportunity to revolutionize and automate data annotation. This survey uniquely focuses on the utility of LLMs for data annotation, contributing mainly to LLM-Based Data Annotation, Assessing LLM-generated Annotations, and Learning with LLM-generated annotations."
}