{
    "title": "A Collision-Aware Cable Grasping Method in Cluttered Environment",
    "abstract": "arXiv:2402.14498v1 Announce Type: cross  Abstract: We introduce a Cable Grasping-Convolutional Neural Network designed to facilitate robust cable grasping in cluttered environments. Utilizing physics simulations, we generate an extensive dataset that mimics the intricacies of cable grasping, factoring in potential collisions between cables and robotic grippers. We employ the Approximate Convex Decomposition technique to dissect the non-convex cable model, with grasp quality autonomously labeled based on simulated grasping attempts. The CG-CNN is refined using this simulated dataset and enhanced through domain randomization techniques. Subsequently, the trained model predicts grasp quality, guiding the optimal grasp pose to the robot controller for execution. Grasping efficacy is assessed across both synthetic and real-world settings. Given our model implicit collision sensitivity, we achieved commendable success rates of 92.3% for known cables and 88.4% for unknown cables, surpassing c",
    "link": "https://arxiv.org/abs/2402.14498",
    "context": "Title: A Collision-Aware Cable Grasping Method in Cluttered Environment\nAbstract: arXiv:2402.14498v1 Announce Type: cross  Abstract: We introduce a Cable Grasping-Convolutional Neural Network designed to facilitate robust cable grasping in cluttered environments. Utilizing physics simulations, we generate an extensive dataset that mimics the intricacies of cable grasping, factoring in potential collisions between cables and robotic grippers. We employ the Approximate Convex Decomposition technique to dissect the non-convex cable model, with grasp quality autonomously labeled based on simulated grasping attempts. The CG-CNN is refined using this simulated dataset and enhanced through domain randomization techniques. Subsequently, the trained model predicts grasp quality, guiding the optimal grasp pose to the robot controller for execution. Grasping efficacy is assessed across both synthetic and real-world settings. Given our model implicit collision sensitivity, we achieved commendable success rates of 92.3% for known cables and 88.4% for unknown cables, surpassing c",
    "path": "papers/24/02/2402.14498.json",
    "total_tokens": 878,
    "translated_title": "在复杂环境中的碰撞感知电缆抓取方法",
    "translated_abstract": "我们介绍了一种专为在复杂环境中实现稳健电缆抓取而设计的碰撞感知卷积神经网络。利用物理仿真，我们生成一个大量数据集，模拟了电缆抓取的复杂性，考虑到电缆与机器人夹爪之间的潜在碰撞。我们使用近似凸分解技术来分析非凸电缆模型，根据模拟抓取尝试自动标记抓取质量。利用这个模拟数据集对CG-CNN进行了改进，并通过域随机化技术增强。随后，训练好的模型预测抓取质量，并将最佳抓取姿势指导给机器人控制器执行。我们评估了抓取效果在合成和真实世界设置下的表现。由于我们模型隐式的碰撞敏感性，我们取得了出色的成功率，对于已知电缆为92.3%，对于未知电缆为88.4%，超越了c。",
    "tldr": "提出了一种碰撞感知的电缆抓取方法，通过CG-CNN和数据集生成技术，在复杂环境中实现稳健电缆抓取，并取得了出色的成功率。",
    "en_tdlr": "A collision-aware cable grasping method is proposed, achieving robust cable grasping in cluttered environments using CG-CNN and dataset generation techniques, with commendable success rates."
}