{
    "title": "A simple method for joint evaluation of skill in directional forecasts of multiple variables",
    "abstract": "Forecasts for key macroeconomic variables are almost always made simultaneously by the same organizations, presented together, and used together in policy analyses and decision-makings. It is therefore important to know whether the forecasters are skillful enough to forecast the future values of those variables. Here a method for joint evaluation of skill in directional forecasts of multiple variables is introduced. The method is simple to use and does not rely on complicated assumptions required by the conventional statistical methods for measuring accuracy of directional forecast. The data on GDP growth and inflation forecasts of three organizations from Thailand, namely, the Bank of Thailand, the Fiscal Policy Office, and the Office of the National Economic and Social Development Council as well as the actual data on GDP growth and inflation of Thailand between 2001 and 2021 are employed in order to demonstrate how the method could be used to evaluate the skills of forecasters in pr",
    "link": "https://rss.arxiv.org/abs/2402.01142",
    "context": "Title: A simple method for joint evaluation of skill in directional forecasts of multiple variables\nAbstract: Forecasts for key macroeconomic variables are almost always made simultaneously by the same organizations, presented together, and used together in policy analyses and decision-makings. It is therefore important to know whether the forecasters are skillful enough to forecast the future values of those variables. Here a method for joint evaluation of skill in directional forecasts of multiple variables is introduced. The method is simple to use and does not rely on complicated assumptions required by the conventional statistical methods for measuring accuracy of directional forecast. The data on GDP growth and inflation forecasts of three organizations from Thailand, namely, the Bank of Thailand, the Fiscal Policy Office, and the Office of the National Economic and Social Development Council as well as the actual data on GDP growth and inflation of Thailand between 2001 and 2021 are employed in order to demonstrate how the method could be used to evaluate the skills of forecasters in pr",
    "path": "papers/24/02/2402.01142.json",
    "total_tokens": 819,
    "translated_title": "一种用于多变量方向预测技能联合评估的简单方法",
    "translated_abstract": "主要宏观经济变量的预测通常由同一组织同时进行，并且在政策分析和决策中一起呈现和使用。因此，了解预测者是否具备足够的技能来预测这些变量的未来值非常重要。本文介绍了一种用于联合评估多变量方向预测技能的简单方法。该方法易于使用，不依赖于传统统计方法中衡量方向预测准确性所需的复杂假设。采用泰国三个组织（泰国银行、财政政策办公室和国家经济和社会发展委员会办公室）关于2001年至2021年间泰国GDP增长和通胀预测以及实际数据，以演示该方法如何用于评估预测者的技能。",
    "tldr": "本文介绍了一种用于联合评估多变量方向预测技能的简单方法，并利用泰国三个组织在2001年至2021年间的GDP增长和通胀预测数据，展示了该方法的应用。"
}