{
    "title": "Mechanics-Informed Autoencoder Enables Automated Detection and Localization of Unforeseen Structural Damage",
    "abstract": "arXiv:2402.15492v1 Announce Type: new  Abstract: Structural health monitoring (SHM) is vital for ensuring the safety and longevity of structures like buildings and bridges. As the volume and scale of structures and the impact of their failure continue to grow, there is a dire need for SHM techniques that are scalable, inexpensive, operate passively without human intervention, and customized for each mechanical structure without the need for complex baseline models. We present a novel \"deploy-and-forget\" approach for automated detection and localization of damages in structures. It is based on a synergistic combination of fully passive measurements from inexpensive sensors and a mechanics-informed autoencoder. Once deployed, our solution continuously learns and adapts a bespoke baseline model for each structure, learning from its undamaged state's response characteristics. After learning from just 3 hours of data, it can autonomously detect and localize different types of unforeseen dam",
    "link": "https://arxiv.org/abs/2402.15492",
    "context": "Title: Mechanics-Informed Autoencoder Enables Automated Detection and Localization of Unforeseen Structural Damage\nAbstract: arXiv:2402.15492v1 Announce Type: new  Abstract: Structural health monitoring (SHM) is vital for ensuring the safety and longevity of structures like buildings and bridges. As the volume and scale of structures and the impact of their failure continue to grow, there is a dire need for SHM techniques that are scalable, inexpensive, operate passively without human intervention, and customized for each mechanical structure without the need for complex baseline models. We present a novel \"deploy-and-forget\" approach for automated detection and localization of damages in structures. It is based on a synergistic combination of fully passive measurements from inexpensive sensors and a mechanics-informed autoencoder. Once deployed, our solution continuously learns and adapts a bespoke baseline model for each structure, learning from its undamaged state's response characteristics. After learning from just 3 hours of data, it can autonomously detect and localize different types of unforeseen dam",
    "path": "papers/24/02/2402.15492.json",
    "total_tokens": 785,
    "translated_title": "机械信息自编码器实现自动检测和定位意外的结构损伤",
    "translated_abstract": "结构健康监测（SHM）对于确保建筑物和桥梁等结构的安全性和长寿命至关重要。本文提出了一种基于机械信息自编码器的新颖的“部署和忘记”方法，用于自动检测和定位结构中的损伤。这种方法基于廉价传感器的全 pass 学习和机械信息自编码器的协同组合，在仅学习了 3 小时的数据后，就能自主检测和定位不同类型的意外损伤。",
    "tldr": "该研究提出了一种新颖的\"部署和忘记\"方法，结合廉价传感器和机械信息自编码器，实现了对结构损伤的自动检测和定位，仅需学习3小时数据即可自主识别和定位不同类型的未知损伤。",
    "en_tdlr": "This study proposes a novel \"deploy-and-forget\" approach that combines inexpensive sensors and a mechanics-informed autoencoder to achieve automated detection and localization of structural damage, which can autonomously identify and locate different types of unknown damages after learning from 3 hours of data."
}