{
    "title": "SzCORE: A Seizure Community Open-source Research Evaluation framework for the validation of EEG-based automated seizure detection algorithms",
    "abstract": "arXiv:2402.13005v1 Announce Type: cross  Abstract: The need for high-quality automated seizure detection algorithms based on electroencephalography (EEG) becomes ever more pressing with the increasing use of ambulatory and long-term EEG monitoring. Heterogeneity in validation methods of these algorithms influences the reported results and makes comprehensive evaluation and comparison challenging. This heterogeneity concerns in particular the choice of datasets, evaluation methodologies, and performance metrics. In this paper, we propose a unified framework designed to establish standardization in the validation of EEG-based seizure detection algorithms. Based on existing guidelines and recommendations, the framework introduces a set of recommendations and standards related to datasets, file formats, EEG data input content, seizure annotation input and output, cross-validation strategies, and performance metrics. We also propose the 10-20 seizure detection benchmark, a machine-learning ",
    "link": "https://arxiv.org/abs/2402.13005",
    "context": "Title: SzCORE: A Seizure Community Open-source Research Evaluation framework for the validation of EEG-based automated seizure detection algorithms\nAbstract: arXiv:2402.13005v1 Announce Type: cross  Abstract: The need for high-quality automated seizure detection algorithms based on electroencephalography (EEG) becomes ever more pressing with the increasing use of ambulatory and long-term EEG monitoring. Heterogeneity in validation methods of these algorithms influences the reported results and makes comprehensive evaluation and comparison challenging. This heterogeneity concerns in particular the choice of datasets, evaluation methodologies, and performance metrics. In this paper, we propose a unified framework designed to establish standardization in the validation of EEG-based seizure detection algorithms. Based on existing guidelines and recommendations, the framework introduces a set of recommendations and standards related to datasets, file formats, EEG data input content, seizure annotation input and output, cross-validation strategies, and performance metrics. We also propose the 10-20 seizure detection benchmark, a machine-learning ",
    "path": "papers/24/02/2402.13005.json",
    "total_tokens": 810,
    "translated_title": "SzCORE：用于验证基于脑电图的自动癫痫检测算法的癫痫社区开源研究评估框架",
    "translated_abstract": "随着家庭和长期脑电图监测的增加，基于脑电图的高质量自动癫痫检测算法的需求变得更加迫切。这些算法验证方法的异质性影响了报告的结果，并使全面评估和比较变得具有挑战性。该异质性主要涉及数据集的选择、评估方法和性能度量等方面。本文提出了一个统一的框架，旨在建立EEG基础癫痫检测算法验证的标准化。基于现有指南和建议，该框架引入了一组关于数据集、文件格式、EEG数据输入内容、癫痫注释输入和输出、交叉验证策略以及性能度量的建议和标准。",
    "tldr": "提出了SzCORE框架，用于验证基于脑电图的自动癫痫检测算法，旨在标准化验证方法，包括数据集、文件格式、输入内容、性能度量等。",
    "en_tdlr": "Introducing SzCORE framework for validating EEG-based automated seizure detection algorithms to standardize validation methods including datasets, file formats, input content, performance metrics, etc."
}