{
    "title": "Robust Appointment Scheduling with Waiting Time Guarantees",
    "abstract": "arXiv:2402.12561v1 Announce Type: new  Abstract: Appointment scheduling problems under uncertainty encounter a fundamental trade-off between cost minimization and customer waiting times. Most existing studies address this trade-off using a weighted sum approach, which puts little emphasis on individual waiting times and, thus, customer satisfaction. In contrast, we study how to minimize total cost while providing waiting time guarantees to all customers. Given box uncertainty sets for service times and no-shows, we introduce the Robust Appointment Scheduling Problem with Waiting Time Guarantees. We show that the problem is NP-hard in general and introduce a mixed-integer linear program that can be solved in reasonable computation time. For special cases, we prove that polynomial-time variants of the well-known Smallest-Variance-First sequencing rule and the Bailey-Welch scheduling rule are optimal. Furthermore, a case study with data from the radiology department of a large university ",
    "link": "https://arxiv.org/abs/2402.12561",
    "context": "Title: Robust Appointment Scheduling with Waiting Time Guarantees\nAbstract: arXiv:2402.12561v1 Announce Type: new  Abstract: Appointment scheduling problems under uncertainty encounter a fundamental trade-off between cost minimization and customer waiting times. Most existing studies address this trade-off using a weighted sum approach, which puts little emphasis on individual waiting times and, thus, customer satisfaction. In contrast, we study how to minimize total cost while providing waiting time guarantees to all customers. Given box uncertainty sets for service times and no-shows, we introduce the Robust Appointment Scheduling Problem with Waiting Time Guarantees. We show that the problem is NP-hard in general and introduce a mixed-integer linear program that can be solved in reasonable computation time. For special cases, we prove that polynomial-time variants of the well-known Smallest-Variance-First sequencing rule and the Bailey-Welch scheduling rule are optimal. Furthermore, a case study with data from the radiology department of a large university ",
    "path": "papers/24/02/2402.12561.json",
    "total_tokens": 916,
    "translated_title": "具有等待时间保证的稳健预约调度",
    "translated_abstract": "在不确定性条件下进行的预约调度问题面临着成本最小化和客户等待时间之间的基本权衡。大多数现有研究采用加权和方法来解决这一权衡，这种方法很少强调个体等待时间，因此对客户满意度关注较少。相反，我们研究了如何在为所有客户提供等待时间保证的同时最小化总成本。鉴于服务时间和客户未到的盒状不确定性集，我们引入了具有等待时间保证的稳健预约调度问题。我们证明了该问题在一般情况下是NP困难的，并引入了一个可以在合理计算时间内解决的混合整数线性规划。对于特殊情况，我们证明了众所周知的最小方差优先排序规则和贝利-韦尔奇调度规则的多项式时间变体是最优的。此外，我们进行了一个案例研究，使用了一个大型大学放射学部门的数据",
    "tldr": "该研究提出了具有等待时间保证的稳健预约调度问题，旨在同时最小化总成本并提供所有客户等待时间保证，通过引入混合整数线性规划解决了这一NP困难问题，并证明了特殊情况下采用的两种调度规则的最优性。",
    "en_tdlr": "The study introduces the Robust Appointment Scheduling Problem with Waiting Time Guarantees, aiming to minimize total cost while providing waiting time guarantees to all customers. It solves this NP-hard problem by introducing a mixed-integer linear program and proves optimality of two scheduling rules for special cases."
}