{
    "title": "Acute kidney injury prediction for non-critical care patients: a retrospective external and internal validation study",
    "abstract": "Background: Acute kidney injury (AKI), the decline of kidney excretory function, occurs in up to 18% of hospitalized admissions. Progression of AKI may lead to irreversible kidney damage. Methods: This retrospective cohort study includes adult patients admitted to a non-intensive care unit at the University of Pittsburgh Medical Center (UPMC) (n = 46,815) and University of Florida Health (UFH) (n = 127,202). We developed and compared deep learning and conventional machine learning models to predict progression to Stage 2 or higher AKI within the next 48 hours. We trained local models for each site (UFH Model trained on UFH, UPMC Model trained on UPMC) and a separate model with a development cohort of patients from both sites (UFH-UPMC Model). We internally and externally validated the models on each site and performed subgroup analyses across sex and race. Results: Stage 2 or higher AKI occurred in 3% (n=3,257) and 8% (n=2,296) of UFH and UPMC patients, respectively. Area under the rec",
    "link": "https://arxiv.org/abs/2402.04209",
    "context": "Title: Acute kidney injury prediction for non-critical care patients: a retrospective external and internal validation study\nAbstract: Background: Acute kidney injury (AKI), the decline of kidney excretory function, occurs in up to 18% of hospitalized admissions. Progression of AKI may lead to irreversible kidney damage. Methods: This retrospective cohort study includes adult patients admitted to a non-intensive care unit at the University of Pittsburgh Medical Center (UPMC) (n = 46,815) and University of Florida Health (UFH) (n = 127,202). We developed and compared deep learning and conventional machine learning models to predict progression to Stage 2 or higher AKI within the next 48 hours. We trained local models for each site (UFH Model trained on UFH, UPMC Model trained on UPMC) and a separate model with a development cohort of patients from both sites (UFH-UPMC Model). We internally and externally validated the models on each site and performed subgroup analyses across sex and race. Results: Stage 2 or higher AKI occurred in 3% (n=3,257) and 8% (n=2,296) of UFH and UPMC patients, respectively. Area under the rec",
    "path": "papers/24/02/2402.04209.json",
    "total_tokens": 1093,
    "translated_title": "非危重病患者急性肾损伤预测：回顾性外部和内部验证研究",
    "translated_abstract": "背景：急性肾损伤（AKI），即肾排泄功能下降，在住院患者中发生的比例高达18%。AKI的进展可能导致不可逆的肾脏损伤。方法：本回顾性队列研究包括在匹兹堡大学医疗中心（UPMC）的非重症监护病房接受治疗的成年患者（n=46,815），以及在佛罗里达大学健康中心（UFH）接受治疗的成年患者（n=127,202）。我们开发并比较了深度学习和传统机器学习模型，以预测接下来48小时内进展至2期或更高程度的AKI。我们分别为各个医院训练本地模型（在UFH上训练的UFH模型，以及在UPMC上训练的UPMC模型），并使用两个医院的发展队列患者开发了一个独立的模型（UFH-UPMC模型）。我们在每个医院内外部验证了这些模型，并进行了性别和种族的亚组分析。结果：UFH和UPMC的患者中，2期或更高程度的AKI分别发生在3%（n=3,257）和8%（n=2,296）的患者中。roc积分率",
    "tldr": "这项研究开发并比较了深度学习和传统机器学习模型，用于预测非危重病患者在接下来48小时内发展为2期或更高程度的急性肾损伤。内外部验证和亚组分析表明模型的有效性和稳定性。",
    "en_tdlr": "This study developed and compared deep learning and conventional machine learning models for predicting progression to Stage 2 or higher acute kidney injury in non-critical care patients within the next 48 hours. Internal and external validation, as well as subgroup analysis, demonstrated the effectiveness and stability of the models."
}