{
    "title": "LTAU-FF: Loss Trajectory Analysis for Uncertainty in Atomistic Force Fields",
    "abstract": "Model ensembles are simple and effective tools for estimating the prediction uncertainty of deep learning atomistic force fields. Despite this, widespread adoption of ensemble-based uncertainty quantification (UQ) techniques is limited by the high computational costs incurred by ensembles during both training and inference. In this work we leverage the cumulative distribution functions (CDFs) of per-sample errors obtained over the course of training to efficiently represent the model ensemble, and couple them with a distance-based similarity search in the model latent space. Using these tools, we develop a simple UQ metric (which we call LTAU) that leverages the strengths of ensemble-based techniques without requiring the evaluation of multiple models during either training or inference. As an initial test, we apply our method towards estimating the epistemic uncertainty in atomistic force fields (LTAU-FF) and demonstrate that it can be easily calibrated to accurately predict test erro",
    "link": "https://arxiv.org/abs/2402.00853",
    "context": "Title: LTAU-FF: Loss Trajectory Analysis for Uncertainty in Atomistic Force Fields\nAbstract: Model ensembles are simple and effective tools for estimating the prediction uncertainty of deep learning atomistic force fields. Despite this, widespread adoption of ensemble-based uncertainty quantification (UQ) techniques is limited by the high computational costs incurred by ensembles during both training and inference. In this work we leverage the cumulative distribution functions (CDFs) of per-sample errors obtained over the course of training to efficiently represent the model ensemble, and couple them with a distance-based similarity search in the model latent space. Using these tools, we develop a simple UQ metric (which we call LTAU) that leverages the strengths of ensemble-based techniques without requiring the evaluation of multiple models during either training or inference. As an initial test, we apply our method towards estimating the epistemic uncertainty in atomistic force fields (LTAU-FF) and demonstrate that it can be easily calibrated to accurately predict test erro",
    "path": "papers/24/02/2402.00853.json",
    "total_tokens": 907,
    "translated_title": "LTAU-FF: 原子力场中不确定性的损失轨迹分析",
    "translated_abstract": "模型集合是估计深度学习原子力场预测不确定性的简单而有效的工具。尽管如此，使用基于集合的不确定度量技术的广泛应用受到训练和推理过程中集合产生的高计算成本的限制。在这项工作中，我们利用在训练过程中获得的逐样本误差的累积分布函数（CDF）来高效表示模型集合，并将它们与基于距离的模型潜空间中的相似性搜索相结合。利用这些工具，我们开发了一个简单的不确定度量指标（称为LTAU），它在训练或推理过程中无需评估多个模型，同时发挥了集合技术的优势。作为初始测试，我们将我们的方法应用于估计原子力场中的认知不确定性（LTAU-FF），并证明它可以被轻松地校准以准确预测测试误差。",
    "tldr": "LTAU-FF是一种利用损失轨迹分析来估计原子力场中不确定性的方法，通过累积分布函数和模型潜空间的相似性搜索，实现了高效的模型集合表示和不确定度量，无需评估多个模型，能准确预测测试误差。",
    "en_tdlr": "LTAU-FF is a method for estimating uncertainty in atomistic force fields using loss trajectory analysis. It efficiently represents the model ensemble and measures uncertainty using cumulative distribution functions and similarity search in the model latent space. It does not require the evaluation of multiple models and accurately predicts test errors."
}