{
    "title": "A survey of recent methods for addressing AI fairness and bias in biomedicine",
    "abstract": "Artificial intelligence (AI) systems have the potential to revolutionize clinical practices, including improving diagnostic accuracy and surgical decision-making, while also reducing costs and manpower. However, it is important to recognize that these systems may perpetuate social inequities or demonstrate biases, such as those based on race or gender. Such biases can occur before, during, or after the development of AI models, making it critical to understand and address potential biases to enable the accurate and reliable application of AI models in clinical settings. To mitigate bias concerns during model development, we surveyed recent publications on different debiasing methods in the fields of biomedical natural language processing (NLP) or computer vision (CV). Then we discussed the methods that have been applied in the biomedical domain to address bias. We performed our literature search on PubMed, ACM digital library, and IEEE Xplore of relevant articles published between Janu",
    "link": "https://arxiv.org/abs/2402.08250",
    "context": "Title: A survey of recent methods for addressing AI fairness and bias in biomedicine\nAbstract: Artificial intelligence (AI) systems have the potential to revolutionize clinical practices, including improving diagnostic accuracy and surgical decision-making, while also reducing costs and manpower. However, it is important to recognize that these systems may perpetuate social inequities or demonstrate biases, such as those based on race or gender. Such biases can occur before, during, or after the development of AI models, making it critical to understand and address potential biases to enable the accurate and reliable application of AI models in clinical settings. To mitigate bias concerns during model development, we surveyed recent publications on different debiasing methods in the fields of biomedical natural language processing (NLP) or computer vision (CV). Then we discussed the methods that have been applied in the biomedical domain to address bias. We performed our literature search on PubMed, ACM digital library, and IEEE Xplore of relevant articles published between Janu",
    "path": "papers/24/02/2402.08250.json",
    "total_tokens": 913,
    "translated_title": "最近解决生物医学中人工智能公平性和偏见的方法综述",
    "translated_abstract": "人工智能系统具有改革临床实践的潜力，包括提高诊断准确性和手术决策，同时减少成本和人力。然而，需要认识到这些系统可能会延续社会不平等或展示基于种族或性别的偏见。这些偏见可能发生在AI模型的开发之前、期间或之后，因此了解和解决潜在的偏见对于在临床环境中准确可靠地应用AI模型至关重要。为了缓解模型开发过程中的偏见问题，我们调查了近期在生物医学自然语言处理（NLP）或计算机视觉（CV）领域中应用的不同去偏方法的文献。然后我们讨论了在生物医学领域中应用的解决偏见的方法。我们在PubMed、ACM数字图书馆和IEEE Xplore上执行了文献搜索，内容涵盖了相关文章的发布在1月之间。",
    "tldr": "这篇论文综述了近期用于解决生物医学中人工智能公平性和偏见的方法。研究指出，在开发AI模型过程中可能存在偏见，因此需要采取措施来识别和解决这些偏见以确保在临床环境中准确可靠地应用AI模型。"
}