{
    "title": "On the Cross-Dataset Generalization of Machine Learning for Network Intrusion Detection",
    "abstract": "arXiv:2402.10974v1 Announce Type: cross  Abstract: Network Intrusion Detection Systems (NIDS) are a fundamental tool in cybersecurity. Their ability to generalize across diverse networks is a critical factor in their effectiveness and a prerequisite for real-world applications. In this study, we conduct a comprehensive analysis on the generalization of machine-learning-based NIDS through an extensive experimentation in a cross-dataset framework. We employ four machine learning classifiers and utilize four datasets acquired from different networks: CIC-IDS-2017, CSE-CIC-IDS2018, LycoS-IDS2017, and LycoS-Unicas-IDS2018. Notably, the last dataset is a novel contribution, where we apply corrections based on LycoS-IDS2017 to the well-known CSE-CIC-IDS2018 dataset. The results show nearly perfect classification performance when the models are trained and tested on the same dataset. However, when training and testing the models in a cross-dataset fashion, the classification accuracy is largel",
    "link": "https://arxiv.org/abs/2402.10974",
    "context": "Title: On the Cross-Dataset Generalization of Machine Learning for Network Intrusion Detection\nAbstract: arXiv:2402.10974v1 Announce Type: cross  Abstract: Network Intrusion Detection Systems (NIDS) are a fundamental tool in cybersecurity. Their ability to generalize across diverse networks is a critical factor in their effectiveness and a prerequisite for real-world applications. In this study, we conduct a comprehensive analysis on the generalization of machine-learning-based NIDS through an extensive experimentation in a cross-dataset framework. We employ four machine learning classifiers and utilize four datasets acquired from different networks: CIC-IDS-2017, CSE-CIC-IDS2018, LycoS-IDS2017, and LycoS-Unicas-IDS2018. Notably, the last dataset is a novel contribution, where we apply corrections based on LycoS-IDS2017 to the well-known CSE-CIC-IDS2018 dataset. The results show nearly perfect classification performance when the models are trained and tested on the same dataset. However, when training and testing the models in a cross-dataset fashion, the classification accuracy is largel",
    "path": "papers/24/02/2402.10974.json",
    "total_tokens": 897,
    "translated_title": "论机器学习在网络入侵检测中的跨数据集泛化能力",
    "translated_abstract": "网络入侵检测系统(NIDS)是网络安全中的基本工具。它们在不同网络中的泛化能力是其有效性的关键因素，也是实际应用的先决条件。在本研究中，我们通过在跨数据集框架中进行全面实验，对基于机器学习的NIDS的泛化能力进行了综合分析。我们采用了四种机器学习分类器，并利用了来自不同网络的四个数据集：CIC-IDS-2017、CSE-CIC-IDS2018、LycoS-IDS2017和LycoS-Unicas-IDS2018。值得注意的是，最后一个数据集是一个创新贡献，我们在这个数据集上基于LycoS-IDS2017的修正对知名的CSE-CIC-IDS2018数据集进行了应用。结果显示，当模型在同一数据集上进行训练和测试时，几乎完美的分类性能。然而，当以跨数据集的方式训练和测试模型时，分类准确度会大幅程度地降低。",
    "tldr": "该研究通过在跨数据集框架中进行实验，对基于机器学习的网络入侵检测系统的泛化能力进行了综合分析，并提出了一个创新的数据集对其进行验证。"
}