{
    "title": "QuantAgent: Seeking Holy Grail in Trading by Self-Improving Large Language Model",
    "abstract": "Autonomous agents based on Large Language Models (LLMs) that devise plans and tackle real-world challenges have gained prominence.However, tailoring these agents for specialized domains like quantitative investment remains a formidable task. The core challenge involves efficiently building and integrating a domain-specific knowledge base for the agent's learning process. This paper introduces a principled framework to address this challenge, comprising a two-layer loop.In the inner loop, the agent refines its responses by drawing from its knowledge base, while in the outer loop, these responses are tested in real-world scenarios to automatically enhance the knowledge base with new insights.We demonstrate that our approach enables the agent to progressively approximate optimal behavior with provable efficiency.Furthermore, we instantiate this framework through an autonomous agent for mining trading signals named QuantAgent. Empirical results showcase QuantAgent's capability in uncoverin",
    "link": "https://arxiv.org/abs/2402.03755",
    "context": "Title: QuantAgent: Seeking Holy Grail in Trading by Self-Improving Large Language Model\nAbstract: Autonomous agents based on Large Language Models (LLMs) that devise plans and tackle real-world challenges have gained prominence.However, tailoring these agents for specialized domains like quantitative investment remains a formidable task. The core challenge involves efficiently building and integrating a domain-specific knowledge base for the agent's learning process. This paper introduces a principled framework to address this challenge, comprising a two-layer loop.In the inner loop, the agent refines its responses by drawing from its knowledge base, while in the outer loop, these responses are tested in real-world scenarios to automatically enhance the knowledge base with new insights.We demonstrate that our approach enables the agent to progressively approximate optimal behavior with provable efficiency.Furthermore, we instantiate this framework through an autonomous agent for mining trading signals named QuantAgent. Empirical results showcase QuantAgent's capability in uncoverin",
    "path": "papers/24/02/2402.03755.json",
    "total_tokens": 926,
    "translated_title": "QuantAgent：通过自我提升的大型语言模型在交易中寻求圣杯",
    "translated_abstract": "基于大型语言模型（LLMs）的自主代理，在制定计划和应对现实世界挑战方面已经引起了重视。然而，将这些代理定制为量化投资等专业领域仍然是一项艰巨的任务。核心挑战在于为代理的学习过程高效地构建和集成领域特定的知识库。本文介绍了一个有原则的框架来解决这个挑战，包括一个两层循环。在内层循环中，代理通过从知识库中获取信息来改进其响应，而在外层循环中，这些响应在现实场景中进行测试，以自动增强知识库。我们证明了我们的方法使代理能够逐步逼近具有可证明效率的最佳行为。此外，我们通过一个名为QuantAgent的自主代理来实现这个框架，用于挖掘交易信号。实证结果展示了QuantAgent在发现交易信号方面的能力。",
    "tldr": "本论文介绍了一种基于大型语言模型的自主代理框架QuantAgent，通过一个有原则的两层循环，使代理能够逐步逼近具有可证明效率的最佳行为。该框架通过构建和集成领域特定的知识库，在量化投资领域展示出了较强的能力。"
}