{
    "title": "Modeling Spatio-temporal Dynamical Systems with Neural Discrete Learning and Levels-of-Experts",
    "abstract": "In this paper, we address the issue of modeling and estimating changes in the state of the spatio-temporal dynamical systems based on a sequence of observations like video frames. Traditional numerical simulation systems depend largely on the initial settings and correctness of the constructed partial differential equations (PDEs). Despite recent efforts yielding significant success in discovering data-driven PDEs with neural networks, the limitations posed by singular scenarios and the absence of local insights prevent them from performing effectively in a broader real-world context. To this end, this paper propose the universal expert module -- that is, optical flow estimation component, to capture the evolution laws of general physical processes in a data-driven fashion. To enhance local insight, we painstakingly design a finer-grained physical pipeline, since local characteristics may be influenced by various internal contextual information, which may contradict the macroscopic pro",
    "link": "https://arxiv.org/abs/2402.05970",
    "context": "Title: Modeling Spatio-temporal Dynamical Systems with Neural Discrete Learning and Levels-of-Experts\nAbstract: In this paper, we address the issue of modeling and estimating changes in the state of the spatio-temporal dynamical systems based on a sequence of observations like video frames. Traditional numerical simulation systems depend largely on the initial settings and correctness of the constructed partial differential equations (PDEs). Despite recent efforts yielding significant success in discovering data-driven PDEs with neural networks, the limitations posed by singular scenarios and the absence of local insights prevent them from performing effectively in a broader real-world context. To this end, this paper propose the universal expert module -- that is, optical flow estimation component, to capture the evolution laws of general physical processes in a data-driven fashion. To enhance local insight, we painstakingly design a finer-grained physical pipeline, since local characteristics may be influenced by various internal contextual information, which may contradict the macroscopic pro",
    "path": "papers/24/02/2402.05970.json",
    "total_tokens": 884,
    "translated_title": "使用神经离散学习和专家级别建模空时动力系统",
    "translated_abstract": "本文针对基于一系列观测（如视频帧）的空时动态系统中状态变化的建模和估计问题进行了研究。传统的数值模拟系统在很大程度上依赖于初始设置和构建的偏微分方程（PDE）的正确性。尽管最近利用神经网络发现了基于数据的PDE模型的重大成功，但是奇异场景和缺乏局部洞察力的限制阻碍了它们在更广泛的现实世界背景下的有效性。为此，本文提出了通用的专家模块——光流估计组件，以数据驱动的方式捕捉一般物理过程的演化规律。为了增强局部洞察力，我们精心设计了一个更精细的物理流水线，因为局部特征可能受到各种内部上下文信息的影响，这可能与宏观属性相矛盾。",
    "tldr": "本文提出了使用神经离散学习和专家级别建模空时动力系统的方法。通过引入通用的专家模块和精细设计的物理流水线，可以在更广泛的现实世界背景下有效地建模和估计空时动态系统的状态变化。",
    "en_tdlr": "This paper proposes a method for modeling spatio-temporal dynamical systems using neural discrete learning and levels-of-experts. By introducing a universal expert module and a finer-grained physical pipeline, it enables effective modeling and estimation of state changes in spatio-temporal dynamical systems in a broader real-world context."
}