{
    "title": "A Multi-faceted Semi-Synthetic Dataset for Automated Cyberbullying Detection",
    "abstract": "arXiv:2402.10231v1 Announce Type: cross  Abstract: In recent years, the rising use of social media has propelled automated cyberbullying detection into a prominent research domain. However, challenges persist due to the absence of a standardized definition and universally accepted datasets. Many researchers now view cyberbullying as a facet of cyberaggression, encompassing factors like repetition, peer relationships, and harmful intent in addition to online aggression. Acquiring comprehensive data reflective of all cyberbullying components from social media networks proves to be a complex task. This paper provides a description of an extensive semi-synthetic cyberbullying dataset that incorporates all of the essential aspects of cyberbullying, including aggression, repetition, peer relationships, and intent to harm. The method of creating the dataset is succinctly outlined, and a detailed overview of the publicly accessible dataset is additionally presented. This accompanying data arti",
    "link": "https://arxiv.org/abs/2402.10231",
    "context": "Title: A Multi-faceted Semi-Synthetic Dataset for Automated Cyberbullying Detection\nAbstract: arXiv:2402.10231v1 Announce Type: cross  Abstract: In recent years, the rising use of social media has propelled automated cyberbullying detection into a prominent research domain. However, challenges persist due to the absence of a standardized definition and universally accepted datasets. Many researchers now view cyberbullying as a facet of cyberaggression, encompassing factors like repetition, peer relationships, and harmful intent in addition to online aggression. Acquiring comprehensive data reflective of all cyberbullying components from social media networks proves to be a complex task. This paper provides a description of an extensive semi-synthetic cyberbullying dataset that incorporates all of the essential aspects of cyberbullying, including aggression, repetition, peer relationships, and intent to harm. The method of creating the dataset is succinctly outlined, and a detailed overview of the publicly accessible dataset is additionally presented. This accompanying data arti",
    "path": "papers/24/02/2402.10231.json",
    "total_tokens": 785,
    "translated_title": "用于自动检测网络欺凌的多方面半合成数据集",
    "translated_abstract": "近年来，社交媒体的使用日益增长，推动了自动检测网络欺凌成为一个重要的研究领域。然而，由于缺乏标准定义和普遍接受的数据集，挑战依然存在。许多研究人员现在将网络欺凌视为网络侵略的一个方面，包括重复性、同行关系和有意伤害等因素，除了在线侵略。从社交媒体网络中获取反映所有网络欺凌组成部分的综合数据证明是一项复杂的任务。本文描述了一个包含网络欺凌的所有要素的广泛半合成网络欺凌数据集，并简要概述了创建数据集的方法，另外还提供了可公开访问的数据集的详细概述。",
    "tldr": "提供了一个包含网络欺凌所有要素的广泛半合成数据集，填补了自动检测网络欺凌领域的数据缺口",
    "en_tdlr": "This paper presents an extensive semi-synthetic dataset encompassing all essential aspects of cyberbullying, addressing the data gap in automated cyberbullying detection."
}