{
    "title": "DiffuseRAW: End-to-End Generative RAW Image Processing for Low-Light Images",
    "abstract": "arXiv:2402.18575v1 Announce Type: cross  Abstract: Imaging under extremely low-light conditions presents a significant challenge and is an ill-posed problem due to the low signal-to-noise ratio (SNR) caused by minimal photon capture. Previously, diffusion models have been used for multiple kinds of generative tasks and image-to-image tasks, however, these models work as a post-processing step. These diffusion models are trained on processed images and learn on processed images. However, such approaches are often not well-suited for extremely low-light tasks. Unlike the task of low-light image enhancement or image-to-image enhancement, we tackle the task of learning the entire image-processing pipeline, from the RAW image to a processed image. For this task, a traditional image processing pipeline often consists of multiple specialized parts that are overly reliant on the downstream tasks. Unlike these, we develop a new generative ISP that relies on fine-tuning latent diffusion models o",
    "link": "https://arxiv.org/abs/2402.18575",
    "context": "Title: DiffuseRAW: End-to-End Generative RAW Image Processing for Low-Light Images\nAbstract: arXiv:2402.18575v1 Announce Type: cross  Abstract: Imaging under extremely low-light conditions presents a significant challenge and is an ill-posed problem due to the low signal-to-noise ratio (SNR) caused by minimal photon capture. Previously, diffusion models have been used for multiple kinds of generative tasks and image-to-image tasks, however, these models work as a post-processing step. These diffusion models are trained on processed images and learn on processed images. However, such approaches are often not well-suited for extremely low-light tasks. Unlike the task of low-light image enhancement or image-to-image enhancement, we tackle the task of learning the entire image-processing pipeline, from the RAW image to a processed image. For this task, a traditional image processing pipeline often consists of multiple specialized parts that are overly reliant on the downstream tasks. Unlike these, we develop a new generative ISP that relies on fine-tuning latent diffusion models o",
    "path": "papers/24/02/2402.18575.json",
    "total_tokens": 828,
    "translated_title": "DiffuseRAW：端到端生成RAW图像处理用于低光照图像",
    "translated_abstract": "在极低光条件下成像面临着巨大挑战，由于最小光子捕获引起的低信噪比（SNR），这是一个逆问题。以前，扩散模型已经用于多种生成任务和图像到图像任务，但这些模型作为后处理步骤。这些扩散模型是在处理后的图像上训练的，并在处理后的图像上进行学习。然而，这种方法通常不适用于极低光任务。与低光图像增强或图像到图像增强任务不同，我们解决了从RAW图像到处理后图像的整个图像处理管道学习任务。对于这个任务，传统的图像处理管道通常由多个专门化部分组成，过度依赖下游任务。与这些不同，我们开发了一种新的生成ISP，依赖于微调潜在的扩散模型o",
    "tldr": "本研究提出了DiffuseRAW，一个端到端生成RAW图像处理方法，重点解决了低光照图像处理中整个图像处理管道学习的问题。",
    "en_tdlr": "The study proposes DiffuseRAW, an end-to-end generative RAW image processing method that focuses on learning the entire image processing pipeline for low-light image processing."
}