{
    "title": "Are Semi-Dense Detector-Free Methods Good at Matching Local Features?",
    "abstract": "Semi-dense detector-free approaches (SDF), such as LoFTR, are currently among the most popular image matching methods. While SDF methods are trained to establish correspondences between two images, their performances are almost exclusively evaluated using relative pose estimation metrics. Thus, the link between their ability to establish correspondences and the quality of the resulting estimated pose has thus far received little attention. This paper is a first attempt to study this link. We start with proposing a novel structured attention-based image matching architecture (SAM). It allows us to show a counter-intuitive result on two datasets (MegaDepth and HPatches): on the one hand SAM either outperforms or is on par with SDF methods in terms of pose/homography estimation metrics, but on the other hand SDF approaches are significantly better than SAM in terms of matching accuracy. We then propose to limit the computation of the matching accuracy to textured regions, and show that in",
    "link": "https://arxiv.org/abs/2402.08671",
    "context": "Title: Are Semi-Dense Detector-Free Methods Good at Matching Local Features?\nAbstract: Semi-dense detector-free approaches (SDF), such as LoFTR, are currently among the most popular image matching methods. While SDF methods are trained to establish correspondences between two images, their performances are almost exclusively evaluated using relative pose estimation metrics. Thus, the link between their ability to establish correspondences and the quality of the resulting estimated pose has thus far received little attention. This paper is a first attempt to study this link. We start with proposing a novel structured attention-based image matching architecture (SAM). It allows us to show a counter-intuitive result on two datasets (MegaDepth and HPatches): on the one hand SAM either outperforms or is on par with SDF methods in terms of pose/homography estimation metrics, but on the other hand SDF approaches are significantly better than SAM in terms of matching accuracy. We then propose to limit the computation of the matching accuracy to textured regions, and show that in",
    "path": "papers/24/02/2402.08671.json",
    "total_tokens": 988,
    "translated_title": "半稠密无检测器方法在匹配局部特征方面表现如何？",
    "translated_abstract": "半稠密无检测器方法（SDF），如LoFTR，目前是最受欢迎的图像匹配方法之一。虽然SDF方法被训练用于在两幅图像之间建立对应关系，但它们的性能几乎只使用相对位姿估计指标进行评估。因此，迄今为止，它们在建立对应关系的能力和估计位姿质量之间的联系得到的关注甚少。本文首次尝试研究这种联系。我们首先提出了一种新颖的基于结构化注意力的图像匹配架构（SAM）。它使我们能够在两个数据集（MegaDepth和HPatches）上展示一个逆直觉的结果：一方面，SAM在位姿/单应性估计指标方面要么优于SDF方法，要么与之相当；另一方面，SDF方法在匹配准确度方面明显优于SAM。然后，我们建议将匹配准确度的计算限制在纹理区域，并展示了在...",
    "tldr": "本研究首次尝试研究半稠密无检测器方法（SDF）建立对应关系能力和估计位姿质量之间的联系。作者提出了一种新颖的图像匹配架构SAM，并发现SAM在位姿估计方面表现优秀，而SDF方法在匹配准确度方面表现更好。作者建议将匹配准确度的计算限制在纹理区域。",
    "en_tdlr": "This study explores the link between the ability of semi-dense detector-free methods (SDF) to establish correspondences and the quality of estimated pose. The authors propose a novel image matching architecture, SAM, which outperforms SDF methods in terms of pose estimation but is surpassed by SDF methods in matching accuracy. The authors suggest limiting the computation of matching accuracy to textured regions."
}