{
    "title": "A non-intrusive machine learning framework for debiasing long-time coarse resolution climate simulations and quantifying rare events statistics",
    "abstract": "arXiv:2402.18484v1 Announce Type: cross  Abstract: Due to the rapidly changing climate, the frequency and severity of extreme weather is expected to increase over the coming decades. As fully-resolved climate simulations remain computationally intractable, policy makers must rely on coarse-models to quantify risk for extremes. However, coarse models suffer from inherent bias due to the ignored \"sub-grid\" scales. We propose a framework to non-intrusively debias coarse-resolution climate predictions using neural-network (NN) correction operators. Previous efforts have attempted to train such operators using loss functions that match statistics. However, this approach falls short with events that have longer return period than that of the training data, since the reference statistics have not converged. Here, the scope is to formulate a learning method that allows for correction of dynamics and quantification of extreme events with longer return period than the training data. The key obst",
    "link": "https://arxiv.org/abs/2402.18484",
    "context": "Title: A non-intrusive machine learning framework for debiasing long-time coarse resolution climate simulations and quantifying rare events statistics\nAbstract: arXiv:2402.18484v1 Announce Type: cross  Abstract: Due to the rapidly changing climate, the frequency and severity of extreme weather is expected to increase over the coming decades. As fully-resolved climate simulations remain computationally intractable, policy makers must rely on coarse-models to quantify risk for extremes. However, coarse models suffer from inherent bias due to the ignored \"sub-grid\" scales. We propose a framework to non-intrusively debias coarse-resolution climate predictions using neural-network (NN) correction operators. Previous efforts have attempted to train such operators using loss functions that match statistics. However, this approach falls short with events that have longer return period than that of the training data, since the reference statistics have not converged. Here, the scope is to formulate a learning method that allows for correction of dynamics and quantification of extreme events with longer return period than the training data. The key obst",
    "path": "papers/24/02/2402.18484.json",
    "total_tokens": 922,
    "translated_title": "一个非侵入式的机器学习框架，用于去偏粗分辨率气候模拟和量化罕见事件统计",
    "translated_abstract": "由于气候快速变化，预计未来几十年极端天气的频率和严重程度将会增加。 由于全分辨率气候模拟在计算上是棘手的，政策制定者必须依赖于粗模型来量化极端风险。 然而，粗模型由于忽视了“亚格”尺度而受到固有偏差的影响。 我们提出了一个框架，使用神经网络（NN）校正算子对粗分辨率气候预测进行非侵入式去偏。 先前的努力试图使用与统计匹配的损失函数来训练这样的算子。 然而，这种方法在具有比训练数据更长重现期的事件中表现不佳，因为参考统计数据尚未收敛。 在这里，我们的范围是制定一种学习方法，允许校正动态并量化具有比训练数据更长重现期的极端事件。",
    "tldr": "提出了一个非侵入式的机器学习框架，用于去偏粗分辨率气候模拟和量化罕见事件统计，并能够校正动态并量化具有比训练数据更长重现期的极端事件。",
    "en_tdlr": "Proposed a non-intrusive machine learning framework for debiasing coarse resolution climate simulations and quantifying rare events statistics, capable of correcting dynamics and quantifying extreme events with longer return period than the training data."
}