{
    "title": "Interference-Aware Emergent Random Access Protocol for Downlink LEO Satellite Networks",
    "abstract": "In this article, we propose a multi-agent deep reinforcement learning (MADRL) framework to train a multiple access protocol for downlink low earth orbit (LEO) satellite networks. By improving the existing learned protocol, emergent random access channel (eRACH), our proposed method, coined centralized and compressed emergent signaling for eRACH (Ce2RACH), can mitigate inter-satellite interference by exchanging additional signaling messages jointly learned through the MADRL training process. Simulations demonstrate that Ce2RACH achieves up to 36.65% higher network throughput compared to eRACH, while the cost of signaling messages increase linearly with the number of users.",
    "link": "https://arxiv.org/abs/2402.02350",
    "context": "Title: Interference-Aware Emergent Random Access Protocol for Downlink LEO Satellite Networks\nAbstract: In this article, we propose a multi-agent deep reinforcement learning (MADRL) framework to train a multiple access protocol for downlink low earth orbit (LEO) satellite networks. By improving the existing learned protocol, emergent random access channel (eRACH), our proposed method, coined centralized and compressed emergent signaling for eRACH (Ce2RACH), can mitigate inter-satellite interference by exchanging additional signaling messages jointly learned through the MADRL training process. Simulations demonstrate that Ce2RACH achieves up to 36.65% higher network throughput compared to eRACH, while the cost of signaling messages increase linearly with the number of users.",
    "path": "papers/24/02/2402.02350.json",
    "total_tokens": 902,
    "translated_title": "感知干扰的下行低地球轨道卫星网络中的新型随机接入协议",
    "translated_abstract": "本文提出了一个多智能体深度强化学习（MADRL）框架，用于训练下行低地球轨道（LEO）卫星网络的多址接入协议。通过改进现有的学习协议，即新型随机接入信道（eRACH），我们提出的方法，被命名为集中压缩的新型随机接入信令（Ce2RACH），可以通过在MADRL训练过程中联合学习的额外信令消息交换来减轻卫星间干扰。模拟结果表明，与eRACH相比，Ce2RACH的网络吞吐量高达36.65％，而信令消息的成本与用户数量线性增加。",
    "tldr": "本文提出了一个多智能体深度强化学习（MADRL）框架，用于训练下行低地球轨道（LEO）卫星网络的多址接入协议。我们的方法集中压缩了新型随机接入信令（Ce2RACH），通过联合学习的额外信令消息交换来减轻卫星间干扰，并实现了高达36.65％的网络吞吐量提升。",
    "en_tdlr": "This article proposes a multi-agent deep reinforcement learning (MADRL) framework for training a multiple access protocol for downlink low earth orbit (LEO) satellite networks. Our method, called centralized and compressed emergent signaling for eRACH (Ce2RACH), improves upon the existing learned protocol, eRACH, by mitigating inter-satellite interference through the exchange of additional signaling messages jointly learned through the MADRL training process. Simulations show that Ce2RACH achieves up to 36.65% higher network throughput compared to eRACH, with the cost of signaling messages increasing linearly with the number of users."
}