{
    "title": "HearHere: Mitigating Echo Chambers in News Consumption through an AI-based Web System",
    "abstract": "arXiv:2402.18222v1 Announce Type: cross  Abstract: Considerable efforts are currently underway to mitigate the negative impacts of echo chambers, such as increased susceptibility to fake news and resistance towards accepting scientific evidence. Prior research has presented the development of computer systems that support the consumption of news information from diverse political perspectives to mitigate the echo chamber effect. However, existing studies still lack the ability to effectively support the key processes of news information consumption and quantitatively identify a political stance towards the information. In this paper, we present HearHere, an AI-based web system designed to help users accommodate information and opinions from diverse perspectives. HearHere facilitates the key processes of news information consumption through two visualizations. Visualization 1 provides political news with quantitative political stance information, derived from our graph-based political c",
    "link": "https://arxiv.org/abs/2402.18222",
    "context": "Title: HearHere: Mitigating Echo Chambers in News Consumption through an AI-based Web System\nAbstract: arXiv:2402.18222v1 Announce Type: cross  Abstract: Considerable efforts are currently underway to mitigate the negative impacts of echo chambers, such as increased susceptibility to fake news and resistance towards accepting scientific evidence. Prior research has presented the development of computer systems that support the consumption of news information from diverse political perspectives to mitigate the echo chamber effect. However, existing studies still lack the ability to effectively support the key processes of news information consumption and quantitatively identify a political stance towards the information. In this paper, we present HearHere, an AI-based web system designed to help users accommodate information and opinions from diverse perspectives. HearHere facilitates the key processes of news information consumption through two visualizations. Visualization 1 provides political news with quantitative political stance information, derived from our graph-based political c",
    "path": "papers/24/02/2402.18222.json",
    "total_tokens": 674,
    "translated_title": "HearHere: 通过基于人工智能的网络系统缓解新闻消费中的“回声室”现象",
    "translated_abstract": "目前正在大力努力减轻“回声室”所带来的负面影响，包括更容易受到虚假新闻的影响以及对接受科学证据的抗拒。本文提出了HearHere，这是一个基于人工智能的网络系统，旨在帮助用户从不同视角融合信息和观点。HearHere通过两种可视化方式促进了新闻信息消费的关键流程。",
    "tldr": "HearHere是一个基于人工智能的网络系统，旨在帮助用户从不同视角融合信息和观点，以减轻新闻消费中“回声室”现象。",
    "en_tdlr": "HearHere is an AI-based web system designed to help users integrate information and perspectives from different angles to mitigate the echo chamber effect in news consumption."
}