{
    "title": "Enhancement of High-definition Map Update Service Through Coverage-aware and Reinforcement Learning",
    "abstract": "arXiv:2402.14582v1 Announce Type: cross  Abstract: High-definition (HD) Map systems will play a pivotal role in advancing autonomous driving to a higher level, thanks to the significant improvement over traditional two-dimensional (2D) maps. Creating an HD Map requires a huge amount of on-road and off-road data. Typically, these raw datasets are collected and uploaded to cloud-based HD map service providers through vehicular networks. Nevertheless, there are challenges in transmitting the raw data over vehicular wireless channels due to the dynamic topology. As the number of vehicles increases, there is a detrimental impact on service quality, which acts as a barrier to a real-time HD Map system for collaborative driving in Autonomous Vehicles (AV). In this paper, to overcome network congestion, a Q-learning coverage-time-awareness algorithm is presented to optimize the quality of service for vehicular networks and HD map updates. The algorithm is evaluated in an environment that imita",
    "link": "https://arxiv.org/abs/2402.14582",
    "context": "Title: Enhancement of High-definition Map Update Service Through Coverage-aware and Reinforcement Learning\nAbstract: arXiv:2402.14582v1 Announce Type: cross  Abstract: High-definition (HD) Map systems will play a pivotal role in advancing autonomous driving to a higher level, thanks to the significant improvement over traditional two-dimensional (2D) maps. Creating an HD Map requires a huge amount of on-road and off-road data. Typically, these raw datasets are collected and uploaded to cloud-based HD map service providers through vehicular networks. Nevertheless, there are challenges in transmitting the raw data over vehicular wireless channels due to the dynamic topology. As the number of vehicles increases, there is a detrimental impact on service quality, which acts as a barrier to a real-time HD Map system for collaborative driving in Autonomous Vehicles (AV). In this paper, to overcome network congestion, a Q-learning coverage-time-awareness algorithm is presented to optimize the quality of service for vehicular networks and HD map updates. The algorithm is evaluated in an environment that imita",
    "path": "papers/24/02/2402.14582.json",
    "total_tokens": 805,
    "translated_title": "通过覆盖感知和强化学习增强高清地图更新服务",
    "translated_abstract": "高清（HD）地图系统将在提升自动驾驶到更高水平中发挥关键作用，得益于相比传统二维地图的显著改进。创建HD地图需要大量的路面和非路面数据。通常，这些原始数据集通过车载网络收集并上传到基于云的HD地图服务提供商。然而，由于动态拓扑，通过车载无线通道传输原始数据存在一定挑战。随着车辆数量的增加，对服务质量产生不利影响，成为协同驾驶中实时HD地图系统在自动驾驶车辆中的障碍。本文提出了一种Q学习覆盖时间感知算法，以优化车载网络和HD地图更新的服务质量，以克服网络拥塞。该算法在一个模拟环境中进行评估，模拟了",
    "tldr": "本文提出了一种Q学习覆盖时间感知算法，以优化车载网络和HD地图更新的服务质量，以克服网络拥塞。"
}