{
    "title": "Learning the Market: Sentiment-Based Ensemble Trading Agents",
    "abstract": "We propose the integration of sentiment analysis and deep-reinforcement learning ensemble algorithms for stock trading, and design a strategy capable of dynamically altering its employed agent given concurrent market sentiment. In particular, we create a simple-yet-effective method for extracting news sentiment and combine this with general improvements upon existing works, resulting in automated trading agents that effectively consider both qualitative market factors and quantitative stock data. We show that our approach results in a strategy that is profitable, robust, and risk-minimal -- outperforming the traditional ensemble strategy as well as single agent algorithms and market metrics. Our findings determine that the conventional practice of switching ensemble agents every fixed-number of months is sub-optimal, and that a dynamic sentiment-based framework greatly unlocks additional performance within these agents. Furthermore, as we have designed our algorithm with simplicity and",
    "link": "https://rss.arxiv.org/abs/2402.01441",
    "context": "Title: Learning the Market: Sentiment-Based Ensemble Trading Agents\nAbstract: We propose the integration of sentiment analysis and deep-reinforcement learning ensemble algorithms for stock trading, and design a strategy capable of dynamically altering its employed agent given concurrent market sentiment. In particular, we create a simple-yet-effective method for extracting news sentiment and combine this with general improvements upon existing works, resulting in automated trading agents that effectively consider both qualitative market factors and quantitative stock data. We show that our approach results in a strategy that is profitable, robust, and risk-minimal -- outperforming the traditional ensemble strategy as well as single agent algorithms and market metrics. Our findings determine that the conventional practice of switching ensemble agents every fixed-number of months is sub-optimal, and that a dynamic sentiment-based framework greatly unlocks additional performance within these agents. Furthermore, as we have designed our algorithm with simplicity and",
    "path": "papers/24/02/2402.01441.json",
    "total_tokens": 983,
    "translated_title": "学习市场：基于情感的集成交易智能体",
    "translated_abstract": "我们提出了将情感分析和深度强化学习集成算法应用于股票交易，并设计了一种能够根据当前市场情绪动态调整所使用的智能体的策略。我们创建了一个简单但有效的方法来提取新闻情感，并将其与对现有作品的一般改进结合起来，从而得到有效考虑定性市场因素和定量股票数据的自动交易智能体。我们证明了我们的方法导致了一种盈利、稳健且风险最小的策略，优于传统的集成策略以及单一智能体算法和市场指标。我们的发现表明，传统的每隔固定月份更换集成智能体的做法并不是最优的，基于情感的动态框架极大地提升了这些智能体的性能。此外，由于我们的算法设计简单且...",
    "tldr": "该论文提出了将情感分析和深度强化学习集成算法应用于股票交易的方法，设计了可以根据市场情绪动态调整的交易策略。实验结果表明，这种方法比传统的集成策略、单一智能体算法和市场指标更具盈利性、稳健性和风险最小化。相关研究还发现，传统的固定更换集成智能体的做法并不是最优的，而基于情感的动态框架可以显著提高交易智能体的性能。"
}