{
    "title": "Efficient Parameter Mining and Freezing for Continual Object Detection",
    "abstract": "arXiv:2402.12624v1 Announce Type: cross  Abstract: Continual Object Detection is essential for enabling intelligent agents to interact proactively with humans in real-world settings. While parameter-isolation strategies have been extensively explored in the context of continual learning for classification, they have yet to be fully harnessed for incremental object detection scenarios. Drawing inspiration from prior research that focused on mining individual neuron responses and integrating insights from recent developments in neural pruning, we proposed efficient ways to identify which layers are the most important for a network to maintain the performance of a detector across sequential updates. The presented findings highlight the substantial advantages of layer-level parameter isolation in facilitating incremental learning within object detection models, offering promising avenues for future research and application in real-world scenarios.",
    "link": "https://arxiv.org/abs/2402.12624",
    "context": "Title: Efficient Parameter Mining and Freezing for Continual Object Detection\nAbstract: arXiv:2402.12624v1 Announce Type: cross  Abstract: Continual Object Detection is essential for enabling intelligent agents to interact proactively with humans in real-world settings. While parameter-isolation strategies have been extensively explored in the context of continual learning for classification, they have yet to be fully harnessed for incremental object detection scenarios. Drawing inspiration from prior research that focused on mining individual neuron responses and integrating insights from recent developments in neural pruning, we proposed efficient ways to identify which layers are the most important for a network to maintain the performance of a detector across sequential updates. The presented findings highlight the substantial advantages of layer-level parameter isolation in facilitating incremental learning within object detection models, offering promising avenues for future research and application in real-world scenarios.",
    "path": "papers/24/02/2402.12624.json",
    "total_tokens": 777,
    "translated_title": "高效参数挖掘和冻结用于连续目标检测",
    "translated_abstract": "持续目标检测对于使智能代理能够在现实环境中与人类进行积极互动至关重要。尽管参数隔离策略在持续学习分类的背景下已被广泛探讨，但在增量目标检测场景中尚未得到充分利用。受先前研究聚焦于挖掘单个神经元响应以及整合最近神经剪枝发展的启发，我们提出了高效的方法来识别哪些层对于网络来说是最重要的，以在顺序更新中维持检测器性能。所呈现的发现突显了在目标检测模型内进行层级参数隔离以促进增量学习的重大优势，为未来研究和在现实场景中应用提供了有前途的途径。",
    "tldr": "提出了在增量目标检测场景中利用高效的层级参数隔离方式，可以帮助网络保持检测器性能，并在对象检测模型内促进增量学习。"
}