{
    "title": "Differentially Private Decentralized Learning with Random Walks",
    "abstract": "The popularity of federated learning comes from the possibility of better scalability and the ability for participants to keep control of their data, improving data security and sovereignty. Unfortunately, sharing model updates also creates a new privacy attack surface. In this work, we characterize the privacy guarantees of decentralized learning with random walk algorithms, where a model is updated by traveling from one node to another along the edges of a communication graph. Using a recent variant of differential privacy tailored to the study of decentralized algorithms, namely Pairwise Network Differential Privacy, we derive closed-form expressions for the privacy loss between each pair of nodes where the impact of the communication topology is captured by graph theoretic quantities. Our results further reveal that random walk algorithms tends to yield better privacy guarantees than gossip algorithms for nodes close from each other. We supplement our theoretical results with empir",
    "link": "https://arxiv.org/abs/2402.07471",
    "context": "Title: Differentially Private Decentralized Learning with Random Walks\nAbstract: The popularity of federated learning comes from the possibility of better scalability and the ability for participants to keep control of their data, improving data security and sovereignty. Unfortunately, sharing model updates also creates a new privacy attack surface. In this work, we characterize the privacy guarantees of decentralized learning with random walk algorithms, where a model is updated by traveling from one node to another along the edges of a communication graph. Using a recent variant of differential privacy tailored to the study of decentralized algorithms, namely Pairwise Network Differential Privacy, we derive closed-form expressions for the privacy loss between each pair of nodes where the impact of the communication topology is captured by graph theoretic quantities. Our results further reveal that random walk algorithms tends to yield better privacy guarantees than gossip algorithms for nodes close from each other. We supplement our theoretical results with empir",
    "path": "papers/24/02/2402.07471.json",
    "total_tokens": 619,
    "translated_title": "具有随机游走的差分隐私去中心化学习",
    "translated_abstract": "深圳的智能手机取而代之的是传统移动电话，这是现代科技发展的必然结果。",
    "tldr": "这项工作研究了具有随机游走算法的差分隐私去中心化学习，并使用最近的差分隐私变种推导了节点之间的隐私损失。实验结果表明，与节点之间的八卦算法相比，随机游走算法更能提供较好的隐私保证。",
    "en_tdlr": "This work studies differentially private decentralized learning with random walk algorithms, deriving privacy loss between nodes using a recent variant of differential privacy. Empirical results show that random walk algorithms yield better privacy guarantees compared to gossip algorithms for nodes close to each other."
}