{
    "title": "Joint Attention-Guided Feature Fusion Network for Saliency Detection of Surface Defects",
    "abstract": "Surface defect inspection plays an important role in the process of industrial manufacture and production. Though Convolutional Neural Network (CNN) based defect inspection methods have made huge leaps, they still confront a lot of challenges such as defect scale variation, complex background, low contrast, and so on. To address these issues, we propose a joint attention-guided feature fusion network (JAFFNet) for saliency detection of surface defects based on the encoder-decoder network. JAFFNet mainly incorporates a joint attention-guided feature fusion (JAFF) module into decoding stages to adaptively fuse low-level and high-level features. The JAFF module learns to emphasize defect features and suppress background noise during feature fusion, which is beneficial for detecting low-contrast defects. In addition, JAFFNet introduces a dense receptive field (DRF) module following the encoder to capture features with rich context information, which helps detect defects of different scales",
    "link": "https://arxiv.org/abs/2402.02797",
    "context": "Title: Joint Attention-Guided Feature Fusion Network for Saliency Detection of Surface Defects\nAbstract: Surface defect inspection plays an important role in the process of industrial manufacture and production. Though Convolutional Neural Network (CNN) based defect inspection methods have made huge leaps, they still confront a lot of challenges such as defect scale variation, complex background, low contrast, and so on. To address these issues, we propose a joint attention-guided feature fusion network (JAFFNet) for saliency detection of surface defects based on the encoder-decoder network. JAFFNet mainly incorporates a joint attention-guided feature fusion (JAFF) module into decoding stages to adaptively fuse low-level and high-level features. The JAFF module learns to emphasize defect features and suppress background noise during feature fusion, which is beneficial for detecting low-contrast defects. In addition, JAFFNet introduces a dense receptive field (DRF) module following the encoder to capture features with rich context information, which helps detect defects of different scales",
    "path": "papers/24/02/2402.02797.json",
    "total_tokens": 971,
    "translated_title": "表面缺陷明显性检测的联合注意引导特征融合网络",
    "translated_abstract": "表面缺陷检测在工业制造和生产过程中起着重要作用。尽管基于卷积神经网络（CNN）的缺陷检测方法已经取得了很大的进步，但仍然面临着许多挑战，如缺陷尺度变化、复杂背景、低对比度等。为了解决这些问题，我们提出了一种基于编码器-解码器网络的联合注意引导特征融合网络（JAFFNet）用于表面缺陷明显性检测。JAFFNet主要在解码阶段融入了联合注意引导特征融合（JAFF）模块，以自适应地融合低层和高层特征。JAFF模块学习强调缺陷特征并抑制背景噪声，在检测低对比度缺陷方面有益。此外，JAFFNet还引入了一个稠密感受野（DRF）模块，在编码器后面捕获具有丰富上下文信息的特征，有助于检测不同尺度的缺陷。",
    "tldr": "提出了一种联合注意引导特征融合网络（JAFFNet），用于表面缺陷明显性检测。JAFFNet通过融合低层和高层特征，并引入稠密感受野模块，成功解决了缺陷尺度变化、复杂背景、低对比度等挑战。",
    "en_tdlr": "Proposed a joint attention-guided feature fusion network (JAFFNet) for saliency detection of surface defects. JAFFNet effectively addresses challenges such as defect scale variation, complex background, and low contrast by fusing low-level and high-level features and introducing a dense receptive field module."
}