{
    "title": "\"What's my model inside of?\": Exploring the role of environments for grounded natural language understanding",
    "abstract": "In contrast to classical cognitive science which studied brains in isolation, ecological approaches focused on the role of the body and environment in shaping cognition. Similarly, in this thesis we adopt an ecological approach to grounded natural language understanding (NLU) research. Grounded language understanding studies language understanding systems situated in the context of events, actions and precepts in naturalistic/simulated virtual environments. Where classic research tends to focus on designing new models and optimization methods while treating environments as given, we explore the potential of environment design for improving data collection and model development. We developed novel training and annotation approaches for procedural text understanding based on text-based game environments. We also drew upon embodied cognitive linguistics literature to propose a roadmap for grounded NLP research, and to inform the development of a new benchmark for measuring the progress of",
    "link": "https://arxiv.org/abs/2402.02548",
    "context": "Title: \"What's my model inside of?\": Exploring the role of environments for grounded natural language understanding\nAbstract: In contrast to classical cognitive science which studied brains in isolation, ecological approaches focused on the role of the body and environment in shaping cognition. Similarly, in this thesis we adopt an ecological approach to grounded natural language understanding (NLU) research. Grounded language understanding studies language understanding systems situated in the context of events, actions and precepts in naturalistic/simulated virtual environments. Where classic research tends to focus on designing new models and optimization methods while treating environments as given, we explore the potential of environment design for improving data collection and model development. We developed novel training and annotation approaches for procedural text understanding based on text-based game environments. We also drew upon embodied cognitive linguistics literature to propose a roadmap for grounded NLP research, and to inform the development of a new benchmark for measuring the progress of",
    "path": "papers/24/02/2402.02548.json",
    "total_tokens": 899,
    "translated_title": "\"我的模型在什么里面？\": 探索环境在基于实践的自然语言理解中的作用",
    "translated_abstract": "与研究孤立的大脑的经典认知科学不同，生态方法侧重于身体和环境在塑造认知过程中的作用。同样，在本论文中，我们采用了生态方法来研究基于实践的自然语言理解（NLU）。基于实践的语言理解研究将语言理解系统置于自然/模拟虚拟环境中的事件、动作和预期之中。与经典研究倾向于专注于设计新模型和优化方法，同时将环境视为给定的情况不同，我们探索了环境设计对于改进数据采集和模型开发的潜力。我们基于基于文本的游戏环境开发了新的训练和标注方法，用于程序化文本理解。我们还参考了基于体验的认知语言学文献，提出了基于实践的NLP研究路线图，并为衡量进展提供了一个新的基准。",
    "tldr": "本论文探索了环境对于改进基于实践的自然语言理解中数据采集和模型开发的潜力，通过开发新的训练方法和基准，采用生态方法研究基于实践的语言理解系统在自然/模拟虚拟环境中的角色。",
    "en_tdlr": "This thesis explores the potential of environment design for improving data collection and model development in grounded natural language understanding, using novel training methods and benchmarks, and adopting an ecological approach to study the role of language understanding systems situated in naturalistic/simulated virtual environments."
}