{
    "title": "Inevitability of Polarization in Geometric Opinion Exchange",
    "abstract": "Polarization and unexpected correlations between opinions on diverse topics (including in politics, culture and consumer choices) are an object of sustained attention. However, numerous theoretical models do not seem to convincingly explain these phenomena.   This paper is motivated by a recent line of work, studying models where polarization can be explained in terms of biased assimilation and geometric interplay between opinions on various topics. The agent opinions are represented as unit vectors on a multidimensional sphere and updated according to geometric rules. In contrast to previous work, we focus on the classical opinion exchange setting, where the agents update their opinions in discrete time steps, with a pair of agents interacting randomly at every step. The opinions are updated according to an update rule belonging to a general class.   Our findings are twofold. First, polarization appears to be ubiquitous in the class of models we study, requiring only relatively modest",
    "link": "https://arxiv.org/abs/2402.08446",
    "context": "Title: Inevitability of Polarization in Geometric Opinion Exchange\nAbstract: Polarization and unexpected correlations between opinions on diverse topics (including in politics, culture and consumer choices) are an object of sustained attention. However, numerous theoretical models do not seem to convincingly explain these phenomena.   This paper is motivated by a recent line of work, studying models where polarization can be explained in terms of biased assimilation and geometric interplay between opinions on various topics. The agent opinions are represented as unit vectors on a multidimensional sphere and updated according to geometric rules. In contrast to previous work, we focus on the classical opinion exchange setting, where the agents update their opinions in discrete time steps, with a pair of agents interacting randomly at every step. The opinions are updated according to an update rule belonging to a general class.   Our findings are twofold. First, polarization appears to be ubiquitous in the class of models we study, requiring only relatively modest",
    "path": "papers/24/02/2402.08446.json",
    "total_tokens": 843,
    "translated_title": "“几何观点交换中极化的必然性”",
    "translated_abstract": "极化和观点在政治、文化和消费选择等多个领域的意外相关性是受到持续关注的对象。然而，许多理论模型似乎无法令人信服地解释这些现象。本文受到最近的一系列研究的启发，研究了极化可以通过有偏倚的同化和观点之间的几何相互作用来解释的模型。代理人的观点被表示为多维球上的单位向量，并根据几何规则进行更新。与先前的工作不同，我们专注于经典的观点交换设定中，代理人在离散时间步骤中更新其观点，每一步中随机选择一对代理人进行交互。观点根据属于一个通用类别的更新规则进行更新。我们的发现有两个方面。首先，在我们研究的模型类中，极化似乎是普遍存在的，只需要相对较小的…",
    "tldr": "在这篇论文中，我们研究了几何观点交换中极化的必然性，发现在我们研究的模型类中，极化似乎是普遍存在的，只需要相对较小的…",
    "en_tdlr": "In this paper, we study the inevitability of polarization in geometric opinion exchange and find that polarization appears to be ubiquitous in the class of models we study, requiring only relatively modest..."
}