{
    "title": "Deep Confident Steps to New Pockets: Strategies for Docking Generalization",
    "abstract": "arXiv:2402.18396v1 Announce Type: cross  Abstract: Accurate blind docking has the potential to lead to new biological breakthroughs, but for this promise to be realized, docking methods must generalize well across the proteome. Existing benchmarks, however, fail to rigorously assess generalizability. Therefore, we develop DockGen, a new benchmark based on the ligand-binding domains of proteins, and we show that existing machine learning-based docking models have very weak generalization abilities. We carefully analyze the scaling laws of ML-based docking and show that, by scaling data and model size, as well as integrating synthetic data strategies, we are able to significantly increase the generalization capacity and set new state-of-the-art performance across benchmarks. Further, we propose Confidence Bootstrapping, a new training paradigm that solely relies on the interaction between diffusion and confidence models and exploits the multi-resolution generation process of diffusion mo",
    "link": "https://arxiv.org/abs/2402.18396",
    "context": "Title: Deep Confident Steps to New Pockets: Strategies for Docking Generalization\nAbstract: arXiv:2402.18396v1 Announce Type: cross  Abstract: Accurate blind docking has the potential to lead to new biological breakthroughs, but for this promise to be realized, docking methods must generalize well across the proteome. Existing benchmarks, however, fail to rigorously assess generalizability. Therefore, we develop DockGen, a new benchmark based on the ligand-binding domains of proteins, and we show that existing machine learning-based docking models have very weak generalization abilities. We carefully analyze the scaling laws of ML-based docking and show that, by scaling data and model size, as well as integrating synthetic data strategies, we are able to significantly increase the generalization capacity and set new state-of-the-art performance across benchmarks. Further, we propose Confidence Bootstrapping, a new training paradigm that solely relies on the interaction between diffusion and confidence models and exploits the multi-resolution generation process of diffusion mo",
    "path": "papers/24/02/2402.18396.json",
    "total_tokens": 903,
    "translated_title": "深入的安全步骤进入新领域：对接广义化策略",
    "translated_abstract": "精确的盲对接有潜力带来新的生物突破，但要实现这一承诺，对接方法必须在蛋白质组中实现良好的泛化。然而，现有的基准数据未能严格评估泛化能力。因此，我们开发了基于蛋白质配体结合域的新基准数据DockGen，并展示了现有基于机器学习的对接模型具有非常弱的泛化能力。我们仔细分析了基于机器学习的对接的可扩展规律，并表明，通过缩放数据和模型大小，以及整合合成数据策略，我们能够显著提高泛化能力并在基准测试中取得新的最优表现。此外，我们提出了一种新的训练范式“置信度自举法”，它仅依赖于扩散和置信模型之间的交互，并利用扩散模型的多分辨率生成过程。",
    "tldr": "通过开发新的基准数据DockGen，分析机器学习对接的可扩展规律，并提出置信度自举法训练范式，该研究显著提高了对接模型的泛化能力并在基准测试中取得了最优表现。",
    "en_tdlr": "By developing a new benchmark dataset DockGen, analyzing the scalability patterns of machine learning-based docking, and proposing Confidence Bootstrapping training paradigm, this study significantly improves the generalization capacity of docking models and achieves state-of-the-art performance across benchmarks."
}