{
    "title": "An Auction-based Marketplace for Model Trading in Federated Learning",
    "abstract": "Federated learning (FL) is increasingly recognized for its efficacy in training models using locally distributed data. However, the proper valuation of shared data in this collaborative process remains insufficiently addressed. In this work, we frame FL as a marketplace of models, where clients act as both buyers and sellers, engaging in model trading. This FL market allows clients to gain monetary reward by selling their own models and improve local model performance through the purchase of others' models. We propose an auction-based solution to ensure proper pricing based on performance gain. Incentive mechanisms are designed to encourage clients to truthfully reveal their model valuations. Furthermore, we introduce a reinforcement learning (RL) framework for marketing operations, aiming to achieve maximum trading volumes under the dynamic and evolving market status. Experimental results on four datasets demonstrate that the proposed FL market can achieve high trading revenue and fai",
    "link": "https://arxiv.org/abs/2402.01802",
    "context": "Title: An Auction-based Marketplace for Model Trading in Federated Learning\nAbstract: Federated learning (FL) is increasingly recognized for its efficacy in training models using locally distributed data. However, the proper valuation of shared data in this collaborative process remains insufficiently addressed. In this work, we frame FL as a marketplace of models, where clients act as both buyers and sellers, engaging in model trading. This FL market allows clients to gain monetary reward by selling their own models and improve local model performance through the purchase of others' models. We propose an auction-based solution to ensure proper pricing based on performance gain. Incentive mechanisms are designed to encourage clients to truthfully reveal their model valuations. Furthermore, we introduce a reinforcement learning (RL) framework for marketing operations, aiming to achieve maximum trading volumes under the dynamic and evolving market status. Experimental results on four datasets demonstrate that the proposed FL market can achieve high trading revenue and fai",
    "path": "papers/24/02/2402.01802.json",
    "total_tokens": 883,
    "translated_title": "一个基于拍卖的联邦学习模型交易市场",
    "translated_abstract": "联邦学习（FL）越来越被认识到在使用本地分布数据训练模型方面的效力。然而，在这个合作过程中共享数据的适当估值仍未得到足够解决。在这项工作中，我们将FL设想为一个模型交易的市场，客户既是买家也是卖家，参与模型交易。这个FL市场允许客户通过出售自己的模型赚取货币奖励，并通过购买他人的模型来提高本地模型的性能。我们提出了一个基于拍卖的解决方案，以确保基于性能增益的适当定价。激励机制被设计出来鼓励客户真实地揭示他们对模型的价值评估。此外，我们引入了一个强化学习（RL）框架用于市场运营，旨在实现在动态和不断变化的市场状况下的最大交易量。在四个数据集上进行的实验结果表明，所提出的FL市场可以实现高交易收益和公平的模型定价。",
    "tldr": "本论文提出了一个基于拍卖的联邦学习模型交易市场，允许模型的买卖并通过适当定价和激励机制来提高模型性能和实现最大交易量。",
    "en_tdlr": "This paper proposes an auction-based marketplace for model trading in federated learning, allowing buyers and sellers to trade models and improve model performance through proper pricing and incentive mechanisms, achieving maximum trading volume."
}