{
    "title": "AI-Enabled Lung Cancer Prognosis",
    "abstract": "arXiv:2402.09476v1 Announce Type: cross  Abstract: Lung cancer is the primary cause of cancer-related mortality, claiming approximately 1.79 million lives globally in 2020, with an estimated 2.21 million new cases diagnosed within the same period. Among these, Non-Small Cell Lung Cancer (NSCLC) is the predominant subtype, characterized by a notably bleak prognosis and low overall survival rate of approximately 25% over five years across all disease stages. However, survival outcomes vary considerably based on the stage at diagnosis and the therapeutic interventions administered. Recent advancements in artificial intelligence (AI) have revolutionized the landscape of lung cancer prognosis. AI-driven methodologies, including machine learning and deep learning algorithms, have shown promise in enhancing survival prediction accuracy by efficiently analyzing complex multi-omics data and integrating diverse clinical variables. By leveraging AI techniques, clinicians can harness comprehensive",
    "link": "https://arxiv.org/abs/2402.09476",
    "context": "Title: AI-Enabled Lung Cancer Prognosis\nAbstract: arXiv:2402.09476v1 Announce Type: cross  Abstract: Lung cancer is the primary cause of cancer-related mortality, claiming approximately 1.79 million lives globally in 2020, with an estimated 2.21 million new cases diagnosed within the same period. Among these, Non-Small Cell Lung Cancer (NSCLC) is the predominant subtype, characterized by a notably bleak prognosis and low overall survival rate of approximately 25% over five years across all disease stages. However, survival outcomes vary considerably based on the stage at diagnosis and the therapeutic interventions administered. Recent advancements in artificial intelligence (AI) have revolutionized the landscape of lung cancer prognosis. AI-driven methodologies, including machine learning and deep learning algorithms, have shown promise in enhancing survival prediction accuracy by efficiently analyzing complex multi-omics data and integrating diverse clinical variables. By leveraging AI techniques, clinicians can harness comprehensive",
    "path": "papers/24/02/2402.09476.json",
    "total_tokens": 911,
    "translated_title": "AI-启用的肺癌预后",
    "translated_abstract": "arXiv:2402.09476v1 公告类型: 交叉研究 摘要: 肺癌是导致癌症相关死亡的主要原因，在2020年全球范围内夺走了约179万人的生命，估计在同一时期内有221万例新病例被诊断出来。其中，非小细胞肺癌（NSCLC）是主要亚型，其特点是预后极差，全部病程五年的存活率约为25%。然而，存活结果根据诊断阶段和行治疗介入的差异而相差很大。人工智能（AI）的最新进展已经在肺癌预后领域引发了革命。AI驱动的方法，包括机器学习和深度学习算法，已经展示了通过高效分析复杂的多组学数据和整合多样临床变量来提高生存预测准确性的潜力。通过利用AI技术，临床医生可以利用全面的信息",
    "tldr": "这项研究旨在探索人工智能在肺癌预后中的应用。通过利用机器学习和深度学习算法，研究人员可以提高肺癌生存预测的准确性，并为临床医生提供全面的信息，以便为患者制定更好的治疗策略。",
    "en_tdlr": "This study aims to explore the application of artificial intelligence in lung cancer prognosis. By utilizing machine learning and deep learning algorithms, researchers can improve the accuracy of lung cancer survival prediction and provide comprehensive information for clinicians to develop better treatment strategies for patients."
}