{
    "title": "AN An ica-ensemble learning approach for prediction of uwb nlos signals data classification",
    "abstract": "arXiv:2402.17808v1 Announce Type: cross  Abstract: Trapped human detection in search and rescue (SAR) scenarios poses a significant challenge in pervasive computing. This study addresses this issue by leveraging machine learning techniques, given their high accuracy. However, accurate identification of trapped individuals is hindered by the curse of dimensionality and noisy data. Particularly in non-line-of-sight (NLOS) situations during catastrophic events, the curse of dimensionality may lead to blind spots due to noise and uncorrelated values in detections. This research focuses on harmonizing information through wireless communication and identifying individuals in NLOS scenarios using ultra-wideband (UWB) radar signals. Employing independent component analysis (ICA) for feature extraction, the study evaluates classification performance using ensemble algorithms on both static and dynamic datasets. The experimental results demonstrate categorization accuracies of 88.37% for static ",
    "link": "https://arxiv.org/abs/2402.17808",
    "context": "Title: AN An ica-ensemble learning approach for prediction of uwb nlos signals data classification\nAbstract: arXiv:2402.17808v1 Announce Type: cross  Abstract: Trapped human detection in search and rescue (SAR) scenarios poses a significant challenge in pervasive computing. This study addresses this issue by leveraging machine learning techniques, given their high accuracy. However, accurate identification of trapped individuals is hindered by the curse of dimensionality and noisy data. Particularly in non-line-of-sight (NLOS) situations during catastrophic events, the curse of dimensionality may lead to blind spots due to noise and uncorrelated values in detections. This research focuses on harmonizing information through wireless communication and identifying individuals in NLOS scenarios using ultra-wideband (UWB) radar signals. Employing independent component analysis (ICA) for feature extraction, the study evaluates classification performance using ensemble algorithms on both static and dynamic datasets. The experimental results demonstrate categorization accuracies of 88.37% for static ",
    "path": "papers/24/02/2402.17808.json",
    "total_tokens": 845,
    "translated_title": "基于ICA集成学习方法的UWB NLOS信号数据分类预测",
    "translated_abstract": "在搜索和救援（SAR）场景中，困人检测在无处不在计算中构成了一个重大挑战。本研究通过利用机器学习技术来解决这个问题，因为它们具有很高的准确性。然而，由于维度诅咒和嘈杂数据，困人的准确识别受到阻碍。特别是在灾难事件期间的非视距（NLOS）情况下，维度诅咒可能导致因检测中的噪声和不相关值而产生盲区。这项研究聚焦于通过无线通信协调信息，并利用超宽带（UWB）雷达信号在NLOS情景中识别个体。利用独立成分分析（ICA）进行特征提取，研究评估了静态和动态数据集上集成算法的分类性能。实验结果表明，静态分类的准确性达到了88.37%。",
    "tldr": "本研究通过ICA进行特征提取，然后利用集成算法对UWB NLOS信号数据进行分类预测，以解决非视距情况下困人检测的问题。",
    "en_tdlr": "This study utilizes ICA for feature extraction and ensemble algorithms for UWB NLOS signal data classification prediction to address trapped human detection in NLOS scenarios."
}