{
    "title": "Latent Graph Diffusion: A Unified Framework for Generation and Prediction on Graphs",
    "abstract": "In this paper, we propose the first framework that enables solving graph learning tasks of all levels (node, edge and graph) and all types (generation, regression and classification) with one model. We first propose Latent Graph Diffusion (LGD), a generative model that can generate node, edge, and graph-level features of all categories simultaneously. We achieve this goal by embedding the graph structures and features into a latent space leveraging a powerful encoder which can also be decoded, then training a diffusion model in the latent space. LGD is also capable of conditional generation through a specifically designed cross-attention mechanism. Then we formulate prediction tasks including regression and classification as (conditional) generation, which enables our LGD to solve tasks of all levels and all types with provable guarantees. We verify the effectiveness of our framework with extensive experiments, where our models achieve state-of-the-art or highly competitive results acr",
    "link": "https://arxiv.org/abs/2402.02518",
    "context": "Title: Latent Graph Diffusion: A Unified Framework for Generation and Prediction on Graphs\nAbstract: In this paper, we propose the first framework that enables solving graph learning tasks of all levels (node, edge and graph) and all types (generation, regression and classification) with one model. We first propose Latent Graph Diffusion (LGD), a generative model that can generate node, edge, and graph-level features of all categories simultaneously. We achieve this goal by embedding the graph structures and features into a latent space leveraging a powerful encoder which can also be decoded, then training a diffusion model in the latent space. LGD is also capable of conditional generation through a specifically designed cross-attention mechanism. Then we formulate prediction tasks including regression and classification as (conditional) generation, which enables our LGD to solve tasks of all levels and all types with provable guarantees. We verify the effectiveness of our framework with extensive experiments, where our models achieve state-of-the-art or highly competitive results acr",
    "path": "papers/24/02/2402.02518.json",
    "total_tokens": 910,
    "translated_title": "潜在图扩散：一种在图上生成和预测的统一框架",
    "translated_abstract": "本文提出了第一个框架，可以使用一个模型解决各级别（节点、边和图）和各类型（生成、回归和分类）的图学习任务。首先，我们提出了潜在图扩散（LGD），一种能够同时生成节点、边和图级别特征的生成模型。通过将图结构和特征嵌入潜在空间，利用强大的编码器进行解码，然后在潜在空间中训练扩散模型，我们实现了这个目标。LGD还可以通过特殊设计的交叉注意力机制进行条件生成。然后，我们将回归和分类等预测任务形式化为（条件）生成，这使得我们的LGD能够通过可证明的保证来解决各级别和各类型的任务。通过大量的实验证明了我们框架的有效性，其中我们的模型在各项指标上取得了最先进或高度竞争力的结果。",
    "tldr": "本文提出了一种统一框架，能够使用一个模型解决各级别和各类型的图学习任务，通过潜在图扩散模型生成和预测节点、边和图级别的特征，具有可证明的保证，并在实验证明了其有效性。"
}