{
    "title": "Implicit Neural Representation of Tileable Material Textures",
    "abstract": "We explore sinusoidal neural networks to represent periodic tileable textures. Our approach leverages the Fourier series by initializing the first layer of a sinusoidal neural network with integer frequencies with a period $P$. We prove that the compositions of sinusoidal layers generate only integer frequencies with period $P$. As a result, our network learns a continuous representation of a periodic pattern, enabling direct evaluation at any spatial coordinate without the need for interpolation. To enforce the resulting pattern to be tileable, we add a regularization term, based on the Poisson equation, to the loss function. Our proposed neural implicit representation is compact and enables efficient reconstruction of high-resolution textures with high visual fidelity and sharpness across multiple levels of detail. We present applications of our approach in the domain of anti-aliased surface.",
    "link": "https://arxiv.org/abs/2402.02208",
    "context": "Title: Implicit Neural Representation of Tileable Material Textures\nAbstract: We explore sinusoidal neural networks to represent periodic tileable textures. Our approach leverages the Fourier series by initializing the first layer of a sinusoidal neural network with integer frequencies with a period $P$. We prove that the compositions of sinusoidal layers generate only integer frequencies with period $P$. As a result, our network learns a continuous representation of a periodic pattern, enabling direct evaluation at any spatial coordinate without the need for interpolation. To enforce the resulting pattern to be tileable, we add a regularization term, based on the Poisson equation, to the loss function. Our proposed neural implicit representation is compact and enables efficient reconstruction of high-resolution textures with high visual fidelity and sharpness across multiple levels of detail. We present applications of our approach in the domain of anti-aliased surface.",
    "path": "papers/24/02/2402.02208.json",
    "total_tokens": 873,
    "translated_title": "隐式神经表示的可平铺材质纹理",
    "translated_abstract": "我们探索使用正弦神经网络来表示周期性可平铺纹理。我们的方法通过用整数频率初始化正弦神经网络的第一层，利用傅立叶级数。我们证明正弦层的组合只生成具有周期P的整数频率。因此，我们的网络学习了周期模式的连续表示，可以直接在任意空间坐标上进行评估，无需插值。为了使结果模式可平铺，我们在损失函数中添加了基于泊松方程的正则化项。我们提出的神经隐式表示紧凑且能够高效重建具有多个层次细节的高分辨率纹理，并具有高视觉保真度和锐度。我们展示了在反锯齿表面领域中应用我们方法的案例。",
    "tldr": "本文研究了一种使用正弦神经网络表示周期性可平铺纹理的隐式神经表示方法。该方法通过使用傅立叶级数初始化神经网络的第一层，实现了在任意空间坐标上直接评估纹理，避免了插值。通过添加正则化项和泊松方程，确保生成可平铺的纹理，并能高效重建高分辨率纹理。应用于反锯齿表面能够提供高视觉保真度和锐度的效果。",
    "en_tdlr": "This paper presents an implicit neural representation method using sinusoidal neural networks for representing periodic tileable textures. The method ensures direct evaluation of textures at any spatial coordinate without interpolation, and enables efficient reconstruction and high visual fidelity of high-resolution textures."
}