{
    "title": "Bloom-epistemic and sentiment analysis hierarchical classification in course discussion forums",
    "abstract": "Online discussion forums are widely used for active textual interaction between lecturers and students, and to see how the students have progressed in a learning process. The objective of this study is to compare appropriate machine-learning models to assess sentiments and Bloom\\'s epistemic taxonomy based on textual comments in educational discussion forums. Our proposed method is called the hierarchical approach of Bloom-Epistemic and Sentiment Analysis (BE-Sent). The research methodology consists of three main steps. The first step is the data collection from the internal discussion forum and YouTube comments of a Web Programming channel. The next step is text preprocessing to annotate the text and clear unimportant words. Furthermore, with the text dataset that has been successfully cleaned, sentiment analysis and epistemic categorization will be done in each sentence of the text. Sentiment analysis is divided into three categories: positive, negative, and neutral. Bloom\\'s epistem",
    "link": "https://arxiv.org/abs/2402.01716",
    "context": "Title: Bloom-epistemic and sentiment analysis hierarchical classification in course discussion forums\nAbstract: Online discussion forums are widely used for active textual interaction between lecturers and students, and to see how the students have progressed in a learning process. The objective of this study is to compare appropriate machine-learning models to assess sentiments and Bloom\\'s epistemic taxonomy based on textual comments in educational discussion forums. Our proposed method is called the hierarchical approach of Bloom-Epistemic and Sentiment Analysis (BE-Sent). The research methodology consists of three main steps. The first step is the data collection from the internal discussion forum and YouTube comments of a Web Programming channel. The next step is text preprocessing to annotate the text and clear unimportant words. Furthermore, with the text dataset that has been successfully cleaned, sentiment analysis and epistemic categorization will be done in each sentence of the text. Sentiment analysis is divided into three categories: positive, negative, and neutral. Bloom\\'s epistem",
    "path": "papers/24/02/2402.01716.json",
    "total_tokens": 989,
    "translated_title": "Bloom-认知和情感分析层次分类在课程讨论论坛中的应用",
    "translated_abstract": "在线讨论论坛广泛被用于讲师和学生之间的积极文本交流，以及检查学生在学习过程中的进展情况。本研究的目标是比较适合的机器学习模型，以评估教育讨论论坛中基于文本评论的情绪和布鲁姆的认知分类。我们提出的方法被称为布鲁姆认知和情感分析的层次化方法（BE-Sent）。研究方法包括三个主要步骤。第一步是从内部讨论论坛和YouTube频道的评论中收集数据。下一步是对文本进行预处理，对文本进行标注并清除不重要的单词。此外，对已成功清理的文本数据集，将在每个句子中进行情感分析和认知分类。情感分析分为三个类别：积极的，消极的和中性的。布鲁姆（Bloom）的认知分类是根据认知过程的六个层次进行的，从低层次的知识记忆到高层次的评价和创造。",
    "tldr": "本研究提出了一种称为布鲁姆-认知和情感分析（BE-Sent）的层次化方法，用于评估教育讨论论坛中的情绪和布鲁姆的认知分类。方法包括数据收集、文本预处理、情感分析和认知分类。研究结果有助于了解学生在学习过程中的进展情况和知识水平。",
    "en_tdlr": "This study proposes a hierarchical approach called Bloom-Epistemic and Sentiment Analysis (BE-Sent) to assess sentiments and Bloom's epistemic taxonomy in educational discussion forums. The method involves data collection, text preprocessing, sentiment analysis, and epistemic categorization. The research findings contribute to understanding students' progress and knowledge level in the learning process."
}