{
    "title": "SecurePose: Automated Face Blurring and Human Movement Kinematics Extraction from Videos Recorded in Clinical Settings",
    "abstract": "arXiv:2402.14143v1 Announce Type: cross  Abstract: Movement disorders are typically diagnosed by consensus-based expert evaluation of clinically acquired patient videos. However, such broad sharing of patient videos poses risks to patient privacy. Face blurring can be used to de-identify videos, but this process is often manual and time-consuming. Available automated face blurring techniques are subject to either excessive, inconsistent, or insufficient facial blurring - all of which can be disastrous for video assessment and patient privacy. Furthermore, assessing movement disorders in these videos is often subjective. The extraction of quantifiable kinematic features can help inform movement disorder assessment in these videos, but existing methods to do this are prone to errors if using pre-blurred videos. We have developed an open-source software called SecurePose that can both achieve reliable face blurring and automated kinematic extraction in patient videos recorded in a clinic ",
    "link": "https://arxiv.org/abs/2402.14143",
    "context": "Title: SecurePose: Automated Face Blurring and Human Movement Kinematics Extraction from Videos Recorded in Clinical Settings\nAbstract: arXiv:2402.14143v1 Announce Type: cross  Abstract: Movement disorders are typically diagnosed by consensus-based expert evaluation of clinically acquired patient videos. However, such broad sharing of patient videos poses risks to patient privacy. Face blurring can be used to de-identify videos, but this process is often manual and time-consuming. Available automated face blurring techniques are subject to either excessive, inconsistent, or insufficient facial blurring - all of which can be disastrous for video assessment and patient privacy. Furthermore, assessing movement disorders in these videos is often subjective. The extraction of quantifiable kinematic features can help inform movement disorder assessment in these videos, but existing methods to do this are prone to errors if using pre-blurred videos. We have developed an open-source software called SecurePose that can both achieve reliable face blurring and automated kinematic extraction in patient videos recorded in a clinic ",
    "path": "papers/24/02/2402.14143.json",
    "total_tokens": 887,
    "translated_title": "SecurePose：在临床环境中录制的视频中实现自动人脸模糊和人体运动动力学特征提取",
    "translated_abstract": "运动障碍通常通过专家对临床获取的患者视频进行共识评估来诊断。然而，这种广泛分享患者视频会对患者隐私构成风险。人脸模糊可以用来去标识化视频，但这个过程通常是手动且耗时的。现有的自动人脸模糊技术容易出现过度、不一致或不足的人脸模糊 - 这些都可能对视频评估和患者隐私造成灾难性影响。此外，在这些视频中评估运动障碍往往是主观的。提取可量化的动力学特征可以帮助了解这些视频中的运动障碍评估，但现有的方法在使用预模糊视频时容易出现错误。我们开发了一个名为SecurePose的开源软件，可以在临床录制的患者视频中实现可靠的人脸模糊和自动动力学特征提取。",
    "tldr": "SecurePose是一个开源软件，可以可靠地实现临床录制的患者视频中的人脸模糊和动力学特征提取，提高了视频评估和患者隐私的安全性。",
    "en_tdlr": "SecurePose is an open-source software that reliably achieves face blurring and kinematic feature extraction in patient videos recorded in clinical settings, enhancing the security of video assessment and patient privacy."
}