{
    "title": "Res-VMamba: Fine-Grained Food Category Visual Classification Using Selective State Space Models with Deep Residual Learning",
    "abstract": "arXiv:2402.15761v1 Announce Type: cross  Abstract: Food classification is the foundation for developing food vision tasks and plays a key role in the burgeoning field of computational nutrition. Due to the complexity of food requiring fine-grained classification, recent academic research mainly modifies Convolutional Neural Networks (CNNs) and/or Vision Transformers (ViTs) to perform food category classification. However, to learn fine-grained features, the CNN backbone needs additional structural design, whereas ViT, containing the self-attention module, has increased computational complexity. In recent months, a new Sequence State Space (S4) model, through a Selection mechanism and computation with a Scan (S6), colloquially termed Mamba, has demonstrated superior performance and computation efficiency compared to the Transformer architecture. The VMamba model, which incorporates the Mamba mechanism into image tasks (such as classification), currently establishes the state-of-the-art ",
    "link": "https://arxiv.org/abs/2402.15761",
    "context": "Title: Res-VMamba: Fine-Grained Food Category Visual Classification Using Selective State Space Models with Deep Residual Learning\nAbstract: arXiv:2402.15761v1 Announce Type: cross  Abstract: Food classification is the foundation for developing food vision tasks and plays a key role in the burgeoning field of computational nutrition. Due to the complexity of food requiring fine-grained classification, recent academic research mainly modifies Convolutional Neural Networks (CNNs) and/or Vision Transformers (ViTs) to perform food category classification. However, to learn fine-grained features, the CNN backbone needs additional structural design, whereas ViT, containing the self-attention module, has increased computational complexity. In recent months, a new Sequence State Space (S4) model, through a Selection mechanism and computation with a Scan (S6), colloquially termed Mamba, has demonstrated superior performance and computation efficiency compared to the Transformer architecture. The VMamba model, which incorporates the Mamba mechanism into image tasks (such as classification), currently establishes the state-of-the-art ",
    "path": "papers/24/02/2402.15761.json",
    "total_tokens": 863,
    "translated_title": "使用具有深度残差学习的选择性状态空间模型进行细粒度食品类别视觉分类的Res-VMamba",
    "translated_abstract": "食品分类是发展食品视觉任务的基础，并在计算营养学这一新兴领域中发挥着关键作用。由于食物的复杂性需要细粒度分类，最近的学术研究主要修改卷积神经网络(CNNs)和/或视觉变压器(ViTs)来执行食品类别分类。然而，为了学习细粒度特征，CNN骨干需要额外的结构设计，而包含自注意力模块的ViT具有更高的计算复杂性。最近推出的新的序列状态空间(S4)模型，通过选择机制和与扫描(S6)的计算，俗称为Mamba，相较于变压器架构展示了卓越的性能和计算效率。将Mamba机制整合到图像任务(如分类)中的VMamba模型目前建立了最先进技术",
    "tldr": "Res-VMamba利用具有选择性状态空间模型和深度残差学习，提供了比Transformer结构更出色的性能和计算效率，是食品细粒度分类中的最新技术。",
    "en_tdlr": "Res-VMamba utilizes selective state space models and deep residual learning to achieve superior performance and computational efficiency compared to Transformer architecture, representing the state-of-the-art in fine-grained food category classification."
}