{
    "title": "Statistical validation of a deep learning algorithm for dental anomaly detection in intraoral radiographs using paired data",
    "abstract": "arXiv:2402.14022v1 Announce Type: cross  Abstract: This article describes the clinical validation study setup, statistical analysis and results for a deep learning algorithm which detects dental anomalies in intraoral radiographic images, more specifically caries, apical lesions, root canal treatment defects, marginal defects at crown restorations, periodontal bone loss and calculus. The study compares the detection performance of dentists using the deep learning algorithm to the prior performance of these dentists evaluating the images without algorithmic assistance. Calculating the marginal profit and loss of performance from the annotated paired image data allows for a quantification of the hypothesized change in sensitivity and specificity. The statistical significance of these results is extensively proven using both McNemar's test and the binomial hypothesis test. The average sensitivity increases from $60.7\\%$ to $85.9\\%$, while the average specificity slightly decreases from $9",
    "link": "https://arxiv.org/abs/2402.14022",
    "context": "Title: Statistical validation of a deep learning algorithm for dental anomaly detection in intraoral radiographs using paired data\nAbstract: arXiv:2402.14022v1 Announce Type: cross  Abstract: This article describes the clinical validation study setup, statistical analysis and results for a deep learning algorithm which detects dental anomalies in intraoral radiographic images, more specifically caries, apical lesions, root canal treatment defects, marginal defects at crown restorations, periodontal bone loss and calculus. The study compares the detection performance of dentists using the deep learning algorithm to the prior performance of these dentists evaluating the images without algorithmic assistance. Calculating the marginal profit and loss of performance from the annotated paired image data allows for a quantification of the hypothesized change in sensitivity and specificity. The statistical significance of these results is extensively proven using both McNemar's test and the binomial hypothesis test. The average sensitivity increases from $60.7\\%$ to $85.9\\%$, while the average specificity slightly decreases from $9",
    "path": "papers/24/02/2402.14022.json",
    "total_tokens": 872,
    "translated_title": "使用配对数据对口内X光中牙齿异常检测的深度学习算法进行统计验证",
    "translated_abstract": "本文描述了一项临床验证研究设置，针对口内X线图像中检测牙齿异常的深度学习算法进行的统计分析和结果，具体包括龋齿、根尖病变、根管治疗缺陷、冠修复边缘缺陷、牙周骨质流失和牙石。该研究比较了使用深度学习算法的牙医的检测性能与这些牙医在没有算法帮助下评估图像时的先前表现。通过计算配对图像数据的边际利润和性能损失，可以量化假设的敏感性和特异性变化。使用McNemar检验和二项假设检验广泛证明了这些结果的统计显著性。平均敏感性从60.7%增加到85.9%，而平均特异性略有降低，从$9",
    "tldr": "该研究通过统计分析验证了一种深度学习算法在口内X光中检测牙齿异常的有效性，平均敏感性显著提高，而平均特异性略有下降",
    "en_tdlr": "This study statistically validates the effectiveness of a deep learning algorithm for detecting dental anomalies in intraoral radiographs, showing a significant increase in average sensitivity and a slight decrease in average specificity."
}