{
    "title": "Identifying and Improving Disability Bias in GAI-Based Resume Screening",
    "abstract": "As Generative AI rises in adoption, its use has expanded to include domains such as hiring and recruiting. However, without examining the potential of bias, this may negatively impact marginalized populations, including people with disabilities. To address this important concern, we present a resume audit study, in which we ask ChatGPT (specifically, GPT-4) to rank a resume against the same resume enhanced with an additional leadership award, scholarship, panel presentation, and membership that are disability related. We find that GPT-4 exhibits prejudice towards these enhanced CVs. Further, we show that this prejudice can be quantifiably reduced by training a custom GPTs on principles of DEI and disability justice. Our study also includes a unique qualitative analysis of the types of direct and indirect ableism GPT-4 uses to justify its biased decisions and suggest directions for additional bias mitigation work. Additionally, since these justifications are presumably drawn from traini",
    "link": "https://arxiv.org/abs/2402.01732",
    "context": "Title: Identifying and Improving Disability Bias in GAI-Based Resume Screening\nAbstract: As Generative AI rises in adoption, its use has expanded to include domains such as hiring and recruiting. However, without examining the potential of bias, this may negatively impact marginalized populations, including people with disabilities. To address this important concern, we present a resume audit study, in which we ask ChatGPT (specifically, GPT-4) to rank a resume against the same resume enhanced with an additional leadership award, scholarship, panel presentation, and membership that are disability related. We find that GPT-4 exhibits prejudice towards these enhanced CVs. Further, we show that this prejudice can be quantifiably reduced by training a custom GPTs on principles of DEI and disability justice. Our study also includes a unique qualitative analysis of the types of direct and indirect ableism GPT-4 uses to justify its biased decisions and suggest directions for additional bias mitigation work. Additionally, since these justifications are presumably drawn from traini",
    "path": "papers/24/02/2402.01732.json",
    "total_tokens": 1028,
    "translated_title": "辨别和改进基于 GAI 的简历筛选中的残疾偏见",
    "translated_abstract": "随着生成式人工智能的广泛应用，其使用范围已扩展到招聘和招聘等领域。然而，如果不考虑偏见的潜在问题，这可能对包括残疾人在内的边缘人群产生负面影响。为了解决这一重要问题，我们提出了一项简历审计研究，在这项研究中，我们要求 ChatGPT（特别是 GPT-4）对一份简历进行排名，与附加了与残疾有关的额外领导奖励、奖学金、面板演讲和成员资格的相同简历进行比较。我们发现 GPT-4 对这些改进的简历存在偏见。此外，我们表明通过训练基于 DEI 和残疾正义原则的自定义 GPT，可以量化地减少这种偏见。我们的研究还包括对 GPT-4 用于证明其有偏见决策的直接和间接残障主义类型的独特定性分析，并提出了额外偏见减轻工作的方向建议。此外，由于这些理由可能来自训练数据，我们还描述了残障正义的相关实际案例，以指导未来的研究方向。",
    "tldr": "这项研究针对生成式人工智能在招聘中的应用进行了简历审计，发现 GPT-4 对残疾相关的简历存在偏见，通过训练自定义 GPT 并遵循多样性、公平性与包容性以及残疾正义原则，可以减少这种偏见。"
}