{
    "title": "Functional Spatial Autoregressive Models",
    "abstract": "arXiv:2402.14763v1 Announce Type: new  Abstract: This study introduces a novel spatial autoregressive model in which the dependent variable is a function that may exhibit functional autocorrelation with the outcome functions of nearby units. This model can be characterized as a simultaneous integral equation system, which, in general, does not necessarily have a unique solution. For this issue, we provide a simple condition on the magnitude of the spatial interaction to ensure the uniqueness in data realization. For estimation, to account for the endogeneity caused by the spatial interaction, we propose a regularized two-stage least squares estimator based on a basis approximation for the functional parameter. The asymptotic properties of the estimator including the consistency and asymptotic normality are investigated under certain conditions. Additionally, we propose a simple Wald-type test for detecting the presence of spatial effects. As an empirical illustration, we apply the prop",
    "link": "https://arxiv.org/abs/2402.14763",
    "context": "Title: Functional Spatial Autoregressive Models\nAbstract: arXiv:2402.14763v1 Announce Type: new  Abstract: This study introduces a novel spatial autoregressive model in which the dependent variable is a function that may exhibit functional autocorrelation with the outcome functions of nearby units. This model can be characterized as a simultaneous integral equation system, which, in general, does not necessarily have a unique solution. For this issue, we provide a simple condition on the magnitude of the spatial interaction to ensure the uniqueness in data realization. For estimation, to account for the endogeneity caused by the spatial interaction, we propose a regularized two-stage least squares estimator based on a basis approximation for the functional parameter. The asymptotic properties of the estimator including the consistency and asymptotic normality are investigated under certain conditions. Additionally, we propose a simple Wald-type test for detecting the presence of spatial effects. As an empirical illustration, we apply the prop",
    "path": "papers/24/02/2402.14763.json",
    "total_tokens": 842,
    "translated_title": "功能性空间自回归模型",
    "translated_abstract": "这项研究介绍了一种新颖的空间自回归模型，其中因变量是可能显示与附近单位的结果函数存在功能自相关性的函数。这种模型可以被描述为一个同时的积分方程系统，通常情况下并没有唯一解。针对这个问题，我们提出了一个简单的空间交互作用量大小的条件，以确保数据实现的唯一性。为了估计，为了考虑由空间相互作用引起的内生性，我们提出了一个基于基函数逼近的正则化两阶段最小二乘估计量。估计量的渐近性质，包括一致性和渐近正态性，在一定条件下进行了研究。此外，我们提出了一种简单的Wald类型检验，用于检测空间效应的存在。作为实证示例，我们应用了prop。",
    "tldr": "介绍了一种新颖的功能性空间自回归模型，提出了确保数据实现唯一性的条件，并提出了一种用于功能参数的正则化两阶段最小二乘估计器，以解决内生性问题，同时还提出了一种用于检测空间效应的简单Wald类型检验",
    "en_tdlr": "Introduces a novel functional spatial autoregressive model, proposes a condition to ensure uniqueness in data realization, and suggests a regularized two-stage least squares estimator for functional parameter to address endogeneity, along with a simple Wald-type test for detecting spatial effects."
}