{
    "title": "Emulating the interstellar medium chemistry with neural operators",
    "abstract": "arXiv:2402.12435v1 Announce Type: cross  Abstract: Galaxy formation and evolution critically depend on understanding the complex photo-chemical processes that govern the evolution and thermodynamics of the InterStellar Medium (ISM). Computationally, solving chemistry is among the most heavy tasks in cosmological and astrophysical simulations. The evolution of such non-equilibrium photo-chemical network relies on implicit, precise, computationally costly, ordinary differential equations (ODE) solvers. Here, we aim at substituting such procedural solvers with fast, pre-trained, emulators based on neural operators. We emulate a non-equilibrium chemical network up to H$_2$ formation (9 species, 52 reactions) by adopting the DeepONet formalism, i.e. by splitting the ODE solver operator that maps the initial conditions and time evolution into a tensor product of two neural networks. We use $\\texttt{KROME}$ to generate a training set spanning $-2\\leq \\log(n/\\mathrm{cm}^{-3}) \\leq 3.5$, $\\log(",
    "link": "https://arxiv.org/abs/2402.12435",
    "context": "Title: Emulating the interstellar medium chemistry with neural operators\nAbstract: arXiv:2402.12435v1 Announce Type: cross  Abstract: Galaxy formation and evolution critically depend on understanding the complex photo-chemical processes that govern the evolution and thermodynamics of the InterStellar Medium (ISM). Computationally, solving chemistry is among the most heavy tasks in cosmological and astrophysical simulations. The evolution of such non-equilibrium photo-chemical network relies on implicit, precise, computationally costly, ordinary differential equations (ODE) solvers. Here, we aim at substituting such procedural solvers with fast, pre-trained, emulators based on neural operators. We emulate a non-equilibrium chemical network up to H$_2$ formation (9 species, 52 reactions) by adopting the DeepONet formalism, i.e. by splitting the ODE solver operator that maps the initial conditions and time evolution into a tensor product of two neural networks. We use $\\texttt{KROME}$ to generate a training set spanning $-2\\leq \\log(n/\\mathrm{cm}^{-3}) \\leq 3.5$, $\\log(",
    "path": "papers/24/02/2402.12435.json",
    "total_tokens": 884,
    "translated_title": "使用神经算子模拟星际介质化学",
    "translated_abstract": "银河系的形成和进化在很大程度上取决于理解主导星际介质（ISM）演化和热力学的复杂光化学过程。在计算上，解决化学问题是宇宙学和天体物理模拟中最繁重的任务之一。这项研究旨在用基于神经算子的快速、预先训练的仿真器替代这些程序求解器。我们通过采用DeepONet形式主义模拟非平衡化学网络直至H$_2$形成（9种物种，52个反应），将初始条件和时间演化映射为两个神经网络的张量乘积来分解映射运算符。我们使用$\\texttt{KROME}$生成一个训练集，涵盖$-2\\leq \\log(n/\\mathrm{cm}^{-3}) \\leq 3.5$，$\\log(",
    "tldr": "该研究使用神经算子取代计算量大、精确度高、计算代价昂贵的普通微分方程求解器，成功模拟了星际介质中的非平衡化学网络演化，对于宇宙学和天体物理模拟具有重要意义。",
    "en_tdlr": "This study successfully replaced computationally expensive ordinary differential equation solvers with neural operators to simulate the non-equilibrium chemical network in the interstellar medium, which is crucial for cosmological and astrophysical simulations."
}