{
    "title": "Choosing a Classical Planner with Graph Neural Networks",
    "abstract": "Online planner selection is the task of choosing a solver out of a predefined set for a given planning problem. As planning is computationally hard, the performance of solvers varies greatly on planning problems. Thus, the ability to predict their performance on a given problem is of great importance. While a variety of learning methods have been employed, for classical cost-optimal planning the prevailing approach uses Graph Neural Networks (GNNs). In this work, we continue the line of work on using GNNs for online planner selection. We perform a thorough investigation of the impact of the chosen GNN model, graph representation and node features, as well as prediction task. Going further, we propose using the graph representation obtained by a GNN as an input to the Extreme Gradient Boosting (XGBoost) model, resulting in a more resource-efficient yet accurate approach. We show the effectiveness of a variety of GNN-based online planner selection methods, opening up new exciting avenues",
    "link": "https://arxiv.org/abs/2402.04874",
    "context": "Title: Choosing a Classical Planner with Graph Neural Networks\nAbstract: Online planner selection is the task of choosing a solver out of a predefined set for a given planning problem. As planning is computationally hard, the performance of solvers varies greatly on planning problems. Thus, the ability to predict their performance on a given problem is of great importance. While a variety of learning methods have been employed, for classical cost-optimal planning the prevailing approach uses Graph Neural Networks (GNNs). In this work, we continue the line of work on using GNNs for online planner selection. We perform a thorough investigation of the impact of the chosen GNN model, graph representation and node features, as well as prediction task. Going further, we propose using the graph representation obtained by a GNN as an input to the Extreme Gradient Boosting (XGBoost) model, resulting in a more resource-efficient yet accurate approach. We show the effectiveness of a variety of GNN-based online planner selection methods, opening up new exciting avenues",
    "path": "papers/24/02/2402.04874.json",
    "total_tokens": 836,
    "translated_title": "选择具有图神经网络的经典规划器",
    "translated_abstract": "在线规划器选择是在给定规划问题的预定义解集中选择一个解算器的任务。由于规划计算复杂，解算器在规划问题上的性能差异很大。因此，预测解算器在给定问题上的性能非常重要。虽然有各种学习方法被采用，但在经典的最优代价规划中，主流方法使用了图神经网络（GNN）。在这项工作中，我们继续使用GNN进行在线规划器选择的研究。我们对所选择的GNN模型、图表示和节点特征以及预测任务的影响进行了彻底的调查。更进一步，我们提出使用GNN获得的图表示作为极端梯度提升（XGBoost）模型的输入，从而实现一种更加资源高效但准确的方法。我们展示了各种基于GNN的在线规划器选择方法的有效性，开辟了新的激动人心的研究方向。",
    "tldr": "本文研究了使用图神经网络进行在线规划器选择的方法，并通过析取出的图表示作为另一模型的输入，提出了一种更加资源高效但准确的方法。",
    "en_tdlr": "This paper investigates the use of graph neural networks for online planner selection and proposes a more resource-efficient yet accurate approach by utilizing the graph representation as input to another model."
}