{
    "title": "Enhancing crop classification accuracy by synthetic SAR-Optical data generation using deep learning",
    "abstract": "Crop classification using remote sensing data has emerged as a prominent research area in recent decades. Studies have demonstrated that fusing SAR and optical images can significantly enhance the accuracy of classification. However, a major challenge in this field is the limited availability of training data, which adversely affects the performance of classifiers. In agricultural regions, the dominant crops typically consist of one or two specific types, while other crops are scarce. Consequently, when collecting training samples to create a map of agricultural products, there is an abundance of samples from the dominant crops, forming the majority classes. Conversely, samples from other crops are scarce, representing the minority classes. Addressing this issue requires overcoming several challenges and weaknesses associated with traditional data generation methods. These methods have been employed to tackle the imbalanced nature of the training data. Nevertheless, they still face lim",
    "link": "https://arxiv.org/abs/2402.02121",
    "context": "Title: Enhancing crop classification accuracy by synthetic SAR-Optical data generation using deep learning\nAbstract: Crop classification using remote sensing data has emerged as a prominent research area in recent decades. Studies have demonstrated that fusing SAR and optical images can significantly enhance the accuracy of classification. However, a major challenge in this field is the limited availability of training data, which adversely affects the performance of classifiers. In agricultural regions, the dominant crops typically consist of one or two specific types, while other crops are scarce. Consequently, when collecting training samples to create a map of agricultural products, there is an abundance of samples from the dominant crops, forming the majority classes. Conversely, samples from other crops are scarce, representing the minority classes. Addressing this issue requires overcoming several challenges and weaknesses associated with traditional data generation methods. These methods have been employed to tackle the imbalanced nature of the training data. Nevertheless, they still face lim",
    "path": "papers/24/02/2402.02121.json",
    "total_tokens": 819,
    "translated_title": "通过使用深度学习生成合成的SAR-光学数据来提高农作物分类准确性",
    "translated_abstract": "农作物分类使用遥感数据已成为近几十年来的一个重要研究领域。研究表明，融合SAR和光学影像可以显著提高分类的准确性。然而，该领域面临的一个主要挑战是训练数据的有限可用性，这会对分类器的性能造成不利影响。在农业地区，主要作物通常包括一两种特定类型，而其他作物则很少。因此，在收集训练样本以创建农产品地图时，主要作物的样本充裕，形成大部分类别。相反，其他作物的样本很少，代表着少数类别。解决这个问题需要克服传统数据生成方法的一些挑战和弱点。这些方法已被用来解决训练数据不平衡的问题。然而，它们仍然面临着限制。",
    "tldr": "通过使用深度学习生成合成的SAR-光学数据，可以增强农作物分类的准确性。然而，传统数据生成方法面临训练数据不平衡的挑战。",
    "en_tdlr": "Enhancing crop classification accuracy can be achieved by generating synthetic SAR-Optical data using deep learning. However, traditional data generation methods face challenges related to imbalanced training data."
}