{
    "title": "Coarse graining correlation matrices according to macrostructures: Financial markets as a paradigm",
    "abstract": "We analyze correlation structures in financial markets by coarse graining the Pearson correlation matrices according to market sectors to obtain Guhr matrices using Guhr's correlation method according to Ref. [P. Rinn {\\it et. al.}, Europhysics Letters 110, 68003 (2015)]. We compare the results for the evolution of market states and the corresponding transition matrices with those obtained using Pearson correlation matrices. The behavior of market states is found to be similar for both the coarse grained and Pearson matrices. However, the number of relevant variables is reduced by orders of magnitude.",
    "link": "https://arxiv.org/abs/2402.05364",
    "context": "Title: Coarse graining correlation matrices according to macrostructures: Financial markets as a paradigm\nAbstract: We analyze correlation structures in financial markets by coarse graining the Pearson correlation matrices according to market sectors to obtain Guhr matrices using Guhr's correlation method according to Ref. [P. Rinn {\\it et. al.}, Europhysics Letters 110, 68003 (2015)]. We compare the results for the evolution of market states and the corresponding transition matrices with those obtained using Pearson correlation matrices. The behavior of market states is found to be similar for both the coarse grained and Pearson matrices. However, the number of relevant variables is reduced by orders of magnitude.",
    "path": "papers/24/02/2402.05364.json",
    "total_tokens": 722,
    "translated_title": "根据宏观结构来粗粒化相关矩阵：以金融市场为范例",
    "translated_abstract": "我们通过将Pearson相关矩阵根据市场部门进行粗粒化，使用Guhr的相关方法得到Guhr矩阵，来分析金融市场的相关结构。我们将市场状态的演变和相应的转换矩阵的结果与使用Pearson相关矩阵得到的进行比较。我们发现，粗粒化和Pearson矩阵对于市场状态的行为是相似的。然而，相关变量的数量减少了数个数量级。",
    "tldr": "本文通过将Pearson相关矩阵粗粒化，根据市场部门来分析金融市场的相关结构，并比较了粗粒化和Pearson矩阵在市场状态演变和转换矩阵上的结果。结果表明，粗粒化和Pearson矩阵对市场状态的行为是相似的，并且相关变量数量减少了数个数量级。",
    "en_tdlr": "This paper analyzes correlation structures in financial markets by coarse graining Pearson correlation matrices according to market sectors and compares the results with the original Pearson matrices. The behavior of market states is found to be similar between the coarse grained and Pearson matrices, but the number of relevant variables is reduced significantly."
}