{
    "title": "Sentinels of the Stream: Unleashing Large Language Models for Dynamic Packet Classification in Software Defined Networks -- Position Paper",
    "abstract": "With the release of OpenAI's ChatGPT, the field of large language models (LLM) saw an increase of academic interest in GPT based chat assistants. In the next few months multiple accesible large language models were released that included Meta's LLama models and Mistral AI's Mistral and Mixtral MoE models. These models are available openly for a wide array of purposes with a wide spectrum of licenses. These LLMs have found their use in a different number of fields like code development, SQL generation etc. In this work we propose our plan to explore the applicability of large language model in the domain of network security. We plan to create Sentinel, a LLM, to analyse network packet contents and pass a judgment on it's threat level. This work is a preliminary report that will lay our plan for our future endeavors.",
    "link": "https://arxiv.org/abs/2402.07950",
    "context": "Title: Sentinels of the Stream: Unleashing Large Language Models for Dynamic Packet Classification in Software Defined Networks -- Position Paper\nAbstract: With the release of OpenAI's ChatGPT, the field of large language models (LLM) saw an increase of academic interest in GPT based chat assistants. In the next few months multiple accesible large language models were released that included Meta's LLama models and Mistral AI's Mistral and Mixtral MoE models. These models are available openly for a wide array of purposes with a wide spectrum of licenses. These LLMs have found their use in a different number of fields like code development, SQL generation etc. In this work we propose our plan to explore the applicability of large language model in the domain of network security. We plan to create Sentinel, a LLM, to analyse network packet contents and pass a judgment on it's threat level. This work is a preliminary report that will lay our plan for our future endeavors.",
    "path": "papers/24/02/2402.07950.json",
    "total_tokens": 831,
    "translated_title": "流媒体的卫士：在软件定义网络中释放大型语言模型进行动态数据包分类--定位论文",
    "translated_abstract": "随着OpenAI的ChatGPT的发布，大型语言模型（LLM）领域在基于GPT的聊天助手方面引起了学术界的兴趣增加。在接下来的几个月中，释放了多个可访问的大型语言模型，包括Meta的LLama模型和Mistral AI的Mistral和Mixtral MoE模型。这些模型以各种不同的许可证对外公开，可用于各种不同的目的。这些LLM已经在代码开发、SQL生成等多个领域得到了应用。在本文中，我们提出了在网络安全领域探索大型语言模型适用性的计划。我们计划创建一个名为Sentinel的LLM，用于分析网络数据包内容并对其威胁级别进行判定。这项工作是我们未来发展规划的初步报告。",
    "tldr": "本文提出了在网络安全领域探索大型语言模型适用性的计划，计划创建名为Sentinel的LLM来分析网络数据包内容并评估威胁级别。",
    "en_tdlr": "This paper proposes a plan to explore the applicability of large language models in the field of network security, with the intention to create a LLM called Sentinel for analyzing network packet contents and assessing threat levels."
}