{
    "title": "Multiple Instance Learning for Glioma Diagnosis using Hematoxylin and Eosin Whole Slide Images: An Indian cohort Study",
    "abstract": "arXiv:2402.15832v1 Announce Type: cross  Abstract: Brain tumors represent a severe and life-threatening condition, demanding precise diagnosis and tailored treatment strategies. This study advances patient care with findings from rigorous multiple-instance-learning experimentations across various feature extractors and aggregators in brain tumor histopathology. It establishes new performance benchmarks in glioma subtype classification across multiple datasets, including a novel dataset focused on the Indian demographic (IPD-Brain), providing a valuable resource for existing research. Using a ResNet-50, pretrained on histopathology datasets, for feature extraction, combined with DTFD feature aggregator, our approach achieves state-of-the-art AUCs of 88.08 on IPD-Brain and 95.81 on TCGA-Brain dataset respectively for three-way glioma subtype classification. Moreover, it establishes new benchmarks in grading and detecting IHC molecular biomarkers (IDH1 (mutant R132H), TP53, ATRX, Ki-67) t",
    "link": "https://arxiv.org/abs/2402.15832",
    "context": "Title: Multiple Instance Learning for Glioma Diagnosis using Hematoxylin and Eosin Whole Slide Images: An Indian cohort Study\nAbstract: arXiv:2402.15832v1 Announce Type: cross  Abstract: Brain tumors represent a severe and life-threatening condition, demanding precise diagnosis and tailored treatment strategies. This study advances patient care with findings from rigorous multiple-instance-learning experimentations across various feature extractors and aggregators in brain tumor histopathology. It establishes new performance benchmarks in glioma subtype classification across multiple datasets, including a novel dataset focused on the Indian demographic (IPD-Brain), providing a valuable resource for existing research. Using a ResNet-50, pretrained on histopathology datasets, for feature extraction, combined with DTFD feature aggregator, our approach achieves state-of-the-art AUCs of 88.08 on IPD-Brain and 95.81 on TCGA-Brain dataset respectively for three-way glioma subtype classification. Moreover, it establishes new benchmarks in grading and detecting IHC molecular biomarkers (IDH1 (mutant R132H), TP53, ATRX, Ki-67) t",
    "path": "papers/24/02/2402.15832.json",
    "total_tokens": 965,
    "translated_title": "利用苏木精与伊红染色整张图像进行胶质瘤诊断的多实例学习：印度队列研究",
    "translated_abstract": "脑肿瘤代表一种严重且危及生命的疾病，需要精确的诊断和量身定制的治疗策略。本研究通过对脑肿瘤组织病理学中严格的多实例学习实验的发现，推动了患者护理。它在胶质瘤亚型分类方面建立了新的性能基准，跨多个数据集，包括一个专注于印度人口的新数据集（IPD-Brain），为现有研究提供了宝贵的资源。使用在组织病理学数据集上预训练的ResNet-50进行特征提取，结合DTFD特征聚合器，我们的方法分别在IPD-Brain和TCGA-Brain数据集上实现了三分胶质瘤亚型分类的最新AUC（分别为88.08和95.81）。此外，它在评级和检测IHC分子生物标志物（IDH1（突变 R132H）、TP53、ATRX、Ki-67）方面建立了新的基准。",
    "tldr": "本研究通过多实例学习在脑肿瘤组织病理学中取得新突破，建立了印度胶质瘤亚型分类性能基准，同时实现了新的评级和检测生物标志物的基准。",
    "en_tdlr": "This study advances patient care with rigorous multiple-instance learning experiments in brain tumor histopathology, establishing new benchmarks in glioma subtype classification for the Indian demographic and grading and detecting molecular biomarkers."
}