{
    "title": "Research on the multi-stage impact of digital economy on rural revitalization in Hainan Province based on GPM model",
    "abstract": "The rapid development of the digital economy has had a profound impact on the implementation of the rural revitalization strategy. Based on this, this study takes Hainan Province as the research object to deeply explore the impact of digital economic development on rural revitalization. The study collected panel data from 2003 to 2022 to construct an evaluation index system for the digital economy and rural revitalization and used panel regression analysis and other methods to explore the promotion effect of the digital economy on rural revitalization. Research results show that the digital economy has a significant positive impact on rural revitalization, and this impact increases as the level of fiscal expenditure increases. The issuance of digital RMB has further exerted a regulatory effect and promoted the development of the digital economy and the process of rural revitalization. At the same time, the establishment of the Hainan Free Trade Port has also played a positive role in p",
    "link": "https://arxiv.org/abs/2402.07170",
    "context": "Title: Research on the multi-stage impact of digital economy on rural revitalization in Hainan Province based on GPM model\nAbstract: The rapid development of the digital economy has had a profound impact on the implementation of the rural revitalization strategy. Based on this, this study takes Hainan Province as the research object to deeply explore the impact of digital economic development on rural revitalization. The study collected panel data from 2003 to 2022 to construct an evaluation index system for the digital economy and rural revitalization and used panel regression analysis and other methods to explore the promotion effect of the digital economy on rural revitalization. Research results show that the digital economy has a significant positive impact on rural revitalization, and this impact increases as the level of fiscal expenditure increases. The issuance of digital RMB has further exerted a regulatory effect and promoted the development of the digital economy and the process of rural revitalization. At the same time, the establishment of the Hainan Free Trade Port has also played a positive role in p",
    "path": "papers/24/02/2402.07170.json",
    "total_tokens": 983,
    "translated_title": "基于GPM模型的数字经济对海南省农村振兴的多阶段影响的研究",
    "translated_abstract": "数字经济的快速发展对农村振兴战略的实施产生了深远影响。基于此，本研究以海南省为研究对象，深入探讨数字经济发展对农村振兴的影响。研究收集了2003年至2022年的面板数据，构建了数字经济与农村振兴评价指标体系，并采用面板回归分析等方法，探究了数字经济对农村振兴的促进效果。研究结果表明，数字经济对农村振兴具有显著的正向影响，且这种影响随着财政支出水平的提高而增加。数字人民币的发行进一步发挥了监管作用，推动了数字经济发展和农村振兴的进程。同时，海南自由贸易港的建立也在农村振兴中起到了积极作用。",
    "tldr": "本研究以海南省为研究对象，探究了数字经济对农村振兴的影响。研究结果表明，数字经济对农村振兴有积极的影响，并且随着财政支出水平的提高而增加。数字人民币的发行和海南自由贸易港的建立也对农村振兴发挥了促进作用。"
}