{
    "title": "Shaping Human-AI Collaboration: Varied Scaffolding Levels in Co-writing with Language Models",
    "abstract": "arXiv:2402.11723v1 Announce Type: cross  Abstract: Advances in language modeling have paved the way for novel human-AI co-writing experiences. This paper explores how varying levels of scaffolding from large language models (LLMs) shape the co-writing process. Employing a within-subjects field experiment with a Latin square design, we asked participants (N=131) to respond to argumentative writing prompts under three randomly sequenced conditions: no AI assistance (control), next-sentence suggestions (low scaffolding), and next-paragraph suggestions (high scaffolding). Our findings reveal a U-shaped impact of scaffolding on writing quality and productivity (words/time). While low scaffolding did not significantly improve writing quality or productivity, high scaffolding led to significant improvements, especially benefiting non-regular writers and less tech-savvy users. No significant cognitive burden was observed while using the scaffolded writing tools, but a moderate decrease in text",
    "link": "https://arxiv.org/abs/2402.11723",
    "context": "Title: Shaping Human-AI Collaboration: Varied Scaffolding Levels in Co-writing with Language Models\nAbstract: arXiv:2402.11723v1 Announce Type: cross  Abstract: Advances in language modeling have paved the way for novel human-AI co-writing experiences. This paper explores how varying levels of scaffolding from large language models (LLMs) shape the co-writing process. Employing a within-subjects field experiment with a Latin square design, we asked participants (N=131) to respond to argumentative writing prompts under three randomly sequenced conditions: no AI assistance (control), next-sentence suggestions (low scaffolding), and next-paragraph suggestions (high scaffolding). Our findings reveal a U-shaped impact of scaffolding on writing quality and productivity (words/time). While low scaffolding did not significantly improve writing quality or productivity, high scaffolding led to significant improvements, especially benefiting non-regular writers and less tech-savvy users. No significant cognitive burden was observed while using the scaffolded writing tools, but a moderate decrease in text",
    "path": "papers/24/02/2402.11723.json",
    "total_tokens": 920,
    "translated_title": "塑造人工智能协作：在与语言模型共同撰写中使用不同支撑级别",
    "translated_abstract": "语言建模的进展为新颖的人工智能与人类共同撰写体验铺平了道路。本文探讨了大型语言模型（LLMs）提供的不同支撑级别如何塑造共同撰写的过程。通过拉丁方设计的被试内实验，我们邀请了131名参与者回应三个随机顺序条件下的论证写作提示：无AI辅助（对照组），下一句建议（低支撑），和下一段建议（高支撑）。我们的发现揭示了支撑对写作质量和生产率（单位时间词数）的U形影响。虽然低支撑并未显著提高写作质量或生产率，但高支撑导致了显著改善，尤其有利于非常规写作者和不太精通技术的用户。在使用支撑式写作工具时并未观察到显著的认知负担，但文字量略有下降。",
    "tldr": "本研究探讨了大型语言模型提供的不同支撑级别如何影响共同撰写过程，发现高支撑可以显著改善写作质量和生产率，特别有利于非常规写作者和不太精通技术的用户。",
    "en_tdlr": "This study investigates how varying levels of scaffolding from large language models (LLMs) affect the co-writing process, revealing that high scaffolding can significantly improve writing quality and productivity, especially benefiting non-regular writers and less tech-savvy users."
}