{
    "title": "evolSOM: an R Package for evolutionary conservation analysis with SOMs",
    "abstract": "Motivation: Unraveling the connection between genes and traits is crucial for solving many biological puzzles. Genes provide instructions for building cellular machinery, directing the processes that sustain life. RNA molecules and proteins, derived from these genetic instructions, play crucial roles in shaping cell structures, influencing reactions, and guiding behavior. This fundamental biological principle links genetic makeup to observable traits, but integrating and extracting meaningful relationships from this complex, multimodal data presents a significant challenge. Results: We introduce evolSOM, a novel R package that utilizes Self-Organizing Maps (SOMs) to explore and visualize the conservation of biological variables, easing the integration of phenotypic and genotypic attributes. By constructing species-specific or condition-specific SOMs that capture non-redundant patterns, evolSOM allows the analysis of displacement of biological variables between species or conditions. Va",
    "link": "https://arxiv.org/abs/2402.07948",
    "context": "Title: evolSOM: an R Package for evolutionary conservation analysis with SOMs\nAbstract: Motivation: Unraveling the connection between genes and traits is crucial for solving many biological puzzles. Genes provide instructions for building cellular machinery, directing the processes that sustain life. RNA molecules and proteins, derived from these genetic instructions, play crucial roles in shaping cell structures, influencing reactions, and guiding behavior. This fundamental biological principle links genetic makeup to observable traits, but integrating and extracting meaningful relationships from this complex, multimodal data presents a significant challenge. Results: We introduce evolSOM, a novel R package that utilizes Self-Organizing Maps (SOMs) to explore and visualize the conservation of biological variables, easing the integration of phenotypic and genotypic attributes. By constructing species-specific or condition-specific SOMs that capture non-redundant patterns, evolSOM allows the analysis of displacement of biological variables between species or conditions. Va",
    "path": "papers/24/02/2402.07948.json",
    "total_tokens": 889,
    "translated_title": "evolSOM:一种用于自组织映射的进化保守性分析的R包",
    "translated_abstract": "动机:解开基因和性状之间的联系对于解决许多生物难题至关重要。基因提供了构建细胞机器的指令，指导维持生命的过程。从这些遗传指令中衍生出的RNA分子和蛋白质在塑造细胞结构、影响反应和指导行为方面起着重要作用。这个基本的生物原则将基因构成与可观察性状联系起来，但是从这种复杂的多模态数据中整合和提取有意义的关系是一个重大挑战。结果:我们介绍了evolSOM，一种利用自组织映射(SOMs)探索和可视化生物变量保守性的创新R包，简化了表型和基因型属性的整合。通过构建捕捉非冗余模式的物种特定或条件特定的自组织映射，evolSOM允许分析物种或条件之间生物变量的位移。",
    "tldr": "evolSOM是一个新颖的R包，利用自组织映射( SOMs)探索和可视化生物变量保守性，以便更容易地整合表型和基因型属性，并分析不同物种或条件之间的生物变量位移。",
    "en_tdlr": "evolSOM is a novel R package that utilizes Self-Organizing Maps (SOMs) to explore and visualize the conservation of biological variables, making it easier to integrate phenotypic and genotypic attributes and analyze the displacement of biological variables between different species or conditions."
}