{
    "title": "SelfSwapper: Self-Supervised Face Swapping via Shape Agnostic Masked AutoEncoder",
    "abstract": "Face swapping has gained significant attention for its varied applications. The majority of previous face swapping approaches have relied on the seesaw game training scheme, which often leads to the instability of the model training and results in undesired samples with blended identities due to the target identity leakage problem. This paper introduces the Shape Agnostic Masked AutoEncoder (SAMAE) training scheme, a novel self-supervised approach designed to enhance face swapping model training. Our training scheme addresses the limitations of traditional training methods by circumventing the conventional seesaw game and introducing clear ground truth through its self-reconstruction training regime. It effectively mitigates identity leakage by masking facial regions of the input images and utilizing learned disentangled identity and non-identity features. Additionally, we tackle the shape misalignment problem with new techniques including perforation confusion and random mesh scaling,",
    "link": "https://arxiv.org/abs/2402.07370",
    "context": "Title: SelfSwapper: Self-Supervised Face Swapping via Shape Agnostic Masked AutoEncoder\nAbstract: Face swapping has gained significant attention for its varied applications. The majority of previous face swapping approaches have relied on the seesaw game training scheme, which often leads to the instability of the model training and results in undesired samples with blended identities due to the target identity leakage problem. This paper introduces the Shape Agnostic Masked AutoEncoder (SAMAE) training scheme, a novel self-supervised approach designed to enhance face swapping model training. Our training scheme addresses the limitations of traditional training methods by circumventing the conventional seesaw game and introducing clear ground truth through its self-reconstruction training regime. It effectively mitigates identity leakage by masking facial regions of the input images and utilizing learned disentangled identity and non-identity features. Additionally, we tackle the shape misalignment problem with new techniques including perforation confusion and random mesh scaling,",
    "path": "papers/24/02/2402.07370.json",
    "total_tokens": 928,
    "translated_title": "SelfSwapper: 通过形状无关的遮罩自编码器实现自监督人脸交换",
    "translated_abstract": "人脸交换因其多样化的应用而受到极大关注。大多数之前的人脸交换方法依赖于跷跷板式训练方案，通常导致模型训练的不稳定性并产生混合身份的不期望样本，原因是目标身份泄漏问题。本文介绍了Shape Agnostic Masked AutoEncoder (SAMAE) 训练方案，这是一种新颖的自监督方法，旨在改进人脸交换模型训练。我们的训练方案通过绕过传统的跷跷板游戏并通过自重建训练机制引入清晰的真实数据，解决了传统训练方法的局限性。它通过遮罩输入图像的面部区域和利用学到的身份和非身份特征来有效减轻身份泄漏。此外，我们还通过 perforation confusion 和随机网格缩放等新技术来解决形状不对齐问题。",
    "tldr": "本文介绍了SelfSwapper，一种通过 Shape Agnostic Masked AutoEncoder (SAMAE) 自监督方案来提升人脸交换模型训练的方法。通过绕过传统的训练方案，引入清晰的真实数据，以及利用遮罩和学到的特征，我们成功解决了身份泄漏和形状不对齐的问题。",
    "en_tdlr": "This paper introduces SelfSwapper, a method for enhancing face swapping model training using the Shape Agnostic Masked AutoEncoder (SAMAE) self-supervised scheme. By bypassing traditional training methods, introducing clear ground truth, and utilizing masks and learned features, we successfully address the issues of identity leakage and shape misalignment."
}