{
    "title": "On the performance of phonetic algorithms in microtext normalization",
    "abstract": "User-generated content published on microblogging social networks constitutes a priceless source of information. However, microtexts usually deviate from the standard lexical and grammatical rules of the language, thus making its processing by traditional intelligent systems very difficult. As an answer, microtext normalization consists in transforming those non-standard microtexts into standard well-written texts as a preprocessing step, allowing traditional approaches to continue with their usual processing. Given the importance of phonetic phenomena in non-standard text formation, an essential element of the knowledge base of a normalizer would be the phonetic rules that encode these phenomena, which can be found in the so-called phonetic algorithms.   In this work we experiment with a wide range of phonetic algorithms for the English language. The aim of this study is to determine the best phonetic algorithms within the context of candidate generation for microtext normalization. I",
    "link": "https://arxiv.org/abs/2402.02591",
    "context": "Title: On the performance of phonetic algorithms in microtext normalization\nAbstract: User-generated content published on microblogging social networks constitutes a priceless source of information. However, microtexts usually deviate from the standard lexical and grammatical rules of the language, thus making its processing by traditional intelligent systems very difficult. As an answer, microtext normalization consists in transforming those non-standard microtexts into standard well-written texts as a preprocessing step, allowing traditional approaches to continue with their usual processing. Given the importance of phonetic phenomena in non-standard text formation, an essential element of the knowledge base of a normalizer would be the phonetic rules that encode these phenomena, which can be found in the so-called phonetic algorithms.   In this work we experiment with a wide range of phonetic algorithms for the English language. The aim of this study is to determine the best phonetic algorithms within the context of candidate generation for microtext normalization. I",
    "path": "papers/24/02/2402.02591.json",
    "total_tokens": 784,
    "translated_title": "关于声学算法在微文本规范化中的性能研究",
    "translated_abstract": "在微博社交网络上发布的用户生成内容构成了一种宝贵的信息来源。然而，微文本通常偏离了标准的词汇和语法规则，因此传统的智能系统很难处理。为了解决这个问题，微文本规范化将这些非标准微文本转化为标准的、书面良好的文本作为预处理步骤，使传统方法可以继续进行常规处理。考虑到非标准文本形成中声学现象的重要性，规范化器的知识库中的一个关键元素是编码这些现象的声学规则，它们可以在所谓的声学算法中找到。在这项研究中，我们对英语语言进行了各种各样的声学算法实验。这项研究的目的是确定微文本规范化候选生成中的最佳声学算法。",
    "tldr": "这项研究通过实验评估了微文本规范化中不同声学算法的性能，旨在确定最佳的声学算法。",
    "en_tdlr": "This study experimentally evaluates the performance of different phonetic algorithms in microtext normalization and aims to determine the best algorithm for candidate generation in microtext normalization."
}