{
    "title": "Imbalance in Regression Datasets",
    "abstract": "arXiv:2402.11963v1 Announce Type: cross  Abstract: For classification, the problem of class imbalance is well known and has been extensively studied. In this paper, we argue that imbalance in regression is an equally important problem which has so far been overlooked: Due to under- and over-representations in a data set's target distribution, regressors are prone to degenerate to naive models, systematically neglecting uncommon training data and over-representing targets seen often during training. We analyse this problem theoretically and use resulting insights to develop a first definition of imbalance in regression, which we show to be a generalisation of the commonly employed imbalance measure in classification. With this, we hope to turn the spotlight on the overlooked problem of imbalance in regression and to provide common ground for future research.",
    "link": "https://arxiv.org/abs/2402.11963",
    "context": "Title: Imbalance in Regression Datasets\nAbstract: arXiv:2402.11963v1 Announce Type: cross  Abstract: For classification, the problem of class imbalance is well known and has been extensively studied. In this paper, we argue that imbalance in regression is an equally important problem which has so far been overlooked: Due to under- and over-representations in a data set's target distribution, regressors are prone to degenerate to naive models, systematically neglecting uncommon training data and over-representing targets seen often during training. We analyse this problem theoretically and use resulting insights to develop a first definition of imbalance in regression, which we show to be a generalisation of the commonly employed imbalance measure in classification. With this, we hope to turn the spotlight on the overlooked problem of imbalance in regression and to provide common ground for future research.",
    "path": "papers/24/02/2402.11963.json",
    "total_tokens": 753,
    "translated_title": "回归数据集中的不平衡问题",
    "translated_abstract": "就分类而言，类别不平衡的问题是众所周知的，并且已经得到了广泛研究。本文认为，在回归中存在的不平衡问题同样重要，但迄今为止被忽视：由于数据集目标分布中的欠表示和过多表示，回归器容易退化为朴素模型，系统地忽略不常见的训练数据并在训练期间经常见到的目标上进行过度表示。我们从理论上分析了这个问题，并利用得出的见解制定了对回归中不平衡的首个定义，我们展示这是分类中常用的不平衡度量的泛化。通过这样做，我们希望将关注点转向回归中被忽视的不平衡问题，并为未来研究奠定共同基础。",
    "tldr": "回归数据集中的不平衡问题一直被忽视，本文通过理论分析和定义，展示了这一问题的重要性，并为未来研究提供了共同基础。",
    "en_tdlr": "Imbalance in regression datasets has been overlooked, this paper highlights its importance through theoretical analysis and definition, aiming to provide a common ground for future research."
}