{
    "title": "Prediction Horizon Requirements for Automated Driving: Optimizing Safety, Comfort, and Efficiency",
    "abstract": "Predicting the movement of other road users is beneficial for improving automated vehicle (AV) performance. However, the relationship between the time horizon associated with these predictions and AV performance remains unclear. Despite the existence of numerous trajectory prediction algorithms, no studies have been conducted on how varying prediction lengths affect AV safety and other vehicle performance metrics, resulting in undefined horizon requirements for prediction methods. Our study addresses this gap by examining the effects of different prediction horizons on AV performance, focusing on safety, comfort, and efficiency. Through multiple experiments using a state-of-the-art, risk-based predictive trajectory planner, we simulated predictions with horizons up to 20 seconds. Based on our simulations, we propose a framework for specifying the minimum required and optimal prediction horizons based on specific AV performance criteria and application needs. Our results indicate that a",
    "link": "https://arxiv.org/abs/2402.03893",
    "context": "Title: Prediction Horizon Requirements for Automated Driving: Optimizing Safety, Comfort, and Efficiency\nAbstract: Predicting the movement of other road users is beneficial for improving automated vehicle (AV) performance. However, the relationship between the time horizon associated with these predictions and AV performance remains unclear. Despite the existence of numerous trajectory prediction algorithms, no studies have been conducted on how varying prediction lengths affect AV safety and other vehicle performance metrics, resulting in undefined horizon requirements for prediction methods. Our study addresses this gap by examining the effects of different prediction horizons on AV performance, focusing on safety, comfort, and efficiency. Through multiple experiments using a state-of-the-art, risk-based predictive trajectory planner, we simulated predictions with horizons up to 20 seconds. Based on our simulations, we propose a framework for specifying the minimum required and optimal prediction horizons based on specific AV performance criteria and application needs. Our results indicate that a",
    "path": "papers/24/02/2402.03893.json",
    "total_tokens": 754,
    "translated_title": "自动驾驶的预测时域需求：优化安全、舒适和效率",
    "translated_abstract": "预测其他道路使用者的移动对于改善自动驾驶车辆(AV)的性能是有益的。然而，预测与AV性能相关的时间范围的关系仍不清楚。尽管存在大量的轨迹预测算法，但还没有研究探讨不同预测长度如何影响AV安全和其他车辆性能指标，导致预测方法的预测时域需求未定义。我们的研究填补了这一空白，通过使用先进的基于风险的预测轨迹规划器进行多次实验，模拟了长达20秒的预测。基于我们的模拟结果，我们提出了一个框架，用于根据特定AV性能标准和应用需求指定最低要求和最佳预测时域。我们的结果表明，一个",
    "tldr": "在自动驾驶中，我们通过研究不同预测时域对性能的影响，提出了根据其特定需求来确定最佳预测时域的框架。"
}