{
    "title": "Detection of the most influential variables for preventing postpartum urinary incontinence using machine learning techniques",
    "abstract": "arXiv:2402.09498v1 Announce Type: new  Abstract: Background: Postpartum urinary incontinence (PUI) is a common issue among postnatal women. Previous studies identified potential related variables, but lacked analysis on certain intrinsic and extrinsic patient variables during pregnancy.   Objective: The study aims to evaluate the most influential variables in PUI using machine learning, focusing on intrinsic, extrinsic, and combined variable groups.   Methods: Data from 93 pregnant women were analyzed using machine learning and oversampling techniques. Four key variables were predicted: occurrence, frequency, intensity of urinary incontinence, and stress urinary incontinence.   Results: Models using extrinsic variables were most accurate, with 70% accuracy for urinary incontinence, 77% for frequency, 71% for intensity, and 93% for stress urinary incontinence.   Conclusions: The study highlights extrinsic variables as significant predictors of PUI issues. This suggests that PUI preventi",
    "link": "https://arxiv.org/abs/2402.09498",
    "context": "Title: Detection of the most influential variables for preventing postpartum urinary incontinence using machine learning techniques\nAbstract: arXiv:2402.09498v1 Announce Type: new  Abstract: Background: Postpartum urinary incontinence (PUI) is a common issue among postnatal women. Previous studies identified potential related variables, but lacked analysis on certain intrinsic and extrinsic patient variables during pregnancy.   Objective: The study aims to evaluate the most influential variables in PUI using machine learning, focusing on intrinsic, extrinsic, and combined variable groups.   Methods: Data from 93 pregnant women were analyzed using machine learning and oversampling techniques. Four key variables were predicted: occurrence, frequency, intensity of urinary incontinence, and stress urinary incontinence.   Results: Models using extrinsic variables were most accurate, with 70% accuracy for urinary incontinence, 77% for frequency, 71% for intensity, and 93% for stress urinary incontinence.   Conclusions: The study highlights extrinsic variables as significant predictors of PUI issues. This suggests that PUI preventi",
    "path": "papers/24/02/2402.09498.json",
    "total_tokens": 913,
    "translated_title": "使用机器学习技术检测预防产后尿失禁的最具影响力变量",
    "translated_abstract": "arXiv:2402.09498v1 公告类型：新摘要：背景：产后尿失禁（PUI）是产后妇女的常见问题。以往的研究鉴定了潜在的相关变量，但缺乏对妊娠期间某些固有和外在的患者变量的分析。目的：本研究旨在利用机器学习评估PUI中的最具影响力的变量，重点关注固有、外在和综合变量组。方法：使用机器学习和过采样技术分析了93名孕妇的数据。预测了四个关键变量：尿失禁发生率、频率、强度和压力尿失禁。结果：使用外在变量的模型最准确，尿失禁准确率为70％，频率为77％，强度为71％，压力尿失禁为93％。结论：本研究强调外在变量是PUI问题的重要预测因素。这表明PUI的预防可能需要注意外在因素。",
    "tldr": "本研究使用机器学习技术评估了产后尿失禁中最具影响力的变量，并发现外在变量是PUI问题的重要预测因素。",
    "en_tdlr": "This study uses machine learning techniques to evaluate the most influential variables in preventing postpartum urinary incontinence (PUI), and finds that extrinsic variables are significant predictors of PUI issues."
}