{
    "title": "Heterogeneous Graph Reasoning for Fact Checking over Texts and Tables",
    "abstract": "arXiv:2402.13028v1 Announce Type: cross  Abstract: Fact checking aims to predict claim veracity by reasoning over multiple evidence pieces. It usually involves evidence retrieval and veracity reasoning. In this paper, we focus on the latter, reasoning over unstructured text and structured table information. Previous works have primarily relied on fine-tuning pretrained language models or training homogeneous-graph-based models. Despite their effectiveness, we argue that they fail to explore the rich semantic information underlying the evidence with different structures. To address this, we propose a novel word-level Heterogeneous-graph-based model for Fact Checking over unstructured and structured information, namely HeterFC. Our approach leverages a heterogeneous evidence graph, with words as nodes and thoughtfully designed edges representing different evidence properties. We perform information propagation via a relational graph neural network, facilitating interactions between claim",
    "link": "https://arxiv.org/abs/2402.13028",
    "context": "Title: Heterogeneous Graph Reasoning for Fact Checking over Texts and Tables\nAbstract: arXiv:2402.13028v1 Announce Type: cross  Abstract: Fact checking aims to predict claim veracity by reasoning over multiple evidence pieces. It usually involves evidence retrieval and veracity reasoning. In this paper, we focus on the latter, reasoning over unstructured text and structured table information. Previous works have primarily relied on fine-tuning pretrained language models or training homogeneous-graph-based models. Despite their effectiveness, we argue that they fail to explore the rich semantic information underlying the evidence with different structures. To address this, we propose a novel word-level Heterogeneous-graph-based model for Fact Checking over unstructured and structured information, namely HeterFC. Our approach leverages a heterogeneous evidence graph, with words as nodes and thoughtfully designed edges representing different evidence properties. We perform information propagation via a relational graph neural network, facilitating interactions between claim",
    "path": "papers/24/02/2402.13028.json",
    "total_tokens": 674,
    "translated_title": "异质图推理用于文本和表格事实核查",
    "translated_abstract": "事实核查旨在通过推理多个证据以预测声明的真实性。本文专注于后者，即推理关于非结构化文本和结构化表格信息的真实性。我们提出了一种新颖的基于异质图的词级模型HeterFC，用于事实核查。我们的方法利用了一个异质证据图，以单词为节点，并且设计了代表不同证据属性的边缘，通过关系图神经网络进行信息传播，促进声明之间的交互。",
    "tldr": "提出了一种基于异质图的模型HeterFC，用于文本和表格中的事实核查，利用异质证据图和关系图神经网络进行信息传播。",
    "en_tdlr": "Proposed a model HeterFC based on heterogeneous graph for fact checking over text and tables, leveraging heterogeneous evidence graph and relational graph neural network for information propagation."
}