{
    "title": "Seismic Traveltime Tomography with Label-free Learning",
    "abstract": "Deep learning techniques have been used to build velocity models (VMs) for seismic traveltime tomography and have shown encouraging performance in recent years. However, they need to generate labeled samples (i.e., pairs of input and label) to train the deep neural network (NN) with end-to-end learning, and the real labels for field data inversion are usually missing or very expensive. Some traditional tomographic methods can be implemented quickly, but their effectiveness is often limited by prior assumptions. To avoid generating labeled samples, we propose a novel method by integrating deep learning and dictionary learning to enhance the VMs with low resolution by using the traditional tomography-least square method (LSQR). We first design a type of shallow and simple NN to reduce computational cost followed by proposing a two-step strategy to enhance the VMs with low resolution: (1) Warming up. An initial dictionary is trained from the estimation by LSQR through dictionary learning ",
    "link": "https://arxiv.org/abs/2402.00310",
    "context": "Title: Seismic Traveltime Tomography with Label-free Learning\nAbstract: Deep learning techniques have been used to build velocity models (VMs) for seismic traveltime tomography and have shown encouraging performance in recent years. However, they need to generate labeled samples (i.e., pairs of input and label) to train the deep neural network (NN) with end-to-end learning, and the real labels for field data inversion are usually missing or very expensive. Some traditional tomographic methods can be implemented quickly, but their effectiveness is often limited by prior assumptions. To avoid generating labeled samples, we propose a novel method by integrating deep learning and dictionary learning to enhance the VMs with low resolution by using the traditional tomography-least square method (LSQR). We first design a type of shallow and simple NN to reduce computational cost followed by proposing a two-step strategy to enhance the VMs with low resolution: (1) Warming up. An initial dictionary is trained from the estimation by LSQR through dictionary learning ",
    "path": "papers/24/02/2402.00310.json",
    "total_tokens": 899,
    "translated_title": "使用无标签学习的地震走时层析成像",
    "translated_abstract": "近年来，深度学习技术在地震走时层析成像中被应用于构建速度模型（VMs），并显示出令人鼓舞的表现。然而，它们需要生成带标签的样本（即输入和标签的对应），以进行端到端学习的深度神经网络（NN）训练，而现实数据反演的真实标签通常缺失或非常昂贵。一些传统层析方法可以快速实施，但其效果通常受到先验假设的限制。为了避免生成带标签的样本，我们提出了一种新方法，通过将深度学习和字典学习与传统的层析-最小二乘法（LSQR）相结合，以提高低分辨率的VMs。我们首先设计了一种浅层简单的NN来降低计算成本，然后提出了一种两步策略来提高低分辨率的VMs：（1）预热阶段。通过字典学习，从LSQR估计中训练出初始字典。",
    "tldr": "这项研究提出了一种使用无标签学习的地震走时层析成像方法，该方法通过将深度学习和字典学习与传统的层析-最小二乘法相结合，来提高低分辨率的速度模型。"
}