{
    "title": "Fairness and Privacy Guarantees in Federated Contextual Bandits",
    "abstract": "This paper considers the contextual multi-armed bandit (CMAB) problem with fairness and privacy guarantees in a federated environment. We consider merit-based exposure as the desired fair outcome, which provides exposure to each action in proportion to the reward associated. We model the algorithm's effectiveness using fairness regret, which captures the difference between fair optimal policy and the policy output by the algorithm. Applying fair CMAB algorithm to each agent individually leads to fairness regret linear in the number of agents. We propose that collaborative -- federated learning can be more effective and provide the algorithm Fed-FairX-LinUCB that also ensures differential privacy. The primary challenge in extending the existing privacy framework is designing the communication protocol for communicating required information across agents. A naive protocol can either lead to weaker privacy guarantees or higher regret. We design a novel communication protocol that allows f",
    "link": "https://arxiv.org/abs/2402.03531",
    "context": "Title: Fairness and Privacy Guarantees in Federated Contextual Bandits\nAbstract: This paper considers the contextual multi-armed bandit (CMAB) problem with fairness and privacy guarantees in a federated environment. We consider merit-based exposure as the desired fair outcome, which provides exposure to each action in proportion to the reward associated. We model the algorithm's effectiveness using fairness regret, which captures the difference between fair optimal policy and the policy output by the algorithm. Applying fair CMAB algorithm to each agent individually leads to fairness regret linear in the number of agents. We propose that collaborative -- federated learning can be more effective and provide the algorithm Fed-FairX-LinUCB that also ensures differential privacy. The primary challenge in extending the existing privacy framework is designing the communication protocol for communicating required information across agents. A naive protocol can either lead to weaker privacy guarantees or higher regret. We design a novel communication protocol that allows f",
    "path": "papers/24/02/2402.03531.json",
    "total_tokens": 925,
    "translated_title": "在联邦环境中的上下文多臂老虎机问题中的公平性和隐私保证",
    "translated_abstract": "本文考虑了在联邦环境中具有公平性和隐私保证的上下文多臂老虎机（CMAB）问题。我们将基于优势的曝光视为期望的公平结果，该结果根据相关奖励的比例给予每个动作曝光。我们使用公平损失来模拟算法的效果，公平损失捕捉了公平最优策略和算法输出策略之间的差异。将公平CMAB算法应用于每个独立的代理会导致与代理数量成线性关系的公平损失。我们提出合作式--联邦学习可更加有效，并提供确保差分隐私的算法Fed-FairX-LinUCB。扩展现有隐私框架的主要挑战在于设计跨代理通信所需信息的通信协议。一个简单的协议可能会导致较弱的隐私保证或更高的损失。我们设计了一种新颖的通信协议，允许f",
    "tldr": "本文研究了在联邦环境中的上下文多臂老虎机问题，提出了一个合作式联邦学习算法Fed-FairX-LinUCB。该算法通过设计新颖的通信协议，保证了公平性和隐私性，解决了传统算法在代理数量上产生的公平性损失问题。"
}