{
    "title": "Application of Machine Learning Optimization in Cloud Computing Resource Scheduling and Management",
    "abstract": "arXiv:2402.17216v1 Announce Type: cross  Abstract: In recent years, cloud computing has been widely used. Cloud computing refers to the centralized computing resources, users through the access to the centralized resources to complete the calculation, the cloud computing center will return the results of the program processing to the user. Cloud computing is not only for individual users, but also for enterprise users. By purchasing a cloud server, users do not have to buy a large number of computers, saving computing costs. According to a report by China Economic News Network, the scale of cloud computing in China has reached 209.1 billion yuan. At present, the more mature cloud service providers in China are Ali Cloud, Baidu Cloud, Huawei Cloud and so on. Therefore, this paper proposes an innovative approach to solve complex problems in cloud computing resource scheduling and management using machine learning optimization techniques. Through in-depth study of challenges such as low r",
    "link": "https://arxiv.org/abs/2402.17216",
    "context": "Title: Application of Machine Learning Optimization in Cloud Computing Resource Scheduling and Management\nAbstract: arXiv:2402.17216v1 Announce Type: cross  Abstract: In recent years, cloud computing has been widely used. Cloud computing refers to the centralized computing resources, users through the access to the centralized resources to complete the calculation, the cloud computing center will return the results of the program processing to the user. Cloud computing is not only for individual users, but also for enterprise users. By purchasing a cloud server, users do not have to buy a large number of computers, saving computing costs. According to a report by China Economic News Network, the scale of cloud computing in China has reached 209.1 billion yuan. At present, the more mature cloud service providers in China are Ali Cloud, Baidu Cloud, Huawei Cloud and so on. Therefore, this paper proposes an innovative approach to solve complex problems in cloud computing resource scheduling and management using machine learning optimization techniques. Through in-depth study of challenges such as low r",
    "path": "papers/24/02/2402.17216.json",
    "total_tokens": 752,
    "translated_title": "机器学习优化在云计算资源调度与管理中的应用",
    "translated_abstract": "近年来，云计算被广泛应用。云计算是指集中式的计算资源，用户通过访问集中式资源完成计算，云计算中心将程序处理结果返回给用户。云计算不仅适用于个人用户，也适用于企业用户。购买云服务器后，用户无需购买大量计算机，节约了计算成本。根据中国经济新闻网络的报告，中国的云计算规模已达到2091亿元人民币。目前，中国较为成熟的云服务提供商有阿里云、百度云、华为云等。因此，本文提出了一种创新方法，利用机器学习优化技术解决云计算资源调度与管理中的复杂问题。",
    "tldr": "本文提出了一种利用机器学习优化技术解决云计算资源调度与管理中复杂问题的创新方法。",
    "en_tdlr": "This paper proposes an innovative approach to solve complex problems in cloud computing resource scheduling and management using machine learning optimization techniques."
}