{
    "title": "Computational Complexity of Preferred Subset Repairs on Data-Graphs",
    "abstract": "arXiv:2402.09265v1 Announce Type: cross Abstract: The problem of repairing inconsistent knowledge bases has a long history within the communities of database theory and knowledge representation and reasoning, especially from the perspective of structured data. However, as the data available in real-world domains becomes more complex and interconnected, the need naturally arises for developing new types of repositories, representation languages, and semantics, to allow for more suitable ways to query and reason about it. Graph databases provide an effective way to represent relationships among semi-structured data, and allow processing and querying these connections efficiently. In this work, we focus on the problem of computing prioritized repairs over graph databases with data values, using a notion of consistency based on Reg-GXPath expressions as integrity constraints. We present several preference criteria based on the standard subset repair semantics, incorporating weights, multis",
    "link": "https://arxiv.org/abs/2402.09265",
    "context": "Title: Computational Complexity of Preferred Subset Repairs on Data-Graphs\nAbstract: arXiv:2402.09265v1 Announce Type: cross Abstract: The problem of repairing inconsistent knowledge bases has a long history within the communities of database theory and knowledge representation and reasoning, especially from the perspective of structured data. However, as the data available in real-world domains becomes more complex and interconnected, the need naturally arises for developing new types of repositories, representation languages, and semantics, to allow for more suitable ways to query and reason about it. Graph databases provide an effective way to represent relationships among semi-structured data, and allow processing and querying these connections efficiently. In this work, we focus on the problem of computing prioritized repairs over graph databases with data values, using a notion of consistency based on Reg-GXPath expressions as integrity constraints. We present several preference criteria based on the standard subset repair semantics, incorporating weights, multis",
    "path": "papers/24/02/2402.09265.json",
    "total_tokens": 764,
    "translated_title": "数据图上首选子集修复的计算复杂性",
    "translated_abstract": "数据库理论和知识表示与推理领域一直以来都存在解决不一致知识库的问题，并且特别关注结构化数据的角度。然而，随着现实领域中可用数据变得更加复杂和互相关联，自然而然地需要开发新类型的存储库、表示语言和语义以实现更合适的查询和推理方式。图数据库提供了一种有效的方法来表示半结构化数据之间的关系，并且能够高效地处理和查询这些连接。在这项工作中，我们专注于使用基于Reg-GXPath表达式的一致性概念作为完整性约束，计算包含数据值的图数据库上的优先修复问题。我们提出了基于标准子集修复语义的几种偏好准则，包括权重和多样性。",
    "tldr": "本论文研究了在图数据库上使用Reg-GXPath表达式作为完整性约束，计算包含数据值的优先修复问题，并提出了几种偏好准则。",
    "en_tdlr": "This paper investigates the problem of computing prioritized repairs over graph databases with data values using Reg-GXPath expressions as integrity constraints, and proposes several preference criteria."
}