{
    "title": "Zero Shot Molecular Generation via Similarity Kernels",
    "abstract": "arXiv:2402.08708v1 Announce Type: cross Abstract: Generative modelling aims to accelerate the discovery of novel chemicals by directly proposing structures with desirable properties. Recently, score-based, or diffusion, generative models have significantly outperformed previous approaches. Key to their success is the close relationship between the score and physical force, allowing the use of powerful equivariant neural networks. However, the behaviour of the learnt score is not yet well understood. Here, we analyse the score by training an energy-based diffusion model for molecular generation. We find that during the generation the score resembles a restorative potential initially and a quantum-mechanical force at the end. In between the two endpoints, it exhibits special properties that enable the building of large molecules. Using insights from the trained model, we present Similarity-based Molecular Generation (SiMGen), a new method for zero shot molecular generation. SiMGen combin",
    "link": "https://arxiv.org/abs/2402.08708",
    "context": "Title: Zero Shot Molecular Generation via Similarity Kernels\nAbstract: arXiv:2402.08708v1 Announce Type: cross Abstract: Generative modelling aims to accelerate the discovery of novel chemicals by directly proposing structures with desirable properties. Recently, score-based, or diffusion, generative models have significantly outperformed previous approaches. Key to their success is the close relationship between the score and physical force, allowing the use of powerful equivariant neural networks. However, the behaviour of the learnt score is not yet well understood. Here, we analyse the score by training an energy-based diffusion model for molecular generation. We find that during the generation the score resembles a restorative potential initially and a quantum-mechanical force at the end. In between the two endpoints, it exhibits special properties that enable the building of large molecules. Using insights from the trained model, we present Similarity-based Molecular Generation (SiMGen), a new method for zero shot molecular generation. SiMGen combin",
    "path": "papers/24/02/2402.08708.json",
    "total_tokens": 811,
    "translated_title": "通过相似性核实现零-shot分子生成",
    "translated_abstract": "生成建模旨在通过直接提出具有理想属性的结构加速新化学物质的发现。最近，基于分数或扩散的生成模型明显优于之前的方法。其成功的关键在于分数与物理力之间的密切关系，可以使用强大的等变神经网络。然而，学到的分数的行为尚不完全理解。在这里，我们通过训练一个基于能量的扩散模型来分析分数以进行分子生成。我们发现在生成过程中，分数一开始类似于恢复性能势，并在最后类似于量子力学力。在这两个端点之间，它表现出能够构建大分子的特殊属性。利用从训练模型中获得的见解，我们提出了基于相似性的分子生成（SiMGen），这是一种新的零-shot分子生成方法。",
    "tldr": "通过研究基于能量的扩散模型分数行为，提出了一种新的零-shot分子生成方法SiMGen，该方法使用基于相似性的分子生成技术，能够构建大分子。",
    "en_tdlr": "A new method for zero-shot molecular generation, SiMGen, is presented by analyzing the behavior of scores in energy-based diffusion models. It utilizes similarity-based molecular generation to build large molecules."
}