{
    "title": "Explaining the emergence of land-use frontiers",
    "abstract": "arXiv:2402.12487v1 Announce Type: new  Abstract: Land use expansion is linked to major sustainability concerns including climate change, food security and biodiversity loss. This expansion is largely concentrated in so-called frontiers, defined here as places experiencing marked transformations due to rapid resource exploitation. Understanding the mechanisms shaping these frontiers is crucial for sustainability. Previous work focused mainly on explaining how active frontiers advance, in particular into tropical forests. Comparatively, our understanding of how frontiers emerge in territories considered marginal in terms of agricultural productivity and global market integration remains weak. We synthesize conceptual tools explaining resource and land-use frontiers, including theories of land rent and agglomeration economies, of frontiers as successive waves, spaces of territorialization, friction, and opportunities, anticipation and expectation. We then propose a new theory of frontier ",
    "link": "https://arxiv.org/abs/2402.12487",
    "context": "Title: Explaining the emergence of land-use frontiers\nAbstract: arXiv:2402.12487v1 Announce Type: new  Abstract: Land use expansion is linked to major sustainability concerns including climate change, food security and biodiversity loss. This expansion is largely concentrated in so-called frontiers, defined here as places experiencing marked transformations due to rapid resource exploitation. Understanding the mechanisms shaping these frontiers is crucial for sustainability. Previous work focused mainly on explaining how active frontiers advance, in particular into tropical forests. Comparatively, our understanding of how frontiers emerge in territories considered marginal in terms of agricultural productivity and global market integration remains weak. We synthesize conceptual tools explaining resource and land-use frontiers, including theories of land rent and agglomeration economies, of frontiers as successive waves, spaces of territorialization, friction, and opportunities, anticipation and expectation. We then propose a new theory of frontier ",
    "path": "papers/24/02/2402.12487.json",
    "total_tokens": 798,
    "translated_title": "解释土地利用前沿的出现",
    "translated_abstract": "土地利用扩张与主要的可持续性问题相关，包括气候变化、粮食安全和生物多样性丧失。这种扩张主要集中在所谓的前沿地区，本文定义前沿地区为由于快速资源开发而经历明显转变的地方。了解塑造这些前沿的机制对于可持续性至关重要。以前的研究主要集中在解释活跃前沿地区如何推进，特别是进入热带森林。相比之下，在边缘化的农业生产力和全球市场融合方面认为次要的领土中前沿地区如何出现的理解还很弱。我们综合了解释资源和土地利用前沿的概念工具，包括土地租金和集聚经济理论，把前沿看作连续波浪、领土化空间、摩擦和机会、预期和期望。我们提出了一个新的前沿理论。",
    "tldr": "本文综合了解释资源和土地利用前沿的概念工具，提出了一个新的前沿理论。",
    "en_tdlr": "The paper synthesizes conceptual tools explaining resource and land-use frontiers and proposes a new theory of frontiers."
}