{
    "title": "Data-driven algorithm design using neural networks with applications to branch-and-cut",
    "abstract": "Data-driven algorithm design is a paradigm that uses statistical and machine learning techniques to select from a class of algorithms for a computational problem an algorithm that has the best expected performance with respect to some (unknown) distribution on the instances of the problem. We build upon recent work in this line of research by introducing the idea where, instead of selecting a single algorithm that has the best performance, we allow the possibility of selecting an algorithm based on the instance to be solved. In particular, given a representative sample of instances, we learn a neural network that maps an instance of the problem to the most appropriate algorithm {\\em for that instance}. We formalize this idea and derive rigorous sample complexity bounds for this learning problem, in the spirit of recent work in data-driven algorithm design. We then apply this approach to the problem of making good decisions in the branch-and-cut framework for mixed-integer optimization ",
    "link": "https://arxiv.org/abs/2402.02328",
    "context": "Title: Data-driven algorithm design using neural networks with applications to branch-and-cut\nAbstract: Data-driven algorithm design is a paradigm that uses statistical and machine learning techniques to select from a class of algorithms for a computational problem an algorithm that has the best expected performance with respect to some (unknown) distribution on the instances of the problem. We build upon recent work in this line of research by introducing the idea where, instead of selecting a single algorithm that has the best performance, we allow the possibility of selecting an algorithm based on the instance to be solved. In particular, given a representative sample of instances, we learn a neural network that maps an instance of the problem to the most appropriate algorithm {\\em for that instance}. We formalize this idea and derive rigorous sample complexity bounds for this learning problem, in the spirit of recent work in data-driven algorithm design. We then apply this approach to the problem of making good decisions in the branch-and-cut framework for mixed-integer optimization ",
    "path": "papers/24/02/2402.02328.json",
    "total_tokens": 799,
    "translated_title": "基于神经网络的数据驱动算法设计及其在分支定界中的应用",
    "translated_abstract": "数据驱动算法设计是一种使用统计和机器学习技术从一类算法中选择在某个（未知）问题实例分布上表现最佳的算法的范例。本文在这一研究领域的最新工作的基础上引入了一个新的思路，即不仅仅选择一个具有最佳性能的单一算法，而是允许根据问题实例选择算法。具体而言，给定一组代表性的问题实例样本，我们学习一个神经网络，将问题实例映射到最合适的算法。我们将这一思路形式化，并根据最近的数据驱动算法设计的工作，推导出了这个学习问题的严格样本复杂度界限。然后，我们将这种方法应用到混合整数优化的分支定界框架中，以做出良好的决策。",
    "tldr": "本文介绍了一种基于神经网络的数据驱动算法设计方法，并将其应用于分支定界框架中，用于解决混合整数优化问题。",
    "en_tdlr": "This paper presents a data-driven algorithm design approach based on neural networks, and applies it to the branch-and-cut framework for solving mixed-integer optimization problems."
}