{
    "title": "Convolutional Neural Networks for signal detection in real LIGO data",
    "abstract": "Searching the data of gravitational-wave detectors for signals from compact binary mergers is a computationally demanding task. Recently, machine learning algorithms have been proposed to address current and future challenges. However, the results of these publications often differ greatly due to differing choices in the evaluation procedure. The Machine Learning Gravitational-Wave Search Challenge was organized to resolve these issues and produce a unified framework for machine-learning search evaluation. Six teams submitted contributions, four of which are based on machine learning methods and two are state-of-the-art production analyses. This paper describes the submission from the team TPI FSU Jena and its updated variant. We also apply our algorithm to real O3b data and recover the relevant events of the GWTC-3 catalog.",
    "link": "https://arxiv.org/abs/2402.07492",
    "context": "Title: Convolutional Neural Networks for signal detection in real LIGO data\nAbstract: Searching the data of gravitational-wave detectors for signals from compact binary mergers is a computationally demanding task. Recently, machine learning algorithms have been proposed to address current and future challenges. However, the results of these publications often differ greatly due to differing choices in the evaluation procedure. The Machine Learning Gravitational-Wave Search Challenge was organized to resolve these issues and produce a unified framework for machine-learning search evaluation. Six teams submitted contributions, four of which are based on machine learning methods and two are state-of-the-art production analyses. This paper describes the submission from the team TPI FSU Jena and its updated variant. We also apply our algorithm to real O3b data and recover the relevant events of the GWTC-3 catalog.",
    "path": "papers/24/02/2402.07492.json",
    "total_tokens": 859,
    "translated_title": "用于LIGO实时数据中信号检测的卷积神经网络",
    "translated_abstract": "在搜索引力波探测器数据中寻找来自紧凑二进制合并的信号是一项计算需求严峻的任务。最近，机器学习算法被提出来应对当前和未来的挑战。然而，这些出版物的结果往往因为在评估过程中的不同选择而大相径庭。机器学习引力波搜索挑战赛旨在解决这些问题，并产生一个统一的机器学习搜索评估框架。六个团队提交了贡献，其中四个基于机器学习方法，两个是最先进的生产分析。本文介绍了来自TPI FSU Jena团队及其更新版本的提交。我们还将算法应用于真实的O3b数据，并恢复了GWTC-3目录中的相关事件。",
    "tldr": "本论文介绍了用于LIGO实时数据中信号检测的卷积神经网络，并描述了解决机器学习评估框架问题的机器学习引力波搜索挑战赛。团队TPI FSU Jena提交了基于机器学习方法的算法，并成功将其应用于真实的O3b数据，并恢复了GWTC-3目录中的相关事件。"
}