{
    "title": "Beyond Spatio-Temporal Representations: Evolving Fourier Transform for Temporal Graphs",
    "abstract": "arXiv:2402.16078v1 Announce Type: new  Abstract: We present the Evolving Graph Fourier Transform (EFT), the first invertible spectral transform that captures evolving representations on temporal graphs. We motivate our work by the inadequacy of existing methods for capturing the evolving graph spectra, which are also computationally expensive due to the temporal aspect along with the graph vertex domain. We view the problem as an optimization over the Laplacian of the continuous time dynamic graph. Additionally, we propose pseudo-spectrum relaxations that decompose the transformation process, making it highly computationally efficient. The EFT method adeptly captures the evolving graph's structural and positional properties, making it effective for downstream tasks on evolving graphs. Hence, as a reference implementation, we develop a simple neural model induced with EFT for capturing evolving graph spectra. We empirically validate our theoretical findings on a number of large-scale an",
    "link": "https://arxiv.org/abs/2402.16078",
    "context": "Title: Beyond Spatio-Temporal Representations: Evolving Fourier Transform for Temporal Graphs\nAbstract: arXiv:2402.16078v1 Announce Type: new  Abstract: We present the Evolving Graph Fourier Transform (EFT), the first invertible spectral transform that captures evolving representations on temporal graphs. We motivate our work by the inadequacy of existing methods for capturing the evolving graph spectra, which are also computationally expensive due to the temporal aspect along with the graph vertex domain. We view the problem as an optimization over the Laplacian of the continuous time dynamic graph. Additionally, we propose pseudo-spectrum relaxations that decompose the transformation process, making it highly computationally efficient. The EFT method adeptly captures the evolving graph's structural and positional properties, making it effective for downstream tasks on evolving graphs. Hence, as a reference implementation, we develop a simple neural model induced with EFT for capturing evolving graph spectra. We empirically validate our theoretical findings on a number of large-scale an",
    "path": "papers/24/02/2402.16078.json",
    "total_tokens": 862,
    "translated_title": "超越时空表示：演化Fourier变换用于时间图",
    "translated_abstract": "我们提出了Evolving Graph Fourier Transform (EFT)，这是第一个捕捉时间图演变表示的可逆谱变换。我们通过现有方法无法捕捉演变图谱的不足来激发我们的工作，由于时间因素以及图顶点域的计算成本较高。我们将问题视为对连续时间动态图的拉普拉斯进行优化。此外，我们提出了伪谱松弛，使变换过程分解，从而使其高度计算有效。EFT方法熟练地捕捉了演变图的结构和位置属性，使其可以有效用于演变图上的下游任务。因此，作为参考实施，我们开发了一个简单的神经模型，用EFT来捕捉演变图谱。我们在大规模数据集上通过实验证实了我们的理论发现。",
    "tldr": "这里是中文总结出的一句话要点：提出了Evolution Graph Fourier Transform(EFT)，首次实现在时间图上捕捉演化表示的可逆谱变换，通过优化连续时间动态图的拉普拉斯，同时提出了伪谱松弛来高效计算转换过程。",
    "en_tdlr": "Here is the key point summarized in English: The paper introduces Evolving Graph Fourier Transform (EFT), the first invertible spectral transform that captures evolving representations on temporal graphs, optimizing over the Laplacian of continuous time dynamic graphs and proposing pseudo-spectrum relaxations for efficient computation of the transformation process."
}