{
    "title": "Sets are all you need: Ultrafast jet classification on FPGAs for HL-LHC",
    "abstract": "We study various machine learning based algorithms for performing accurate jet flavor classification on field-programmable gate arrays and demonstrate how latency and resource consumption scale with the input size and choice of algorithm. These architectures provide an initial design for models that could be used for tagging at the CERN LHC during its high-luminosity phase. The high-luminosity upgrade will lead to a five-fold increase in its instantaneous luminosity for proton-proton collisions and, in turn, higher data volume and complexity, such as the availability of jet constituents. Through quantization-aware training and efficient hardware implementations, we show that O(100) ns inference of complex architectures such as deep sets and interaction networks is feasible at a low computational resource cost.",
    "link": "https://arxiv.org/abs/2402.01876",
    "context": "Title: Sets are all you need: Ultrafast jet classification on FPGAs for HL-LHC\nAbstract: We study various machine learning based algorithms for performing accurate jet flavor classification on field-programmable gate arrays and demonstrate how latency and resource consumption scale with the input size and choice of algorithm. These architectures provide an initial design for models that could be used for tagging at the CERN LHC during its high-luminosity phase. The high-luminosity upgrade will lead to a five-fold increase in its instantaneous luminosity for proton-proton collisions and, in turn, higher data volume and complexity, such as the availability of jet constituents. Through quantization-aware training and efficient hardware implementations, we show that O(100) ns inference of complex architectures such as deep sets and interaction networks is feasible at a low computational resource cost.",
    "path": "papers/24/02/2402.01876.json",
    "total_tokens": 812,
    "translated_title": "集合就是你所需要的：用于HL-LHC的超快速喷注分类在FPGAs上的研究",
    "translated_abstract": "我们研究了各种基于机器学习的算法，用于在可编程逻辑门阵列上进行准确的喷注风味分类，并展示了延迟和资源消耗如何随着输入大小和算法选择而变化。这些架构为在CERN LHC的高亮度阶段标记所能使用的模型提供了一个初始设计。高亮度升级将导致质子-质子碰撞的瞬时亮度增加五倍，进而产生更高的数据量和复杂性，例如喷注组成部分的可用性。通过量化感知的训练和高效的硬件实现，我们展示了复杂架构（如深度集合和交互网络）的推断时间可以达到O（100）ns，并且计算资源成本较低。",
    "tldr": "该论文研究了在FPGA上进行高性能喷注分类的机器学习算法，通过量化感知的训练和高效的硬件实现，实现了低延迟和低资源消耗，为高亮度阶段标记的模型提供了初始设计。",
    "en_tdlr": "This paper studied machine learning algorithms for high-performance jet classification on FPGAs, achieving low latency and resource consumption through quantization-aware training and efficient hardware implementation, providing an initial design for models used in high-luminosity phase tagging."
}