{
    "title": "When Scaling Meets LLM Finetuning: The Effect of Data, Model and Finetuning Method",
    "abstract": "arXiv:2402.17193v1 Announce Type: new  Abstract: While large language models (LLMs) often adopt finetuning to unlock their capabilities for downstream applications, our understanding on the inductive biases (especially the scaling properties) of different finetuning methods is still limited. To fill this gap, we conduct systematic experiments studying whether and how different scaling factors, including LLM model size, pretraining data size, new finetuning parameter size and finetuning data size, affect the finetuning performance. We consider two types of finetuning -- full-model tuning (FMT) and parameter efficient tuning (PET, including prompt tuning and LoRA), and explore their scaling behaviors in the data-limited regime where the LLM model size substantially outweighs the finetuning data size. Based on two sets of pretrained bilingual LLMs from 1B to 16B and experiments on bilingual machine translation and multilingual summarization benchmarks, we find that 1) LLM finetuning follo",
    "link": "https://arxiv.org/abs/2402.17193",
    "context": "Title: When Scaling Meets LLM Finetuning: The Effect of Data, Model and Finetuning Method\nAbstract: arXiv:2402.17193v1 Announce Type: new  Abstract: While large language models (LLMs) often adopt finetuning to unlock their capabilities for downstream applications, our understanding on the inductive biases (especially the scaling properties) of different finetuning methods is still limited. To fill this gap, we conduct systematic experiments studying whether and how different scaling factors, including LLM model size, pretraining data size, new finetuning parameter size and finetuning data size, affect the finetuning performance. We consider two types of finetuning -- full-model tuning (FMT) and parameter efficient tuning (PET, including prompt tuning and LoRA), and explore their scaling behaviors in the data-limited regime where the LLM model size substantially outweighs the finetuning data size. Based on two sets of pretrained bilingual LLMs from 1B to 16B and experiments on bilingual machine translation and multilingual summarization benchmarks, we find that 1) LLM finetuning follo",
    "path": "papers/24/02/2402.17193.json",
    "total_tokens": 846,
    "translated_title": "当扩展遇到LLM微调: 数据、模型和微调方法的影响",
    "translated_abstract": "大型语言模型（LLMs）通常采用微调来释放其在下游应用中的能力，但我们对不同微调方法的归纳偏差（特别是扩展属性）的理解仍然有限。为了填补这一空白，我们进行了系统实验，研究不同扩展因素（包括LLM模型大小、预训练数据大小、新微调参数大小和微调数据大小）如何影响微调性能。我们考虑了两种微调类型--全模型调整（FMT）和参数高效微调（PET，包括提示调整和LoRA），并探索它们在数据有限的情况下的扩展行为，其中LLM模型大小远远超过微调数据大小。基于1B到16B的两组预训练双语LLMs和对双语机器翻译和多语言摘要基准的实验，我们发现LLM微调遵循",
    "tldr": "研究了不同扩展因素如何影响大型语言模型微调性能，认为LLM微调遵循着一种特殊的扩展行为。",
    "en_tdlr": "Investigated how different scaling factors affect the finetuning performance of large language models, finding that LLM finetuning follows a specific scaling behavior."
}