{
    "title": "Efficient Low-Rank Matrix Estimation, Experimental Design, and Arm-Set-Dependent Low-Rank Bandits",
    "abstract": "arXiv:2402.11156v1 Announce Type: cross  Abstract: We study low-rank matrix trace regression and the related problem of low-rank matrix bandits. Assuming access to the distribution of the covariates, we propose a novel low-rank matrix estimation method called LowPopArt and provide its recovery guarantee that depends on a novel quantity denoted by B(Q) that characterizes the hardness of the problem, where Q is the covariance matrix of the measurement distribution. We show that our method can provide tighter recovery guarantees than classical nuclear norm penalized least squares (Koltchinskii et al., 2011) in several problems. To perform efficient estimation with a limited number of measurements from an arbitrarily given measurement set A, we also propose a novel experimental design criterion that minimizes B(Q) with computational efficiency. We leverage our novel estimator and design of experiments to derive two low-rank linear bandit algorithms for general arm sets that enjoy improved ",
    "link": "https://arxiv.org/abs/2402.11156",
    "context": "Title: Efficient Low-Rank Matrix Estimation, Experimental Design, and Arm-Set-Dependent Low-Rank Bandits\nAbstract: arXiv:2402.11156v1 Announce Type: cross  Abstract: We study low-rank matrix trace regression and the related problem of low-rank matrix bandits. Assuming access to the distribution of the covariates, we propose a novel low-rank matrix estimation method called LowPopArt and provide its recovery guarantee that depends on a novel quantity denoted by B(Q) that characterizes the hardness of the problem, where Q is the covariance matrix of the measurement distribution. We show that our method can provide tighter recovery guarantees than classical nuclear norm penalized least squares (Koltchinskii et al., 2011) in several problems. To perform efficient estimation with a limited number of measurements from an arbitrarily given measurement set A, we also propose a novel experimental design criterion that minimizes B(Q) with computational efficiency. We leverage our novel estimator and design of experiments to derive two low-rank linear bandit algorithms for general arm sets that enjoy improved ",
    "path": "papers/24/02/2402.11156.json",
    "total_tokens": 940,
    "translated_title": "高效的低秩矩阵估计、实验设计和基于Arm集的低秩赌博机",
    "translated_abstract": "我们研究了低秩矩阵迹回归和相关的低秩矩阵赌博问题。假设可以访问协变量的分布，我们提出了一种名为LowPopArt的新型低秩矩阵估计方法，并提供了其依赖于一个新颖数量B(Q)的恢复保证，该数量表征了问题的难度，其中Q是测量分布的协方差矩阵。我们展示了我们的方法在几个问题中可以提供比经典的核范数惩罚最小二乘法（Koltchinskii等人，2011）更紧密的恢复保证。为了在从任意给定的测量集合A中进行有限测量的情况下执行高效估计，我们还提出了一种新颖的实验设计标准，该标准以计算效率最小化B(Q)。我们利用我们的新颖估计器和实验设计推导了两种适用于一般Arm集的低秩线性赌博算法，其享有改进的",
    "tldr": "提出一种新型低秩矩阵估计方法LowPopArt，通过最小化量B(Q)提供更紧密的恢复保证，同时提出了一种新颖的实验设计标准，以及两种适用于一般Arm集的低秩线性赌博算法。",
    "en_tdlr": "Introducing a novel low-rank matrix estimation method LowPopArt with tighter recovery guarantees by minimizing quantity B(Q), along with a novel experimental design criterion, and two low-rank linear bandit algorithms for general Arm sets."
}