{
    "title": "Deep learning for the design of non-Hermitian topolectrical circuits",
    "abstract": "arXiv:2402.09978v1 Announce Type: cross  Abstract: Non-Hermitian topological phases can produce some remarkable properties, compared with their Hermitian counterpart, such as the breakdown of conventional bulk-boundary correspondence and the non-Hermitian topological edge mode. Here, we introduce several algorithms with multi-layer perceptron (MLP), and convolutional neural network (CNN) in the field of deep learning, to predict the winding of eigenvalues non-Hermitian Hamiltonians. Subsequently, we use the smallest module of the periodic circuit as one unit to construct high-dimensional circuit data features. Further, we use the Dense Convolutional Network (DenseNet), a type of convolutional neural network that utilizes dense connections between layers to design a non-Hermitian topolectrical Chern circuit, as the DenseNet algorithm is more suitable for processing high-dimensional data. Our results demonstrate the effectiveness of the deep learning network in capturing the global topol",
    "link": "https://arxiv.org/abs/2402.09978",
    "context": "Title: Deep learning for the design of non-Hermitian topolectrical circuits\nAbstract: arXiv:2402.09978v1 Announce Type: cross  Abstract: Non-Hermitian topological phases can produce some remarkable properties, compared with their Hermitian counterpart, such as the breakdown of conventional bulk-boundary correspondence and the non-Hermitian topological edge mode. Here, we introduce several algorithms with multi-layer perceptron (MLP), and convolutional neural network (CNN) in the field of deep learning, to predict the winding of eigenvalues non-Hermitian Hamiltonians. Subsequently, we use the smallest module of the periodic circuit as one unit to construct high-dimensional circuit data features. Further, we use the Dense Convolutional Network (DenseNet), a type of convolutional neural network that utilizes dense connections between layers to design a non-Hermitian topolectrical Chern circuit, as the DenseNet algorithm is more suitable for processing high-dimensional data. Our results demonstrate the effectiveness of the deep learning network in capturing the global topol",
    "path": "papers/24/02/2402.09978.json",
    "total_tokens": 900,
    "translated_title": "用于非厄米拓电路设计的深度学习",
    "translated_abstract": "非厄米拓扑相相对于其厄米对应物具有一些出色的特性，例如传统的体-边对应的破裂以及非厄米拓扑边模态。我们在深度学习领域引入了几种基于多层感知器(MLP)和卷积神经网络(CNN)的算法，用于预测非厄米哈密顿量的本征值。随后，我们使用周期性电路的最小模块作为一个单元来构建高维电路数据特征。进一步地，我们使用DenseNet算法，它是一种利用层之间的密集连接的卷积神经网络，来设计非厄米拓电陈电路，因为DenseNet算法更适合处理高维数据。我们的结果证明了深度学习网络在捕捉全局拓扑特性方面的有效性。",
    "tldr": "用深度学习设计非厄米拓电路，通过多层感知器和卷积神经网络预测非厄米哈密顿量的本征值，利用DenseNet算法设计高维拓扑电路，证明了深度学习网络在捕捉全局拓扑特性方面的有效性。",
    "en_tdlr": "Deep learning is used to design non-Hermitian topolectrical circuits by predicting the eigenvalues of non-Hermitian Hamiltonians using multi-layer perceptron and convolutional neural network algorithms. DenseNet algorithm is utilized to design high-dimensional topolectrical circuits, demonstrating the effectiveness of deep learning network in capturing global topological properties."
}