{
    "title": "Companhias a\\'ereas s\\~ao todas iguais? A converg\\^encia dos modelos de neg\\'ocios no transporte a\\'ereo",
    "abstract": "arXiv:2402.11371v1 Announce Type: new  Abstract: This study discusses the literature on the convergence of business models of airlines in Brazilian air transport, focusing on the formation of flight networks. Initially, it analyzes the determinants of the network formation patterns of the \"fundamental\" business models (archetypes) of airlines in the first years after the sector's deregulation. Then, it discusses how the business models of Brazilian companies resemble these patterns. The literature highlights convergences between the network formation strategies of full-service companies in relation to older low-cost companies, in addition to business model redirections after mergers and acquisitions.",
    "link": "https://arxiv.org/abs/2402.11371",
    "context": "Title: Companhias a\\'ereas s\\~ao todas iguais? A converg\\^encia dos modelos de neg\\'ocios no transporte a\\'ereo\nAbstract: arXiv:2402.11371v1 Announce Type: new  Abstract: This study discusses the literature on the convergence of business models of airlines in Brazilian air transport, focusing on the formation of flight networks. Initially, it analyzes the determinants of the network formation patterns of the \"fundamental\" business models (archetypes) of airlines in the first years after the sector's deregulation. Then, it discusses how the business models of Brazilian companies resemble these patterns. The literature highlights convergences between the network formation strategies of full-service companies in relation to older low-cost companies, in addition to business model redirections after mergers and acquisitions.",
    "path": "papers/24/02/2402.11371.json",
    "total_tokens": 738,
    "translated_title": "航空公司都一样吗？巴西航空运输业务模式的融合",
    "translated_abstract": "本研究探讨了关于巴西航空运输业航空公司业务模式融合的文献，重点关注航班网络的形成。首先，分析了在部门解除管制后的头几年内航空公司“基本”业务模式（典型）的网络形成模式的决定因素。然后，讨论了巴西公司的业务模式如何类似于这些模式。文献强调了全方位服务公司的网络形成战略与较老的低成本公司之间的收敛，以及在合并和收购之后业务模式的重新定位。",
    "tldr": "巴西航空公司业务模式融合研究发现，在航空运输业务中存在全方位服务公司和老式低成本公司之间的网络形成策略收敛，以及在合并收购后业务模式的调整。",
    "en_tdlr": "This study on the convergence of business models of Brazilian airlines in air transport sector reveals convergences in network formation strategies between full-service companies and older low-cost companies, as well as business model realignments post mergers and acquisitions."
}