{
    "title": "The Mechanical Turkness: Tactical Media Art and the Critique of Corporate AI",
    "abstract": "arXiv:2402.17490v1 Announce Type: cross  Abstract: The extensive industrialization of artificial intelligence (AI) since the mid-2010s has increasingly motivated artists to address its economic and sociopolitical consequences. In this chapter, I discuss interrelated art practices that thematize creative agency, crowdsourced labor, and delegated artmaking to reveal the social rootage of AI technologies and underline the productive human roles in their development. I focus on works whose poetic features indicate broader issues of contemporary AI-influenced science, technology, economy, and society. By exploring the conceptual, methodological, and ethical aspects of their effectiveness in disrupting the political regime of corporate AI, I identify several problems that affect their tactical impact and outline potential avenues for tackling the challenges and advancing the field.",
    "link": "https://arxiv.org/abs/2402.17490",
    "context": "Title: The Mechanical Turkness: Tactical Media Art and the Critique of Corporate AI\nAbstract: arXiv:2402.17490v1 Announce Type: cross  Abstract: The extensive industrialization of artificial intelligence (AI) since the mid-2010s has increasingly motivated artists to address its economic and sociopolitical consequences. In this chapter, I discuss interrelated art practices that thematize creative agency, crowdsourced labor, and delegated artmaking to reveal the social rootage of AI technologies and underline the productive human roles in their development. I focus on works whose poetic features indicate broader issues of contemporary AI-influenced science, technology, economy, and society. By exploring the conceptual, methodological, and ethical aspects of their effectiveness in disrupting the political regime of corporate AI, I identify several problems that affect their tactical impact and outline potential avenues for tackling the challenges and advancing the field.",
    "path": "papers/24/02/2402.17490.json",
    "total_tokens": 846,
    "translated_title": "机械土耳其人：战术媒体艺术与对公司AI的批判",
    "translated_abstract": "自2010年代中期以来，人工智能（AI）的广泛工业化越来越激励艺术家们关注其经济和社会政治后果。本章讨论了主题化创造性代理、众包劳动和委托艺术创作的相关艺术实践，揭示了人工智能技术的社会根源，并强调了人类在其发展中的积极作用。我关注的是那些诗意特征表明当代AI影响的科学、技术、经济和社会的广泛问题的作品。通过探讨它们在颠覆公司AI政治体制中的有效性的概念、方法和道德方面，我确定了影响其战术影响力的几个问题，并概述了解决挑战并推进该领域的潜在途径。",
    "tldr": "这些艺术实践关注人工智能的经济和社会政治后果，通过揭示AI技术的社会根源和强调人类在其中的角色，挖掘了战术媒体艺术对公司AI政治体制的干扰作用。"
}