{
    "title": "CochCeps-Augment: A Novel Self-Supervised Contrastive Learning Using Cochlear Cepstrum-based Masking for Speech Emotion Recognition",
    "abstract": "Self-supervised learning (SSL) for automated speech recognition in terms of its emotional content, can be heavily degraded by the presence noise, affecting the efficiency of modeling the intricate temporal and spectral informative structures of speech. Recently, SSL on large speech datasets, as well as new audio-specific SSL proxy tasks, such as, temporal and frequency masking, have emerged, yielding superior performance compared to classic approaches drawn from the image augmentation domain. Our proposed contribution builds upon this successful paradigm by introducing CochCeps-Augment, a novel bio-inspired masking augmentation task for self-supervised contrastive learning of speech representations. Specifically, we utilize the newly introduced bio-inspired cochlear cepstrogram (CCGRAM) to derive noise robust representations of input speech, that are then further refined through a self-supervised learning scheme. The latter employs SimCLR to generate contrastive views of a CCGRAM throu",
    "link": "https://arxiv.org/abs/2402.06923",
    "context": "Title: CochCeps-Augment: A Novel Self-Supervised Contrastive Learning Using Cochlear Cepstrum-based Masking for Speech Emotion Recognition\nAbstract: Self-supervised learning (SSL) for automated speech recognition in terms of its emotional content, can be heavily degraded by the presence noise, affecting the efficiency of modeling the intricate temporal and spectral informative structures of speech. Recently, SSL on large speech datasets, as well as new audio-specific SSL proxy tasks, such as, temporal and frequency masking, have emerged, yielding superior performance compared to classic approaches drawn from the image augmentation domain. Our proposed contribution builds upon this successful paradigm by introducing CochCeps-Augment, a novel bio-inspired masking augmentation task for self-supervised contrastive learning of speech representations. Specifically, we utilize the newly introduced bio-inspired cochlear cepstrogram (CCGRAM) to derive noise robust representations of input speech, that are then further refined through a self-supervised learning scheme. The latter employs SimCLR to generate contrastive views of a CCGRAM throu",
    "path": "papers/24/02/2402.06923.json",
    "total_tokens": 889,
    "translated_title": "CochCeps-Augment：一种使用基于Cochlear Cepstrum的掩蔽的自监督对比学习方法用于语音情感识别",
    "translated_abstract": "自监督学习（SSL）用于情感内容的自动语音识别可以被噪声干扰严重降低，影响对语音的复杂时域和频谱信息结构进行建模的效率。最近，大规模语音数据集上的SSL以及新的音频特定的SSL代理任务（如时域和频域掩蔽）已经出现，相比于传统的源自图像增强领域的方法，取得了更好的性能。我们提出的创新在于基于成功的范例引入CochCeps-Augment，这是一种用于自监督对比学习语音表示的新型生物启发掩蔽增强任务。具体来说，我们利用了新引入的生物启发式Cochlear cepstrogram（CCGRAM）来推导输入语音的噪声鲁棒表示，然后通过自监督学习方案进一步优化。后者利用SimCLR生成CCGRAM的对比视图，通过对比学习来产生。",
    "tldr": "提出了一种名为CochCeps-Augment的方法，利用基于Cochlear Cepstrum的掩蔽增强任务进行自监督对比学习，提高了语音情感识别的性能和噪声鲁棒性。"
}