{
    "title": "Generative VS non-Generative Models in Engineering Shape Optimization",
    "abstract": "In this work, we perform a systematic comparison of the effectiveness and efficiency of generative and non-generative models in constructing design spaces for novel and efficient design exploration and shape optimization. We apply these models in the case of airfoil/hydrofoil design and conduct the comparison on the resulting design spaces. A conventional Generative Adversarial Network (GAN) and a state-of-the-art generative model, the Performance-Augmented Diverse Generative Adversarial Network (PaDGAN), are juxtaposed with a linear non-generative model based on the coupling of the Karhunen-Lo\\`eve Expansion and a physics-informed Shape Signature Vector (SSV-KLE). The comparison demonstrates that, with an appropriate shape encoding and a physics-augmented design space, non-generative models have the potential to cost-effectively generate high-performing valid designs with enhanced coverage of the design space. In this work, both approaches are applied to two large foil profile dataset",
    "link": "https://arxiv.org/abs/2402.08540",
    "context": "Title: Generative VS non-Generative Models in Engineering Shape Optimization\nAbstract: In this work, we perform a systematic comparison of the effectiveness and efficiency of generative and non-generative models in constructing design spaces for novel and efficient design exploration and shape optimization. We apply these models in the case of airfoil/hydrofoil design and conduct the comparison on the resulting design spaces. A conventional Generative Adversarial Network (GAN) and a state-of-the-art generative model, the Performance-Augmented Diverse Generative Adversarial Network (PaDGAN), are juxtaposed with a linear non-generative model based on the coupling of the Karhunen-Lo\\`eve Expansion and a physics-informed Shape Signature Vector (SSV-KLE). The comparison demonstrates that, with an appropriate shape encoding and a physics-augmented design space, non-generative models have the potential to cost-effectively generate high-performing valid designs with enhanced coverage of the design space. In this work, both approaches are applied to two large foil profile dataset",
    "path": "papers/24/02/2402.08540.json",
    "total_tokens": 912,
    "translated_title": "工程形状优化中的生成式与非生成式模型的比较",
    "translated_abstract": "本研究对生成式模型和非生成式模型在构建设计空间、进行新颖高效设计探索和形状优化方面的效果和效率进行了系统比较。我们将这些模型应用于翼型/水翼设计案例，并在生成的设计空间上进行比较。我们将传统的生成对抗网络(GAN)和最先进的生成模型——性能增强多样性生成对抗网络(PaDGAN)与基于Karhunen-Loève展开和物理模型化形状签名向量(SSV-KLE)耦合的线性非生成式模型进行比较。研究结果表明，在适当的形状编码和物理增强设计空间的情况下，非生成式模型有潜力以经济高效的方式生成高性能的有效设计，并且可以扩展设计空间的覆盖范围。本研究将这两种方法应用于两个大型翼型数据集。",
    "tldr": "本研究对生成式和非生成式模型在工程形状优化中的效果和效率进行了比较。研究结果表明，非生成式模型通过适当的形状编码和物理增强设计空间，可以以经济高效的方式生成高性能的有效设计，并且扩展了设计空间的覆盖范围。",
    "en_tdlr": "This work compares the effectiveness and efficiency of generative and non-generative models in engineering shape optimization. The study demonstrates that non-generative models, with appropriate shape encoding and physics-augmented design space, have the potential to generate high-performing valid designs cost-effectively and enhance the coverage of the design space."
}