{
    "title": "Explainable Adversarial Learning Framework on Physical Layer Secret Keys Combating Malicious Reconfigurable Intelligent Surface",
    "abstract": "The development of reconfigurable intelligent surfaces (RIS) is a double-edged sword to physical layer security (PLS). Whilst a legitimate RIS can yield beneficial impacts including increased channel randomness to enhance physical layer secret key generation (PL-SKG), malicious RIS can poison legitimate channels and crack most of existing PL-SKGs. In this work, we propose an adversarial learning framework between legitimate parties (namely Alice and Bob) to address this Man-in-the-middle malicious RIS (MITM-RIS) eavesdropping. First, the theoretical mutual information gap between legitimate pairs and MITM-RIS is deduced. Then, Alice and Bob leverage generative adversarial networks (GANs) to learn to achieve a common feature surface that does not have mutual information overlap with MITM-RIS. Next, we aid signal processing interpretation of black-box neural networks by using a symbolic explainable AI (xAI) representation. These symbolic terms of dominant neurons aid feature engineering-",
    "link": "https://arxiv.org/abs/2402.06663",
    "context": "Title: Explainable Adversarial Learning Framework on Physical Layer Secret Keys Combating Malicious Reconfigurable Intelligent Surface\nAbstract: The development of reconfigurable intelligent surfaces (RIS) is a double-edged sword to physical layer security (PLS). Whilst a legitimate RIS can yield beneficial impacts including increased channel randomness to enhance physical layer secret key generation (PL-SKG), malicious RIS can poison legitimate channels and crack most of existing PL-SKGs. In this work, we propose an adversarial learning framework between legitimate parties (namely Alice and Bob) to address this Man-in-the-middle malicious RIS (MITM-RIS) eavesdropping. First, the theoretical mutual information gap between legitimate pairs and MITM-RIS is deduced. Then, Alice and Bob leverage generative adversarial networks (GANs) to learn to achieve a common feature surface that does not have mutual information overlap with MITM-RIS. Next, we aid signal processing interpretation of black-box neural networks by using a symbolic explainable AI (xAI) representation. These symbolic terms of dominant neurons aid feature engineering-",
    "path": "papers/24/02/2402.06663.json",
    "total_tokens": 905,
    "translated_title": "物理层密钥对抗恶意可重构智能面的可解释对抗学习框架",
    "translated_abstract": "可重构智能面（RIS）的发展对物理层安全（PLS）是一把双刃剑。合法的RIS可以产生有益的影响，包括增加信道的随机性，增强物理层密钥生成（PL-SKG），而恶意的RIS可以破坏合法信道并破解大部分现有的PL-SKG。在这项工作中，我们提出了一个合法参与方（即爱丽丝和鲍勃）之间的对抗学习框架，以解决中间人恶意RIS（MITM-RIS）窃听问题。首先，我们推导了合法配对和MITM-RIS之间的理论互信息差距。然后，爱丽丝和鲍勃利用生成对抗网络（GAN）学习实现一个与MITM-RIS没有互信息重叠的共同特征面。接下来，我们使用符号可解释AI（xAI）表示对黑盒神经网络进行信号处理解释。这些主导神经元的符号术语有助于特征工程。",
    "tldr": "本文提出了一个对抗学习框架，用于合法参与方间的物理层密钥生成，在恶意可重构智能面干扰下提供了一个可解释的解决方案。",
    "en_tdlr": "This paper proposes an adversarial learning framework for physical layer secret key generation between legitimate parties, providing an explainable solution against malicious reconfigurable intelligent surfaces interference."
}