{
    "title": "A Hybrid Strategy for Chat Transcript Summarization",
    "abstract": "Text summarization is the process of condensing a piece of text to fewer sentences, while still preserving its content. Chat transcript, in this context, is a textual copy of a digital or online conversation between a customer (caller) and agent(s). This paper presents an indigenously (locally) developed hybrid method that first combines extractive and abstractive summarization techniques in compressing ill-punctuated or un-punctuated chat transcripts to produce more readable punctuated summaries and then optimizes the overall quality of summarization through reinforcement learning. Extensive testing, evaluations, comparisons, and validation have demonstrated the efficacy of this approach for large-scale deployment of chat transcript summarization, in the absence of manually generated reference (annotated) summaries.",
    "link": "https://rss.arxiv.org/abs/2402.01510",
    "context": "Title: A Hybrid Strategy for Chat Transcript Summarization\nAbstract: Text summarization is the process of condensing a piece of text to fewer sentences, while still preserving its content. Chat transcript, in this context, is a textual copy of a digital or online conversation between a customer (caller) and agent(s). This paper presents an indigenously (locally) developed hybrid method that first combines extractive and abstractive summarization techniques in compressing ill-punctuated or un-punctuated chat transcripts to produce more readable punctuated summaries and then optimizes the overall quality of summarization through reinforcement learning. Extensive testing, evaluations, comparisons, and validation have demonstrated the efficacy of this approach for large-scale deployment of chat transcript summarization, in the absence of manually generated reference (annotated) summaries.",
    "path": "papers/24/02/2402.01510.json",
    "total_tokens": 791,
    "translated_title": "一种混合策略用于聊天记录摘要化",
    "translated_abstract": "文本摘要化是将一段文本压缩成较少句子的过程，同时保留其内容。在这个背景下，聊天记录是客户（来电者）和客服人员之间的数字或在线对话的文本副本。本文提出了一种本地开发的混合方法，首先结合抽取和生成式摘要化技术，对缺乏标点或未标点的聊天记录进行压缩，产生更易读的带标点摘要，然后通过强化学习优化摘要的整体质量。广泛的测试、评估、比较和验证证明了这种方法在没有手动生成的参考摘要的情况下，对于大规模部署的聊天记录摘要化的有效性。",
    "tldr": "这篇论文介绍了一种混合策略用于聊天记录摘要化，该策略首先结合了抽取和生成式摘要化技术，然后通过强化学习优化摘要的质量。这种方法在大规模部署的聊天记录摘要化中表现出了很好的效果。",
    "en_tdlr": "This paper presents a hybrid strategy for chat transcript summarization, which combines extractive and abstractive summarization techniques and optimizes the quality of summaries through reinforcement learning. This approach has demonstrated effectiveness in large-scale deployment of chat transcript summarization."
}