{
    "title": "Training Green AI Models Using Elite Samples",
    "abstract": "arXiv:2402.12010v1 Announce Type: cross  Abstract: The substantial increase in AI model training has considerable environmental implications, mandating more energy-efficient and sustainable AI practices. On the one hand, data-centric approaches show great potential towards training energy-efficient AI models. On the other hand, instance selection methods demonstrate the capability of training AI models with minimised training sets and negligible performance degradation. Despite the growing interest in both topics, the impact of data-centric training set selection on energy efficiency remains to date unexplored. This paper presents an evolutionary-based sampling framework aimed at (i) identifying elite training samples tailored for datasets and model pairs, (ii) comparing model performance and energy efficiency gains against typical model training practice, and (iii) investigating the feasibility of this framework for fostering sustainable model training practices. To evaluate the propo",
    "link": "https://arxiv.org/abs/2402.12010",
    "context": "Title: Training Green AI Models Using Elite Samples\nAbstract: arXiv:2402.12010v1 Announce Type: cross  Abstract: The substantial increase in AI model training has considerable environmental implications, mandating more energy-efficient and sustainable AI practices. On the one hand, data-centric approaches show great potential towards training energy-efficient AI models. On the other hand, instance selection methods demonstrate the capability of training AI models with minimised training sets and negligible performance degradation. Despite the growing interest in both topics, the impact of data-centric training set selection on energy efficiency remains to date unexplored. This paper presents an evolutionary-based sampling framework aimed at (i) identifying elite training samples tailored for datasets and model pairs, (ii) comparing model performance and energy efficiency gains against typical model training practice, and (iii) investigating the feasibility of this framework for fostering sustainable model training practices. To evaluate the propo",
    "path": "papers/24/02/2402.12010.json",
    "total_tokens": 774,
    "translated_title": "使用精英样本训练绿色人工智能模型",
    "translated_abstract": "AI模型训练量的大幅增加具有重要的环境影响，这需要更节能高效和可持续的人工智能实践。数据中心方法展现出训练节能人工智能模型的巨大潜力，而实例选择方法展示了使用最小化训练集训练人工智能模型的能力且性能下降可以忽略不计。本文提出了一个基于进化的采样框架，旨在识别针对数据集和模型的精英训练样本，比较模型性能和节能效益与典型模型训练实践的差异，并研究这一框架对促进可持续模型训练实践的可行性。",
    "tldr": "该论文提出了一个基于进化的采样框架，旨在识别精英训练样本，比较与传统方法的模型性能和能效优势，探讨其对可持续模型训练的可能性。",
    "en_tdlr": "This paper introduces an evolutionary-based sampling framework for identifying elite training samples, comparing model performance and energy efficiency gains against typical practices, and exploring its feasibility in fostering sustainable model training."
}