{
    "title": "Archer: A Human-Labeled Text-to-SQL Dataset with Arithmetic, Commonsense and Hypothetical Reasoning",
    "abstract": "arXiv:2402.12554v1 Announce Type: new  Abstract: We present Archer, a challenging bilingual text-to-SQL dataset specific to complex reasoning, including arithmetic, commonsense and hypothetical reasoning. It contains 1,042 English questions and 1,042 Chinese questions, along with 521 unique SQL queries, covering 20 English databases across 20 domains. Notably, this dataset demonstrates a significantly higher level of complexity compared to existing publicly available datasets. Our evaluation shows that Archer challenges the capabilities of current state-of-the-art models, with a high-ranked model on the Spider leaderboard achieving only 6.73% execution accuracy on Archer test set. Thus, Archer presents a significant challenge for future research in this field.",
    "link": "https://arxiv.org/abs/2402.12554",
    "context": "Title: Archer: A Human-Labeled Text-to-SQL Dataset with Arithmetic, Commonsense and Hypothetical Reasoning\nAbstract: arXiv:2402.12554v1 Announce Type: new  Abstract: We present Archer, a challenging bilingual text-to-SQL dataset specific to complex reasoning, including arithmetic, commonsense and hypothetical reasoning. It contains 1,042 English questions and 1,042 Chinese questions, along with 521 unique SQL queries, covering 20 English databases across 20 domains. Notably, this dataset demonstrates a significantly higher level of complexity compared to existing publicly available datasets. Our evaluation shows that Archer challenges the capabilities of current state-of-the-art models, with a high-ranked model on the Spider leaderboard achieving only 6.73% execution accuracy on Archer test set. Thus, Archer presents a significant challenge for future research in this field.",
    "path": "papers/24/02/2402.12554.json",
    "total_tokens": 768,
    "translated_title": "Archer: 一个具有算术、常识和假设推理的人工标记文本到SQL数据集",
    "translated_abstract": "我们提出了Archer，一个具有挑战性的双语文本到SQL数据集，专注于包括算术、常识和假设推理在内的复杂推理。它包含1,042个英文问题和1,042个中文问题，以及521个唯一的SQL查询，涵盖了20个领域中的20个英语数据库。值得注意的是，与现有公开数据集相比，这个数据集展示了显著更高的复杂性水平。我们的评估表明，Archer挑战了当前最先进模型的能力，Spider排行榜上的排名靠前的模型在Archer测试集上仅达到6.73%的执行准确率。因此，Archer为这一领域的未来研究提出了重大挑战。",
    "tldr": "Archer数据集是一个具有挑战性的双语文本到SQL数据集，包含算术、常识和假设推理的复杂推理，挑战了当前最先进模型的能力。",
    "en_tdlr": "The Archer dataset is a challenging bilingual text-to-SQL dataset with complex reasoning involving arithmetic, commonsense, and hypothetical reasoning, challenging the capabilities of current state-of-the-art models."
}