{
    "title": "Generative AI for Unmanned Vehicle Swarms: Challenges, Applications and Opportunities",
    "abstract": "arXiv:2402.18062v1 Announce Type: cross  Abstract: With recent advances in artificial intelligence (AI) and robotics, unmanned vehicle swarms have received great attention from both academia and industry due to their potential to provide services that are difficult and dangerous to perform by humans. However, learning and coordinating movements and actions for a large number of unmanned vehicles in complex and dynamic environments introduce significant challenges to conventional AI methods. Generative AI (GAI), with its capabilities in complex data feature extraction, transformation, and enhancement, offers great potential in solving these challenges of unmanned vehicle swarms. For that, this paper aims to provide a comprehensive survey on applications, challenges, and opportunities of GAI in unmanned vehicle swarms. Specifically, we first present an overview of unmanned vehicles and unmanned vehicle swarms as well as their use cases and existing issues. Then, an in-depth background of",
    "link": "https://arxiv.org/abs/2402.18062",
    "context": "Title: Generative AI for Unmanned Vehicle Swarms: Challenges, Applications and Opportunities\nAbstract: arXiv:2402.18062v1 Announce Type: cross  Abstract: With recent advances in artificial intelligence (AI) and robotics, unmanned vehicle swarms have received great attention from both academia and industry due to their potential to provide services that are difficult and dangerous to perform by humans. However, learning and coordinating movements and actions for a large number of unmanned vehicles in complex and dynamic environments introduce significant challenges to conventional AI methods. Generative AI (GAI), with its capabilities in complex data feature extraction, transformation, and enhancement, offers great potential in solving these challenges of unmanned vehicle swarms. For that, this paper aims to provide a comprehensive survey on applications, challenges, and opportunities of GAI in unmanned vehicle swarms. Specifically, we first present an overview of unmanned vehicles and unmanned vehicle swarms as well as their use cases and existing issues. Then, an in-depth background of",
    "path": "papers/24/02/2402.18062.json",
    "total_tokens": 815,
    "translated_title": "无人车群体的生成式人工智能：挑战、应用和机遇",
    "translated_abstract": "随着人工智能（AI）和机器人技术的不断进步，无人车群体因其潜在提供人类难以完成和危险的任务的能力，从学术界和工业界获得了极大关注。然而，在复杂和动态环境中学习和协调大量无人车的移动和行动，给传统人工智能方法引入了重大挑战。生成式人工智能（GAI）以其在复杂数据特征提取、转换和增强方面的能力，为解决无人车群体这些挑战提供了巨大潜力。因此，本文旨在对生成式人工智能在无人车群体中的应用、挑战和机遇进行全面调查。具体而言，我们首先概述了无人车和无人车群体以及它们的用例和现有问题。",
    "tldr": "生成式人工智能在解决无人车群体挑战方面具有巨大潜力，本文对其在应用、挑战和机遇方面进行了全面调查。",
    "en_tdlr": "Generative AI shows great potential in addressing challenges of unmanned vehicle swarms, and this paper provides a comprehensive survey on its applications, challenges, and opportunities."
}