{
    "title": "A Survey of Table Reasoning with Large Language Models",
    "abstract": "Table reasoning, which aims to generate the corresponding answer to the question following the user requirement according to the provided table, and optionally a text description of the table, effectively improving the efficiency of obtaining information. Recently, using Large Language Models (LLMs) has become the mainstream method for table reasoning, because it not only significantly reduces the annotation cost but also exceeds the performance of previous methods. However, existing research still lacks a summary of LLM-based table reasoning works. Due to the existing lack of research, questions about which techniques can improve table reasoning performance in the era of LLMs, why LLMs excel at table reasoning, and how to enhance table reasoning abilities in the future, remain largely unexplored. This gap significantly limits progress in research. To answer the above questions and advance table reasoning research with LLMs, we present this survey to analyze existing research, inspirin",
    "link": "https://arxiv.org/abs/2402.08259",
    "context": "Title: A Survey of Table Reasoning with Large Language Models\nAbstract: Table reasoning, which aims to generate the corresponding answer to the question following the user requirement according to the provided table, and optionally a text description of the table, effectively improving the efficiency of obtaining information. Recently, using Large Language Models (LLMs) has become the mainstream method for table reasoning, because it not only significantly reduces the annotation cost but also exceeds the performance of previous methods. However, existing research still lacks a summary of LLM-based table reasoning works. Due to the existing lack of research, questions about which techniques can improve table reasoning performance in the era of LLMs, why LLMs excel at table reasoning, and how to enhance table reasoning abilities in the future, remain largely unexplored. This gap significantly limits progress in research. To answer the above questions and advance table reasoning research with LLMs, we present this survey to analyze existing research, inspirin",
    "path": "papers/24/02/2402.08259.json",
    "total_tokens": 833,
    "translated_title": "大规模语言模型在表格推理中的调查",
    "translated_abstract": "表格推理旨在根据提供的表格和可选的文本描述，根据用户要求生成相应的问题答案，有效提高获取信息的效率。最近，使用大规模语言模型(LLMs)已成为表格推理的主流方法，因为它不仅显著降低了注释成本，还超过了先前方法的性能。然而，现有研究仍缺乏LLM-based表格推理工作的总结。由于现有研究的缺乏，关于在LLM时代如何提高表格推理性能的技术，为什么LLMs在表格推理方面表现出色，以及如何在未来增强表格推理能力的问题仍然大部分未被探索。这一差距严重限制了研究的进展。为了回答上述问题并推动基于LLMs的表格推理研究，我们提出这个调查分析现有的研究，激发创新。",
    "tldr": "这篇论文调查了使用大规模语言模型进行表格推理的现有研究，总结了LLM在表格推理中的优势，并探讨了未来增强表格推理能力的方向。"
}