{
    "title": "An enhanced Teaching-Learning-Based Optimization (TLBO) with Grey Wolf Optimizer (GWO) for text feature selection and clustering",
    "abstract": "arXiv:2402.11839v1 Announce Type: cross  Abstract: Text document clustering can play a vital role in organizing and handling the everincreasing number of text documents. Uninformative and redundant features included in large text documents reduce the effectiveness of the clustering algorithm. Feature selection (FS) is a well-known technique for removing these features. Since FS can be formulated as an optimization problem, various meta-heuristic algorithms have been employed to solve it. Teaching-Learning-Based Optimization (TLBO) is a novel meta-heuristic algorithm that benefits from the low number of parameters and fast convergence. A hybrid method can simultaneously benefit from the advantages of TLBO and tackle the possible entrapment in the local optimum. By proposing a hybrid of TLBO, Grey Wolf Optimizer (GWO), and Genetic Algorithm (GA) operators, this paper suggests a filter-based FS algorithm (TLBO-GWO). Six benchmark datasets are selected, and TLBO-GWO is compared with three ",
    "link": "https://arxiv.org/abs/2402.11839",
    "context": "Title: An enhanced Teaching-Learning-Based Optimization (TLBO) with Grey Wolf Optimizer (GWO) for text feature selection and clustering\nAbstract: arXiv:2402.11839v1 Announce Type: cross  Abstract: Text document clustering can play a vital role in organizing and handling the everincreasing number of text documents. Uninformative and redundant features included in large text documents reduce the effectiveness of the clustering algorithm. Feature selection (FS) is a well-known technique for removing these features. Since FS can be formulated as an optimization problem, various meta-heuristic algorithms have been employed to solve it. Teaching-Learning-Based Optimization (TLBO) is a novel meta-heuristic algorithm that benefits from the low number of parameters and fast convergence. A hybrid method can simultaneously benefit from the advantages of TLBO and tackle the possible entrapment in the local optimum. By proposing a hybrid of TLBO, Grey Wolf Optimizer (GWO), and Genetic Algorithm (GA) operators, this paper suggests a filter-based FS algorithm (TLBO-GWO). Six benchmark datasets are selected, and TLBO-GWO is compared with three ",
    "path": "papers/24/02/2402.11839.json",
    "total_tokens": 874,
    "translated_title": "一个增强的基于教学学习优化（TLBO）与灰狼优化器（GWO）的文本特征选择和聚类方法",
    "translated_abstract": "文本文档聚类在组织和处理日益增多的文本文档方面起着至关重要的作用。大型文本文档中包含的无信息和冗余特征会降低聚类算法的有效性。特征选择（FS）是一种用于去除这些特征的众所周知的技术。由于FS可以被形式化为一个优化问题，因此各种元启发式算法被用来解决它。教学学习优化（TLBO）是一种受益于较少参数和快速收敛的新型元启发式算法。通过提出TLBO，灰狼优化器（GWO）和遗传算法（GA）算子的混合方法，本文提出了一个基于过滤的FS算法（TLBO-GWO）。选择了六个基准数据集，并将TLBO-GWO与三个进行比较。",
    "tldr": "本文提出了一个增强的基于教学学习优化和灰狼优化器的混合方法，用于文本特征选择和聚类，旨在解决特征选择中的局部最优陷阱问题。",
    "en_tdlr": "The paper introduces an enhanced hybrid approach of Teaching-Learning-Based Optimization and Grey Wolf Optimizer for text feature selection and clustering, aiming to address the issue of local optimal trap in feature selection."
}