{
    "title": "COMET: Generating Commit Messages using Delta Graph Context Representation",
    "abstract": "Commit messages explain code changes in a commit and facilitate collaboration among developers. Several commit message generation approaches have been proposed; however, they exhibit limited success in capturing the context of code changes. We propose Comet (Context-Aware Commit Message Generation), a novel approach that captures context of code changes using a graph-based representation and leverages a transformer-based model to generate high-quality commit messages. Our proposed method utilizes delta graph that we developed to effectively represent code differences. We also introduce a customizable quality assurance module to identify optimal messages, mitigating subjectivity in commit messages. Experiments show that Comet outperforms state-of-the-art techniques in terms of bleu-norm and meteor metrics while being comparable in terms of rogue-l. Additionally, we compare the proposed approach with the popular gpt-3.5-turbo model, along with gpt-4-turbo; the most capable GPT model, ove",
    "link": "https://arxiv.org/abs/2402.01841",
    "context": "Title: COMET: Generating Commit Messages using Delta Graph Context Representation\nAbstract: Commit messages explain code changes in a commit and facilitate collaboration among developers. Several commit message generation approaches have been proposed; however, they exhibit limited success in capturing the context of code changes. We propose Comet (Context-Aware Commit Message Generation), a novel approach that captures context of code changes using a graph-based representation and leverages a transformer-based model to generate high-quality commit messages. Our proposed method utilizes delta graph that we developed to effectively represent code differences. We also introduce a customizable quality assurance module to identify optimal messages, mitigating subjectivity in commit messages. Experiments show that Comet outperforms state-of-the-art techniques in terms of bleu-norm and meteor metrics while being comparable in terms of rogue-l. Additionally, we compare the proposed approach with the popular gpt-3.5-turbo model, along with gpt-4-turbo; the most capable GPT model, ove",
    "path": "papers/24/02/2402.01841.json",
    "total_tokens": 844,
    "translated_title": "COMET: 使用增量图上下文表示生成提交消息",
    "translated_abstract": "提交消息解释了提交中的代码更改，并促进开发者之间的协作。已经提出了几种提交消息生成方法，然而这些方法在捕捉代码更改的上下文方面取得了有限的成功。我们提出了一种新颖的方法COMET（Context-Aware Commit Message Generation），通过使用基于图的表示捕捉代码更改的上下文，并利用基于transformer的模型生成高质量的提交消息。我们的方法使用我们开发的增量图有效地表示代码差异。我们还引入了一个可定制的质量保证模块来识别最佳的消息，减少了提交消息的主观性。实验证明，COMET在bleu-norm和meteor指标方面优于最先进的技术，并在rogue-l指标方面具有可比性。此外，我们将所提出的方法与流行的gpt-3.5-turbo模型以及最强大的GPT模型gpt-4-turbo进行了比较。",
    "tldr": "COMET是一种利用增量图上下文表示的新方法，通过使用transformer模型生成高质量的提交消息，并引入可定制的质量保证模块。实验证明，COMET在各项指标上优于其他技术，并与流行的GPT模型具有可比性。"
}