{
    "title": "Understanding Entrainment in Human Groups: Optimising Human-Robot Collaboration from Lessons Learned during Human-Human Collaboration",
    "abstract": "arXiv:2402.15427v1 Announce Type: cross  Abstract: Successful entrainment during collaboration positively affects trust, willingness to collaborate, and likeability towards collaborators. In this paper, we present a mixed-method study to investigate characteristics of successful entrainment leading to pair and group-based synchronisation. Drawing inspiration from industrial settings, we designed a fast-paced, short-cycle repetitive task. Using motion tracking, we investigated entrainment in both dyadic and triadic task completion. Furthermore, we utilise audio-video recordings and semi-structured interviews to contextualise participants' experiences. This paper contributes to the Human-Computer/Robot Interaction (HCI/HRI) literature using a human-centred approach to identify characteristics of entrainment during pair- and group-based collaboration. We present five characteristics related to successful entrainment. These are related to the occurrence of entrainment, leader-follower patt",
    "link": "https://arxiv.org/abs/2402.15427",
    "context": "Title: Understanding Entrainment in Human Groups: Optimising Human-Robot Collaboration from Lessons Learned during Human-Human Collaboration\nAbstract: arXiv:2402.15427v1 Announce Type: cross  Abstract: Successful entrainment during collaboration positively affects trust, willingness to collaborate, and likeability towards collaborators. In this paper, we present a mixed-method study to investigate characteristics of successful entrainment leading to pair and group-based synchronisation. Drawing inspiration from industrial settings, we designed a fast-paced, short-cycle repetitive task. Using motion tracking, we investigated entrainment in both dyadic and triadic task completion. Furthermore, we utilise audio-video recordings and semi-structured interviews to contextualise participants' experiences. This paper contributes to the Human-Computer/Robot Interaction (HCI/HRI) literature using a human-centred approach to identify characteristics of entrainment during pair- and group-based collaboration. We present five characteristics related to successful entrainment. These are related to the occurrence of entrainment, leader-follower patt",
    "path": "papers/24/02/2402.15427.json",
    "total_tokens": 829,
    "translated_title": "理解人类群体中的衔接：从人际协作中学到的经验优化人机协作",
    "translated_abstract": "成功的衔接在协作过程中积极影响信任、愿意合作以及对合作者的好感。本文通过一项混合方法研究探讨了成功衔接的特征，从而实现成对和基于群体的同步。我们从工业场景中汲取灵感，设计了一个快节奏、短周期重复任务。利用运动跟踪技术，我们研究了二人和三人任务完成中的衔接。此外，我们利用音视频录制和半结构化访谈来对参与者的经验进行情境化。本文通过以人为中心的方法，为人机/机器人交互（HCI/HRI）文献作出贡献，以确定在成对和基于群体的协作中的衔接特征。我们提出了与成功衔接相关的五个特征。",
    "tldr": "本文通过混合方法研究了成功衔接的特征，从而实现成对和基于群体的同步，为人机/机器人交互领域提供了有益的贡献。",
    "en_tdlr": "This paper presents a mixed-method study on the characteristics of successful entrainment leading to pair and group-based synchronization, contributing valuable insights to the field of Human-Computer/Robot Interaction."
}