{
    "title": "Knowledge Graph Assisted Automatic Sports News Writing",
    "abstract": "arXiv:2402.11191v1 Announce Type: new  Abstract: In this paper, we present a novel method for automatically generating sports news, which employs a unique algorithm that extracts pivotal moments from live text broadcasts and uses them to create an initial draft of the news. This draft is further refined by incorporating key details and background information from a specially designed sports knowledge graph. This graph contains 5,893 entities, which are classified into three distinct conceptual categories, interconnected through four relationship types, and characterized by 27 unique attributes. In addition, we create a multi-stage learning model by combining convolutional neural networks and a transformer encoder. This model expresses entity-task interactions using convolutional neural networks and enriches entity representations in the query set with the transformer encoder. It also includes a processor to compute matching scores for incomplete triples, addressing few-shot knowledge g",
    "link": "https://arxiv.org/abs/2402.11191",
    "context": "Title: Knowledge Graph Assisted Automatic Sports News Writing\nAbstract: arXiv:2402.11191v1 Announce Type: new  Abstract: In this paper, we present a novel method for automatically generating sports news, which employs a unique algorithm that extracts pivotal moments from live text broadcasts and uses them to create an initial draft of the news. This draft is further refined by incorporating key details and background information from a specially designed sports knowledge graph. This graph contains 5,893 entities, which are classified into three distinct conceptual categories, interconnected through four relationship types, and characterized by 27 unique attributes. In addition, we create a multi-stage learning model by combining convolutional neural networks and a transformer encoder. This model expresses entity-task interactions using convolutional neural networks and enriches entity representations in the query set with the transformer encoder. It also includes a processor to compute matching scores for incomplete triples, addressing few-shot knowledge g",
    "path": "papers/24/02/2402.11191.json",
    "total_tokens": 782,
    "translated_title": "知识图谱辅助自动生成体育新闻",
    "translated_abstract": "在这篇论文中，我们提出了一种新颖的方法，用于自动生成体育新闻，该方法采用一种独特的算法，从现场文本广播中提取关键时刻，并使用这些时刻创建新闻的初稿。这一初稿通过整合专门设计的体育知识图谱中的关键细节和背景信息得以进一步完善。该图谱包含5,893个实体，分为三个不同的概念类别，通过四种关系类型相互连接，具有27个独特属性。此外，我们通过结合卷积神经网络和变压器编码器创建了一个多阶段学习模型。该模型使用卷积神经网络表达实体-任务交互，并利用变压器编码器在查询集中丰富实体表示。它还包括一个处理器，用于计算不完整三元组的匹配分数，解决了少样本知识匮乏的问题。",
    "tldr": "该论文提出了一种利用知识图谱和多阶段学习模型自动生成体育新闻的方法。",
    "en_tdlr": "This paper introduces a method for automatically generating sports news using a knowledge graph and a multi-stage learning model."
}