{
    "title": "Impacts of Extreme Heat on Labor Force Dynamics",
    "abstract": "arXiv:2402.15072v1 Announce Type: new  Abstract: We use daily longitudinal data and a within-worker identification approach to examine the impacts of heat on labor force dynamics in Australia. High temperatures during 2001-2019 significantly reduced work attendance and hours worked, which were not compensated for in subsequent days and weeks. The largest reductions occurred in cooler regions and recent years, and were not solely concentrated amongst outdoor-based workers. Financial and Insurance Services was the most strongly affected industry, with temperatures above 38{\\deg}C (100{\\deg}F) increasing absenteeism by 15 percent. Adverse heat effects during the work commute and during outdoor work hours are shown to be key mechanisms.",
    "link": "https://arxiv.org/abs/2402.15072",
    "context": "Title: Impacts of Extreme Heat on Labor Force Dynamics\nAbstract: arXiv:2402.15072v1 Announce Type: new  Abstract: We use daily longitudinal data and a within-worker identification approach to examine the impacts of heat on labor force dynamics in Australia. High temperatures during 2001-2019 significantly reduced work attendance and hours worked, which were not compensated for in subsequent days and weeks. The largest reductions occurred in cooler regions and recent years, and were not solely concentrated amongst outdoor-based workers. Financial and Insurance Services was the most strongly affected industry, with temperatures above 38{\\deg}C (100{\\deg}F) increasing absenteeism by 15 percent. Adverse heat effects during the work commute and during outdoor work hours are shown to be key mechanisms.",
    "path": "papers/24/02/2402.15072.json",
    "total_tokens": 728,
    "translated_title": "极端高温对劳动力动态的影响",
    "translated_abstract": "我们使用每日纵向数据和一种在工作者内部进行身份识别的方法，研究了热浪对澳大利亚劳动力动态的影响。2001年至2019年的高温显着减少了工作出勤率和工作时间，而这些并没有在随后的日子和周数中得到补偿。最大的减少发生在较凉爽的地区和最近的年份，而不仅仅集中在户外工作者中。金融与保险服务是受影响最严重的行业，38摄氏度（100华氏度）以上的温度会使旷工率增加15％。工作途中和室外工作时间中的不利热效应被证实是关键机制。",
    "tldr": "极端高温会显着减少澳大利亚劳动力的工作出勤率和工作时间，尤其是对金融与保险服务领域的影响最为显著。",
    "en_tdlr": "Extreme heat significantly reduces work attendance and hours worked in Australia, especially affecting the financial and insurance services sector."
}