{
    "title": "Emergence of specialized Collective Behaviors in Evolving Heterogeneous Swarms",
    "abstract": "Natural groups of animals, such as swarms of social insects, exhibit astonishing degrees of task specialization, useful to address complex tasks and to survive. This is supported by phenotypic plasticity: individuals sharing the same genotype that is expressed differently for different classes of individuals, each specializing in one task. In this work, we evolve a swarm of simulated robots with phenotypic plasticity to study the emergence of specialized collective behavior during an emergent perception task. Phenotypic plasticity is realized in the form of heterogeneity of behavior by dividing the genotype into two components, with one different neural network controller associated to each component. The whole genotype, expressing the behavior of the whole group through the two components, is subject to evolution with a single fitness function. We analyse the obtained behaviors and use the insights provided by these results to design an online regulatory mechanism. Our experiments sho",
    "link": "https://arxiv.org/abs/2402.04763",
    "context": "Title: Emergence of specialized Collective Behaviors in Evolving Heterogeneous Swarms\nAbstract: Natural groups of animals, such as swarms of social insects, exhibit astonishing degrees of task specialization, useful to address complex tasks and to survive. This is supported by phenotypic plasticity: individuals sharing the same genotype that is expressed differently for different classes of individuals, each specializing in one task. In this work, we evolve a swarm of simulated robots with phenotypic plasticity to study the emergence of specialized collective behavior during an emergent perception task. Phenotypic plasticity is realized in the form of heterogeneity of behavior by dividing the genotype into two components, with one different neural network controller associated to each component. The whole genotype, expressing the behavior of the whole group through the two components, is subject to evolution with a single fitness function. We analyse the obtained behaviors and use the insights provided by these results to design an online regulatory mechanism. Our experiments sho",
    "path": "papers/24/02/2402.04763.json",
    "total_tokens": 915,
    "translated_title": "进化异质群集中的专门化集体行为的出现",
    "translated_abstract": "自然动物群体，如社会昆虫群体，表现出惊人的任务专业化程度，用于处理复杂任务并生存下来。这是通过表型可塑性支持的：共享相同基因型但对不同类别的个体表达不同的基因型，每个专门化任务。在这项工作中，我们通过表型可塑性演化了一群模拟机器人，研究在紧急感知任务中专门化集体行为的出现。表型可塑性通过行为的异质性实现，将基因型分为两个部分，每个部分与一个不同的神经网络控制器相关联。整个基因型通过这两个部分表达整个群体的行为，并通过单一的适应度函数进行演化。我们分析了获得的行为，并利用这些结果提供的见解设计了一个在线调节机制。我们的实验展示。。",
    "tldr": ""
}