{
    "title": "What About the Data? A Mapping Study on Data Engineering for AI Systems",
    "abstract": "AI systems cannot exist without data. Now that AI models (data science and AI) have matured and are readily available to apply in practice, most organizations struggle with the data infrastructure to do so. There is a growing need for data engineers that know how to prepare data for AI systems or that can setup enterprise-wide data architectures for analytical projects. But until now, the data engineering part of AI engineering has not been getting much attention, in favor of discussing the modeling part. In this paper we aim to change this by perform a mapping study on data engineering for AI systems, i.e., AI data engineering. We found 25 relevant papers between January 2019 and June 2023, explaining AI data engineering activities. We identify which life cycle phases are covered, which technical solutions or architectures are proposed and which lessons learned are presented. We end by an overall discussion of the papers with implications for practitioners and researchers. This paper ",
    "link": "https://arxiv.org/abs/2402.05156",
    "context": "Title: What About the Data? A Mapping Study on Data Engineering for AI Systems\nAbstract: AI systems cannot exist without data. Now that AI models (data science and AI) have matured and are readily available to apply in practice, most organizations struggle with the data infrastructure to do so. There is a growing need for data engineers that know how to prepare data for AI systems or that can setup enterprise-wide data architectures for analytical projects. But until now, the data engineering part of AI engineering has not been getting much attention, in favor of discussing the modeling part. In this paper we aim to change this by perform a mapping study on data engineering for AI systems, i.e., AI data engineering. We found 25 relevant papers between January 2019 and June 2023, explaining AI data engineering activities. We identify which life cycle phases are covered, which technical solutions or architectures are proposed and which lessons learned are presented. We end by an overall discussion of the papers with implications for practitioners and researchers. This paper ",
    "path": "papers/24/02/2402.05156.json",
    "total_tokens": 849,
    "translated_title": "数据如何？关于AI系统数据工程的映射研究",
    "translated_abstract": "AI系统离不开数据。现在，随着AI模型（数据科学和AI）的成熟，并可以实际应用，大部分组织在数据基础设施方面遇到了困难。需要了解如何为AI系统准备数据的数据工程师或可以为分析项目设置企业级数据架构的工程师越来越多。然而，在过去，AI工程的数据工程部分没有得到太多关注，而更多讨论建模部分。本文旨在通过进行一项关于AI系统数据工程的映射研究（即AI数据工程）来改变这种情况。我们在2019年1月至2023年6月之间找到了25篇相关论文，解释了AI数据工程活动。我们确定了涵盖的生命周期阶段，提出的技术解决方案或架构以及所呈现的经验教训。最后，我们对论文进行了整体讨论，并对从业者和研究人员提出了一些启示。",
    "tldr": "本文通过进行一项关于AI系统数据工程的映射研究，提出了关于AI数据工程活动的生命周期阶段，技术解决方案和架构以及经验教训。",
    "en_tdlr": "This paper presents a mapping study on data engineering for AI systems, highlighting the life cycle phases, technical solutions and architectures, and lessons learned regarding AI data engineering activities."
}