{
    "title": "Diffusion Model-Based Multiobjective Optimization for Gasoline Blending Scheduling",
    "abstract": "arXiv:2402.14600v1 Announce Type: new  Abstract: Gasoline blending scheduling uses resource allocation and operation sequencing to meet a refinery's production requirements. The presence of nonlinearity, integer constraints, and a large number of decision variables adds complexity to this problem, posing challenges for traditional and evolutionary algorithms. This paper introduces a novel multiobjective optimization approach driven by a diffusion model (named DMO), which is designed specifically for gasoline blending scheduling. To address integer constraints and generate feasible schedules, the diffusion model creates multiple intermediate distributions between Gaussian noise and the feasible domain. Through iterative processes, the solutions transition from Gaussian noise to feasible schedules while optimizing the objectives using the gradient descent method. DMO achieves simultaneous objective optimization and constraint adherence. Comparative tests are conducted to evaluate DMO's p",
    "link": "https://arxiv.org/abs/2402.14600",
    "context": "Title: Diffusion Model-Based Multiobjective Optimization for Gasoline Blending Scheduling\nAbstract: arXiv:2402.14600v1 Announce Type: new  Abstract: Gasoline blending scheduling uses resource allocation and operation sequencing to meet a refinery's production requirements. The presence of nonlinearity, integer constraints, and a large number of decision variables adds complexity to this problem, posing challenges for traditional and evolutionary algorithms. This paper introduces a novel multiobjective optimization approach driven by a diffusion model (named DMO), which is designed specifically for gasoline blending scheduling. To address integer constraints and generate feasible schedules, the diffusion model creates multiple intermediate distributions between Gaussian noise and the feasible domain. Through iterative processes, the solutions transition from Gaussian noise to feasible schedules while optimizing the objectives using the gradient descent method. DMO achieves simultaneous objective optimization and constraint adherence. Comparative tests are conducted to evaluate DMO's p",
    "path": "papers/24/02/2402.14600.json",
    "total_tokens": 792,
    "translated_title": "基于扩散模型的汽油调配调度多目标优化",
    "translated_abstract": "汽油混合调度利用资源分配和操作顺序满足炼油厂的生产要求。非线性、整数约束和大量决策变量的存在增加了这一问题的复杂性，使传统和进化算法面临挑战。本文介绍了一种新颖的基于扩散模型（称为DMO）的多目标优化方法，专门设计用于汽油混合调度。为了解决整数约束并生成可行调度，扩散模型在高斯噪声和可行域之间创建多个中间分布。通过迭代过程，解决方案从高斯噪声过渡到可行调度，同时使用梯度下降方法优化目标。DMO实现了同时目标优化和约束遵守。进行了比较测试以评估DMO的性能。",
    "tldr": "该论文介绍了一种基于扩散模型的汽油调配调度多目标优化方法，通过解决整数约束和生成可行调度，实现了同时达到多个优化目标并遵守约束条件。",
    "en_tdlr": "This paper presents a novel multiobjective optimization approach driven by a diffusion model for gasoline blending scheduling, achieving simultaneous objective optimization and constraint adherence by addressing integer constraints and generating feasible schedules."
}