{
    "title": "Interplay of Semantic Communication and Knowledge Learning",
    "abstract": "In the swiftly advancing realm of communication technologies, Semantic Communication (SemCom), which emphasizes knowledge understanding and processing, has emerged as a hot topic. By integrating artificial intelligence technologies, SemCom facilitates a profound understanding, analysis and transmission of communication content. In this chapter, we clarify the means of knowledge learning in SemCom with a particular focus on the utilization of Knowledge Graphs (KGs). Specifically, we first review existing efforts that combine SemCom with knowledge learning. Subsequently, we introduce a KG-enhanced SemCom system, wherein the receiver is carefully calibrated to leverage knowledge from its static knowledge base for ameliorating the decoding performance. Contingent upon this framework, we further explore potential approaches that can empower the system to operate in evolving knowledge base more effectively. Furthermore, we investigate the possibility of integration with Large Language Models",
    "link": "https://arxiv.org/abs/2402.03339",
    "context": "Title: Interplay of Semantic Communication and Knowledge Learning\nAbstract: In the swiftly advancing realm of communication technologies, Semantic Communication (SemCom), which emphasizes knowledge understanding and processing, has emerged as a hot topic. By integrating artificial intelligence technologies, SemCom facilitates a profound understanding, analysis and transmission of communication content. In this chapter, we clarify the means of knowledge learning in SemCom with a particular focus on the utilization of Knowledge Graphs (KGs). Specifically, we first review existing efforts that combine SemCom with knowledge learning. Subsequently, we introduce a KG-enhanced SemCom system, wherein the receiver is carefully calibrated to leverage knowledge from its static knowledge base for ameliorating the decoding performance. Contingent upon this framework, we further explore potential approaches that can empower the system to operate in evolving knowledge base more effectively. Furthermore, we investigate the possibility of integration with Large Language Models",
    "path": "papers/24/02/2402.03339.json",
    "total_tokens": 854,
    "translated_title": "语义通信与知识学习的相互作用",
    "translated_abstract": "在迅速发展的通信技术领域，强调知识理解和处理的语义通信（SemCom）已经成为一个热门话题。通过整合人工智能技术，SemCom促进了对通信内容的深入理解、分析和传输。在本章中，我们着重阐明了SemCom中的知识学习手段，特别关注了知识图谱（KGs）的利用。具体而言，我们首先回顾了将SemCom与知识学习相结合的现有工作。随后，我们介绍了一个基于KG增强的SemCom系统，其中接收方通过从静态知识库中利用知识来改善解码性能。在此框架下，我们进一步探讨了能够使系统在不断演化的知识库中更有效地运行的潜在方法。此外，我们还研究了与大型语言模型集成的可能性。",
    "tldr": "这篇论文介绍了语义通信与知识学习的相互作用，讨论了如何利用知识图谱来增强语义通信系统，并探索了使系统在不断演化的知识库中更有效运行的方法。同时还研究了将语义通信与大型语言模型集成的可能性。",
    "en_tdlr": "This paper explores the interplay between semantic communication and knowledge learning, discusses the enhancement of semantic communication systems with knowledge graphs, and investigates approaches to effectively operate in evolving knowledge bases. The possibility of integration with large language models is also examined."
}