{
    "title": "Toward Building a Semantic Network Inventory for Model-Driven Telemetry",
    "abstract": "Network telemetry based on data models is expected to become the standard mechanism for collecting operational data from network devices efficiently. But the wide variety of standard and proprietary data models along with the different implementations of telemetry protocols offered by network vendors, become a barrier when monitoring heterogeneous network infrastructures. To facilitate the integration and sharing of context information related to model-driven telemetry, this work proposes a semantic network inventory that integrates new information models specifically developed to capture context information in a vendor-agnostic fashion using current standards defined for context management. To automate the integration of this context information within the network inventory, a reference architecture is designed. Finally, a prototype of the solution is implemented and validated through a case study that illustrates how the network inventory can ease the operation of model-driven teleme",
    "link": "https://arxiv.org/abs/2402.06511",
    "context": "Title: Toward Building a Semantic Network Inventory for Model-Driven Telemetry\nAbstract: Network telemetry based on data models is expected to become the standard mechanism for collecting operational data from network devices efficiently. But the wide variety of standard and proprietary data models along with the different implementations of telemetry protocols offered by network vendors, become a barrier when monitoring heterogeneous network infrastructures. To facilitate the integration and sharing of context information related to model-driven telemetry, this work proposes a semantic network inventory that integrates new information models specifically developed to capture context information in a vendor-agnostic fashion using current standards defined for context management. To automate the integration of this context information within the network inventory, a reference architecture is designed. Finally, a prototype of the solution is implemented and validated through a case study that illustrates how the network inventory can ease the operation of model-driven teleme",
    "path": "papers/24/02/2402.06511.json",
    "total_tokens": 829,
    "translated_title": "构建基于模型驱动遥测的语义网络清单的研究",
    "translated_abstract": "基于数据模型的网络遥测被期望成为高效收集网络设备运行数据的标准机制。但是，标准和专有数据模型的广泛多样性，以及网络供应商提供的遥测协议的不同实现，使得监控异构网络基础设施变得困难。为了促进与模型驱动遥测相关的上下文信息的集成和共享，该研究提出了一个语义网络清单，该清单集成了特定开发的新信息模型，以一种供应商无关的方式捕获上下文信息，使用了当前上下文管理所定义的标准。为了自动化地将这些上下文信息集成到网络清单中，设计了一个参考架构。最后，通过一个案例研究实施并验证了该解决方案的原型，阐述了网络清单如何简化模型驱动遥测的操作。",
    "tldr": "本研究提出了一个语义网络清单，用于集成和共享与模型驱动遥测相关的上下文信息，并自动化地将这些信息集成到网络清单中。通过实施和验证原型，证明了网络清单可以简化模型驱动遥测的操作。",
    "en_tdlr": "This study proposes a semantic network inventory to integrate and share context information related to model-driven telemetry, automating its integration within the network inventory. The prototype implementation validates that the network inventory can simplify the operation of model-driven telemetry."
}