{
    "title": "Understanding the Impact of Long-Term Memory on Self-Disclosure with Large Language Model-Driven Chatbots for Public Health Intervention",
    "abstract": "arXiv:2402.11353v1 Announce Type: cross  Abstract: Recent large language models (LLMs) offer the potential to support public health monitoring by facilitating health disclosure through open-ended conversations but rarely preserve the knowledge gained about individuals across repeated interactions. Augmenting LLMs with long-term memory (LTM) presents an opportunity to improve engagement and self-disclosure, but we lack an understanding of how LTM impacts people's interaction with LLM-driven chatbots in public health interventions. We examine the case of CareCall -- an LLM-driven voice chatbot with LTM -- through the analysis of 1,252 call logs and interviews with nine users. We found that LTM enhanced health disclosure and fostered positive perceptions of the chatbot by offering familiarity. However, we also observed challenges in promoting self-disclosure through LTM, particularly around addressing chronic health conditions and privacy concerns. We discuss considerations for LTM integr",
    "link": "https://arxiv.org/abs/2402.11353",
    "context": "Title: Understanding the Impact of Long-Term Memory on Self-Disclosure with Large Language Model-Driven Chatbots for Public Health Intervention\nAbstract: arXiv:2402.11353v1 Announce Type: cross  Abstract: Recent large language models (LLMs) offer the potential to support public health monitoring by facilitating health disclosure through open-ended conversations but rarely preserve the knowledge gained about individuals across repeated interactions. Augmenting LLMs with long-term memory (LTM) presents an opportunity to improve engagement and self-disclosure, but we lack an understanding of how LTM impacts people's interaction with LLM-driven chatbots in public health interventions. We examine the case of CareCall -- an LLM-driven voice chatbot with LTM -- through the analysis of 1,252 call logs and interviews with nine users. We found that LTM enhanced health disclosure and fostered positive perceptions of the chatbot by offering familiarity. However, we also observed challenges in promoting self-disclosure through LTM, particularly around addressing chronic health conditions and privacy concerns. We discuss considerations for LTM integr",
    "path": "papers/24/02/2402.11353.json",
    "total_tokens": 926,
    "translated_title": "理解长期记忆对大型语言模型驱动聊天机器人在公共卫生干预中自我披露的影响",
    "translated_abstract": "最近的大型语言模型(LLMs)有潜力通过开放式对话支持公共卫生监测，但在多次互动中很少保留关于个人的知识。通过添加长期记忆(LTM)来增强LLMs提供了改进参与度和自我披露的机会，但我们缺乏对LTM如何影响人们在公共卫生干预中与LLM驱动的聊天机器人互动的理解。我们通过分析1,252通话记录和对九名用户的访谈，研究了CareCall这种带有LTM的LLM驱动的语音聊天机器人的案例。我们发现LTM增强了健康披露，并通过提供熟悉感促进了用户对聊天机器人的积极看法。然而，我们也观察到通过LTM促进自我披露存在挑战，尤其是在解决慢性健康状况和隐私问题方面。我们讨论了LTM整合的考虑。",
    "tldr": "长期记忆的引入提高了大型语言模型驱动聊天机器人在公共卫生干预中的用户自我披露，但仍存在挑战，特别是在解决慢性健康状况和隐私问题方面。",
    "en_tdlr": "Introducing long-term memory improves user self-disclosure with large language model-driven chatbots for public health intervention, but challenges remain, especially in addressing chronic health conditions and privacy concerns."
}