{
    "title": "Class-incremental Learning for Time Series: Benchmark and Evaluation",
    "abstract": "arXiv:2402.12035v1 Announce Type: cross  Abstract: Real-world environments are inherently non-stationary, frequently introducing new classes over time. This is especially common in time series classification, such as the emergence of new disease classification in healthcare or the addition of new activities in human activity recognition. In such cases, a learning system is required to assimilate novel classes effectively while avoiding catastrophic forgetting of the old ones, which gives rise to the Class-incremental Learning (CIL) problem. However, despite the encouraging progress in the image and language domains, CIL for time series data remains relatively understudied. Existing studies suffer from inconsistent experimental designs, necessitating a comprehensive evaluation and benchmarking of methods across a wide range of datasets. To this end, we first present an overview of the Time Series Class-incremental Learning (TSCIL) problem, highlight its unique challenges, and cover the ",
    "link": "https://arxiv.org/abs/2402.12035",
    "context": "Title: Class-incremental Learning for Time Series: Benchmark and Evaluation\nAbstract: arXiv:2402.12035v1 Announce Type: cross  Abstract: Real-world environments are inherently non-stationary, frequently introducing new classes over time. This is especially common in time series classification, such as the emergence of new disease classification in healthcare or the addition of new activities in human activity recognition. In such cases, a learning system is required to assimilate novel classes effectively while avoiding catastrophic forgetting of the old ones, which gives rise to the Class-incremental Learning (CIL) problem. However, despite the encouraging progress in the image and language domains, CIL for time series data remains relatively understudied. Existing studies suffer from inconsistent experimental designs, necessitating a comprehensive evaluation and benchmarking of methods across a wide range of datasets. To this end, we first present an overview of the Time Series Class-incremental Learning (TSCIL) problem, highlight its unique challenges, and cover the ",
    "path": "papers/24/02/2402.12035.json",
    "total_tokens": 849,
    "translated_title": "时间序列的增量式学习: 基准和评估",
    "translated_abstract": "现实环境本质上是非平稳的，经常会随时间引入新的类别。这在时间序列分类中尤为常见，比如在医疗保健领域出现新的疾病分类，或者在人类活动识别中添加新的活动。在这种情况下，需要一个学习系统能够有效地吸收新的类别，同时避免对旧类别的灾难性遗忘，这就引发了增量式学习问题。然而，尽管在图像和语言领域取得了令人鼓舞的进展，但针对时间序列数据的增量式学习仍然相对较少研究。现有研究存在实验设计不一致的问题，需要对方法在各种数据集上进行全面评估和基准测试。为此，我们首先概述了时间序列增量学习（TSCIL）问题，突出了其独特挑战，并覆盖了...",
    "tldr": "时间序列增量学习问题在图像和语言领域取得了进展，但在时间序列数据方面仍然相对较少研究，本文提出了一个全面的评估和基准测试方法。",
    "en_tdlr": "Incremental learning in time series has seen progress in image and language domains, but remains relatively understudied, prompting a comprehensive evaluation and benchmarking approach in this paper."
}