{
    "title": "Radio-astronomical Image Reconstruction with Conditional Denoising Diffusion Model",
    "abstract": "arXiv:2402.10204v1 Announce Type: cross  Abstract: Reconstructing sky models from dirty radio images for accurate source localization and flux estimation is crucial for studying galaxy evolution at high redshift, especially in deep fields using instruments like the Atacama Large Millimetre Array (ALMA). With new projects like the Square Kilometre Array (SKA), there's a growing need for better source extraction methods. Current techniques, such as CLEAN and PyBDSF, often fail to detect faint sources, highlighting the need for more accurate methods. This study proposes using stochastic neural networks to rebuild sky models directly from dirty images. This method can pinpoint radio sources and measure their fluxes with related uncertainties, marking a potential improvement in radio source characterization. We tested this approach on 10164 images simulated with the CASA tool simalma, based on ALMA's Cycle 5.3 antenna setup. We applied conditional Denoising Diffusion Probabilistic Models (D",
    "link": "https://arxiv.org/abs/2402.10204",
    "context": "Title: Radio-astronomical Image Reconstruction with Conditional Denoising Diffusion Model\nAbstract: arXiv:2402.10204v1 Announce Type: cross  Abstract: Reconstructing sky models from dirty radio images for accurate source localization and flux estimation is crucial for studying galaxy evolution at high redshift, especially in deep fields using instruments like the Atacama Large Millimetre Array (ALMA). With new projects like the Square Kilometre Array (SKA), there's a growing need for better source extraction methods. Current techniques, such as CLEAN and PyBDSF, often fail to detect faint sources, highlighting the need for more accurate methods. This study proposes using stochastic neural networks to rebuild sky models directly from dirty images. This method can pinpoint radio sources and measure their fluxes with related uncertainties, marking a potential improvement in radio source characterization. We tested this approach on 10164 images simulated with the CASA tool simalma, based on ALMA's Cycle 5.3 antenna setup. We applied conditional Denoising Diffusion Probabilistic Models (D",
    "path": "papers/24/02/2402.10204.json",
    "total_tokens": 882,
    "translated_title": "使用有条件降噪扩散模型进行射电天文图像重建",
    "translated_abstract": "从不干净的射电图像中重建天空模型，以便准确定位和测量流量对于研究高红移下的星系演化至关重要，尤其是在使用Atacama Large Millimetre Array (ALMA)等仪器进行深度观测时。随着Square Kilometre Array (SKA)等新项目的启动，对更好的源提取方法的需求日益增长。目前的技术，如CLEAN和PyBDSF，往往无法检测到微弱的源，凸显了对更准确方法的需求。本研究提议使用随机神经网络直接从不干净的图像中重建天空模型。该方法可以精确定位射电源并测量伴随的不确定性，标志着射电源表征方面的潜在改进。我们在使用基于ALMA第5.3周期天线设置的CASA工具simalma模拟的10164个图像上测试了这种方法。",
    "tldr": "该研究提出使用有条件降噪扩散模型从不干净的射电图像中重建天空模型，以实现准确定位和测量流量，为射电源的表征提供潜在改进。",
    "en_tdlr": "This study proposes using a conditional denoising diffusion model to reconstruct sky models from dirty radio images, allowing for accurate source localization and flux measurement, with a potential improvement in radio source characterization."
}