{
    "title": "Graph-Based Retriever Captures the Long Tail of Biomedical Knowledge",
    "abstract": "arXiv:2402.12352v1 Announce Type: new  Abstract: Large language models (LLMs) are transforming the way information is retrieved with vast amounts of knowledge being summarized and presented via natural language conversations. Yet, LLMs are prone to highlight the most frequently seen pieces of information from the training set and to neglect the rare ones. In the field of biomedical research, latest discoveries are key to academic and industrial actors and are obscured by the abundance of an ever-increasing literature corpus (the information overload problem). Surfacing new associations between biomedical entities, e.g., drugs, genes, diseases, with LLMs becomes a challenge of capturing the long-tail knowledge of the biomedical scientific production. To overcome this challenge, Retrieval Augmented Generation (RAG) has been proposed to alleviate some of the shortcomings of LLMs by augmenting the prompts with context retrieved from external datasets. RAG methods typically select the conte",
    "link": "https://arxiv.org/abs/2402.12352",
    "context": "Title: Graph-Based Retriever Captures the Long Tail of Biomedical Knowledge\nAbstract: arXiv:2402.12352v1 Announce Type: new  Abstract: Large language models (LLMs) are transforming the way information is retrieved with vast amounts of knowledge being summarized and presented via natural language conversations. Yet, LLMs are prone to highlight the most frequently seen pieces of information from the training set and to neglect the rare ones. In the field of biomedical research, latest discoveries are key to academic and industrial actors and are obscured by the abundance of an ever-increasing literature corpus (the information overload problem). Surfacing new associations between biomedical entities, e.g., drugs, genes, diseases, with LLMs becomes a challenge of capturing the long-tail knowledge of the biomedical scientific production. To overcome this challenge, Retrieval Augmented Generation (RAG) has been proposed to alleviate some of the shortcomings of LLMs by augmenting the prompts with context retrieved from external datasets. RAG methods typically select the conte",
    "path": "papers/24/02/2402.12352.json",
    "total_tokens": 811,
    "translated_title": "基于图的检索器捕捉生物医学知识的长尾",
    "translated_abstract": "大型语言模型(Large language models, LLMs)正在改变信息检索的方式，通过自然语言对话总结和展示大量知识。然而，LLMs倾向于突出训练集中最常见的信息片段，并忽视罕见的信息。在生物医学研究领域，最新的发现对于学术和工业界是至关重要的，但往往被大量不断增长的文献领域所掩盖(信息过载问题)。利用LLMs展现生物医学实体之间的新关联，如药物、基因、疾病，成为捕捉生物医学科学生产的长尾知识的挑战。",
    "tldr": "基于Retrieval Augmented Generation (RAG)的图检索器被提议用来克服LLMs的局限，通过从外部数据集检索的上下文来增强提示信息，从而解决生物医学领域长尾知识的捕获挑战。",
    "en_tdlr": "A graph-based retriever using Retrieval Augmented Generation (RAG) is proposed to overcome the limitations of LLMs by augmenting prompts with context retrieved from external datasets, addressing the challenge of capturing long-tail knowledge in the field of biomedical research."
}