{
    "title": "Generating Visual Stimuli from EEG Recordings using Transformer-encoder based EEG encoder and GAN",
    "abstract": "arXiv:2402.10115v1 Announce Type: new  Abstract: In this study, we tackle a modern research challenge within the field of perceptual brain decoding, which revolves around synthesizing images from EEG signals using an adversarial deep learning framework. The specific objective is to recreate images belonging to various object categories by leveraging EEG recordings obtained while subjects view those images. To achieve this, we employ a Transformer-encoder based EEG encoder to produce EEG encodings, which serve as inputs to the generator component of the GAN network. Alongside the adversarial loss, we also incorporate perceptual loss to enhance the quality of the generated images.",
    "link": "https://arxiv.org/abs/2402.10115",
    "context": "Title: Generating Visual Stimuli from EEG Recordings using Transformer-encoder based EEG encoder and GAN\nAbstract: arXiv:2402.10115v1 Announce Type: new  Abstract: In this study, we tackle a modern research challenge within the field of perceptual brain decoding, which revolves around synthesizing images from EEG signals using an adversarial deep learning framework. The specific objective is to recreate images belonging to various object categories by leveraging EEG recordings obtained while subjects view those images. To achieve this, we employ a Transformer-encoder based EEG encoder to produce EEG encodings, which serve as inputs to the generator component of the GAN network. Alongside the adversarial loss, we also incorporate perceptual loss to enhance the quality of the generated images.",
    "path": "papers/24/02/2402.10115.json",
    "total_tokens": 742,
    "translated_title": "使用基于Transformer编码器的EEG编码器和GAN从EEG记录中生成视觉刺激",
    "translated_abstract": "在这项研究中，我们解决了感知性脑解码领域的一个现代研究挑战，即使用对抗式深度学习框架从EEG信号中合成图像。具体目标是利用主体观看图像时获得的EEG记录重新创建属于各种对象类别的图像。为了实现这一目标，我们使用基于Transformer编码器的EEG编码器生成EEG编码，然后将其作为GAN网络的生成器组件的输入。除了对抗损失之外，我们还采用了感知损失来提高生成图像的质量。",
    "tldr": "本研究使用基于Transformer编码器的EEG编码器和GAN网络，通过合成图像从EEG信号中恢复出各种对象类别的图像，同时结合对抗损失和感知损失，提高生成图像的质量。",
    "en_tdlr": "This study investigates the challenge of synthesizing images from EEG signals using an adversarial deep learning framework, proposing a method that utilizes a Transformer-encoder based EEG encoder and a GAN network. The approach aims to recreate images of various object categories by leveraging EEG recordings, and incorporates both adversarial and perceptual losses to enhance the quality of the generated images."
}