{
    "title": "AI-Driven Anonymization: Protecting Personal Data Privacy While Leveraging Machine Learning",
    "abstract": "arXiv:2402.17191v1 Announce Type: cross  Abstract: The development of artificial intelligence has significantly transformed people's lives. However, it has also posed a significant threat to privacy and security, with numerous instances of personal information being exposed online and reports of criminal attacks and theft. Consequently, the need to achieve intelligent protection of personal information through machine learning algorithms has become a paramount concern. Artificial intelligence leverages advanced algorithms and technologies to effectively encrypt and anonymize personal data, enabling valuable data analysis and utilization while safeguarding privacy. This paper focuses on personal data privacy protection and the promotion of anonymity as its core research objectives. It achieves personal data privacy protection and detection through the use of machine learning's differential privacy protection algorithm. The paper also addresses existing challenges in machine learning rel",
    "link": "https://arxiv.org/abs/2402.17191",
    "context": "Title: AI-Driven Anonymization: Protecting Personal Data Privacy While Leveraging Machine Learning\nAbstract: arXiv:2402.17191v1 Announce Type: cross  Abstract: The development of artificial intelligence has significantly transformed people's lives. However, it has also posed a significant threat to privacy and security, with numerous instances of personal information being exposed online and reports of criminal attacks and theft. Consequently, the need to achieve intelligent protection of personal information through machine learning algorithms has become a paramount concern. Artificial intelligence leverages advanced algorithms and technologies to effectively encrypt and anonymize personal data, enabling valuable data analysis and utilization while safeguarding privacy. This paper focuses on personal data privacy protection and the promotion of anonymity as its core research objectives. It achieves personal data privacy protection and detection through the use of machine learning's differential privacy protection algorithm. The paper also addresses existing challenges in machine learning rel",
    "path": "papers/24/02/2402.17191.json",
    "total_tokens": 751,
    "translated_title": "AI驱动的匿名化：在利用机器学习的同时保护个人数据隐私",
    "translated_abstract": "人工智能的发展显著改变了人们的生活。然而，它也对隐私和安全构成了重大威胁，许多个人信息被公开，并有犯罪攻击和窃取的报道。因此，通过机器学习算法实现个人信息的智能保护已经成为首要关注的问题。人工智能利用先进算法和技术有效加密和匿名化个人数据，实现有价值的数据分析和利用同时维护隐私。本文着眼于个人数据隐私保护和匿名化推广作为其核心研究目标。它通过使用机器学习的差分隐私保护算法实现了个人数据隐私保护和检测。该论文还解决了机器学习领域中现有的挑战。",
    "tldr": "通过机器学习的差分隐私保护算法，实现个人数据隐私保护和检测。",
    "en_tdlr": "Achieving personal data privacy protection and detection through the use of machine learning's differential privacy protection algorithm."
}