{
    "title": "Graph Learning under Distribution Shifts: A Comprehensive Survey on Domain Adaptation, Out-of-distribution, and Continual Learning",
    "abstract": "arXiv:2402.16374v1 Announce Type: new  Abstract: Graph learning plays a pivotal role and has gained significant attention in various application scenarios, from social network analysis to recommendation systems, for its effectiveness in modeling complex data relations represented by graph structural data. In reality, the real-world graph data typically show dynamics over time, with changing node attributes and edge structure, leading to the severe graph data distribution shift issue. This issue is compounded by the diverse and complex nature of distribution shifts, which can significantly impact the performance of graph learning methods in degraded generalization and adaptation capabilities, posing a substantial challenge to their effectiveness. In this survey, we provide a comprehensive review and summary of the latest approaches, strategies, and insights that address distribution shifts within the context of graph learning. Concretely, according to the observability of distributions ",
    "link": "https://arxiv.org/abs/2402.16374",
    "context": "Title: Graph Learning under Distribution Shifts: A Comprehensive Survey on Domain Adaptation, Out-of-distribution, and Continual Learning\nAbstract: arXiv:2402.16374v1 Announce Type: new  Abstract: Graph learning plays a pivotal role and has gained significant attention in various application scenarios, from social network analysis to recommendation systems, for its effectiveness in modeling complex data relations represented by graph structural data. In reality, the real-world graph data typically show dynamics over time, with changing node attributes and edge structure, leading to the severe graph data distribution shift issue. This issue is compounded by the diverse and complex nature of distribution shifts, which can significantly impact the performance of graph learning methods in degraded generalization and adaptation capabilities, posing a substantial challenge to their effectiveness. In this survey, we provide a comprehensive review and summary of the latest approaches, strategies, and insights that address distribution shifts within the context of graph learning. Concretely, according to the observability of distributions ",
    "path": "papers/24/02/2402.16374.json",
    "total_tokens": 770,
    "translated_title": "图学习在分布变化下的研究：领域自适应、外部分布和持续学习的综述",
    "translated_abstract": "图学习在各种应用场景中发挥着关键作用，并且因其在建模由图结构数据表示的复杂数据关系方面的有效性而引起了广泛关注，从社交网络分析到推荐系统。现实中，真实世界的图数据通常随时间动态变化，节点属性和边结构也会发生变化，导致严重的图数据分布转移问题。这个问题受到分布转移多样性和复杂性的影响，这些转移可以显著影响图学习方法在降低泛化和适应能力方面的性能，给它们的有效性带来了重大挑战。在这项调查中，我们对解决图学习背景下的分布变化的最新方法、策略和见解进行了全面回顾和总结。",
    "tldr": "该综述调查了解决图学习中分布变化问题的最新方法、策略和见解。"
}