{
    "title": "CrashFormer: A Multimodal Architecture to Predict the Risk of Crash",
    "abstract": "Reducing traffic accidents is a crucial global public safety concern. Accident prediction is key to improving traffic safety, enabling proactive measures to be taken before a crash occurs, and informing safety policies, regulations, and targeted interventions. Despite numerous studies on accident prediction over the past decades, many have limitations in terms of generalizability, reproducibility, or feasibility for practical use due to input data or problem formulation. To address existing shortcomings, we propose CrashFormer, a multi-modal architecture that utilizes comprehensive (but relatively easy to obtain) inputs such as the history of accidents, weather information, map images, and demographic information. The model predicts the future risk of accidents on a reasonably acceptable cadence (i.e., every six hours) for a geographical location of 5.161 square kilometers. CrashFormer is composed of five components: a sequential encoder to utilize historical accidents and weather data",
    "link": "https://arxiv.org/abs/2402.05151",
    "context": "Title: CrashFormer: A Multimodal Architecture to Predict the Risk of Crash\nAbstract: Reducing traffic accidents is a crucial global public safety concern. Accident prediction is key to improving traffic safety, enabling proactive measures to be taken before a crash occurs, and informing safety policies, regulations, and targeted interventions. Despite numerous studies on accident prediction over the past decades, many have limitations in terms of generalizability, reproducibility, or feasibility for practical use due to input data or problem formulation. To address existing shortcomings, we propose CrashFormer, a multi-modal architecture that utilizes comprehensive (but relatively easy to obtain) inputs such as the history of accidents, weather information, map images, and demographic information. The model predicts the future risk of accidents on a reasonably acceptable cadence (i.e., every six hours) for a geographical location of 5.161 square kilometers. CrashFormer is composed of five components: a sequential encoder to utilize historical accidents and weather data",
    "path": "papers/24/02/2402.05151.json",
    "total_tokens": 881,
    "translated_title": "CrashFormer: 一种多模态架构用于预测事故风险",
    "translated_abstract": "减少交通事故是一个至关重要的全球公共安全问题。事故预测对于提高交通安全至关重要，可以在事故发生之前采取积极的措施，并提供安全政策、法规和有针对性的干预措施的信息。尽管过去几十年进行了许多关于事故预测的研究，但由于输入数据或问题形式的限制，许多研究在可推广性、可重现性或实际应用上存在局限性。为了解决现有的缺点，我们提出了CrashFormer，这是一种多模态架构，利用全面（但相对容易获取）的输入数据，如事故历史、天气信息、地图图像和人口信息。该模型可以以相对可接受的频率（即每6小时）预测5.161平方公里地理范围内的未来事故风险。CrashFormer由五个组成部分组成：序列编码器用于利用历史事故和天气数据。",
    "tldr": "CrashFormer是一种多模态架构，利用全面的输入数据（如事故历史、天气信息、地图图像和人口信息），可以每6小时预测5.161平方公里地理范围内的未来事故风险。",
    "en_tdlr": "CrashFormer is a multimodal architecture that uses comprehensive input data such as accident history, weather information, map images, and demographic information to predict future accident risk every six hours within a geographical area of 5.161 square kilometers."
}