{
    "title": "On non-negative solutions of stochastic Volterra equations with jumps and non-Lipschitz coefficients",
    "abstract": "arXiv:2402.19203v1 Announce Type: cross  Abstract: We consider one-dimensional stochastic Volterra equations with jumps for which we establish conditions upon the convolution kernel and coefficients for the strong existence and pathwise uniqueness of a non-negative c\\`adl\\`ag solution. By using the approach recently developed in arXiv:2302.07758, we show the strong existence by using a nonnegative approximation of the equation whose convergence is proved via a variant of the Yamada--Watanabe approximation technique. We apply our results to L\\'evy-driven stochastic Volterra equations. In particular, we are able to define a Volterra extension of the so-called alpha-stable Cox--Ingersoll--Ross process, which is especially used for applications in Mathematical Finance.",
    "link": "https://arxiv.org/abs/2402.19203",
    "context": "Title: On non-negative solutions of stochastic Volterra equations with jumps and non-Lipschitz coefficients\nAbstract: arXiv:2402.19203v1 Announce Type: cross  Abstract: We consider one-dimensional stochastic Volterra equations with jumps for which we establish conditions upon the convolution kernel and coefficients for the strong existence and pathwise uniqueness of a non-negative c\\`adl\\`ag solution. By using the approach recently developed in arXiv:2302.07758, we show the strong existence by using a nonnegative approximation of the equation whose convergence is proved via a variant of the Yamada--Watanabe approximation technique. We apply our results to L\\'evy-driven stochastic Volterra equations. In particular, we are able to define a Volterra extension of the so-called alpha-stable Cox--Ingersoll--Ross process, which is especially used for applications in Mathematical Finance.",
    "path": "papers/24/02/2402.19203.json",
    "total_tokens": 825,
    "translated_title": "关于具有跳跃和非Lipschitz系数的随机Volterra方程的非负解",
    "translated_abstract": "我们考虑具有跳跃的一维随机Volterra方程，在其中我们建立了关于卷积核和系数的条件，从而确立了非负连续增函数解的强存在性和路径唯一性。通过利用最近在arXiv:2302.07758中开发的方法，我们展示了通过使用方程的非负逼近来实现强存在性，其收敛性是通过Yamada-Watanabe逼近技术的变体证明的。我们将结果应用于Lévy驱动的随机Volterra方程。特别地，我们能够定义所谓的alpha-稳定Cox-Ingersoll-Ross过程的Volterra扩展，这在数学金融中特别有应用。",
    "tldr": "该论文研究了具有跳跃和非Lipschitz系数的随机Volterra方程的非负解的强存在和路径唯一性条件，并将结果应用于Lévy驱动的随机Volterra方程，尤其在数学金融中定义了alpha-稳定Cox-Ingersoll-Ross过程的Volterra扩展。",
    "en_tdlr": "The paper investigates the conditions for strong existence and pathwise uniqueness of non-negative solutions of stochastic Volterra equations with jumps and non-Lipschitz coefficients, and applies the results to Lévy-driven stochastic Volterra equations, defining a Volterra extension of the alpha-stable Cox-Ingersoll-Ross process, particularly useful in Mathematical Finance."
}