{
    "title": "FDNet: Frequency Domain Denoising Network For Cell Segmentation in Astrocytes Derived From Induced Pluripotent Stem Cells",
    "abstract": "Artificially generated induced pluripotent stem cells (iPSCs) from somatic cells play an important role for disease modeling and drug screening of neurodegenerative diseases. Astrocytes differentiated from iPSCs are important targets to investigate neuronal metabolism. The astrocyte differentiation progress can be monitored through the variations of morphology observed from microscopy images at different differentiation stages, then determined by molecular biology techniques upon maturation. However, the astrocytes usually ``perfectly'' blend into the background and some of them are covered by interference information (i.e., dead cells, media sediments, and cell debris), which makes astrocytes difficult to observe. Due to the lack of annotated datasets, the existing state-of-the-art deep learning approaches cannot be used to address this issue. In this paper, we introduce a new task named astrocyte segmentation with a novel dataset, called IAI704, which contains 704 images and their co",
    "link": "https://arxiv.org/abs/2402.02724",
    "context": "Title: FDNet: Frequency Domain Denoising Network For Cell Segmentation in Astrocytes Derived From Induced Pluripotent Stem Cells\nAbstract: Artificially generated induced pluripotent stem cells (iPSCs) from somatic cells play an important role for disease modeling and drug screening of neurodegenerative diseases. Astrocytes differentiated from iPSCs are important targets to investigate neuronal metabolism. The astrocyte differentiation progress can be monitored through the variations of morphology observed from microscopy images at different differentiation stages, then determined by molecular biology techniques upon maturation. However, the astrocytes usually ``perfectly'' blend into the background and some of them are covered by interference information (i.e., dead cells, media sediments, and cell debris), which makes astrocytes difficult to observe. Due to the lack of annotated datasets, the existing state-of-the-art deep learning approaches cannot be used to address this issue. In this paper, we introduce a new task named astrocyte segmentation with a novel dataset, called IAI704, which contains 704 images and their co",
    "path": "papers/24/02/2402.02724.json",
    "total_tokens": 1081,
    "translated_title": "FDNet: 频域去噪神经网络用于识别由诱导多能干细胞分化而来的星形胶质细胞",
    "translated_abstract": "从体细胞人工生成的诱导多能干细胞（iPSCs）在疾病建模和神经退行性疾病的药物筛选中起着重要作用。从iPSCs分化出的星形胶质细胞是研究神经代谢的重要目标。通过在不同分化阶段观察显微镜图像中观察到的形态变化来监测星形胶质细胞的分化进程，然后通过分子生物学技术在成熟时确定。然而，星形胶质细胞通常会“完美地”融入背景中，而且其中一些细胞会被干扰信息（例如死细胞、培养基沉积物和细胞残骸）掩盖，这使得观察星形胶质细胞变得困难。由于缺乏标注数据集，现有的最先进的深度学习方法无法解决这个问题。本文提出了一种新的任务，即星形胶质细胞分割，并引入了一个名为IAI704的新数据集，其中包含704个图像及其co",
    "tldr": "本论文提出了一种名为FDNet的频域去噪神经网络用于识别由诱导多能干细胞分化而来的星形胶质细胞。由于背景和干扰信息的存在，观察星形胶质细胞变得困难，而现有的深度学习方法无法解决这个问题。本文还引入了一个新的数据集IAI704来解决这个问题。",
    "en_tdlr": "This paper presents a frequency domain denoising network, FDNet, for cell segmentation in astrocytes derived from induced pluripotent stem cells (iPSCs). Due to the presence of background and interference information, it is challenging to observe astrocytes, and existing deep learning methods cannot address this issue. A new dataset, IAI704, is also introduced in this paper to tackle this problem."
}