{
    "title": "PSC-CPI: Multi-Scale Protein Sequence-Structure Contrasting for Efficient and Generalizable Compound-Protein Interaction Prediction",
    "abstract": "Compound-Protein Interaction (CPI) prediction aims to predict the pattern and strength of compound-protein interactions for rational drug discovery. Existing deep learning-based methods utilize only the single modality of protein sequences or structures and lack the co-modeling of the joint distribution of the two modalities, which may lead to significant performance drops in complex real-world scenarios due to various factors, e.g., modality missing and domain shifting. More importantly, these methods only model protein sequences and structures at a single fixed scale, neglecting more fine-grained multi-scale information, such as those embedded in key protein fragments. In this paper, we propose a novel multi-scale Protein Sequence-structure Contrasting framework for CPI prediction (PSC-CPI), which captures the dependencies between protein sequences and structures through both intra-modality and cross-modality contrasting. We further apply length-variable protein augmentation to allow",
    "link": "https://arxiv.org/abs/2402.08198",
    "context": "Title: PSC-CPI: Multi-Scale Protein Sequence-Structure Contrasting for Efficient and Generalizable Compound-Protein Interaction Prediction\nAbstract: Compound-Protein Interaction (CPI) prediction aims to predict the pattern and strength of compound-protein interactions for rational drug discovery. Existing deep learning-based methods utilize only the single modality of protein sequences or structures and lack the co-modeling of the joint distribution of the two modalities, which may lead to significant performance drops in complex real-world scenarios due to various factors, e.g., modality missing and domain shifting. More importantly, these methods only model protein sequences and structures at a single fixed scale, neglecting more fine-grained multi-scale information, such as those embedded in key protein fragments. In this paper, we propose a novel multi-scale Protein Sequence-structure Contrasting framework for CPI prediction (PSC-CPI), which captures the dependencies between protein sequences and structures through both intra-modality and cross-modality contrasting. We further apply length-variable protein augmentation to allow",
    "path": "papers/24/02/2402.08198.json",
    "total_tokens": 1009,
    "translated_title": "PSC-CPI: 多尺度蛋白质序列-结构对比用于高效且具有可推广性的化合物-蛋白质相互作用预测",
    "translated_abstract": "化合物-蛋白质相互作用（CPI）预测旨在预测化合物-蛋白质相互作用的模式和强度，以用于理性药物发现。现有的基于深度学习的方法仅利用蛋白质序列或结构的单一模态，缺乏对两个模态的联合分布进行共同建模，这可能导致在复杂的实际场景中由于各种因素（例如，模态丢失和领域转移）而出现显著的性能下降。更重要的是，这些方法仅以单一固定尺度模拟蛋白质序列和结构，忽视了更精细的多尺度信息，例如嵌入在关键蛋白质片段中的信息。在本文中，我们提出了一种新颖的多尺度蛋白质序列-结构对比框架用于CPI预测（PSC-CPI），通过内模态和跨模态对比捕获蛋白质序列和结构之间的依赖关系。我们还应用可变长度的蛋白质增强技术，以允许对不同长度的蛋白质进行建模。",
    "tldr": "PSC-CPI是一种多尺度蛋白质序列-结构对比框架，通过内模态和跨模态对比捕获蛋白质序列和结构之间的依赖关系，用于高效且具有可推广性的化合物-蛋白质相互作用预测。"
}