{
    "title": "Quantum neural network with ensemble learning to mitigate barren plateaus and cost function concentration",
    "abstract": "The rapid development of quantum computers promises transformative impacts across diverse fields of science and technology. Quantum neural networks (QNNs), as a forefront application, hold substantial potential. Despite the multitude of proposed models in the literature, persistent challenges, notably the vanishing gradient (VG) and cost function concentration (CFC) problems, impede their widespread success. In this study, we introduce a novel approach to quantum neural network construction, specifically addressing the issues of VG and CFC. Our methodology employs ensemble learning, advocating for the simultaneous deployment of multiple quantum circuits with a depth equal to $1$, a departure from the conventional use of a single quantum circuit with depth $L$. We assess the efficacy of our proposed model through a comparative analysis with a conventionally constructed QNN. The evaluation unfolds in the context of a classification problem, yielding valuable insights into the potential a",
    "link": "https://arxiv.org/abs/2402.06026",
    "context": "Title: Quantum neural network with ensemble learning to mitigate barren plateaus and cost function concentration\nAbstract: The rapid development of quantum computers promises transformative impacts across diverse fields of science and technology. Quantum neural networks (QNNs), as a forefront application, hold substantial potential. Despite the multitude of proposed models in the literature, persistent challenges, notably the vanishing gradient (VG) and cost function concentration (CFC) problems, impede their widespread success. In this study, we introduce a novel approach to quantum neural network construction, specifically addressing the issues of VG and CFC. Our methodology employs ensemble learning, advocating for the simultaneous deployment of multiple quantum circuits with a depth equal to $1$, a departure from the conventional use of a single quantum circuit with depth $L$. We assess the efficacy of our proposed model through a comparative analysis with a conventionally constructed QNN. The evaluation unfolds in the context of a classification problem, yielding valuable insights into the potential a",
    "path": "papers/24/02/2402.06026.json",
    "total_tokens": 867,
    "translated_title": "使用集成学习的量子神经网络以缓解平板坡和成本函数集中问题",
    "translated_abstract": "量子计算机的快速发展承诺在科学和技术领域产生变革性影响。量子神经网络（QNN）作为前沿应用具有重要潜力。尽管文献中提出了许多模型，但持续存在的挑战，特别是消失梯度（VG）和成本函数集中（CFC）问题，阻碍了它们的广泛成功。在本研究中，我们提出了一种新的量子神经网络构建方法，特别解决了VG和CFC问题。我们的方法采用集成学习，推崇同时部署多个深度为1的量子电路，而不是传统单一深度为L的量子电路。通过与传统构建的QNN进行比较分析，我们评估了我们提出的模型的有效性。评估在分类问题的背景下展开，为了对量子神经网络的潜在前景提供宝贵的见解。",
    "tldr": "本研究提出了一种使用集成学习的量子神经网络构建方法，旨在解决消失梯度和成本函数集中问题，并通过与传统构建的QNN进行比较分析，评估了其有效性。",
    "en_tdlr": "This study introduces a novel approach to quantum neural network construction using ensemble learning to address the issues of vanishing gradient and cost function concentration. The proposed model is evaluated through a comparative analysis with a conventionally constructed QNN and provides valuable insights into the potential of quantum neural networks."
}