{
    "title": "Competitive Revenue Extraction from Time-Discounted Transactions in the Semi-Myopic Regime",
    "abstract": "Decentralized cryptocurrencies are payment systems that rely on aligning the incentives of users and miners to operate correctly and offer a high quality of service to users. Recent literature studies the mechanism design problem of the auction serving as a cryptocurrency's transaction fee mechanism (TFM). We find that a non-myopic modelling of miners falls close to another well-known problem: that of online buffer management for packet switching. The main difference is that unlike packets which are of a fixed size throughout their lifetime, in a financial environment, user preferences (and therefore revenue extraction) may be time-dependent. We study the competitive ratio guarantees given a certain discount rate, and show how existing methods from packet scheduling, which we call \"the undiscounted case\", perform suboptimally in the more general discounted setting. Most notably, we find a novel, simple, memoryless, and optimal deterministic algorithm for the semi-myopic case, when the ",
    "link": "https://arxiv.org/abs/2402.08549",
    "context": "Title: Competitive Revenue Extraction from Time-Discounted Transactions in the Semi-Myopic Regime\nAbstract: Decentralized cryptocurrencies are payment systems that rely on aligning the incentives of users and miners to operate correctly and offer a high quality of service to users. Recent literature studies the mechanism design problem of the auction serving as a cryptocurrency's transaction fee mechanism (TFM). We find that a non-myopic modelling of miners falls close to another well-known problem: that of online buffer management for packet switching. The main difference is that unlike packets which are of a fixed size throughout their lifetime, in a financial environment, user preferences (and therefore revenue extraction) may be time-dependent. We study the competitive ratio guarantees given a certain discount rate, and show how existing methods from packet scheduling, which we call \"the undiscounted case\", perform suboptimally in the more general discounted setting. Most notably, we find a novel, simple, memoryless, and optimal deterministic algorithm for the semi-myopic case, when the ",
    "path": "papers/24/02/2402.08549.json",
    "total_tokens": 950,
    "translated_title": "在半短视模式中从时间折扣交易中进行竞争性收入提取",
    "translated_abstract": "分散的加密货币是依靠用户和矿工的激励机制来正确运作并为用户提供高质量服务的支付系统。最近的文献研究了作为加密货币交易费机制 (TFM) 的拍卖的机制设计问题。我们发现，对矿工进行非短视建模与另一个众所周知的问题非常接近：数据包交换的在线缓冲管理问题。主要的区别在于，在金融环境中，用户的偏好（因此是收入提取）可能随时间变化。我们研究了在特定折扣率下给出的竞争比率保证，并展示了现有的数据包调度方法在更一般的折扣设定下表现不佳，我们称之为“无折扣情况”。值得注意的是，我们发现了一种新颖、简单、无记忆且最优的确定性算法，适用于半短视情况，当用户的交易价值根据时间而变化时。",
    "tldr": "该论文研究了在半短视模式下，从时间折扣交易中进行竞争性收入提取的问题。通过研究现有的数据包调度方法，发现在更一般的折扣设定下表现不佳。研究者提出了一种新颖、简单、无记忆且最优的确定性算法来解决这个问题。",
    "en_tdlr": "This paper investigates the problem of competitive revenue extraction from time-discounted transactions in the semi-myopic regime. By studying existing packet scheduling methods, it is found that they perform suboptimally in the more general discounted setting. A novel, simple, memoryless, and optimal deterministic algorithm is proposed to address this issue."
}