{
    "title": "Heterogeneity, Uncertainty and Learning: Semiparametric Identification and Estimation",
    "abstract": "We provide semiparametric identification results for a broad class of learning models in which continuous outcomes depend on three types of unobservables: i) known heterogeneity, ii) initially unknown heterogeneity that may be revealed over time, and iii) transitory uncertainty. We consider a common environment where the researcher only has access to a short panel on choices and realized outcomes. We establish identification of the outcome equation parameters and the distribution of the three types of unobservables, under the standard assumption that unknown heterogeneity and uncertainty are normally distributed. We also show that, absent known heterogeneity, the model is identified without making any distributional assumption. We then derive the asymptotic properties of a sieve MLE estimator for the model parameters, and devise a tractable profile likelihood based estimation procedure. Monte Carlo simulation results indicate that our estimator exhibits good finite-sample properties.",
    "link": "https://arxiv.org/abs/2402.08575",
    "context": "Title: Heterogeneity, Uncertainty and Learning: Semiparametric Identification and Estimation\nAbstract: We provide semiparametric identification results for a broad class of learning models in which continuous outcomes depend on three types of unobservables: i) known heterogeneity, ii) initially unknown heterogeneity that may be revealed over time, and iii) transitory uncertainty. We consider a common environment where the researcher only has access to a short panel on choices and realized outcomes. We establish identification of the outcome equation parameters and the distribution of the three types of unobservables, under the standard assumption that unknown heterogeneity and uncertainty are normally distributed. We also show that, absent known heterogeneity, the model is identified without making any distributional assumption. We then derive the asymptotic properties of a sieve MLE estimator for the model parameters, and devise a tractable profile likelihood based estimation procedure. Monte Carlo simulation results indicate that our estimator exhibits good finite-sample properties.",
    "path": "papers/24/02/2402.08575.json",
    "total_tokens": 893,
    "translated_title": "异质性、不确定性和学习：半参数识别和估计",
    "translated_abstract": "我们提供了一类广泛的学习模型的半参数识别结果，其中连续的结果依赖于三类不可观测因素：i) 已知的异质性，ii) 最初未知的异质性可能会随着时间的推移而揭示出来，以及 iii) 短暂的不确定性。我们考虑一个常见的环境，研究人员只能访问其在选择和实际结果上的短期面板数据。在未知的异质性和不确定性服从正态分布的标准假设下，我们确立了结果方程参数和三类不可观测因素的分布的识别。我们还证明，在没有已知的异质性的情况下，该模型可以在不进行任何分布假设的情况下得到识别。然后我们推导了模型参数的筛选最大似然估计的渐近性质，并设计了一个可行的基于剖面似然的估计过程。蒙特卡洛模拟结果表明，我们的估计器表现出良好的有限样本性质。",
    "tldr": "该论文提供了一种半参数方法来识别和估计学习模型，该模型考虑了连续结果在三类不可观测因素的影响下发生变化，结果表明该方法在有限样本下表现良好。",
    "en_tdlr": "This paper provides a semiparametric approach to identify and estimate learning models, considering the impact of three types of unobservables on continuous outcomes, and the results show good performance of this method in finite samples."
}