{
    "title": "Generating Survival Interpretable Trajectories and Data",
    "abstract": "arXiv:2402.12331v1 Announce Type: cross  Abstract: A new model for generating survival trajectories and data based on applying an autoencoder of a specific structure is proposed. It solves three tasks. First, it provides predictions in the form of the expected event time and the survival function for a new generated feature vector on the basis of the Beran estimator. Second, the model generates additional data based on a given training set that would supplement the original dataset. Third, the most important, it generates a prototype time-dependent trajectory for an object, which characterizes how features of the object could be changed to achieve a different time to an event. The trajectory can be viewed as a type of the counterfactual explanation. The proposed model is robust during training and inference due to a specific weighting scheme incorporating into the variational autoencoder. The model also determines the censored indicators of new generated data by solving a classificatio",
    "link": "https://arxiv.org/abs/2402.12331",
    "context": "Title: Generating Survival Interpretable Trajectories and Data\nAbstract: arXiv:2402.12331v1 Announce Type: cross  Abstract: A new model for generating survival trajectories and data based on applying an autoencoder of a specific structure is proposed. It solves three tasks. First, it provides predictions in the form of the expected event time and the survival function for a new generated feature vector on the basis of the Beran estimator. Second, the model generates additional data based on a given training set that would supplement the original dataset. Third, the most important, it generates a prototype time-dependent trajectory for an object, which characterizes how features of the object could be changed to achieve a different time to an event. The trajectory can be viewed as a type of the counterfactual explanation. The proposed model is robust during training and inference due to a specific weighting scheme incorporating into the variational autoencoder. The model also determines the censored indicators of new generated data by solving a classificatio",
    "path": "papers/24/02/2402.12331.json",
    "total_tokens": 798,
    "translated_title": "生成生存可解释轨迹和数据",
    "translated_abstract": "提出了一种基于应用特定结构的自动编码器来生成生存轨迹和数据的新模型。 它解决了三个任务。 首先，它基于Beran估计器为新生成的特征向量提供事件时间的预测和生存函数的形式。 第二，该模型基于给定的训练集生成额外数据，可以补充原始数据集。 第三，最重要的是，它为对象生成了一个原型时间相关轨迹，描述了如何改变对象的特征以实现不同时间事件的时间。 轨迹可以看作是一种反事实解释。 由于将特定加权方案纳入变分自动编码器中，所提出的模型在训练和推理过程中表现出鲁棒性。 该模型还通过解决分类问题确定了新生成数据的被审查指标。",
    "tldr": "提出了一种新的模型，能够生成生存轨迹和数据，并通过特定结构的自动编码器解决了预测、数据补充和生成原型时间相关轨迹等任务"
}