{
    "title": "SocialCVAE: Predicting Pedestrian Trajectory via Interaction Conditioned Latents",
    "abstract": "arXiv:2402.17339v1 Announce Type: cross  Abstract: Pedestrian trajectory prediction is the key technology in many applications for providing insights into human behavior and anticipating human future motions. Most existing empirical models are explicitly formulated by observed human behaviors using explicable mathematical terms with a deterministic nature, while recent work has focused on developing hybrid models combined with learning-based techniques for powerful expressiveness while maintaining explainability. However, the deterministic nature of the learned steering behaviors from the empirical models limits the models' practical performance. To address this issue, this work proposes the social conditional variational autoencoder (SocialCVAE) for predicting pedestrian trajectories, which employs a CVAE to explore behavioral uncertainty in human motion decisions. SocialCVAE learns socially reasonable motion randomness by utilizing a socially explainable interaction energy map as the",
    "link": "https://arxiv.org/abs/2402.17339",
    "context": "Title: SocialCVAE: Predicting Pedestrian Trajectory via Interaction Conditioned Latents\nAbstract: arXiv:2402.17339v1 Announce Type: cross  Abstract: Pedestrian trajectory prediction is the key technology in many applications for providing insights into human behavior and anticipating human future motions. Most existing empirical models are explicitly formulated by observed human behaviors using explicable mathematical terms with a deterministic nature, while recent work has focused on developing hybrid models combined with learning-based techniques for powerful expressiveness while maintaining explainability. However, the deterministic nature of the learned steering behaviors from the empirical models limits the models' practical performance. To address this issue, this work proposes the social conditional variational autoencoder (SocialCVAE) for predicting pedestrian trajectories, which employs a CVAE to explore behavioral uncertainty in human motion decisions. SocialCVAE learns socially reasonable motion randomness by utilizing a socially explainable interaction energy map as the",
    "path": "papers/24/02/2402.17339.json",
    "total_tokens": 809,
    "translated_title": "SocialCVAE：通过交互条件潜变量预测行人轨迹",
    "translated_abstract": "行人轨迹预测是许多应用程序中的关键技术，可以洞察人类行为并预测人类未来动向。大多数现有的经验模型是通过观察到的人类行为以可解释的数学术语明确表达出来的，具有确定性，而近期的工作集中在开发混合模型，结合基于学习的技术，以提供强大的表达能力同时保持可解释性。然而，从经验模型中学得的具有确定性的驾驶行为的性质限制了模型的实际性能。为了解决这个问题，本文提出了社交条件变分自动编码器（SocialCVAE）用于预测行人轨迹，它采用CVAE来探索人类运动决策中的行为不确定性。SocialCVAE通过利用一个社交可解释的交互能量图来学习社交合理的运动随机性",
    "tldr": "SocialCVAE使用CVAE模型来预测行人轨迹，通过探索行为不确定性并学习社交合理的运动随机性来提高模型性能。",
    "en_tdlr": "SocialCVAE utilizes a CVAE model to predict pedestrian trajectories, improving model performance by exploring behavioral uncertainty and learning socially reasonable motion randomness."
}