{
    "title": "I Am Not Them: Fluid Identities and Persistent Out-group Bias in Large Language Models",
    "abstract": "arXiv:2402.10436v1 Announce Type: new  Abstract: We explored cultural biases-individualism vs. collectivism-in ChatGPT across three Western languages (i.e., English, German, and French) and three Eastern languages (i.e., Chinese, Japanese, and Korean). When ChatGPT adopted an individualistic persona in Western languages, its collectivism scores (i.e., out-group values) exhibited a more negative trend, surpassing their positive orientation towards individualism (i.e., in-group values). Conversely, when a collectivistic persona was assigned to ChatGPT in Eastern languages, a similar pattern emerged with more negative responses toward individualism (i.e., out-group values) as compared to collectivism (i.e., in-group values). The results indicate that when imbued with a particular social identity, ChatGPT discerns in-group and out-group, embracing in-group values while eschewing out-group values. Notably, the negativity towards the out-group, from which prejudices and discrimination arise,",
    "link": "https://arxiv.org/abs/2402.10436",
    "context": "Title: I Am Not Them: Fluid Identities and Persistent Out-group Bias in Large Language Models\nAbstract: arXiv:2402.10436v1 Announce Type: new  Abstract: We explored cultural biases-individualism vs. collectivism-in ChatGPT across three Western languages (i.e., English, German, and French) and three Eastern languages (i.e., Chinese, Japanese, and Korean). When ChatGPT adopted an individualistic persona in Western languages, its collectivism scores (i.e., out-group values) exhibited a more negative trend, surpassing their positive orientation towards individualism (i.e., in-group values). Conversely, when a collectivistic persona was assigned to ChatGPT in Eastern languages, a similar pattern emerged with more negative responses toward individualism (i.e., out-group values) as compared to collectivism (i.e., in-group values). The results indicate that when imbued with a particular social identity, ChatGPT discerns in-group and out-group, embracing in-group values while eschewing out-group values. Notably, the negativity towards the out-group, from which prejudices and discrimination arise,",
    "path": "papers/24/02/2402.10436.json",
    "total_tokens": 943,
    "translated_title": "我不是他们：大型语言模型中的流动身份和持久的外群体偏见",
    "translated_abstract": "我们探讨了ChatGPT在三种西方语言（即英语、德语和法语）和三种东方语言（即中文、日语和韩语）中的文化偏见-个人主义与集体主义。当ChatGPT在西方语言中采用个人主义人格时，其集体主义评分（即外群体价值观）呈现出更为消极的趋势，超越了对个人主义（即内群体价值观）的积极取向。相反，当在东方语言中向ChatGPT指定集体主义人格时，出现了类似的模式，对个人主义（即外群体价值观）产生了更为负面的反应，而对集体主义（即内群体价值观）持积极态度。结果表明，当注入特定社会身份时，ChatGPT能够识别内群体和外群体，接受内群体价值观同时摒弃外群体价值观。值得注意的是，对外群体的消极态度引发了偏见和歧视。",
    "tldr": "论文研究了ChatGPT在不同语言环境中的文化偏见表现，发现当其拥抱特定社会身份时，会区分内外群体，偏好内群体价值观而抵制外群体价值观。"
}