{
    "title": "How to Understand \"Support\"? An Implicit-enhanced Causal Inference Approach for Weakly-supervised Phrase Grounding",
    "abstract": "arXiv:2402.19116v1 Announce Type: cross  Abstract: Weakly-supervised Phrase Grounding (WPG) is an emerging task of inferring the fine-grained phrase-region matching, while merely leveraging the coarse-grained sentence-image pairs for training. However, existing studies on WPG largely ignore the implicit phrase-region matching relations, which are crucial for evaluating the capability of models in understanding the deep multimodal semantics. To this end, this paper proposes an Implicit-Enhanced Causal Inference (IECI) approach to address the challenges of modeling the implicit relations and highlighting them beyond the explicit. Specifically, this approach leverages both the intervention and counterfactual techniques to tackle the above two challenges respectively. Furthermore, a high-quality implicit-enhanced dataset is annotated to evaluate IECI and detailed evaluations show the great advantages of IECI over the state-of-the-art baselines. Particularly, we observe an interesting findi",
    "link": "https://arxiv.org/abs/2402.19116",
    "context": "Title: How to Understand \"Support\"? An Implicit-enhanced Causal Inference Approach for Weakly-supervised Phrase Grounding\nAbstract: arXiv:2402.19116v1 Announce Type: cross  Abstract: Weakly-supervised Phrase Grounding (WPG) is an emerging task of inferring the fine-grained phrase-region matching, while merely leveraging the coarse-grained sentence-image pairs for training. However, existing studies on WPG largely ignore the implicit phrase-region matching relations, which are crucial for evaluating the capability of models in understanding the deep multimodal semantics. To this end, this paper proposes an Implicit-Enhanced Causal Inference (IECI) approach to address the challenges of modeling the implicit relations and highlighting them beyond the explicit. Specifically, this approach leverages both the intervention and counterfactual techniques to tackle the above two challenges respectively. Furthermore, a high-quality implicit-enhanced dataset is annotated to evaluate IECI and detailed evaluations show the great advantages of IECI over the state-of-the-art baselines. Particularly, we observe an interesting findi",
    "path": "papers/24/02/2402.19116.json",
    "total_tokens": 893,
    "translated_title": "如何理解“支持”？一种隐式增强因果推断方法用于弱监督短语定位",
    "translated_abstract": "弱监督短语定位（WPG）是一个新兴的任务，用于推断细粒度短语-区域匹配，仅利用粗粒度的句子-图像对进行训练。然而，现有关于WPG的研究很大程度上忽略了隐式短语-区域匹配关系，这对于评估模型理解深层多模态语义的能力至关重要。为此，本文提出了一种隐式增强因果推断（IECI）方法来解决对建模隐式关系和突出显性关系的挑战。具体而言，该方法分别利用干预和反事实技术来应对上述两个挑战。此外，还标注了一个高质量的隐式增强数据集来评估IECI，详细评估显示IECI相比最先进基线方法有很大优势。特别地，我们观察到了一个有趣的发现。",
    "tldr": "提出了一种隐式增强因果推断方法（IECI），用于解决弱监督短语定位任务中的挑战，通过标注高质量数据集进行评估，并相比基线方法展现出明显优势。",
    "en_tdlr": "Proposed an Implicit-Enhanced Causal Inference approach (IECI) to address challenges in weakly-supervised phrase grounding task, evaluated using a high-quality dataset and demonstrated significant advantages over baseline methods."
}