{
    "title": "The impact of Facebook-Cambridge Analytica data scandal on the USA tech stock market: An event study based on clustering method",
    "abstract": "arXiv:2402.14206v1 Announce Type: new  Abstract: This study delves into the intra-industry effects following a firm-specific scandal, with a particular focus on the Facebook data leakage scandal and its associated events within the U.S. tech industry and two additional relevant groups. We employ various metrics including daily spread, volatility, volume-weighted return, and CAPM-beta for the pre-analysis clustering, and subsequently utilize CAR (Cumulative Abnormal Return) to evaluate the impact on firms grouped within these clusters. From a broader industry viewpoint, significant positive CAARs are observed across U.S. sample firms over the three days post-scandal announcement, indicating no adverse impact on the tech sector overall. Conversely, after Facebook's initial quarterly earnings report, it showed a notable negative effect despite reported positive performance. The clustering principle should aid in identifying directly related companies and thus reducing the influence of ran",
    "link": "https://arxiv.org/abs/2402.14206",
    "context": "Title: The impact of Facebook-Cambridge Analytica data scandal on the USA tech stock market: An event study based on clustering method\nAbstract: arXiv:2402.14206v1 Announce Type: new  Abstract: This study delves into the intra-industry effects following a firm-specific scandal, with a particular focus on the Facebook data leakage scandal and its associated events within the U.S. tech industry and two additional relevant groups. We employ various metrics including daily spread, volatility, volume-weighted return, and CAPM-beta for the pre-analysis clustering, and subsequently utilize CAR (Cumulative Abnormal Return) to evaluate the impact on firms grouped within these clusters. From a broader industry viewpoint, significant positive CAARs are observed across U.S. sample firms over the three days post-scandal announcement, indicating no adverse impact on the tech sector overall. Conversely, after Facebook's initial quarterly earnings report, it showed a notable negative effect despite reported positive performance. The clustering principle should aid in identifying directly related companies and thus reducing the influence of ran",
    "path": "papers/24/02/2402.14206.json",
    "total_tokens": 906,
    "translated_title": "Facebook-Cambridge Analytica数据丑闻对美国科技股市的影响：基于聚类方法的事件研究",
    "translated_abstract": "该研究探讨了特定公司丑闻后产生的行业内效应，特别关注Facebook数据泄露丑闻及其在美国科技行业及其他两个相关群体中的相关事件。我们运用每日波动、波动率、成交量加权回报率和CAPM-beta等多种指标进行前期聚类分析，随后利用CAR（累积异常回报）评估分属这些聚类的公司所受到的影响。从更广泛的行业视角看，美国样本公司在丑闻公告后的三天内出现了显著的正CAAR，表明整个科技行业未受到不利影响。相反，在Facebook首次季度财报后，尽管报告表现良好，但表现出显著的负面影响。聚类原则应有助于识别直接相关公司，从而减少随机因素的影响。",
    "tldr": "该研究通过聚类方法研究了Facebook-Cambridge Analytica数据丑闻对美国科技股市的影响，发现丑闻公告后美国科技公司整体未受不利影响，但Facebook季度财报后出现显著负面效应。",
    "en_tdlr": "This study uses clustering method to investigate the impact of the Facebook-Cambridge Analytica data scandal on the USA tech stock market, finding that there was no adverse effect on the overall U.S. tech sector after the scandal announcement, but a notable negative impact was observed after Facebook's quarterly earnings report."
}