{
    "title": "Comparative Analysis of ImageNet Pre-Trained Deep Learning Models and DINOv2 in Medical Imaging Classification",
    "abstract": "Medical image analysis frequently encounters data scarcity challenges. Transfer learning has been effective in addressing this issue while conserving computational resources. The recent advent of foundational models like the DINOv2, which uses the vision transformer architecture, has opened new opportunities in the field and gathered significant interest. However, DINOv2's performance on clinical data still needs to be verified. In this paper, we performed a glioma grading task using three clinical modalities of brain MRI data. We compared the performance of various pre-trained deep learning models, including those based on ImageNet and DINOv2, in a transfer learning context. Our focus was on understanding the impact of the freezing mechanism on performance. We also validated our findings on three other types of public datasets: chest radiography, fundus radiography, and dermoscopy. Our findings indicate that in our clinical dataset, DINOv2's performance was not as strong as ImageNet-b",
    "link": "https://arxiv.org/abs/2402.07595",
    "context": "Title: Comparative Analysis of ImageNet Pre-Trained Deep Learning Models and DINOv2 in Medical Imaging Classification\nAbstract: Medical image analysis frequently encounters data scarcity challenges. Transfer learning has been effective in addressing this issue while conserving computational resources. The recent advent of foundational models like the DINOv2, which uses the vision transformer architecture, has opened new opportunities in the field and gathered significant interest. However, DINOv2's performance on clinical data still needs to be verified. In this paper, we performed a glioma grading task using three clinical modalities of brain MRI data. We compared the performance of various pre-trained deep learning models, including those based on ImageNet and DINOv2, in a transfer learning context. Our focus was on understanding the impact of the freezing mechanism on performance. We also validated our findings on three other types of public datasets: chest radiography, fundus radiography, and dermoscopy. Our findings indicate that in our clinical dataset, DINOv2's performance was not as strong as ImageNet-b",
    "path": "papers/24/02/2402.07595.json",
    "total_tokens": 885,
    "translated_title": "对比分析ImageNet预训练的深度学习模型和DINOv2在医学图像分类中的表现",
    "translated_abstract": "医学图像分析常常面临着数据稀缺的挑战。迁移学习在解决这个问题同时节约计算资源方面非常有效。最近出现的基础模型，如使用视觉变换器架构的DINOv2，为该领域提供了新的机会并引起了极大的关注。然而，DINOv2在临床数据上的表现仍需验证。本文中，我们使用三种临床模态的脑部MRI数据执行了一个胶质瘤分级任务。我们在迁移学习的上下文中比较了基于ImageNet和DINOv2的各种预训练深度学习模型的表现。我们关注了冻结机制对性能的影响。我们还在其他三种类型的公共数据集上验证了我们的发现：胸部放射学、眼底放射学和皮肤镜。我们的研究结果表明，在我们的临床数据集中，DINOv2的性能不如ImageNet-b。",
    "tldr": "本文通过对比分析ImageNet预训练的深度学习模型和DINOv2在医学图像分类中的表现，发现在临床数据集中，DINOv2的性能不如ImageNet-b。",
    "en_tdlr": "This paper compares the performance of ImageNet pre-trained deep learning models and DINOv2 in medical imaging classification and finds that DINOv2 is not as strong as ImageNet-b in a clinical dataset."
}