{
    "title": "Smooth and Sparse Latent Dynamics in Operator Learning with Jerk Regularization",
    "abstract": "arXiv:2402.15636v1 Announce Type: new  Abstract: Spatiotemporal modeling is critical for understanding complex systems across various scientific and engineering disciplines, but governing equations are often not fully known or computationally intractable due to inherent system complexity. Data-driven reduced-order models (ROMs) offer a promising approach for fast and accurate spatiotemporal forecasting by computing solutions in a compressed latent space. However, these models often neglect temporal correlations between consecutive snapshots when constructing the latent space, leading to suboptimal compression, jagged latent trajectories, and limited extrapolation ability over time. To address these issues, this paper introduces a continuous operator learning framework that incorporates jerk regularization into the learning of the compressed latent space. This jerk regularization promotes smoothness and sparsity of latent space dynamics, which not only yields enhanced accuracy and conve",
    "link": "https://arxiv.org/abs/2402.15636",
    "context": "Title: Smooth and Sparse Latent Dynamics in Operator Learning with Jerk Regularization\nAbstract: arXiv:2402.15636v1 Announce Type: new  Abstract: Spatiotemporal modeling is critical for understanding complex systems across various scientific and engineering disciplines, but governing equations are often not fully known or computationally intractable due to inherent system complexity. Data-driven reduced-order models (ROMs) offer a promising approach for fast and accurate spatiotemporal forecasting by computing solutions in a compressed latent space. However, these models often neglect temporal correlations between consecutive snapshots when constructing the latent space, leading to suboptimal compression, jagged latent trajectories, and limited extrapolation ability over time. To address these issues, this paper introduces a continuous operator learning framework that incorporates jerk regularization into the learning of the compressed latent space. This jerk regularization promotes smoothness and sparsity of latent space dynamics, which not only yields enhanced accuracy and conve",
    "path": "papers/24/02/2402.15636.json",
    "total_tokens": 869,
    "translated_title": "操作员学习中光滑稀疏的潜在动态与Jerk正则化",
    "translated_abstract": "arXiv:2402.15636v1 Announce Type: new  Abstract: 时空建模对于理解跨越各种科学和工程学科的复杂系统至关重要，但由于系统固有的复杂性，控制方程通常不完全已知或在计算上难以处理。基于数据驱动的降阶模型（ROMs）通过在压缩的潜在空间中计算解决方案来提供一种快速准确的时空预测方法。然而，这些模型在构建潜在空间时通常忽略相邻快照之间的时间相关性，这导致压缩次优、锯齿状的潜在轨迹以及随时间有限的外推能力。为了解决这些问题，本文引入了一个连续的操作员学习框架，将Jerk正则化纳入到压缩潜在空间的学习中。这种Jerk正则化促进了潜在空间动态的平滑性和稀疏性，不仅提高了准确性和收敛性",
    "tldr": "引入了连续的操作员学习框架，将Jerk正则化纳入压缩潜在空间的学习中，促进了潜在空间动态的平滑性和稀疏性"
}