{
    "title": "SemTra: A Semantic Skill Translator for Cross-Domain Zero-Shot Policy Adaptation",
    "abstract": "This work explores the zero-shot adaptation capability of semantic skills, semantically interpretable experts' behavior patterns, in cross-domain settings, where a user input in interleaved multi-modal snippets can prompt a new long-horizon task for different domains. In these cross-domain settings, we present a semantic skill translator framework SemTra which utilizes a set of multi-modal models to extract skills from the snippets, and leverages the reasoning capabilities of a pretrained language model to adapt these extracted skills to the target domain. The framework employs a two-level hierarchy for adaptation: task adaptation and skill adaptation. During task adaptation, seq-to-seq translation by the language model transforms the extracted skills into a semantic skill sequence, which is tailored to fit the cross-domain contexts. Skill adaptation focuses on optimizing each semantic skill for the target domain context, through parametric instantiations that are facilitated by langua",
    "link": "https://arxiv.org/abs/2402.07418",
    "context": "Title: SemTra: A Semantic Skill Translator for Cross-Domain Zero-Shot Policy Adaptation\nAbstract: This work explores the zero-shot adaptation capability of semantic skills, semantically interpretable experts' behavior patterns, in cross-domain settings, where a user input in interleaved multi-modal snippets can prompt a new long-horizon task for different domains. In these cross-domain settings, we present a semantic skill translator framework SemTra which utilizes a set of multi-modal models to extract skills from the snippets, and leverages the reasoning capabilities of a pretrained language model to adapt these extracted skills to the target domain. The framework employs a two-level hierarchy for adaptation: task adaptation and skill adaptation. During task adaptation, seq-to-seq translation by the language model transforms the extracted skills into a semantic skill sequence, which is tailored to fit the cross-domain contexts. Skill adaptation focuses on optimizing each semantic skill for the target domain context, through parametric instantiations that are facilitated by langua",
    "path": "papers/24/02/2402.07418.json",
    "total_tokens": 941,
    "translated_title": "SemTra: 一种用于跨领域零-shot策略自适应的语义技能翻译器",
    "translated_abstract": "本论文探讨了语义技能在跨领域环境中的零-shot自适应能力，其中语义可解释的专家行为模式在不同领域的用户输入中可以引发新的长期任务。在这些跨领域环境中，我们提出了一个语义技能翻译器框架SemTra，该框架利用一组多模态模型从片段中提取技能，并利用预训练语言模型的推理能力将这些提取出的技能适应到目标领域。该框架使用了两层层次结构进行自适应：任务自适应和技能自适应。在任务自适应过程中，语言模型进行序列到序列翻译，将提取出的技能转换为适应跨领域环境的语义技能序列。技能自适应侧重于通过语言模型的参数化实例化来优化每个语义技能，以适应目标领域的上下文。",
    "tldr": "本论文介绍了一种名为SemTra的语义技能翻译器，可以在跨领域环境中实现零-shot策略自适应。该翻译器利用多模态模型提取技能，并利用预训练语言模型的推理能力将提取出的技能适应到目标领域，从而实现任务和技能的自适应。",
    "en_tdlr": "This paper presents SemTra, a semantic skill translator that enables zero-shot policy adaptation in cross-domain environments. The translator leverages multi-modal models to extract skills and utilizes a pretrained language model for reasoning to adapt these skills to the target domain. It employs a two-level hierarchy for adaptation: task adaptation and skill adaptation."
}