{
    "title": "FusionSF: Fuse Heterogeneous Modalities in a Vector Quantized Framework for Robust Solar Power Forecasting",
    "abstract": "Accurate solar power forecasting is crucial to integrate photovoltaic plants into the electric grid, schedule and secure the power grid safety. This problem becomes more demanding for those newly installed solar plants which lack sufficient data. Current research predominantly relies on historical solar power data or numerical weather prediction in a single-modality format, ignoring the complementary information provided in different modalities. In this paper, we propose a multi-modality fusion framework to integrate historical power data, numerical weather prediction, and satellite images, significantly improving forecast performance. We introduce a vector quantized framework that aligns modalities with varying information densities, striking a balance between integrating sufficient information and averting model overfitting. Our framework demonstrates strong zero-shot forecasting capability, which is especially useful for those newly installed plants. Moreover, we collect and release",
    "link": "https://arxiv.org/abs/2402.05823",
    "context": "Title: FusionSF: Fuse Heterogeneous Modalities in a Vector Quantized Framework for Robust Solar Power Forecasting\nAbstract: Accurate solar power forecasting is crucial to integrate photovoltaic plants into the electric grid, schedule and secure the power grid safety. This problem becomes more demanding for those newly installed solar plants which lack sufficient data. Current research predominantly relies on historical solar power data or numerical weather prediction in a single-modality format, ignoring the complementary information provided in different modalities. In this paper, we propose a multi-modality fusion framework to integrate historical power data, numerical weather prediction, and satellite images, significantly improving forecast performance. We introduce a vector quantized framework that aligns modalities with varying information densities, striking a balance between integrating sufficient information and averting model overfitting. Our framework demonstrates strong zero-shot forecasting capability, which is especially useful for those newly installed plants. Moreover, we collect and release",
    "path": "papers/24/02/2402.05823.json",
    "total_tokens": 925,
    "translated_title": "FusionSF：在矢量量化框架中融合异质模态以实现可靠的太阳能发电预测",
    "translated_abstract": "准确的太阳能发电预测对于将光伏电站整合到电网中，调度和确保电网安全至关重要。对于缺乏足够数据的新安装的太阳能电站来说，这个问题变得更加紧迫。当前的研究主要依赖于历史太阳能发电数据或数值天气预报，以单一模态的形式，忽略了不同模态提供的互补信息。在本文中，我们提出了一个多模态融合框架，将历史功率数据、数值天气预报和卫星图像进行整合，显著提高了预测性能。我们引入了一个矢量量化框架，使具有不同信息密度的模态对齐，平衡了整合足够信息和避免模型过拟合之间的关系。我们的框架展现了强大的零样本预测能力，对于新安装的电站尤其有用。此外，我们还收集并发布了训练和测试数据集。",
    "tldr": "本文提出了一个多模态融合框架，将历史功率数据、数值天气预报和卫星图像整合在一起，显著提高了太阳能发电预测的性能。研究展示了强大的零样本预测能力，对于新安装的电站尤其有用。",
    "en_tdlr": "This paper proposes a multi-modality fusion framework that integrates historical power data, numerical weather prediction, and satellite images, significantly improving the performance of solar power forecasting. The research demonstrates strong zero-shot forecasting capability, which is especially useful for newly installed plants."
}