{
    "title": "Poisson-Gamma Dynamical Systems with Non-Stationary Transition Dynamics",
    "abstract": "arXiv:2402.16297v1 Announce Type: cross  Abstract: Bayesian methodologies for handling count-valued time series have gained prominence due to their ability to infer interpretable latent structures and to estimate uncertainties, and thus are especially suitable for dealing with noisy and incomplete count data. Among these Bayesian models, Poisson-Gamma Dynamical Systems (PGDSs) are proven to be effective in capturing the evolving dynamics underlying observed count sequences. However, the state-of-the-art PGDS still falls short in capturing the time-varying transition dynamics that are commonly observed in real-world count time series. To mitigate this limitation, a non-stationary PGDS is proposed to allow the underlying transition matrices to evolve over time, and the evolving transition matrices are modeled by sophisticatedly-designed Dirichlet Markov chains. Leveraging Dirichlet-Multinomial-Beta data augmentation techniques, a fully-conjugate and efficient Gibbs sampler is developed t",
    "link": "https://arxiv.org/abs/2402.16297",
    "context": "Title: Poisson-Gamma Dynamical Systems with Non-Stationary Transition Dynamics\nAbstract: arXiv:2402.16297v1 Announce Type: cross  Abstract: Bayesian methodologies for handling count-valued time series have gained prominence due to their ability to infer interpretable latent structures and to estimate uncertainties, and thus are especially suitable for dealing with noisy and incomplete count data. Among these Bayesian models, Poisson-Gamma Dynamical Systems (PGDSs) are proven to be effective in capturing the evolving dynamics underlying observed count sequences. However, the state-of-the-art PGDS still falls short in capturing the time-varying transition dynamics that are commonly observed in real-world count time series. To mitigate this limitation, a non-stationary PGDS is proposed to allow the underlying transition matrices to evolve over time, and the evolving transition matrices are modeled by sophisticatedly-designed Dirichlet Markov chains. Leveraging Dirichlet-Multinomial-Beta data augmentation techniques, a fully-conjugate and efficient Gibbs sampler is developed t",
    "path": "papers/24/02/2402.16297.json",
    "total_tokens": 862,
    "translated_title": "具有非平稳转移动态的泊松-伽马动力系统",
    "translated_abstract": "处理计数值时间序列的贝叶斯方法因其能够推断可解释的潜在结构和估计不确定性而备受重视，尤其适用于处理嘈杂和不完整的计数数据。在这些贝叶斯模型中，泊松-伽马动力系统（PGDSs）被证明能够有效捕捉观察到的计数序列底层动态的演变特征。然而，最新的PGDS在捕捉常见于实际计数时间序列中的时变转移动态方面仍有不足。为了克服这一限制，提出了一种非平稳PGDS，允许基础转移矩阵随时间演变，演变的转移矩阵由精心设计的Dirichlet Markov链建模。利用Dirichlet-Multinomial-Beta数据增广技术，开发了一个完全共轭且高效的Gibbs采样器。",
    "tldr": "提出了一种具有非平稳转移动态的泊松-伽马动力系统，通过采用Dirichlet Markov链和数据增广技术来解决原有模型捕捉时变转移动态的不足。",
    "en_tdlr": "A Poisson-Gamma dynamical system with non-stationary transition dynamics is proposed, addressing the limitation of capturing time-varying transition dynamics by leveraging Dirichlet Markov chains and data augmentation techniques."
}