{
    "title": "Using Large Language Models for Student-Code Guided Test Case Generation in Computer Science Education",
    "abstract": "In computer science education, test cases are an integral part of programming assignments since they can be used as assessment items to test students' programming knowledge and provide personalized feedback on student-written code. The goal of our work is to propose a fully automated approach for test case generation that can accurately measure student knowledge, which is important for two reasons. First, manually constructing test cases requires expert knowledge and is a labor-intensive process. Second, developing test cases for students, especially those who are novice programmers, is significantly different from those oriented toward professional-level software developers. Therefore, we need an automated process for test case generation to assess student knowledge and provide feedback. In this work, we propose a large language model-based approach to automatically generate test cases and show that they are good measures of student knowledge, using a publicly available dataset that c",
    "link": "https://arxiv.org/abs/2402.07081",
    "context": "Title: Using Large Language Models for Student-Code Guided Test Case Generation in Computer Science Education\nAbstract: In computer science education, test cases are an integral part of programming assignments since they can be used as assessment items to test students' programming knowledge and provide personalized feedback on student-written code. The goal of our work is to propose a fully automated approach for test case generation that can accurately measure student knowledge, which is important for two reasons. First, manually constructing test cases requires expert knowledge and is a labor-intensive process. Second, developing test cases for students, especially those who are novice programmers, is significantly different from those oriented toward professional-level software developers. Therefore, we need an automated process for test case generation to assess student knowledge and provide feedback. In this work, we propose a large language model-based approach to automatically generate test cases and show that they are good measures of student knowledge, using a publicly available dataset that c",
    "path": "papers/24/02/2402.07081.json",
    "total_tokens": 858,
    "translated_title": "在计算机科学教育中使用大型语言模型进行学生代码引导的测试用例生成",
    "translated_abstract": "在计算机科学教育中，测试用例是编程作业的重要组成部分，因为它们可以用作评估项目，测试学生的编程知识，并为学生编写的代码提供个性化反馈。我们的工作目标是提出一种完全自动化的测试用例生成方法，可以准确地衡量学生的知识水平，这一点非常重要。首先，手动构建测试用例需要专业知识，并且是一项劳动密集型工作。其次，为学生开发测试用例，尤其是对于初学者来说，与针对专业级软件开发人员的测试用例有着显著的区别。因此，我们需要一种自动化的测试用例生成过程来评估学生的知识水平并提供反馈。在这项工作中，我们提出了一种基于大型语言模型的自动化测试用例生成方法，并证明它们是衡量学生知识水平的良好指标，使用一个公开可用的数据集。",
    "tldr": "本研究旨在提出一种完全自动化的测试用例生成方法，使用大型语言模型，并证明它们是衡量学生知识水平的良好指标，从而解决手动构建测试用例的劳动密集性和专业知识需求的问题。"
}