{
    "title": "Transferring Ultrahigh-Field Representations for Intensity-Guided Brain Segmentation of Low-Field Magnetic Resonance Imaging",
    "abstract": "Ultrahigh-field (UHF) magnetic resonance imaging (MRI), i.e., 7T MRI, provides superior anatomical details of internal brain structures owing to its enhanced signal-to-noise ratio and susceptibility-induced contrast. However, the widespread use of 7T MRI is limited by its high cost and lower accessibility compared to low-field (LF) MRI. This study proposes a deep-learning framework that systematically fuses the input LF magnetic resonance feature representations with the inferred 7T-like feature representations for brain image segmentation tasks in a 7T-absent environment. Specifically, our adaptive fusion module aggregates 7T-like features derived from the LF image by a pre-trained network and then refines them to be effectively assimilable UHF guidance into LF image features. Using intensity-guided features obtained from such aggregation and assimilation, segmentation models can recognize subtle structural representations that are usually difficult to recognize when relying only on L",
    "link": "https://arxiv.org/abs/2402.08409",
    "context": "Title: Transferring Ultrahigh-Field Representations for Intensity-Guided Brain Segmentation of Low-Field Magnetic Resonance Imaging\nAbstract: Ultrahigh-field (UHF) magnetic resonance imaging (MRI), i.e., 7T MRI, provides superior anatomical details of internal brain structures owing to its enhanced signal-to-noise ratio and susceptibility-induced contrast. However, the widespread use of 7T MRI is limited by its high cost and lower accessibility compared to low-field (LF) MRI. This study proposes a deep-learning framework that systematically fuses the input LF magnetic resonance feature representations with the inferred 7T-like feature representations for brain image segmentation tasks in a 7T-absent environment. Specifically, our adaptive fusion module aggregates 7T-like features derived from the LF image by a pre-trained network and then refines them to be effectively assimilable UHF guidance into LF image features. Using intensity-guided features obtained from such aggregation and assimilation, segmentation models can recognize subtle structural representations that are usually difficult to recognize when relying only on L",
    "path": "papers/24/02/2402.08409.json",
    "total_tokens": 935,
    "translated_title": "将超高场图像的特征迁移到低场磁共振成像中进行强度引导的脑分割",
    "translated_abstract": "超高场(7T)磁共振成像能够提供更好的解剖细节和对比度，然而其高成本和较低可访问性限制了其广泛应用。本研究提出了一种深度学习框架，通过将7T图像的特征与低场图像的特征进行融合，实现在7T缺失环境下的脑图像分割任务。我们的自适应融合模块通过预训练网络提取低场图像的7T-like特征，并将其精细调整，使其有效地融入低场图像的特征中。利用从融合和融入中获得的强度引导特征，分割模型能够识别通常在仅依赖低场图像时难以识别的细微结构特征。",
    "tldr": "本研究提出了一种将7T磁共振成像特征与低场磁共振成像特征融合的深度学习框架，实现在7T缺失环境下进行脑图像分割的任务。通过自适应融合和融入，利用强度引导特征，可以识别难以识别的细微结构特征。",
    "en_tdlr": "This study proposes a deep-learning framework that fuses 7T MRI features with low-field MRI features for brain image segmentation in a 7T-absent environment. By adaptive fusion and assimilation, using intensity-guided features, subtle structural representations that are difficult to recognize can be identified."
}