{
    "title": "Transfer Learning in ECG Diagnosis: Is It Effective?",
    "abstract": "The adoption of deep learning in ECG diagnosis is often hindered by the scarcity of large, well-labeled datasets in real-world scenarios, leading to the use of transfer learning to leverage features learned from larger datasets. Yet the prevailing assumption that transfer learning consistently outperforms training from scratch has never been systematically validated. In this study, we conduct the first extensive empirical study on the effectiveness of transfer learning in multi-label ECG classification, by investigating comparing the fine-tuning performance with that of training from scratch, covering a variety of ECG datasets and deep neural networks. We confirm that fine-tuning is the preferable choice for small downstream datasets; however, when the dataset is sufficiently large, training from scratch can achieve comparable performance, albeit requiring a longer training time to catch up. Furthermore, we find that transfer learning exhibits better compatibility with convolutional ne",
    "link": "https://arxiv.org/abs/2402.02021",
    "context": "Title: Transfer Learning in ECG Diagnosis: Is It Effective?\nAbstract: The adoption of deep learning in ECG diagnosis is often hindered by the scarcity of large, well-labeled datasets in real-world scenarios, leading to the use of transfer learning to leverage features learned from larger datasets. Yet the prevailing assumption that transfer learning consistently outperforms training from scratch has never been systematically validated. In this study, we conduct the first extensive empirical study on the effectiveness of transfer learning in multi-label ECG classification, by investigating comparing the fine-tuning performance with that of training from scratch, covering a variety of ECG datasets and deep neural networks. We confirm that fine-tuning is the preferable choice for small downstream datasets; however, when the dataset is sufficiently large, training from scratch can achieve comparable performance, albeit requiring a longer training time to catch up. Furthermore, we find that transfer learning exhibits better compatibility with convolutional ne",
    "path": "papers/24/02/2402.02021.json",
    "total_tokens": 918,
    "translated_title": "ECG诊断中的迁移学习：有效吗？",
    "translated_abstract": "在真实世界的场景中，深度学习在心电图诊断中的应用往往受到大规模、标记良好的数据集的稀缺性的限制，因此使用迁移学习来利用从更大的数据集中学到的特征。然而，关于迁移学习始终优于从头开始训练的普遍假设从未被系统验证过。在本研究中，我们通过对多标签心电图分类中进行微调与从头开始训练的性能进行比较，涵盖了各种心电图数据集和深度神经网络，进行了第一次广泛的经验性研究来验证迁移学习的有效性。我们证实，对于小型的下游数据集来说，微调是更好的选择；然而，当数据集足够大时，从头开始训练可以达到可比性能，尽管需要更长的训练时间来迎头赶上。此外，我们发现，迁移学习与卷积神经网络更好的兼容性。",
    "tldr": "本研究首次对心电图诊断中的迁移学习进行了广泛的经验研究，发现微调对于小型数据集是较好的选择，当数据集足够大时，从头开始训练可以达到可比性能，但需要更长的训练时间。同时，迁移学习与卷积神经网络具有更好的兼容性。"
}