{
    "title": "History of generative Artificial Intelligence (AI) chatbots: past, present, and future development",
    "abstract": "This research provides an in-depth comprehensive review of the progress of chatbot technology over time, from the initial basic systems relying on rules to today's advanced conversational bots powered by artificial intelligence. Spanning many decades, the paper explores the major milestones, innovations, and paradigm shifts that have driven the evolution of chatbots. Looking back at the very basic statistical model in 1906 via the early chatbots, such as ELIZA and ALICE in the 1960s and 1970s, the study traces key innovations leading to today's advanced conversational agents, such as ChatGPT and Google Bard. The study synthesizes insights from academic literature and industry sources to highlight crucial milestones, including the introduction of Turing tests, influential projects such as CALO, and recent transformer-based models. Tracing the path forward, the paper highlights how natural language processing and machine learning have been integrated into modern chatbots for more sophist",
    "link": "https://arxiv.org/abs/2402.05122",
    "context": "Title: History of generative Artificial Intelligence (AI) chatbots: past, present, and future development\nAbstract: This research provides an in-depth comprehensive review of the progress of chatbot technology over time, from the initial basic systems relying on rules to today's advanced conversational bots powered by artificial intelligence. Spanning many decades, the paper explores the major milestones, innovations, and paradigm shifts that have driven the evolution of chatbots. Looking back at the very basic statistical model in 1906 via the early chatbots, such as ELIZA and ALICE in the 1960s and 1970s, the study traces key innovations leading to today's advanced conversational agents, such as ChatGPT and Google Bard. The study synthesizes insights from academic literature and industry sources to highlight crucial milestones, including the introduction of Turing tests, influential projects such as CALO, and recent transformer-based models. Tracing the path forward, the paper highlights how natural language processing and machine learning have been integrated into modern chatbots for more sophist",
    "path": "papers/24/02/2402.05122.json",
    "total_tokens": 946,
    "translated_title": "生成式人工智能聊天机器人的历史：过去、现在和未来发展",
    "translated_abstract": "本研究全面深入地回顾了聊天机器人技术的发展，从最初依赖规则的基本系统到如今由人工智能驱动的高级对话机器人。该论文跨越了几十年的时间，探讨了推动聊天机器人演进的重要里程碑、创新和范式转变。回顾起源于1906年的基本统计模型，到上世纪60年代和70年代的早期聊天机器人，例如ELIZA和ALICE，研究追踪了导致如今高级对话机器人（如ChatGPT和Google Bard）的关键创新。该研究综合了学术文献和行业资料的见解，突出了图灵测试的引入、CALO等具有影响力的项目以及最近的基于Transformer的模型。展望未来，本文强调了自然语言处理和机器学习如何被集成到现代聊天机器人中的更高级的能力。",
    "tldr": "本研究回顾了生成式人工智能聊天机器人的发展历程，从最初的基本规则系统到如今由人工智能驱动的高级对话机器人。研究突出了关键创新，如聊天机器人ELIZA和ALICE，并探讨了影响演进的重要里程碑，以及Transformer模型的最新进展。",
    "en_tdlr": "This research provides a comprehensive review of the history of generative Artificial Intelligence (AI) chatbots, highlighting major innovations like the chatbots ELIZA and ALICE, and exploring significant milestones and advancements, including the recent progress in Transformer models."
}