{
    "title": "Assessing the Efficacy of Grammar Error Correction: A Human Evaluation Approach in the Japanese Context",
    "abstract": "arXiv:2402.18101v1 Announce Type: new  Abstract: In this study, we evaluated the performance of the state-of-the-art sequence tagging grammar error detection and correction model (SeqTagger) using Japanese university students' writing samples. With an automatic annotation toolkit, ERRANT, we first evaluated SeqTagger's performance on error correction with human expert correction as the benchmark. Then a human-annotated approach was adopted to evaluate Seqtagger's performance in error detection using a subset of the writing dataset. Results indicated a precision of 63.66% and a recall of 20.19% for error correction in the full dataset. For the subset, after manual exclusion of irrelevant errors such as semantic and mechanical ones, the model shows an adjusted precision of 97.98% and an adjusted recall of 42.98% for error detection, indicating the model's high accuracy but also its conservativeness. Thematic analysis on errors undetected by the model revealed that determiners and article",
    "link": "https://arxiv.org/abs/2402.18101",
    "context": "Title: Assessing the Efficacy of Grammar Error Correction: A Human Evaluation Approach in the Japanese Context\nAbstract: arXiv:2402.18101v1 Announce Type: new  Abstract: In this study, we evaluated the performance of the state-of-the-art sequence tagging grammar error detection and correction model (SeqTagger) using Japanese university students' writing samples. With an automatic annotation toolkit, ERRANT, we first evaluated SeqTagger's performance on error correction with human expert correction as the benchmark. Then a human-annotated approach was adopted to evaluate Seqtagger's performance in error detection using a subset of the writing dataset. Results indicated a precision of 63.66% and a recall of 20.19% for error correction in the full dataset. For the subset, after manual exclusion of irrelevant errors such as semantic and mechanical ones, the model shows an adjusted precision of 97.98% and an adjusted recall of 42.98% for error detection, indicating the model's high accuracy but also its conservativeness. Thematic analysis on errors undetected by the model revealed that determiners and article",
    "path": "papers/24/02/2402.18101.json",
    "total_tokens": 905,
    "translated_title": "评估语法错误校正的有效性：在日本背景下的人类评估方法",
    "translated_abstract": "在这项研究中，我们使用自动注释工具包ERRANT，评估了最先进的序列标记语法错误检测和校正模型（SeqTagger）在日本大学生写作样本上的表现。首先，我们将SeqTagger的性能与人类专家校正作为基准来评估错误校正的性能。然后采用人工标注方法来评估Seqtagger在错误检测方面的表现，使用写作数据集的一个子集。结果显示，在整个数据集上，错误校正的精确度为63.66%，召回率为20.19%。对于子集，在手动排除了语义和机械错误等不相关错误后，模型在错误检测方面显示出97.98%的调整精确度和42.98%的调整召回率，表明模型具有很高的准确性，但也表现出保守性。对模型未检测到的错误进行的主题分析揭示了限定词和冠词等问题。",
    "tldr": "评估了一种日本背景下人类评估方法中最先进语法错误检测和校正模型的性能，在错误校正方面表现出较高的准确性和保守性，在错误检测方面表现出高精确度和调整召回率。",
    "en_tdlr": "Evaluated the efficacy of a state-of-the-art grammar error detection and correction model in a Japanese context through human evaluation, showing high accuracy and conservatism in error correction and high precision along with adjusted recall in error detection."
}