{
    "title": "Direct Punjabi to English speech translation using discrete units",
    "abstract": "arXiv:2402.15967v1 Announce Type: new  Abstract: Speech-to-speech translation is yet to reach the same level of coverage as text-to-text translation systems. The current speech technology is highly limited in its coverage of over 7000 languages spoken worldwide, leaving more than half of the population deprived of such technology and shared experiences. With voice-assisted technology (such as social robots and speech-to-text apps) and auditory content (such as podcasts and lectures) on the rise, ensuring that the technology is available for all is more important than ever. Speech translation can play a vital role in mitigating technological disparity and creating a more inclusive society. With a motive to contribute towards speech translation research for low-resource languages, our work presents a direct speech-to-speech translation model for one of the Indic languages called Punjabi to English. Additionally, we explore the performance of using a discrete representation of speech call",
    "link": "https://arxiv.org/abs/2402.15967",
    "context": "Title: Direct Punjabi to English speech translation using discrete units\nAbstract: arXiv:2402.15967v1 Announce Type: new  Abstract: Speech-to-speech translation is yet to reach the same level of coverage as text-to-text translation systems. The current speech technology is highly limited in its coverage of over 7000 languages spoken worldwide, leaving more than half of the population deprived of such technology and shared experiences. With voice-assisted technology (such as social robots and speech-to-text apps) and auditory content (such as podcasts and lectures) on the rise, ensuring that the technology is available for all is more important than ever. Speech translation can play a vital role in mitigating technological disparity and creating a more inclusive society. With a motive to contribute towards speech translation research for low-resource languages, our work presents a direct speech-to-speech translation model for one of the Indic languages called Punjabi to English. Additionally, we explore the performance of using a discrete representation of speech call",
    "path": "papers/24/02/2402.15967.json",
    "total_tokens": 872,
    "translated_title": "使用离散单元进行直接旁遮普语到英语的语音翻译",
    "translated_abstract": "语音到语音翻译尚未达到与文本到文本翻译系统相同的覆盖水平。当前的语音技术在全球超过7000种语言中的覆盖范围上受到严重限制，导致超过一半的人口无法获得这种技术和共享体验。随着语音助手技术（例如社交机器人和语音转文本应用程序）以及听觉内容（例如播客和讲座）的兴起，确保技术对所有人都可用变得比以往任何时候都更加重要。语音翻译可以在缓解技术差距和创造一个更具包容性社会方面发挥至关重要的作用。为了为低资源语言做出贡献，我们的工作提出了一个针对印度语言之一的旁遮普语到英语的直接语音翻译模型。此外，我们探讨了使用离散语音表示的性能。",
    "tldr": "论文致力于为低资源语言进行研究，提出了一个用于旁遮普语到英语的直接语音翻译模型，以缓解全球语音技术覆盖不足的问题。",
    "en_tdlr": "The paper aims to contribute to research for low-resource languages by proposing a direct speech-to-speech translation model for Punjabi to English, addressing the issue of insufficient global coverage in speech technology."
}