{
    "title": "Tensor Completion via Integer Optimization",
    "abstract": "The main challenge with the tensor completion problem is a fundamental tension between computation power and the information-theoretic sample complexity rate. Past approaches either achieve the information-theoretic rate but lack practical algorithms to compute the corresponding solution, or have polynomial-time algorithms that require an exponentially-larger number of samples for low estimation error. This paper develops a novel tensor completion algorithm that resolves this tension by achieving both provable convergence (in numerical tolerance) in a linear number of oracle steps and the information-theoretic rate. Our approach formulates tensor completion as a convex optimization problem constrained using a gauge-based tensor norm, which is defined in a way that allows the use of integer linear optimization to solve linear separation problems over the unit-ball in this new norm. Adaptations based on this insight are incorporated into a Frank-Wolfe variant to build our algorithm. We s",
    "link": "https://arxiv.org/abs/2402.05141",
    "context": "Title: Tensor Completion via Integer Optimization\nAbstract: The main challenge with the tensor completion problem is a fundamental tension between computation power and the information-theoretic sample complexity rate. Past approaches either achieve the information-theoretic rate but lack practical algorithms to compute the corresponding solution, or have polynomial-time algorithms that require an exponentially-larger number of samples for low estimation error. This paper develops a novel tensor completion algorithm that resolves this tension by achieving both provable convergence (in numerical tolerance) in a linear number of oracle steps and the information-theoretic rate. Our approach formulates tensor completion as a convex optimization problem constrained using a gauge-based tensor norm, which is defined in a way that allows the use of integer linear optimization to solve linear separation problems over the unit-ball in this new norm. Adaptations based on this insight are incorporated into a Frank-Wolfe variant to build our algorithm. We s",
    "path": "papers/24/02/2402.05141.json",
    "total_tokens": 786,
    "translated_title": "通过整数优化实现张量补全",
    "translated_abstract": "张量补全问题的主要挑战在于计算能力和信息理论样本复杂度之间的基本张力。过去的方法要么达到了信息理论的速率但缺乏计算相应解的实际算法，要么具有多项式时间算法，但需要指数级更多的样本以达到低估计误差。本文开发了一种新颖的张量补全算法，通过在线性数目的oracle步骤中同时实现可证的收敛（在数字容差方面）和信息理论速率，从而解决了这个张力。我们的方法通过使用基于规范的张量范数构造了张量补全问题的凸优化问题，这种方法定义了一种允许使用整数线性优化在这种新范数下解决线性分离问题的规范。基于这个洞察力的调整被纳入到一种基于Frank-Wolfe变体的算法中来构建我们的算法。",
    "tldr": "本文开发了一种通过整数优化实现张量补全的新算法，该算法通过在线性步骤中实现了收敛并达到了信息理论速率。",
    "en_tdlr": "This paper develops a novel algorithm for tensor completion using integer optimization, achieving convergence and the information-theoretic rate in a linear number of steps."
}