{
    "title": "LAVE: LLM-Powered Agent Assistance and Language Augmentation for Video Editing",
    "abstract": "arXiv:2402.10294v1 Announce Type: cross  Abstract: Video creation has become increasingly popular, yet the expertise and effort required for editing often pose barriers to beginners. In this paper, we explore the integration of large language models (LLMs) into the video editing workflow to reduce these barriers. Our design vision is embodied in LAVE, a novel system that provides LLM-powered agent assistance and language-augmented editing features. LAVE automatically generates language descriptions for the user's footage, serving as the foundation for enabling the LLM to process videos and assist in editing tasks. When the user provides editing objectives, the agent plans and executes relevant actions to fulfill them. Moreover, LAVE allows users to edit videos through either the agent or direct UI manipulation, providing flexibility and enabling manual refinement of agent actions. Our user study, which included eight participants ranging from novices to proficient editors, demonstrated",
    "link": "https://arxiv.org/abs/2402.10294",
    "context": "Title: LAVE: LLM-Powered Agent Assistance and Language Augmentation for Video Editing\nAbstract: arXiv:2402.10294v1 Announce Type: cross  Abstract: Video creation has become increasingly popular, yet the expertise and effort required for editing often pose barriers to beginners. In this paper, we explore the integration of large language models (LLMs) into the video editing workflow to reduce these barriers. Our design vision is embodied in LAVE, a novel system that provides LLM-powered agent assistance and language-augmented editing features. LAVE automatically generates language descriptions for the user's footage, serving as the foundation for enabling the LLM to process videos and assist in editing tasks. When the user provides editing objectives, the agent plans and executes relevant actions to fulfill them. Moreover, LAVE allows users to edit videos through either the agent or direct UI manipulation, providing flexibility and enabling manual refinement of agent actions. Our user study, which included eight participants ranging from novices to proficient editors, demonstrated",
    "path": "papers/24/02/2402.10294.json",
    "total_tokens": 852,
    "translated_title": "LAVE：以LLM为动力的视频编辑代理辅助和语言增强技术",
    "translated_abstract": "视频制作变得越来越受欢迎，但编辑所需的专业知识和努力常常对初学者构成障碍。本文探讨了在视频编辑工作流程中整合大型语言模型（LLMs）以减少这些障碍。我们的设计理念体现在LAVE中，这是一个提供LLM动力的代理辅助和语言增强编辑功能的新颖系统。LAVE自动生成用户素材的语言描述，作为使LLM能够处理视频并协助编辑任务的基础。当用户提供编辑目标时，代理计划并执行相关动作以实现这些目标。此外，LAVE允许用户通过代理或直接UI操作编辑视频，提供灵活性并使代理动作能够进行手动调整。我们的用户研究包括了从初学者到熟练编辑者的八名参与者，证明了LAVE对于减少编辑障碍和帮助用户实现编辑目标的有效性。",
    "tldr": "LAVE通过整合大型语言模型（LLMs），提供LLM动力的代理辅助和语言增强编辑功能，减少视频编辑的障碍，帮助用户实现编辑目标",
    "en_tdlr": "LAVE reduces barriers in video editing and assists users in achieving editing goals by integrating large language models (LLMs) to provide LLM-powered agent assistance and language-augmented editing features."
}