{
    "title": "HyperMagNet: A Magnetic Laplacian based Hypergraph Neural Network",
    "abstract": "arXiv:2402.09676v1 Announce Type: new  Abstract: In data science, hypergraphs are natural models for data exhibiting multi-way relations, whereas graphs only capture pairwise. Nonetheless, many proposed hypergraph neural networks effectively reduce hypergraphs to undirected graphs via symmetrized matrix representations, potentially losing important information. We propose an alternative approach to hypergraph neural networks in which the hypergraph is represented as a non-reversible Markov chain. We use this Markov chain to construct a complex Hermitian Laplacian matrix - the magnetic Laplacian - which serves as the input to our proposed hypergraph neural network. We study HyperMagNet for the task of node classification, and demonstrate its effectiveness over graph-reduction based hypergraph neural networks.",
    "link": "https://arxiv.org/abs/2402.09676",
    "context": "Title: HyperMagNet: A Magnetic Laplacian based Hypergraph Neural Network\nAbstract: arXiv:2402.09676v1 Announce Type: new  Abstract: In data science, hypergraphs are natural models for data exhibiting multi-way relations, whereas graphs only capture pairwise. Nonetheless, many proposed hypergraph neural networks effectively reduce hypergraphs to undirected graphs via symmetrized matrix representations, potentially losing important information. We propose an alternative approach to hypergraph neural networks in which the hypergraph is represented as a non-reversible Markov chain. We use this Markov chain to construct a complex Hermitian Laplacian matrix - the magnetic Laplacian - which serves as the input to our proposed hypergraph neural network. We study HyperMagNet for the task of node classification, and demonstrate its effectiveness over graph-reduction based hypergraph neural networks.",
    "path": "papers/24/02/2402.09676.json",
    "total_tokens": 807,
    "translated_title": "HyperMagNet:一种基于磁度拉普拉斯的超图神经网络",
    "translated_abstract": "在数据科学领域，超图是对展示多种关系的数据的自然模型，而图只能捕捉到两两之间的关系。然而，许多现有的超图神经网络通过对称矩阵表示将超图有效地简化为无向图，可能会丢失重要信息。我们提出了一种替代超图神经网络的方法，其中将超图表示为非可逆的马尔可夫链。我们使用该马尔可夫链构建了一个复数埃尔米特拉普拉斯矩阵 - 磁度拉普拉斯矩阵，该矩阵作为我们提出的超图神经网络的输入。我们研究了HyperMagNet在节点分类任务中的效果，并证明其在基于图简化的超图神经网络上的优越性。",
    "tldr": "HyperMagNet是一种基于磁度拉普拉斯的超图神经网络，通过将超图表示为非可逆的马尔可夫链并构建磁度拉普拉斯矩阵作为输入，它在节点分类任务中表现出优越性。",
    "en_tdlr": "HyperMagNet is a magnetic Laplacian based hypergraph neural network, which represents the hypergraph as a non-reversible Markov chain and constructs a magnetic Laplacian matrix as the input. It demonstrates superiority in node classification task over graph-reduction based hypergraph neural networks."
}