{
    "title": "SocraSynth: Multi-LLM Reasoning with Conditional Statistics",
    "abstract": "Large language models (LLMs), while promising, face criticisms for biases, hallucinations, and a lack of reasoning capability. This paper introduces SocraSynth, a multi-LLM agent reasoning platform developed to mitigate these issues. SocraSynth utilizes conditional statistics and systematic context enhancement through continuous arguments, alongside adjustable debate contentiousness levels. The platform typically involves a human moderator and two LLM agents representing opposing viewpoints on a given subject. SocraSynth operates in two main phases: knowledge generation and reasoning evaluation. In the knowledge generation phase, the moderator defines the debate topic and contentiousness level, prompting the agents to formulate supporting arguments for their respective stances. The reasoning evaluation phase then employs Socratic reasoning and formal logic principles to appraise the quality of the arguments presented. The dialogue concludes with the moderator adjusting the contentiousn",
    "link": "https://arxiv.org/abs/2402.06634",
    "context": "Title: SocraSynth: Multi-LLM Reasoning with Conditional Statistics\nAbstract: Large language models (LLMs), while promising, face criticisms for biases, hallucinations, and a lack of reasoning capability. This paper introduces SocraSynth, a multi-LLM agent reasoning platform developed to mitigate these issues. SocraSynth utilizes conditional statistics and systematic context enhancement through continuous arguments, alongside adjustable debate contentiousness levels. The platform typically involves a human moderator and two LLM agents representing opposing viewpoints on a given subject. SocraSynth operates in two main phases: knowledge generation and reasoning evaluation. In the knowledge generation phase, the moderator defines the debate topic and contentiousness level, prompting the agents to formulate supporting arguments for their respective stances. The reasoning evaluation phase then employs Socratic reasoning and formal logic principles to appraise the quality of the arguments presented. The dialogue concludes with the moderator adjusting the contentiousn",
    "path": "papers/24/02/2402.06634.json",
    "total_tokens": 876,
    "translated_title": "SocraSynth:基于条件统计的多语言模型推理系统",
    "translated_abstract": "大型语言模型(LLMs)在实用上面临着偏见、幻觉和推理能力不足等问题。本文介绍了SocraSynth，这是一个多语言模型(LLM)推理平台，旨在解决这些问题。SocraSynth通过连续的论证和可调节的争议程度，利用条件统计和系统化的语境增强，充分发挥了多语言模型(LLM)的优势。该平台通常由一个人类主持者和两个代表互相对抗立场的LLM代理组成。SocraSynth分为两个主要阶段：知识生成和推理评估。在知识生成阶段，主持者定义了辩论话题和争议程度，促使代理商为各自的立场制定支持性的论证。然后，在推理评估阶段，采用了苏格拉底推理和形式逻辑原理来评估所提出的论证的质量。对话以主持者调整争议程度结束。",
    "tldr": "SocraSynth是一个多语言模型推理平台，通过使用条件统计和系统化的语境增强技术，以及可调节的辩论争议程度，解决了大型语言模型(LLMs)面临的偏见、幻觉和推理能力不足等问题。",
    "en_tdlr": "SocraSynth is a multi-LLM reasoning platform that addresses the biases, hallucinations, and lack of reasoning capability faced by large language models (LLMs) through the use of conditional statistics, systematic context enhancement, and adjustable debate contentiousness levels."
}