{
    "title": "RecMind: Japanese Movie Recommendation Dialogue with Seeker's Internal State",
    "abstract": "arXiv:2402.13522v1 Announce Type: new  Abstract: Humans pay careful attention to the interlocutor's internal state in dialogues. For example, in recommendation dialogues, we make recommendations while estimating the seeker's internal state, such as his/her level of knowledge and interest. Since there are no existing annotated resources for the analysis, we constructed RecMind, a Japanese movie recommendation dialogue dataset with annotations of the seeker's internal state at the entity level. Each entity has a subjective label annotated by the seeker and an objective label annotated by the recommender. RecMind also features engaging dialogues with long seeker's utterances, enabling a detailed analysis of the seeker's internal state. Our analysis based on RecMind reveals that entities that the seeker has no knowledge about but has an interest in contribute to recommendation success. We also propose a response generation framework that explicitly considers the seeker's internal state, ut",
    "link": "https://arxiv.org/abs/2402.13522",
    "context": "Title: RecMind: Japanese Movie Recommendation Dialogue with Seeker's Internal State\nAbstract: arXiv:2402.13522v1 Announce Type: new  Abstract: Humans pay careful attention to the interlocutor's internal state in dialogues. For example, in recommendation dialogues, we make recommendations while estimating the seeker's internal state, such as his/her level of knowledge and interest. Since there are no existing annotated resources for the analysis, we constructed RecMind, a Japanese movie recommendation dialogue dataset with annotations of the seeker's internal state at the entity level. Each entity has a subjective label annotated by the seeker and an objective label annotated by the recommender. RecMind also features engaging dialogues with long seeker's utterances, enabling a detailed analysis of the seeker's internal state. Our analysis based on RecMind reveals that entities that the seeker has no knowledge about but has an interest in contribute to recommendation success. We also propose a response generation framework that explicitly considers the seeker's internal state, ut",
    "path": "papers/24/02/2402.13522.json",
    "total_tokens": 869,
    "translated_title": "RecMind: 寻求者内心状态下的日本电影推荐对话",
    "translated_abstract": "人类在对话中会仔细关注交流者的内在状态。例如，在推荐对话中，我们会在推荐时估计寻求者的内心状态，比如他/她的知识水平和兴趣。鉴于目前没有现有的资源用于分析，我们构建了RecMind，这是一个具有寻求者内在状态实体级别注释的日本电影推荐对话数据集。每个实体都有一个由寻求者注释的主观标签和由推荐者注释的客观标签。RecMind还具有引人入胜的对话，具有长篇寻求者话语，有助于详细分析寻求者的内在状态。我们基于RecMind的分析显示，寻求者对一些并不了解但感兴趣的实体有助于推荐成功。我们还提出了一个响应生成框架，明确考虑了寻求者的内在状态。",
    "tldr": "RecMind是一个具有寻求者内在状态注释的日本电影推荐对话数据集，研究发现对那些寻求者感兴趣但并不了解的实体进行推荐有助于成功推荐，并提出了一个考虑寻求者内在状态的响应生成框架。",
    "en_tdlr": "RecMind is a Japanese movie recommendation dialogue dataset with annotations of the seeker's internal state, revealing that recommending entities the seeker is interested in but has no knowledge of contributes to successful recommendations, and proposing a response generation framework that explicitly considers the seeker's internal state."
}