{
    "title": "Unraveling the Key of Machine Learning Solutions for Android Malware Detection",
    "abstract": "Android malware detection serves as the front line against malicious apps. With the rapid advancement of machine learning (ML), ML-based Android malware detection has attracted increasing attention due to its capability of automatically capturing malicious patterns from Android APKs. These learning-driven methods have reported promising results in detecting malware. However, the absence of an in-depth analysis of current research progress makes it difficult to gain a holistic picture of the state of the art in this area.   This paper presents a comprehensive investigation to date into ML-based Android malware detection with empirical and quantitative analysis. We first survey the literature, categorizing contributions into a taxonomy based on the Android feature engineering and ML modeling pipeline. Then, we design a general-propose framework for ML-based Android malware detection, re-implement 12 representative approaches from different research communities, and evaluate them from thr",
    "link": "https://arxiv.org/abs/2402.02953",
    "context": "Title: Unraveling the Key of Machine Learning Solutions for Android Malware Detection\nAbstract: Android malware detection serves as the front line against malicious apps. With the rapid advancement of machine learning (ML), ML-based Android malware detection has attracted increasing attention due to its capability of automatically capturing malicious patterns from Android APKs. These learning-driven methods have reported promising results in detecting malware. However, the absence of an in-depth analysis of current research progress makes it difficult to gain a holistic picture of the state of the art in this area.   This paper presents a comprehensive investigation to date into ML-based Android malware detection with empirical and quantitative analysis. We first survey the literature, categorizing contributions into a taxonomy based on the Android feature engineering and ML modeling pipeline. Then, we design a general-propose framework for ML-based Android malware detection, re-implement 12 representative approaches from different research communities, and evaluate them from thr",
    "path": "papers/24/02/2402.02953.json",
    "total_tokens": 828,
    "translated_title": "揭示解决Android恶意软件检测的机器学习方案的关键",
    "translated_abstract": "Android恶意软件检测作为对恶意应用程序的第一道防线。随着机器学习（ML）的快速发展，基于ML的Android恶意软件检测因其能够自动捕获Android APK中的恶意模式而受到越来越多的关注。这些基于学习的方法在检测恶意软件方面取得了有希望的结果。然而，缺乏对当前研究进展的深入分析，使得很难对这一领域的最新发展有一个全面的了解。本文对基于ML的Android恶意软件检测进行了全面的实证和定量分析。我们首先对文献进行了调查，并根据Android特征工程和ML建模过程将贡献分类。然后，我们设计了一个通用的ML-based Android恶意软件检测框架，重新实现了来自不同研究社区的12个代表性方法，并从三个方面对其进行了评估。",
    "tldr": "本文通过调查和分析，提出了一个全面研究基于机器学习的Android恶意软件检测的方案，并重新实现了12个代表性方法的评估。"
}