{
    "title": "Exploring the Synergies of Hybrid CNNs and ViTs Architectures for Computer Vision: A survey",
    "abstract": "The hybrid of Convolutional Neural Network (CNN) and Vision Transformers (ViT) architectures has emerged as a groundbreaking approach, pushing the boundaries of computer vision (CV). This comprehensive review provides a thorough examination of the literature on state-of-the-art hybrid CNN-ViT architectures, exploring the synergies between these two approaches. The main content of this survey includes: (1) a background on the vanilla CNN and ViT, (2) systematic review of various taxonomic hybrid designs to explore the synergy achieved through merging CNNs and ViTs models, (3) comparative analysis and application task-specific synergy between different hybrid architectures, (4) challenges and future directions for hybrid models, (5) lastly, the survey concludes with a summary of key findings and recommendations. Through this exploration of hybrid CV architectures, the survey aims to serve as a guiding resource, fostering a deeper understanding of the intricate dynamics between CNNs and V",
    "link": "https://arxiv.org/abs/2402.02941",
    "context": "Title: Exploring the Synergies of Hybrid CNNs and ViTs Architectures for Computer Vision: A survey\nAbstract: The hybrid of Convolutional Neural Network (CNN) and Vision Transformers (ViT) architectures has emerged as a groundbreaking approach, pushing the boundaries of computer vision (CV). This comprehensive review provides a thorough examination of the literature on state-of-the-art hybrid CNN-ViT architectures, exploring the synergies between these two approaches. The main content of this survey includes: (1) a background on the vanilla CNN and ViT, (2) systematic review of various taxonomic hybrid designs to explore the synergy achieved through merging CNNs and ViTs models, (3) comparative analysis and application task-specific synergy between different hybrid architectures, (4) challenges and future directions for hybrid models, (5) lastly, the survey concludes with a summary of key findings and recommendations. Through this exploration of hybrid CV architectures, the survey aims to serve as a guiding resource, fostering a deeper understanding of the intricate dynamics between CNNs and V",
    "path": "papers/24/02/2402.02941.json",
    "total_tokens": 903,
    "translated_title": "探索卷积神经网络（CNN）和视觉变换器（ViT）混合架构在计算机视觉中的协同作用：一项调查",
    "translated_abstract": "卷积神经网络（CNN）和视觉变换器（ViT）混合架构的协同作用已经成为一种突破性的方法，推动了计算机视觉的发展。这篇综述对最新的混合CNN-ViT架构的文献进行了全面的研究，探讨了这两种方法之间的协同作用。该调查的主要内容包括：(1)对普通CNN和ViT的背景介绍，(2)系统性地研究不同分类混合设计，探索融合CNN和ViT模型所实现的协同作用，(3)比较不同混合架构之间的应用任务特定的协同作用和分析，(4)混合模型面临的挑战和未来方向，(5)最后，调查总结了关键发现和建议。通过这种对混合计算机视觉架构的探索，该调查旨在作为一个指南，促进对CNN和ViT之间复杂动态的深入理解。",
    "tldr": "本文调查了卷积神经网络和视觉变换器混合架构在计算机视觉中的协同作用，提供了对最新混合CNN-ViT架构的综述。翻译",
    "en_tdlr": "This survey explores the synergies between hybrid CNN and ViT architectures in computer vision, providing a comprehensive review of the latest hybrid CNN-ViT architectures."
}