{
    "title": "S$\\Omega$I: Score-based O-INFORMATION Estimation",
    "abstract": "The analysis of scientific data and complex multivariate systems requires information quantities that capture relationships among multiple random variables. Recently, new information-theoretic measures have been developed to overcome the shortcomings of classical ones, such as mutual information, that are restricted to considering pairwise interactions. Among them, the concept of information synergy and redundancy is crucial for understanding the high-order dependencies between variables. One of the most prominent and versatile measures based on this concept is O-information, which provides a clear and scalable way to quantify the synergy-redundancy balance in multivariate systems. However, its practical application is limited to simplified cases. In this work, we introduce S$\\Omega$I, which allows for the first time to compute O-information without restrictive assumptions about the system. Our experiments validate our approach on synthetic data, and demonstrate the effectiveness of S$",
    "link": "https://arxiv.org/abs/2402.05667",
    "context": "Title: S$\\Omega$I: Score-based O-INFORMATION Estimation\nAbstract: The analysis of scientific data and complex multivariate systems requires information quantities that capture relationships among multiple random variables. Recently, new information-theoretic measures have been developed to overcome the shortcomings of classical ones, such as mutual information, that are restricted to considering pairwise interactions. Among them, the concept of information synergy and redundancy is crucial for understanding the high-order dependencies between variables. One of the most prominent and versatile measures based on this concept is O-information, which provides a clear and scalable way to quantify the synergy-redundancy balance in multivariate systems. However, its practical application is limited to simplified cases. In this work, we introduce S$\\Omega$I, which allows for the first time to compute O-information without restrictive assumptions about the system. Our experiments validate our approach on synthetic data, and demonstrate the effectiveness of S$",
    "path": "papers/24/02/2402.05667.json",
    "total_tokens": 811,
    "translated_title": "S$\\Omega$I: 基于分数的O-INFORMATION估计",
    "translated_abstract": "科学数据和复杂的多变量系统的分析需要捕捉多个随机变量之间关系的信息量。最近，新的信息论量度已被发展出来，以克服传统量度（如互信息）的局限性，后者只考虑成对交互作用。其中，信息协同和冗余的概念对于理解变量之间的高阶依赖关系至关重要。基于这一概念的最著名和多用途的量度之一是O-information，它提供了一种清晰且可扩展的方式来量化多变量系统中的协同-冗余平衡。然而，它在实际应用中受限于简化情况。在本研究中，我们引入了S$\\Omega$I，该方法首次允许计算O-information而不受对系统的限制性假设。我们的实验证实了我们的方法在合成数据上的有效性，证明了S$的有效性。",
    "tldr": "S$\\Omega$I是一种新的信息论量度，可以计算多变量系统中的协同-冗余平衡，突破了传统量度的局限性，并在合成数据上得到了验证。"
}