{
    "title": "BMLP: Behavior-aware MLP for Heterogeneous Sequential Recommendation",
    "abstract": "arXiv:2402.12733v1 Announce Type: cross  Abstract: In real recommendation scenarios, users often have different types of behaviors, such as clicking and buying. Existing research methods show that it is possible to capture the heterogeneous interests of users through different types of behaviors. However, most multi-behavior approaches have limitations in learning the relationship between different behaviors. In this paper, we propose a novel multilayer perceptron (MLP)-based heterogeneous sequential recommendation method, namely behavior-aware multilayer perceptron (BMLP). Specifically, it has two main modules, including a heterogeneous interest perception (HIP) module, which models behaviors at multiple granularities through behavior types and transition relationships, and a purchase intent perception (PIP) module, which adaptively fuses subsequences of auxiliary behaviors to capture users' purchase intent. Compared with mainstream sequence models, MLP is competitive in terms of accu",
    "link": "https://arxiv.org/abs/2402.12733",
    "context": "Title: BMLP: Behavior-aware MLP for Heterogeneous Sequential Recommendation\nAbstract: arXiv:2402.12733v1 Announce Type: cross  Abstract: In real recommendation scenarios, users often have different types of behaviors, such as clicking and buying. Existing research methods show that it is possible to capture the heterogeneous interests of users through different types of behaviors. However, most multi-behavior approaches have limitations in learning the relationship between different behaviors. In this paper, we propose a novel multilayer perceptron (MLP)-based heterogeneous sequential recommendation method, namely behavior-aware multilayer perceptron (BMLP). Specifically, it has two main modules, including a heterogeneous interest perception (HIP) module, which models behaviors at multiple granularities through behavior types and transition relationships, and a purchase intent perception (PIP) module, which adaptively fuses subsequences of auxiliary behaviors to capture users' purchase intent. Compared with mainstream sequence models, MLP is competitive in terms of accu",
    "path": "papers/24/02/2402.12733.json",
    "total_tokens": 829,
    "translated_title": "BMLP：用于异构序列推荐的行为感知MLP",
    "translated_abstract": "在真实的推荐场景中，用户往往具有不同类型的行为，比如点击和购买。现有研究方法表明，通过不同类型的行为可以捕捉用户的异构兴趣。然而，大多数多行为方法在学习不同行为之间的关系方面存在局限性。本文提出了一种新颖的基于多层感知器（MLP）的异构序列推荐方法，即行为感知多层感知器（BMLP）。具体而言，它包括两个主要模块，即异构兴趣感知（HIP）模块，通过行为类型和转换关系在多个粒度上建模行为，并购买意图感知（PIP）模块，该模块自适应地融合辅助行为的子序列以捕捉用户的购买意图。与主流序列模型相比，MLP在准确性方面有竞争力。",
    "tldr": "提出了一种新颖的基于多层感知器的异构序列推荐方法BMLP，通过行为感知模块和购买意图感知模块捕捉用户的异构兴趣和购买意图。",
    "en_tdlr": "Proposed a novel behavior-aware MLP-based method BMLP for heterogeneous sequential recommendation, capturing users' heterogeneous interests and purchase intent through behavior perception and purchase intent perception modules."
}