{
    "title": "OPSurv: Orthogonal Polynomials Quadrature Algorithm for Survival Analysis",
    "abstract": "This paper introduces the Orthogonal Polynomials Quadrature Algorithm for Survival Analysis (OPSurv), a new method providing time-continuous functional outputs for both single and competing risks scenarios in survival analysis. OPSurv utilizes the initial zero condition of the Cumulative Incidence function and a unique decomposition of probability densities using orthogonal polynomials, allowing it to learn functional approximation coefficients for each risk event and construct Cumulative Incidence Function estimates via Gauss--Legendre quadrature. This approach effectively counters overfitting, particularly in competing risks scenarios, enhancing model expressiveness and control. The paper further details empirical validations and theoretical justifications of OPSurv, highlighting its robust performance as an advancement in survival analysis with competing risks.",
    "link": "https://arxiv.org/abs/2402.01955",
    "context": "Title: OPSurv: Orthogonal Polynomials Quadrature Algorithm for Survival Analysis\nAbstract: This paper introduces the Orthogonal Polynomials Quadrature Algorithm for Survival Analysis (OPSurv), a new method providing time-continuous functional outputs for both single and competing risks scenarios in survival analysis. OPSurv utilizes the initial zero condition of the Cumulative Incidence function and a unique decomposition of probability densities using orthogonal polynomials, allowing it to learn functional approximation coefficients for each risk event and construct Cumulative Incidence Function estimates via Gauss--Legendre quadrature. This approach effectively counters overfitting, particularly in competing risks scenarios, enhancing model expressiveness and control. The paper further details empirical validations and theoretical justifications of OPSurv, highlighting its robust performance as an advancement in survival analysis with competing risks.",
    "path": "papers/24/02/2402.01955.json",
    "total_tokens": 887,
    "translated_title": "OPSurv：用于生存分析的正交多项式积分算法",
    "translated_abstract": "本文介绍了用于生存分析中单一风险和竞争风险场景的Orthogonal Polynomials Quadrature Algorithm for Survival Analysis（OPSurv）方法，该方法提供了连续时间功能性输出。OPSurv利用累积发生函数的初始零条件和使用正交多项式对概率密度进行唯一分解，从而为每个风险事件学习功能近似系数，并通过高斯-勒让德积分法构建累积发生函数的估计值。该方法有效地对抗过度拟合，尤其在竞争风险场景中，增强模型的表达能力和控制性。本文还详细介绍了OPSurv的经验验证和理论证明，突出了其作为竞争风险生存分析的一项重要进展的鲁棒性能。",
    "tldr": "本文介绍了一种用于生存分析的新方法OPSurv，通过正交多项式积分算法提供连续时间功能性输出。该方法利用累积发生函数的初始零条件和正交多项式的分解，实现了对每个风险事件的功能近似系数的学习，并通过高斯-勒让德积分法构建累积发生函数的估计值，有效地解决了竞争风险场景中的过度拟合问题。"
}