{
    "title": "Leveraging AI Predicted and Expert Revised Annotations in Interactive Segmentation: Continual Tuning or Full Training?",
    "abstract": "arXiv:2402.19423v1 Announce Type: cross  Abstract: Interactive segmentation, an integration of AI algorithms and human expertise, premises to improve the accuracy and efficiency of curating large-scale, detailed-annotated datasets in healthcare. Human experts revise the annotations predicted by AI, and in turn, AI improves its predictions by learning from these revised annotations. This interactive process continues to enhance the quality of annotations until no major revision is needed from experts. The key challenge is how to leverage AI predicted and expert revised annotations to iteratively improve the AI. Two problems arise: (1) The risk of catastrophic forgetting--the AI tends to forget the previously learned classes if it is only retrained using the expert revised classes. (2) Computational inefficiency when retraining the AI using both AI predicted and expert revised annotations; moreover, given the dominant AI predicted annotations in the dataset, the contribution of newly rev",
    "link": "https://arxiv.org/abs/2402.19423",
    "context": "Title: Leveraging AI Predicted and Expert Revised Annotations in Interactive Segmentation: Continual Tuning or Full Training?\nAbstract: arXiv:2402.19423v1 Announce Type: cross  Abstract: Interactive segmentation, an integration of AI algorithms and human expertise, premises to improve the accuracy and efficiency of curating large-scale, detailed-annotated datasets in healthcare. Human experts revise the annotations predicted by AI, and in turn, AI improves its predictions by learning from these revised annotations. This interactive process continues to enhance the quality of annotations until no major revision is needed from experts. The key challenge is how to leverage AI predicted and expert revised annotations to iteratively improve the AI. Two problems arise: (1) The risk of catastrophic forgetting--the AI tends to forget the previously learned classes if it is only retrained using the expert revised classes. (2) Computational inefficiency when retraining the AI using both AI predicted and expert revised annotations; moreover, given the dominant AI predicted annotations in the dataset, the contribution of newly rev",
    "path": "papers/24/02/2402.19423.json",
    "total_tokens": 973,
    "translated_title": "利用人工智能预测和专家修订的注释在交互式分割中：持续调整还是完全训练？",
    "translated_abstract": "交互式分割是人工智能算法和人类专业知识相结合的一种方法，旨在提高在医疗保健领域中筛选大规模、详细标注数据集的准确性和效率。人类专家会修订人工智能预测的注释，而人工智能则通过学习这些修订的注释来改善其预测。这种交互过程不断增强注释的质量，直到不再需要专家进行重大修订。关键挑战在于如何利用人工智能预测和专家修订的注释来迭代地改善人工智能。存在两个问题：（1）灾难性遗忘的风险--如果仅使用专家修订的类别进行重新训练，人工智能往往会忘记先前学习的类别。 （2）当使用人工智能预测和专家修订的注释重新训练人工智能时存在计算效率低下的问题；此外，考虑到数据集中占主导地位的人工智能预测注释，新注释的贡献可能会被低估。",
    "tldr": "交互式分割结合了人工智能算法和人类专业知识，通过反复调整人工智能预测和专家修订的注释来持续改善人工智能，但如何在避免灾难性遗忘的同时提高计算效率仍是关键挑战。",
    "en_tdlr": "Interactive segmentation integrates AI algorithms and human expertise to continually improve AI by iteratively adjusting AI-predicted and expert-revised annotations, with the key challenge being how to enhance computational efficiency while avoiding catastrophic forgetting."
}