{
    "title": "On the Privacy of Selection Mechanisms with Gaussian Noise",
    "abstract": "Report Noisy Max and Above Threshold are two classical differentially private (DP) selection mechanisms. Their output is obtained by adding noise to a sequence of low-sensitivity queries and reporting the identity of the query whose (noisy) answer satisfies a certain condition. Pure DP guarantees for these mechanisms are easy to obtain when Laplace noise is added to the queries. On the other hand, when instantiated using Gaussian noise, standard analyses only yield approximate DP guarantees despite the fact that the outputs of these mechanisms lie in a discrete space. In this work, we revisit the analysis of Report Noisy Max and Above Threshold with Gaussian noise and show that, under the additional assumption that the underlying queries are bounded, it is possible to provide pure ex-ante DP bounds for Report Noisy Max and pure ex-post DP bounds for Above Threshold. The resulting bounds are tight and depend on closed-form expressions that can be numerically evaluated using standard met",
    "link": "https://arxiv.org/abs/2402.06137",
    "context": "Title: On the Privacy of Selection Mechanisms with Gaussian Noise\nAbstract: Report Noisy Max and Above Threshold are two classical differentially private (DP) selection mechanisms. Their output is obtained by adding noise to a sequence of low-sensitivity queries and reporting the identity of the query whose (noisy) answer satisfies a certain condition. Pure DP guarantees for these mechanisms are easy to obtain when Laplace noise is added to the queries. On the other hand, when instantiated using Gaussian noise, standard analyses only yield approximate DP guarantees despite the fact that the outputs of these mechanisms lie in a discrete space. In this work, we revisit the analysis of Report Noisy Max and Above Threshold with Gaussian noise and show that, under the additional assumption that the underlying queries are bounded, it is possible to provide pure ex-ante DP bounds for Report Noisy Max and pure ex-post DP bounds for Above Threshold. The resulting bounds are tight and depend on closed-form expressions that can be numerically evaluated using standard met",
    "path": "papers/24/02/2402.06137.json",
    "total_tokens": 884,
    "translated_title": "关于带有高斯噪声的选择机制的隐私问题",
    "translated_abstract": "报告噪声最大值和阈值以上是两个经典的差分隐私(DP)选择机制。它们的输出是通过对一系列低灵敏度的查询添加噪声，并报告满足某个条件的查询(噪声的)答案的身份来获得的。当在查询上添加拉普拉斯噪声时，这些机制的纯DP保证很容易获得。另一方面，当使用高斯噪声实例化时，标准分析只能提供近似的DP保证，尽管这些机制的输出位于离散空间中。在这项工作中，我们重新审视了使用高斯噪声的报告噪声最大值和阈值以上的分析，并展示了在额外的假设下，即底层查询是有界的情况下，可以为报告噪声最大值提供纯粹的前期DP界限，以及为阈值以上提供纯粹的后期DP界限。得到的界限是紧密的，并且依赖于可以使用标准元方法数值评估的闭式表达式。",
    "tldr": "该论文研究了带有高斯噪声的选择机制的隐私问题，并证明了在底层查询是有界的情况下，可以提供纯粹的前期和后期差分隐私界限。",
    "en_tdlr": "This paper investigates the privacy of selection mechanisms with Gaussian noise and demonstrates that under the assumption of bounded queries, pure ex-ante and ex-post differential privacy bounds can be provided."
}