{
    "title": "Graph Generation via Spectral Diffusion",
    "abstract": "arXiv:2402.18974v1 Announce Type: new  Abstract: In this paper, we present GRASP, a novel graph generative model based on 1) the spectral decomposition of the graph Laplacian matrix and 2) a diffusion process. Specifically, we propose to use a denoising model to sample eigenvectors and eigenvalues from which we can reconstruct the graph Laplacian and adjacency matrix. Our permutation invariant model can also handle node features by concatenating them to the eigenvectors of each node. Using the Laplacian spectrum allows us to naturally capture the structural characteristics of the graph and work directly in the node space while avoiding the quadratic complexity bottleneck that limits the applicability of other methods. This is achieved by truncating the spectrum, which as we show in our experiments results in a faster yet accurate generative process. An extensive set of experiments on both synthetic and real world graphs demonstrates the strengths of our model against state-of-the-art a",
    "link": "https://arxiv.org/abs/2402.18974",
    "context": "Title: Graph Generation via Spectral Diffusion\nAbstract: arXiv:2402.18974v1 Announce Type: new  Abstract: In this paper, we present GRASP, a novel graph generative model based on 1) the spectral decomposition of the graph Laplacian matrix and 2) a diffusion process. Specifically, we propose to use a denoising model to sample eigenvectors and eigenvalues from which we can reconstruct the graph Laplacian and adjacency matrix. Our permutation invariant model can also handle node features by concatenating them to the eigenvectors of each node. Using the Laplacian spectrum allows us to naturally capture the structural characteristics of the graph and work directly in the node space while avoiding the quadratic complexity bottleneck that limits the applicability of other methods. This is achieved by truncating the spectrum, which as we show in our experiments results in a faster yet accurate generative process. An extensive set of experiments on both synthetic and real world graphs demonstrates the strengths of our model against state-of-the-art a",
    "path": "papers/24/02/2402.18974.json",
    "total_tokens": 885,
    "translated_title": "通过谱扩散生成图形",
    "translated_abstract": "在本文中，我们提出了GRASP，一种基于图拉普拉斯矩阵的谱分解和扩散过程的新颖图生成模型。具体而言，我们提出使用去噪模型从中采样特征向量和特征值，从而可以重建图拉普拉斯矩阵和邻接矩阵。我们的置换不变模型还可以通过将节点特征连接到每个节点的特征向量来处理节点特征。使用拉普拉斯频谱使我们能够自然捕获图的结构特征，并直接在节点空间中工作，同时避免了限制其他方法适用性的二次复杂性瓶颈。通过截断谱，我们实现了更快但准确的生成过程，这在我们的实验中得到了证实。对合成和现实世界图形的大量实验显示了我们模型相对于最先进的模型的优势。",
    "tldr": "提出了一种基于图拉普拉斯矩阵谱分解和扩散过程的新颖图生成模型GRASP，能够通过截断拉普拉斯频谱快速准确地捕捉图的结构特征，同时处理节点特征，避免了二次复杂性瓶颈。",
    "en_tdlr": "Introduced a novel graph generative model GRASP based on the spectral decomposition of the graph Laplacian matrix and diffusion process, capable of quickly and accurately capturing structural characteristics of a graph by truncating the Laplacian spectrum, handling node features, and avoiding quadratic complexity bottleneck."
}