{
    "title": "Exploitation Strategies in Conditional Markov Chain Search: A case study on the three-index assignment problem",
    "abstract": "The Conditional Markov Chain Search (CMCS) is a framework for automated design of metaheuristics for discrete combinatorial optimisation problems. Given a set of algorithmic components such as hill climbers and mutations, CMCS decides in which order to apply those components. The decisions are dictated by the CMCS configuration that can be learnt offline. CMCS does not have an acceptance criterion; any moves are accepted by the framework. As a result, it is particularly good in exploration but is not as good at exploitation. In this study, we explore several extensions of the framework to improve its exploitation abilities. To perform a computational study, we applied the framework to the three-index assignment problem. The results of our experiments showed that a two-stage CMCS is indeed superior to a single-stage CMCS.",
    "link": "https://arxiv.org/abs/2402.00076",
    "context": "Title: Exploitation Strategies in Conditional Markov Chain Search: A case study on the three-index assignment problem\nAbstract: The Conditional Markov Chain Search (CMCS) is a framework for automated design of metaheuristics for discrete combinatorial optimisation problems. Given a set of algorithmic components such as hill climbers and mutations, CMCS decides in which order to apply those components. The decisions are dictated by the CMCS configuration that can be learnt offline. CMCS does not have an acceptance criterion; any moves are accepted by the framework. As a result, it is particularly good in exploration but is not as good at exploitation. In this study, we explore several extensions of the framework to improve its exploitation abilities. To perform a computational study, we applied the framework to the three-index assignment problem. The results of our experiments showed that a two-stage CMCS is indeed superior to a single-stage CMCS.",
    "path": "papers/24/02/2402.00076.json",
    "total_tokens": 795,
    "translated_title": "有条件马尔可夫链搜索中的开发策略：基于三指数分配问题的案例研究",
    "translated_abstract": "有条件马尔可夫链搜索（CMCS）是用于离散组合优化问题的元启发式自动设计框架。给定一组算法组件，如山爬和突变，CMCS决定以何种顺序应用这些组件。决策由离线学习的CMCS配置指导。CMCS没有接受标准，框架接受任何移动。因此，它在探索方面表现出色，但在开发方面不如其他方法。在本研究中，我们探索了几种扩展CMCS的方法以提高其开发能力。为了进行计算研究，我们将该框架应用于三指数分配问题。我们实验的结果表明，两阶段CMCS的确优于单一阶段CMCS。",
    "tldr": "这个研究探索了扩展有条件马尔可夫链搜索（CMCS）框架的几种方法，以提高其在开发方面的能力。实验结果表明，两阶段CMCS优于单一阶段CMCS。",
    "en_tdlr": "The study explores several extensions of the Conditional Markov Chain Search (CMCS) framework to improve its exploitation abilities. Experimental results show that a two-stage CMCS is superior to a single-stage CMCS."
}