{
    "title": "Machine-learning prediction of tipping and collapse of the Atlantic Meridional Overturning Circulation",
    "abstract": "arXiv:2402.14877v1 Announce Type: cross  Abstract: Recent research on the Atlantic Meridional Overturning Circulation (AMOC) raised concern about its potential collapse through a tipping point due to the climate-change caused increase in the freshwater input into the North Atlantic. The predicted time window of collapse is centered about the middle of the century and the earliest possible start is approximately two years from now. More generally, anticipating a tipping point at which the system transitions from one stable steady state to another is relevant to a broad range of fields. We develop a machine-learning approach to predicting tipping in noisy dynamical systems with a time-varying parameter and test it on a number of systems including the AMOC, ecological networks, an electrical power system, and a climate model. For the AMOC, our prediction based on simulated fingerprint data and real data of the sea surface temperature places the time window of a potential collapse between ",
    "link": "https://arxiv.org/abs/2402.14877",
    "context": "Title: Machine-learning prediction of tipping and collapse of the Atlantic Meridional Overturning Circulation\nAbstract: arXiv:2402.14877v1 Announce Type: cross  Abstract: Recent research on the Atlantic Meridional Overturning Circulation (AMOC) raised concern about its potential collapse through a tipping point due to the climate-change caused increase in the freshwater input into the North Atlantic. The predicted time window of collapse is centered about the middle of the century and the earliest possible start is approximately two years from now. More generally, anticipating a tipping point at which the system transitions from one stable steady state to another is relevant to a broad range of fields. We develop a machine-learning approach to predicting tipping in noisy dynamical systems with a time-varying parameter and test it on a number of systems including the AMOC, ecological networks, an electrical power system, and a climate model. For the AMOC, our prediction based on simulated fingerprint data and real data of the sea surface temperature places the time window of a potential collapse between ",
    "path": "papers/24/02/2402.14877.json",
    "total_tokens": 873,
    "translated_title": "机器学习预测大西洋经向翻转环流的倾覆和崩溃",
    "translated_abstract": "大西洋经向翻转环流(AMOC)的最新研究引发了对其潜在倾覆的担忧，这是由于气候变化导致北大西洋淡水输入增加的一个临界点。预测的崩溃时间窗口大约在本世纪中叶，最早可能在大约两年后开始。更一般地，对系统从一个稳定平衡状态转变到另一个稳定状态的临界点的预测对于广泛领域都是相关的。我们开发了一种机器学习方法，用于预测嘈杂的动力系统中具有时间变化参数的倾覆，并在多个系统上进行测试，包括AMOC、生态网络、电力系统和气候模型。对于AMOC，我们基于模拟指纹数据和海表温度的真实数据进行预测，将潜在倾覆的时间窗口置于",
    "tldr": "该研究开发了一种机器学习方法，用于预测在嘈杂的动力系统中具有时间变化参数的倾覆，包括预测大西洋经向翻转环流的倾覆和崩溃。",
    "en_tdlr": "The study developed a machine-learning approach to predict tipping in noisy dynamical systems with a time-varying parameter, including the prediction of tipping and collapse of the Atlantic Meridional Overturning Circulation."
}