{
    "title": "A novel framework for adaptive stress testing of autonomous vehicles in highways",
    "abstract": "arXiv:2402.11813v1 Announce Type: cross  Abstract: Guaranteeing the safe operations of autonomous vehicles (AVs) is crucial for their widespread adoption and public acceptance. It is thus of a great significance to not only assess the AV against the standard safety tests, but also discover potential corner cases of the AV under test that could lead to unsafe behaviour or scenario. In this paper, we propose a novel framework to systematically explore corner cases that can result in safety concerns in a highway traffic scenario. The framework is based on an adaptive stress testing (AST) approach, an emerging validation method that leverages a Markov decision process to formulate the scenarios and deep reinforcement learning (DRL) to discover the desirable patterns representing corner cases. To this end, we develop a new reward function for DRL to guide the AST in identifying crash scenarios based on the collision probability estimate between the AV under test (i.e., the ego vehicle) and ",
    "link": "https://arxiv.org/abs/2402.11813",
    "context": "Title: A novel framework for adaptive stress testing of autonomous vehicles in highways\nAbstract: arXiv:2402.11813v1 Announce Type: cross  Abstract: Guaranteeing the safe operations of autonomous vehicles (AVs) is crucial for their widespread adoption and public acceptance. It is thus of a great significance to not only assess the AV against the standard safety tests, but also discover potential corner cases of the AV under test that could lead to unsafe behaviour or scenario. In this paper, we propose a novel framework to systematically explore corner cases that can result in safety concerns in a highway traffic scenario. The framework is based on an adaptive stress testing (AST) approach, an emerging validation method that leverages a Markov decision process to formulate the scenarios and deep reinforcement learning (DRL) to discover the desirable patterns representing corner cases. To this end, we develop a new reward function for DRL to guide the AST in identifying crash scenarios based on the collision probability estimate between the AV under test (i.e., the ego vehicle) and ",
    "path": "papers/24/02/2402.11813.json",
    "total_tokens": 856,
    "translated_title": "自适应压力测试高速公路自动驾驶车辆的新框架",
    "translated_abstract": "保证自动驾驶车辆（AVs）的安全运行对于它们的广泛应用和公众接受至关重要。因此，不仅对AV进行标准安全测试的评估，还发现可能导致不安全行为或情况的被测试AV的潜在边界情况具有极其重要的意义。本文提出了一个新颖的框架，用于系统地探索可能导致高速公路交通场景中安全问题的边界情况。该框架基于一种自适应压力测试（AST）方法，这是一种利用马尔可夫决策过程制定场景以及深度强化学习（DRL）发现代表边界情况的理想模式的新兴验证方法。为此，我们为DRL开发了一个新的奖励函数，以指导AST根据被测试AV（即自车）与其他车辆之间的碰撞概率估计来识别碰撞场景。",
    "tldr": "提出了一种新颖的框架，利用自适应压力测试方法和深度强化学习来系统探索可能导致高速公路交通场景中安全问题的边界情况",
    "en_tdlr": "A novel framework is proposed to systematically explore corner cases in highway traffic scenarios by utilizing an adaptive stress testing method and deep reinforcement learning."
}