{
    "title": "High-dimensional Bayesian Optimization via Covariance Matrix Adaptation Strategy",
    "abstract": "Bayesian Optimization (BO) is an effective method for finding the global optimum of expensive black-box functions. However, it is well known that applying BO to high-dimensional optimization problems is challenging. To address this issue, a promising solution is to use a local search strategy that partitions the search domain into local regions with high likelihood of containing the global optimum, and then use BO to optimize the objective function within these regions. In this paper, we propose a novel technique for defining the local regions using the Covariance Matrix Adaptation (CMA) strategy. Specifically, we use CMA to learn a search distribution that can estimate the probabilities of data points being the global optimum of the objective function. Based on this search distribution, we then define the local regions consisting of data points with high probabilities of being the global optimum. Our approach serves as a meta-algorithm as it can incorporate existing black-box BO optim",
    "link": "https://arxiv.org/abs/2402.03104",
    "context": "Title: High-dimensional Bayesian Optimization via Covariance Matrix Adaptation Strategy\nAbstract: Bayesian Optimization (BO) is an effective method for finding the global optimum of expensive black-box functions. However, it is well known that applying BO to high-dimensional optimization problems is challenging. To address this issue, a promising solution is to use a local search strategy that partitions the search domain into local regions with high likelihood of containing the global optimum, and then use BO to optimize the objective function within these regions. In this paper, we propose a novel technique for defining the local regions using the Covariance Matrix Adaptation (CMA) strategy. Specifically, we use CMA to learn a search distribution that can estimate the probabilities of data points being the global optimum of the objective function. Based on this search distribution, we then define the local regions consisting of data points with high probabilities of being the global optimum. Our approach serves as a meta-algorithm as it can incorporate existing black-box BO optim",
    "path": "papers/24/02/2402.03104.json",
    "total_tokens": 797,
    "translated_title": "高维贝叶斯优化通过协方差矩阵适应策略",
    "translated_abstract": "贝叶斯优化（BO）是一种寻找昂贵黑盒函数全局最优解的有效方法。然而，众所周知，将BO应用于高维优化问题具有挑战性。为了解决这个问题，一个有希望的解决方案是使用局部搜索策略将搜索域划分成包含全局最优解可能性较高的局部区域，然后在这些区域内使用BO优化目标函数。在本文中，我们提出了一种使用协方差矩阵适应（CMA）策略定义局部区域的新技术。具体来说，我们使用CMA来学习一个能够估计数据点作为目标函数全局最优解概率的搜索分布。基于这个搜索分布，我们定义由高概率数据点组成的局部区域。我们的方法作为一个元算法，可以整合现有的黑盒BO优化方法。",
    "tldr": "本文提出了一种高维贝叶斯优化方法，通过协方差矩阵适应策略定义局部搜索区域，能够解决将贝叶斯优化应用于高维优化问题的挑战。"
}