{
    "title": "ExGRG: Explicitly-Generated Relation Graph for Self-Supervised Representation Learning",
    "abstract": "Self-supervised Learning (SSL) has emerged as a powerful technique in pre-training deep learning models without relying on expensive annotated labels, instead leveraging embedded signals in unlabeled data. While SSL has shown remarkable success in computer vision tasks through intuitive data augmentation, its application to graph-structured data poses challenges due to the semantic-altering and counter-intuitive nature of graph augmentations. Addressing this limitation, this paper introduces a novel non-contrastive SSL approach to Explicitly Generate a compositional Relation Graph (ExGRG) instead of relying solely on the conventional augmentation-based implicit relation graph. ExGRG offers a framework for incorporating prior domain knowledge and online extracted information into the SSL invariance objective, drawing inspiration from the Laplacian Eigenmap and Expectation-Maximization (EM). Employing an EM perspective on SSL, our E-step involves relation graph generation to identify can",
    "link": "https://arxiv.org/abs/2402.06737",
    "context": "Title: ExGRG: Explicitly-Generated Relation Graph for Self-Supervised Representation Learning\nAbstract: Self-supervised Learning (SSL) has emerged as a powerful technique in pre-training deep learning models without relying on expensive annotated labels, instead leveraging embedded signals in unlabeled data. While SSL has shown remarkable success in computer vision tasks through intuitive data augmentation, its application to graph-structured data poses challenges due to the semantic-altering and counter-intuitive nature of graph augmentations. Addressing this limitation, this paper introduces a novel non-contrastive SSL approach to Explicitly Generate a compositional Relation Graph (ExGRG) instead of relying solely on the conventional augmentation-based implicit relation graph. ExGRG offers a framework for incorporating prior domain knowledge and online extracted information into the SSL invariance objective, drawing inspiration from the Laplacian Eigenmap and Expectation-Maximization (EM). Employing an EM perspective on SSL, our E-step involves relation graph generation to identify can",
    "path": "papers/24/02/2402.06737.json",
    "total_tokens": 931,
    "translated_title": "ExGRG: 用于自监督表示学习的显式生成关系图",
    "translated_abstract": "自监督学习（SSL）作为一种无需昂贵的标注标签而预训练深度学习模型的强大技术，通过利用未标记数据中的内嵌信号取得了显著的成功。然而，尽管SSL在计算机视觉任务中通过直观的数据增强展现了出色的性能，但其在图结构数据上的应用面临着挑战，因为图增强操作改变了语义并呈现出反直观的性质。针对这一限制，本文引入了一种新颖的非对比自监督学习方法，即显式生成关系图（ExGRG），以取代仅依靠传统的基于增强的隐式关系图。ExGRG提供了一个框架，可以将先验领域知识和在线提取的信息纳入自监督学习的不变性目标中，借鉴了拉普拉斯特征映射和期望最大化算法。通过将自监督学习与期望最大化算法结合，我们的E步骤涉及关系图的生成，以识别...",
    "tldr": "本文介绍了一种新颖的自监督学习方法ExGRG，它通过显式生成关系图来解决图结构数据上的挑战，将先验领域知识和在线提取的信息纳入自监督学习中，取得了显著的成功。",
    "en_tdlr": "This paper presents a novel self-supervised learning approach, ExGRG, which addresses the challenges in graph-structured data by explicitly generating a relation graph and incorporating prior domain knowledge and online extracted information into the self-supervised learning process, achieving remarkable success."
}