{
    "title": "Moco: A Learnable Meta Optimizer for Combinatorial Optimization",
    "abstract": "Relevant combinatorial optimization problems (COPs) are often NP-hard. While they have been tackled mainly via handcrafted heuristics in the past, advances in neural networks have motivated the development of general methods to learn heuristics from data. Many approaches utilize a neural network to directly construct a solution, but are limited in further improving based on already constructed solutions at inference time. Our approach, Moco, learns a graph neural network that updates the solution construction procedure based on features extracted from the current search state. This meta training procedure targets the overall best solution found during the search procedure given information such as the search budget. This allows Moco to adapt to varying circumstances such as different computational budgets. Moco is a fully learnable meta optimizer that does not utilize any problem specific local search or decomposition. We test Moco on the Traveling Salesman Problem (TSP) and Maximum In",
    "link": "https://arxiv.org/abs/2402.04915",
    "context": "Title: Moco: A Learnable Meta Optimizer for Combinatorial Optimization\nAbstract: Relevant combinatorial optimization problems (COPs) are often NP-hard. While they have been tackled mainly via handcrafted heuristics in the past, advances in neural networks have motivated the development of general methods to learn heuristics from data. Many approaches utilize a neural network to directly construct a solution, but are limited in further improving based on already constructed solutions at inference time. Our approach, Moco, learns a graph neural network that updates the solution construction procedure based on features extracted from the current search state. This meta training procedure targets the overall best solution found during the search procedure given information such as the search budget. This allows Moco to adapt to varying circumstances such as different computational budgets. Moco is a fully learnable meta optimizer that does not utilize any problem specific local search or decomposition. We test Moco on the Traveling Salesman Problem (TSP) and Maximum In",
    "path": "papers/24/02/2402.04915.json",
    "total_tokens": 822,
    "translated_title": "Moco: 一种可学习的组合优化元优化器",
    "translated_abstract": "相关的组合优化问题（COPs）通常是NP难的。过去，这些问题主要是通过人工设计的启发式方法来解决的，但是神经网络的进展促使人们开发了从数据中学习启发式方法的通用方法。许多方法利用神经网络直接构建解决方案，但在推理时无法进一步改进已经构建的解决方案。我们的方法Moco学习了一个图神经网络，根据从当前搜索状态提取的特征来更新解决方案构建过程。这种元训练过程以搜索过程中找到的最佳解决方案为目标，给定搜索预算等信息。这使得Moco能够适应不同的情况，例如不同的计算预算。Moco是一个完全可学习的元优化器，不使用任何特定问题的局部搜索或分解。我们在旅行商问题（TSP）和最大最小费用流问题中测试了Moco。",
    "tldr": "Moco是一个可学习的组合优化元优化器，通过学习图神经网络来更新解决方案构建过程，并能够适应不同的情况和计算预算。",
    "en_tdlr": "Moco is a learnable meta optimizer for combinatorial optimization, which updates the solution construction process using a graph neural network and can adapt to varying circumstances and computational budgets."
}