{
    "title": "Detecting Anti-vaccine Content on Twitter using Multiple Message-Based Network Representations",
    "abstract": "arXiv:2402.18335v1 Announce Type: cross  Abstract: Social media platforms such as Twitter have a fundamental role in facilitating the spread and discussion of ideas online through the concept of retweeting and replying. However, these features also contribute to the spread of mis/disinformation during the vaccine rollout of the COVID-19 pandemic. Using COVID-19 vaccines as a case study, we analyse multiple social network representation derived from three message-based interactions on Twitter (quote retweets, mentions and replies) based upon a set of known anti-vax hashtags and keywords. Each network represents a certain hashtag or keyword which were labelled as \"controversial\" and \"non-controversial\" according to a small group of participants. For each network, we extract a combination of global and local network-based metrics which are used as feature vectors for binary classification. Our results suggest that it is possible to detect controversial from non-controversial terms with hi",
    "link": "https://arxiv.org/abs/2402.18335",
    "context": "Title: Detecting Anti-vaccine Content on Twitter using Multiple Message-Based Network Representations\nAbstract: arXiv:2402.18335v1 Announce Type: cross  Abstract: Social media platforms such as Twitter have a fundamental role in facilitating the spread and discussion of ideas online through the concept of retweeting and replying. However, these features also contribute to the spread of mis/disinformation during the vaccine rollout of the COVID-19 pandemic. Using COVID-19 vaccines as a case study, we analyse multiple social network representation derived from three message-based interactions on Twitter (quote retweets, mentions and replies) based upon a set of known anti-vax hashtags and keywords. Each network represents a certain hashtag or keyword which were labelled as \"controversial\" and \"non-controversial\" according to a small group of participants. For each network, we extract a combination of global and local network-based metrics which are used as feature vectors for binary classification. Our results suggest that it is possible to detect controversial from non-controversial terms with hi",
    "path": "papers/24/02/2402.18335.json",
    "total_tokens": 846,
    "translated_title": "在Twitter上利用多个基于消息的网络表示检测反疫苗内容",
    "translated_abstract": "社交媒体平台如Twitter在通过转推和回复的概念促进在线观点的传播和讨论方面起着基础作用。然而，这些功能也有助于在COVID-19大流行的疫苗推出期间传播误导信息。我们以COVID-19疫苗为案例研究，分析了来自Twitter上三种基于消息的互动的多个社交网络表征（引述转推、提及和回复），基于一组已知的反疫苗标签和关键词。每个网络代表了一个特定的标签或关键词，根据一小组参与者的标记，这些标签被标记为“有争议的”和“无争议的”。对于每个网络，我们提取了一组全局和局部基于网络的度量，将其用作二进制分类的特征向量。我们的结果表明，可能通过这些特征向量来检测有争议与无争议的术语。",
    "tldr": "分析了来自Twitter的多个社交网络表征，证明了通过全局和局部网络度量指标可以有效检测有争议和无争议的反疫苗标签和关键词",
    "en_tdlr": "Analyzed multiple social network representations derived from Twitter and showed that controversial and non-controversial anti-vax hashtags and keywords can be effectively detected using global and local network-based metrics."
}