{
    "title": "Inference Stage Denoising for Undersampled MRI Reconstruction",
    "abstract": "arXiv:2402.08692v1 Announce Type: cross Abstract: Reconstruction of magnetic resonance imaging (MRI) data has been positively affected by deep learning. A key challenge remains: to improve generalisation to distribution shifts between the training and testing data. Most approaches aim to address this via inductive design or data augmentation. However, they can be affected by misleading data, e.g. random noise, and cases where the inference stage data do not match assumptions in the modelled shifts. In this work, by employing a conditional hyperparameter network, we eliminate the need of augmentation, yet maintain robust performance under various levels of Gaussian noise. We demonstrate that our model withstands various input noise levels while producing high-definition reconstructions during the test stage. Moreover, we present a hyperparameter sampling strategy that accelerates the convergence of training. Our proposed method achieves the highest accuracy and image quality in all sett",
    "link": "https://arxiv.org/abs/2402.08692",
    "context": "Title: Inference Stage Denoising for Undersampled MRI Reconstruction\nAbstract: arXiv:2402.08692v1 Announce Type: cross Abstract: Reconstruction of magnetic resonance imaging (MRI) data has been positively affected by deep learning. A key challenge remains: to improve generalisation to distribution shifts between the training and testing data. Most approaches aim to address this via inductive design or data augmentation. However, they can be affected by misleading data, e.g. random noise, and cases where the inference stage data do not match assumptions in the modelled shifts. In this work, by employing a conditional hyperparameter network, we eliminate the need of augmentation, yet maintain robust performance under various levels of Gaussian noise. We demonstrate that our model withstands various input noise levels while producing high-definition reconstructions during the test stage. Moreover, we present a hyperparameter sampling strategy that accelerates the convergence of training. Our proposed method achieves the highest accuracy and image quality in all sett",
    "path": "papers/24/02/2402.08692.json",
    "total_tokens": 938,
    "translated_title": "稀疏采样MRI重构的推理阶段降噪",
    "translated_abstract": "磁共振成像（MRI）数据的重构受到深度学习的积极影响。然而，一个关键的挑战是改善对训练和测试数据之间分布变化的泛化能力。大多数方法通过归纳设计或数据增强来解决这个问题。然而，它们可能受到误导性数据（如随机噪声）和推理阶段数据与模型中假设的变化不匹配的影响。在本研究中，通过采用条件超参数网络，我们消除了对增强的需求，在各种高斯噪声水平下仍能保持稳健性能。我们证明了我们的模型能够经受各种输入噪声水平的考验，并在测试阶段产生高清晰度重构。此外，我们提出了一种超参数采样策略，加快了训练的收敛速度。我们提出的方法在所有设置中实现了最高的准确性和图像质量。",
    "tldr": "本文提出了一种在稀疏采样MRI重构过程中利用推理阶段降噪的方法，通过采用条件超参数网络，消除了数据增强的需求，并在各种噪声水平下保持稳健性能。实验表明该方法在测试阶段产生高清晰度重构，并在准确性和图像质量方面达到最佳效果。",
    "en_tdlr": "This paper proposes a method for denoising in the inference stage of undersampled MRI reconstruction, which eliminates the need for data augmentation by using a conditional hyperparameter network and maintains robust performance under various noise levels. Experiments demonstrate that the proposed method produces high-definition reconstructions during the test stage and achieves the highest accuracy and image quality."
}