{
    "title": "Designing deep neural networks for driver intention recognition",
    "abstract": "Driver intention recognition studies increasingly rely on deep neural networks. Deep neural networks have achieved top performance for many different tasks, but it is not a common practice to explicitly analyse the complexity and performance of the network's architecture. Therefore, this paper applies neural architecture search to investigate the effects of the deep neural network architecture on a real-world safety critical application with limited computational capabilities. We explore a pre-defined search space for three deep neural network layer types that are capable to handle sequential data (a long-short term memory, temporal convolution, and a time-series transformer layer), and the influence of different data fusion strategies on the driver intention recognition performance. A set of eight search strategies are evaluated for two driver intention recognition datasets. For the two datasets, we observed that there is no search strategy clearly sampling better deep neural network ",
    "link": "https://arxiv.org/abs/2402.05150",
    "context": "Title: Designing deep neural networks for driver intention recognition\nAbstract: Driver intention recognition studies increasingly rely on deep neural networks. Deep neural networks have achieved top performance for many different tasks, but it is not a common practice to explicitly analyse the complexity and performance of the network's architecture. Therefore, this paper applies neural architecture search to investigate the effects of the deep neural network architecture on a real-world safety critical application with limited computational capabilities. We explore a pre-defined search space for three deep neural network layer types that are capable to handle sequential data (a long-short term memory, temporal convolution, and a time-series transformer layer), and the influence of different data fusion strategies on the driver intention recognition performance. A set of eight search strategies are evaluated for two driver intention recognition datasets. For the two datasets, we observed that there is no search strategy clearly sampling better deep neural network ",
    "path": "papers/24/02/2402.05150.json",
    "total_tokens": 824,
    "translated_title": "设计用于司机意图识别的深度神经网络",
    "translated_abstract": "司机意图识别研究越来越多地依赖于深度神经网络。深度神经网络在许多不同的任务中取得了最优性能，但常常不常见地对网络架构的复杂性和性能进行显式分析。因此，本文应用神经架构搜索来研究深度神经网络架构对现实世界中具有有限计算能力的安全关键应用的影响。我们探索了一个预定义的搜索空间，其中包含三种能够处理序列数据的深度神经网络层类型（长短时记忆、时间卷积和时间序列转换层），以及不同数据融合策略对司机意图识别性能的影响。对于两个司机意图识别数据集，我们评估了八种搜索策略。对于这两个数据集，我们观察到没有明显的搜索策略比较好地采样深度神经网络。",
    "tldr": "本文研究了深度神经网络架构对司机意图识别性能的影响，并应用神经架构搜索方法进行探索，为具有有限计算能力的安全关键应用提供指导。",
    "en_tdlr": "This paper investigates the effect of deep neural network architecture on driver intention recognition performance and explores it using neural architecture search, providing guidance for safety-critical applications with limited computational capabilities."
}