{
    "title": "Model-Based Reinforcement Learning Control of Reaction-Diffusion Problems",
    "abstract": "arXiv:2402.14446v1 Announce Type: cross  Abstract: Mathematical and computational tools have proven to be reliable in decision-making processes. In recent times, in particular, machine learning-based methods are becoming increasingly popular as advanced support tools. When dealing with control problems, reinforcement learning has been applied to decision-making in several applications, most notably in games. The success of these methods in finding solutions to complex problems motivates the exploration of new areas where they can be employed to overcome current difficulties. In this paper, we explore the use of automatic control strategies to initial boundary value problems in thermal and disease transport. Specifically, in this work, we adapt an existing reinforcement learning algorithm using a stochastic policy gradient method and we introduce two novel reward functions to drive the flow of the transported field. The new model-based framework exploits the interactions between a react",
    "link": "https://arxiv.org/abs/2402.14446",
    "context": "Title: Model-Based Reinforcement Learning Control of Reaction-Diffusion Problems\nAbstract: arXiv:2402.14446v1 Announce Type: cross  Abstract: Mathematical and computational tools have proven to be reliable in decision-making processes. In recent times, in particular, machine learning-based methods are becoming increasingly popular as advanced support tools. When dealing with control problems, reinforcement learning has been applied to decision-making in several applications, most notably in games. The success of these methods in finding solutions to complex problems motivates the exploration of new areas where they can be employed to overcome current difficulties. In this paper, we explore the use of automatic control strategies to initial boundary value problems in thermal and disease transport. Specifically, in this work, we adapt an existing reinforcement learning algorithm using a stochastic policy gradient method and we introduce two novel reward functions to drive the flow of the transported field. The new model-based framework exploits the interactions between a react",
    "path": "papers/24/02/2402.14446.json",
    "total_tokens": 827,
    "translated_title": "基于模型的强化学习对反应扩散问题的控制",
    "translated_abstract": "数学和计算工具在决策过程中被证明是可靠的。特别是最近，基于机器学习的方法作为高级支持工具变得越来越受欢迎。处理控制问题时，强化学习已经被应用于多个应用中的决策过程，尤其是在游戏中。这些方法在解决复杂问题方面的成功激发了对能够克服当前困难的新领域的探索。在本文中，我们探讨了自动控制策略在热和疾病传输初始边界值问题中的应用。具体地，在这项工作中，我们使用随机策略梯度方法调整了现有的强化学习算法，并引入了两种新的奖励函数来驱动传输场的流动。新的基于模型的框架利用了反应传输",
    "tldr": "本文探索了使用自动控制策略处理热和疾病传输初始边界值问题，并通过引入新的奖励函数和改进的强化学习算法来驱动传输场的流动。"
}