{
    "title": "Stylized Facts of High-Frequency Bitcoin Time Series",
    "abstract": "arXiv:2402.11930v1 Announce Type: new  Abstract: This paper analyses the high-frequency intraday Bitcoin dataset from 2019 to 2022. During this time frame, the Bitcoin market index exhibited two distinct periods characterized by abrupt changes in volatility. The Bitcoin price returns for both periods can be described by an anomalous diffusion process, transitioning from subdiffusion for short intervals to weak superdiffusion over longer time intervals. The characteristic features related to this anomalous behavior studied in the present paper include heavy tails, which can be described using a $q$-Gaussian distribution and correlations. When we sample the autocorrelation of absolute returns, we observe a power-law relationship, indicating time dependency in both periods initially. The ensemble autocorrelation of returns decays rapidly and exhibits periodicity. We fitted the autocorrelation with a power law and a cosine function to capture both the decay and the fluctuation and found th",
    "link": "https://arxiv.org/abs/2402.11930",
    "context": "Title: Stylized Facts of High-Frequency Bitcoin Time Series\nAbstract: arXiv:2402.11930v1 Announce Type: new  Abstract: This paper analyses the high-frequency intraday Bitcoin dataset from 2019 to 2022. During this time frame, the Bitcoin market index exhibited two distinct periods characterized by abrupt changes in volatility. The Bitcoin price returns for both periods can be described by an anomalous diffusion process, transitioning from subdiffusion for short intervals to weak superdiffusion over longer time intervals. The characteristic features related to this anomalous behavior studied in the present paper include heavy tails, which can be described using a $q$-Gaussian distribution and correlations. When we sample the autocorrelation of absolute returns, we observe a power-law relationship, indicating time dependency in both periods initially. The ensemble autocorrelation of returns decays rapidly and exhibits periodicity. We fitted the autocorrelation with a power law and a cosine function to capture both the decay and the fluctuation and found th",
    "path": "papers/24/02/2402.11930.json",
    "total_tokens": 846,
    "translated_title": "高频比特币时间序列的风格化事实",
    "translated_abstract": "本文分析了2019年至2022年间的高频比特币日内数据集。在此期间，比特币市场指数表现出两个明显时期，其特征是波动性的突然变化。两个时期的比特币价格回报可用异常扩散过程来描述，从短时间间隔下的次扩散过渡到长时间间隔上的弱超扩散。本文研究的与这种异常行为相关的特征包括重尾，可以用$q$-高斯分布和相关性来描述。当对绝对回报的自相关进行取样时，我们观察到一种幂律关系，表明两个时期中最初存在时间依赖性。回报的整体自相关迅速衰减并表现出周期性。我们将自相关拟合为幂律和余弦函数，以捕捉衰减和波动，并发现了这两种函数的特征",
    "tldr": "本文研究了2019年至2022年间的高频比特币日内数据集，发现比特币价格回报表现出了两个不同时期的异常扩散过程，具有重尾特征和时间依赖性。"
}