{
    "title": "Contact Complexity in Customer Service",
    "abstract": "arXiv:2402.15655v1 Announce Type: cross  Abstract: Customers who reach out for customer service support may face a range of issues that vary in complexity. Routing high-complexity contacts to junior agents can lead to multiple transfers or repeated contacts, while directing low-complexity contacts to senior agents can strain their capacity to assist customers who need professional help. To tackle this, a machine learning model that accurately predicts the complexity of customer issues is highly desirable. However, defining the complexity of a contact is a difficult task as it is a highly abstract concept. While consensus-based data annotation by experienced agents is a possible solution, it is time-consuming and costly. To overcome these challenges, we have developed a novel machine learning approach to define contact complexity. Instead of relying on human annotation, we trained an AI expert model to mimic the behavior of agents and evaluate each contact's complexity based on how the ",
    "link": "https://arxiv.org/abs/2402.15655",
    "context": "Title: Contact Complexity in Customer Service\nAbstract: arXiv:2402.15655v1 Announce Type: cross  Abstract: Customers who reach out for customer service support may face a range of issues that vary in complexity. Routing high-complexity contacts to junior agents can lead to multiple transfers or repeated contacts, while directing low-complexity contacts to senior agents can strain their capacity to assist customers who need professional help. To tackle this, a machine learning model that accurately predicts the complexity of customer issues is highly desirable. However, defining the complexity of a contact is a difficult task as it is a highly abstract concept. While consensus-based data annotation by experienced agents is a possible solution, it is time-consuming and costly. To overcome these challenges, we have developed a novel machine learning approach to define contact complexity. Instead of relying on human annotation, we trained an AI expert model to mimic the behavior of agents and evaluate each contact's complexity based on how the ",
    "path": "papers/24/02/2402.15655.json",
    "total_tokens": 833,
    "translated_title": "客户服务中的联系复杂性",
    "translated_abstract": "联系客户服务支持的客户可能面临各种复杂程度不同的问题。将高复杂性的联系路由到初级代理可能导致多次转接或重复联系，而将低复杂性的联系路由到高级代理可能会使他们的专业帮助容量受到压力。为了解决这个问题，一种可以准确预测客户问题复杂性的机器学习模型至关重要。然而，定义联系的复杂性是一项困难的任务，因为它是一个高度抽象的概念。虽然经验代理进行基于共识的数据注释是一个可能的解决方案，但这需要耗费时间和金钱。为了克服这些障碍，我们开发了一种新颖的机器学习方法来定义联系复杂性。我们的方法不依赖于人工注释，而是训练一种AI专家模型来模拟代理的行为，并根据联系的行为评估每个联系的复杂性。",
    "tldr": "开发了一种新颖的机器学习方法来定义联系复杂性，通过训练AI专家模型来评估客户问题复杂性，避免了人工标注的时间和金钱成本。",
    "en_tdlr": "A novel machine learning approach was developed to define contact complexity by training an AI expert model to evaluate the complexity of customer issues, avoiding the time and cost of manual annotation."
}