{
    "title": "Multi-Generative Agent Collective Decision-Making in Urban Planning: A Case Study for Kendall Square Renovation",
    "abstract": "arXiv:2402.11314v1 Announce Type: cross  Abstract: In this study, we develop a multiple-generative agent system to simulate community decision-making for the redevelopment of Kendall Square's Volpe building. Drawing on interviews with local stakeholders, our simulations incorporated varying degrees of communication, demographic data, and life values in the agent prompts. The results revealed that communication among agents improved collective reasoning, while the inclusion of demographic and life values led to more distinct opinions. These findings highlight the potential application of AI in understanding complex social interactions and decision-making processes, offering valuable insights for urban planning and community engagement in diverse settings like Kendall Square.",
    "link": "https://arxiv.org/abs/2402.11314",
    "context": "Title: Multi-Generative Agent Collective Decision-Making in Urban Planning: A Case Study for Kendall Square Renovation\nAbstract: arXiv:2402.11314v1 Announce Type: cross  Abstract: In this study, we develop a multiple-generative agent system to simulate community decision-making for the redevelopment of Kendall Square's Volpe building. Drawing on interviews with local stakeholders, our simulations incorporated varying degrees of communication, demographic data, and life values in the agent prompts. The results revealed that communication among agents improved collective reasoning, while the inclusion of demographic and life values led to more distinct opinions. These findings highlight the potential application of AI in understanding complex social interactions and decision-making processes, offering valuable insights for urban planning and community engagement in diverse settings like Kendall Square.",
    "path": "papers/24/02/2402.11314.json",
    "total_tokens": 767,
    "translated_title": "多生成代理集体决策在城市规划中的应用：Kendall Square改造案例研究",
    "translated_abstract": "在这项研究中，我们开发了一个多生成代理系统，用于模拟 Kendall Square Volpe 大厦改造的社区决策过程。通过与当地利益相关者的访谈，我们的模拟结合了不同程度的沟通、人口统计数据和生活价值在代理提示中的应用。结果显示，代理之间的沟通改善了集体推理，而包含人口统计数据和生活价值导致了更明显的意见分歧。这些发现凸显了人工智能在理解复杂社会互动和决策过程中的潜在应用，为城市规划和 Kendall Square 等多样化环境中的社区参与提供了宝贵的见解。",
    "tldr": "多生成代理系统在城市规划中模拟社区决策，发现沟通有助于集体推理，而包含人口统计数据和生活价值导致意见分歧。这为城市规划和社区参与提供了有价值的见解。",
    "en_tdlr": "A multi-generative agent system simulates community decision-making in urban planning, finding that communication enhances collective reasoning, while incorporating demographic and life values leads to divergent opinions, offering valuable insights for urban planning and community engagement."
}