{
    "title": "Representation learning in multiplex graphs: Where and how to fuse information?",
    "abstract": "arXiv:2402.17906v1 Announce Type: new  Abstract: In recent years, unsupervised and self-supervised graph representation learning has gained popularity in the research community. However, most proposed methods are focused on homogeneous networks, whereas real-world graphs often contain multiple node and edge types. Multiplex graphs, a special type of heterogeneous graphs, possess richer information, provide better modeling capabilities and integrate more detailed data from potentially different sources. The diverse edge types in multiplex graphs provide more context and insights into the underlying processes of representation learning. In this paper, we tackle the problem of learning representations for nodes in multiplex networks in an unsupervised or self-supervised manner. To that end, we explore diverse information fusion schemes performed at different levels of the graph processing pipeline. The detailed analysis and experimental evaluation of various scenarios inspired us to propo",
    "link": "https://arxiv.org/abs/2402.17906",
    "context": "Title: Representation learning in multiplex graphs: Where and how to fuse information?\nAbstract: arXiv:2402.17906v1 Announce Type: new  Abstract: In recent years, unsupervised and self-supervised graph representation learning has gained popularity in the research community. However, most proposed methods are focused on homogeneous networks, whereas real-world graphs often contain multiple node and edge types. Multiplex graphs, a special type of heterogeneous graphs, possess richer information, provide better modeling capabilities and integrate more detailed data from potentially different sources. The diverse edge types in multiplex graphs provide more context and insights into the underlying processes of representation learning. In this paper, we tackle the problem of learning representations for nodes in multiplex networks in an unsupervised or self-supervised manner. To that end, we explore diverse information fusion schemes performed at different levels of the graph processing pipeline. The detailed analysis and experimental evaluation of various scenarios inspired us to propo",
    "path": "papers/24/02/2402.17906.json",
    "total_tokens": 785,
    "translated_title": "多重图中的表示学习：信息融合的何处和如何？",
    "translated_abstract": "近年来，无监督和自监督图表示学习在研究界日益受到关注。然而，大多数方法专注于同质网络，而现实世界中的图通常包含多种节点和边类型。多重图是一种特殊的异质图，拥有更丰富的信息，提供更好的建模能力，并整合来自潜在不同来源的更详细数据。多重图中的多样边类型提供了更多的上下文和洞察力，有助于理解表示学习的基本过程。本文解决了在无监督或自监督方式下学习多重网络中节点表示的问题。为此，我们探索了在图处理管道的不同级别上执行的多样信息融合方案。通过详细的分析和实验评估，我们提出了",
    "tldr": "在多重图中，该论文研究了如何在无监督或自监督学习的情况下学习节点的表示，并探讨了不同级别的信息融合方案。",
    "en_tdlr": "This paper investigates how to learn representations for nodes in multiplex networks in unsupervised or self-supervised learning scenarios, exploring diverse information fusion schemes performed at different levels."
}