{
    "title": "Screening method for early dementia using sound objects as voice biomarkers",
    "abstract": "Introduction: We present a screening method for early dementia using features based on sound objects as voice biomarkers.   Methods: The final dataset used for machine learning models consisted of 266 observations, with a distribution of 186 healthy individuals, 46 diagnosed with Alzheimer's, and 34 with MCI. This method is based on six-second recordings of the sustained vowel /a/ spoken by the subject. The main original contribution of this work is the use of carefully crafted features based on sound objects. This approach allows one to first represent the sound spectrum in a more accurate way than the standard spectrum, and then build interpretable features containing relevant information about subjects' control over their voice.   Results: ROC AUC obtained in this work for distinguishing healthy subjects from those with MCI was 0.85, while accuracy was 0.76. For distinguishing between healthy subjects and those with either MCI or Alzheimer's the results were 0.84, 0.77, respectively",
    "link": "https://rss.arxiv.org/abs/2402.00897",
    "context": "Title: Screening method for early dementia using sound objects as voice biomarkers\nAbstract: Introduction: We present a screening method for early dementia using features based on sound objects as voice biomarkers.   Methods: The final dataset used for machine learning models consisted of 266 observations, with a distribution of 186 healthy individuals, 46 diagnosed with Alzheimer's, and 34 with MCI. This method is based on six-second recordings of the sustained vowel /a/ spoken by the subject. The main original contribution of this work is the use of carefully crafted features based on sound objects. This approach allows one to first represent the sound spectrum in a more accurate way than the standard spectrum, and then build interpretable features containing relevant information about subjects' control over their voice.   Results: ROC AUC obtained in this work for distinguishing healthy subjects from those with MCI was 0.85, while accuracy was 0.76. For distinguishing between healthy subjects and those with either MCI or Alzheimer's the results were 0.84, 0.77, respectively",
    "path": "papers/24/02/2402.00897.json",
    "total_tokens": 993,
    "translated_title": "使用声音对象作为声音生物标志物的早期痴呆筛查方法",
    "translated_abstract": "引言：我们提出了一种使用基于声音对象的特征作为声音生物标志物的早期痴呆筛查方法。方法：用于机器学习模型的最终数据集包括266个观察值，其中分布了186个健康个体，46个被诊断为阿尔茨海默病，34个被诊断为轻度认知障碍。这种方法基于被试者发出的/a/持续元音的六秒录音。本研究的主要原创贡献是使用基于声音对象的精心设计的特征。这种方法首先以比标准频谱更准确的方式表示声音谱，然后构建包含与被试者对声音的控制有关的有意义信息的可解释特征。结果：该方法在将健康个体与轻度认知障碍个体区分的ROC AUC为0.85，准确率为0.76。在将健康个体与轻度认知障碍或阿尔茨海默病个体区分的结果为0.84和0.77。",
    "tldr": "本研究提出了一种使用声音对象作为声音生物标志物的早期痴呆筛查方法。该方法基于精心设计的特征，能准确地表示声音谱，并包含与被试者对声音的控制有关的有意义信息。实验结果表明，该方法能够有效区分健康个体与轻度认知障碍或阿尔茨海默病个体。",
    "en_tdlr": "This paper presents a screening method for early dementia using sound objects as voice biomarkers. The method utilizes carefully crafted features to accurately represent the sound spectrum and provide meaningful information about subjects' control over their voice. The results demonstrate the effectiveness of the method in distinguishing between healthy individuals and those with mild cognitive impairment or Alzheimer's disease."
}