{
    "title": "Generating Universal Adversarial Perturbations for Quantum Classifiers",
    "abstract": "Quantum Machine Learning (QML) has emerged as a promising field of research, aiming to leverage the capabilities of quantum computing to enhance existing machine learning methodologies. Recent studies have revealed that, like their classical counterparts, QML models based on Parametrized Quantum Circuits (PQCs) are also vulnerable to adversarial attacks. Moreover, the existence of Universal Adversarial Perturbations (UAPs) in the quantum domain has been demonstrated theoretically in the context of quantum classifiers. In this work, we introduce QuGAP: a novel framework for generating UAPs for quantum classifiers. We conceptualize the notion of additive UAPs for PQC-based classifiers and theoretically demonstrate their existence. We then utilize generative models (QuGAP-A) to craft additive UAPs and experimentally show that quantum classifiers are susceptible to such attacks. Moreover, we formulate a new method for generating unitary UAPs (QuGAP-U) using quantum generative models and a ",
    "link": "https://arxiv.org/abs/2402.08648",
    "context": "Title: Generating Universal Adversarial Perturbations for Quantum Classifiers\nAbstract: Quantum Machine Learning (QML) has emerged as a promising field of research, aiming to leverage the capabilities of quantum computing to enhance existing machine learning methodologies. Recent studies have revealed that, like their classical counterparts, QML models based on Parametrized Quantum Circuits (PQCs) are also vulnerable to adversarial attacks. Moreover, the existence of Universal Adversarial Perturbations (UAPs) in the quantum domain has been demonstrated theoretically in the context of quantum classifiers. In this work, we introduce QuGAP: a novel framework for generating UAPs for quantum classifiers. We conceptualize the notion of additive UAPs for PQC-based classifiers and theoretically demonstrate their existence. We then utilize generative models (QuGAP-A) to craft additive UAPs and experimentally show that quantum classifiers are susceptible to such attacks. Moreover, we formulate a new method for generating unitary UAPs (QuGAP-U) using quantum generative models and a ",
    "path": "papers/24/02/2402.08648.json",
    "total_tokens": 820,
    "translated_title": "为量子分类器生成通用对抗扰动",
    "translated_abstract": "量子机器学习（QML）作为一个有前景的研究领域已经出现，旨在利用量子计算的能力来增强现有的机器学习方法。最近的研究发现，像经典的模型一样，基于参数化量子电路（PQC）的QML模型也容易受到对抗性攻击。此外，在量子领域，理论上已经证明了存在通用对抗扰动（UAP），并且已在量子分类器的背景下进行了实证研究。在这项工作中，我们引入了QuGAP：一个为量子分类器生成UAP的新框架。我们对基于PQC的分类器的加性UAP的概念进行了理论上的证明，并通过概率模型（QuGAP-A）来制造加性UAP，并实验证明了量子分类器容易受到这类攻击。此外，我们提出了一种使用量子生成模型和压缩方法生成幺正UAP的新方法（QuGAP-U），并且进行了实验验证。",
    "tldr": "这项工作引入了QuGAP-一个用于生成量子分类器的通用对抗扰动的新框架，并通过实验证明了量子分类器容易受到这些攻击。"
}