{
    "title": "An Automated End-to-End Open-Source Software for High-Quality Text-to-Speech Dataset Generation",
    "abstract": "arXiv:2402.16380v1 Announce Type: cross  Abstract: Data availability is crucial for advancing artificial intelligence applications, including voice-based technologies. As content creation, particularly in social media, experiences increasing demand, translation and text-to-speech (TTS) technologies have become essential tools. Notably, the performance of these TTS technologies is highly dependent on the quality of the training data, emphasizing the mutual dependence of data availability and technological progress. This paper introduces an end-to-end tool to generate high-quality datasets for text-to-speech (TTS) models to address this critical need for high-quality data. The contributions of this work are manifold and include: the integration of language-specific phoneme distribution into sample selection, automation of the recording process, automated and human-in-the-loop quality assurance of recordings, and processing of recordings to meet specified formats. The proposed application",
    "link": "https://arxiv.org/abs/2402.16380",
    "context": "Title: An Automated End-to-End Open-Source Software for High-Quality Text-to-Speech Dataset Generation\nAbstract: arXiv:2402.16380v1 Announce Type: cross  Abstract: Data availability is crucial for advancing artificial intelligence applications, including voice-based technologies. As content creation, particularly in social media, experiences increasing demand, translation and text-to-speech (TTS) technologies have become essential tools. Notably, the performance of these TTS technologies is highly dependent on the quality of the training data, emphasizing the mutual dependence of data availability and technological progress. This paper introduces an end-to-end tool to generate high-quality datasets for text-to-speech (TTS) models to address this critical need for high-quality data. The contributions of this work are manifold and include: the integration of language-specific phoneme distribution into sample selection, automation of the recording process, automated and human-in-the-loop quality assurance of recordings, and processing of recordings to meet specified formats. The proposed application",
    "path": "papers/24/02/2402.16380.json",
    "total_tokens": 829,
    "translated_title": "一种用于生成高质量文本转语音数据集的自动化端到端开源软件",
    "translated_abstract": "数据的可用性对推动人工智能应用至关重要，包括基于语音的技术。随着内容创作的需求增加，尤其是社交媒体上的内容，翻译和文本转语音（TTS）技术已经成为必不可少的工具。本文介绍了一种端到端工具，用于生成高质量的文本转语音（TTS）模型数据集，以解决对高质量数据的急切需求。本作品的贡献多方面，包括：将语言特定的语音分布整合到样本选择中，自动化录制过程，自动化和人机协作的录音质量保证，以及处理录音以满足指定格式。",
    "tldr": "该论文介绍了一种端到端工具，用于生成高质量的文本转语音（TTS）模型数据集，实现了语言特定的语音分布整合、自动化录制过程、自动化和人机协作的录音质量保证以及录音格式处理。",
    "en_tdlr": "This paper introduces an end-to-end tool for generating high-quality datasets for text-to-speech (TTS) models, with contributions including the integration of language-specific phoneme distribution into sample selection, automation of the recording process, automated and human-in-the-loop quality assurance of recordings, and processing of recordings to meet specified formats."
}