{
    "title": "Scheduling for On-Board Federated Learning with Satellite Clusters",
    "abstract": "arXiv:2402.09105v1 Announce Type: cross Abstract: Mega-constellations of small satellites have evolved into a source of massive amount of valuable data. To manage this data efficiently, on-board federated learning (FL) enables satellites to train a machine learning (ML) model collaboratively without having to share the raw data. This paper introduces a scheme for scheduling on-board FL for constellations connected with intra-orbit inter-satellite links. The proposed scheme utilizes the predictable visibility pattern between satellites and ground station (GS), both at the individual satellite level and cumulatively within the entire orbit, to mitigate intermittent connectivity and best use of available time. To this end, two distinct schedulers are employed: one for coordinating the FL procedures among orbits, and the other for controlling those within each orbit. These two schedulers cooperatively determine the appropriate time to perform global updates in GS and then allocate suitable",
    "link": "https://arxiv.org/abs/2402.09105",
    "context": "Title: Scheduling for On-Board Federated Learning with Satellite Clusters\nAbstract: arXiv:2402.09105v1 Announce Type: cross Abstract: Mega-constellations of small satellites have evolved into a source of massive amount of valuable data. To manage this data efficiently, on-board federated learning (FL) enables satellites to train a machine learning (ML) model collaboratively without having to share the raw data. This paper introduces a scheme for scheduling on-board FL for constellations connected with intra-orbit inter-satellite links. The proposed scheme utilizes the predictable visibility pattern between satellites and ground station (GS), both at the individual satellite level and cumulatively within the entire orbit, to mitigate intermittent connectivity and best use of available time. To this end, two distinct schedulers are employed: one for coordinating the FL procedures among orbits, and the other for controlling those within each orbit. These two schedulers cooperatively determine the appropriate time to perform global updates in GS and then allocate suitable",
    "path": "papers/24/02/2402.09105.json",
    "total_tokens": 847,
    "translated_title": "卫星集群上的机载联邦学习调度",
    "translated_abstract": "小卫星的大规模星座已经成为大量宝贵数据的来源。为了高效管理这些数据，机载联邦学习（FL）允许卫星在不共享原始数据的情况下进行机器学习模型的协同训练。本文介绍了一种用于连接星座内部轨道间卫星的机载FL调度方案。所提方案利用了卫星与地面站之间的可预测可见性模式，包括个别卫星级别和整个轨道范围内的模式，以减轻间歇性连接问题，最大限度地利用可用时间。为此，本文采用了两个不同的调度程序：一个用于协调轨道之间的FL过程，另一个用于控制每个轨道内部的FL过程。这两个调度程序共同确定在地面站执行全局更新的适当时间，并分配合适的时间进行本地更新。",
    "tldr": "本文提出了一种用于卫星集群上的机载联邦学习调度方案，利用可预测的可见性模式来解决间歇性连接问题，实现高效的数据管理和机器学习模型协同训练。",
    "en_tdlr": "This paper proposes a scheduling scheme for on-board federated learning in satellite clusters, utilizing predictable visibility patterns to address intermittent connectivity issues and enable efficient data management and collaborative training of machine learning models."
}