{
    "title": "Barriers to Collusion-resistant Transaction Fee Mechanisms",
    "abstract": "To allocate transactions to blocks, cryptocurrencies use an auction-like transaction fee mechanism (TFM). A conjecture of Roughgarden [44] asks whether there is a TFM that is incentive compatible for both the users and the miner, and is also resistant to off-chain agreements (OCAs) between these parties, a collusion notion that captures the ability of users and the miner to jointly deviate for profit. The work of Chung and Shi [12] tackles the problem using the different collusion resistance notion of side-channel proofness (SCP), and shows an impossibility given this notion. We show that OCA-proofness and SCP are different, with SCP being strictly stronger. We then fully characterize the intersection of deterministic dominant strategy incentive-compatible (DSIC) and OCA-proof mechanisms, as well as deterministic MMIC and OCA-proof ones, and use this characterization to show that only the trivial mechanism is DSIC, myopic miner incentive-compatible (MMIC) and OCA-proof. We also show th",
    "link": "https://arxiv.org/abs/2402.08564",
    "context": "Title: Barriers to Collusion-resistant Transaction Fee Mechanisms\nAbstract: To allocate transactions to blocks, cryptocurrencies use an auction-like transaction fee mechanism (TFM). A conjecture of Roughgarden [44] asks whether there is a TFM that is incentive compatible for both the users and the miner, and is also resistant to off-chain agreements (OCAs) between these parties, a collusion notion that captures the ability of users and the miner to jointly deviate for profit. The work of Chung and Shi [12] tackles the problem using the different collusion resistance notion of side-channel proofness (SCP), and shows an impossibility given this notion. We show that OCA-proofness and SCP are different, with SCP being strictly stronger. We then fully characterize the intersection of deterministic dominant strategy incentive-compatible (DSIC) and OCA-proof mechanisms, as well as deterministic MMIC and OCA-proof ones, and use this characterization to show that only the trivial mechanism is DSIC, myopic miner incentive-compatible (MMIC) and OCA-proof. We also show th",
    "path": "papers/24/02/2402.08564.json",
    "total_tokens": 897,
    "translated_title": "防止勾结的交易费机制的障碍",
    "translated_abstract": "加密货币使用类似拍卖的交易费机制（TFM）来分配交易到区块。Roughgarden [44]的猜想问是否存在一种TFM，既对用户又对矿工具有激励兼容，并且还对用户和矿工之间的离线协议（OCAs）具有抵抗能力，这种合谋概念捕捉了用户和矿工共同为了利润而联合偏离的能力。Chung和Shi [12]的工作使用了不同的合谋抵抗概念——侧信道证明（SCP），并且在这个概念下证明了不可能性。我们表明OCA-proofness和SCP是不同的，其中SCP更加强大。然后我们完全表征了确定性主导策略激励兼容（DSIC）和OCA-proof机制的交集，以及确定性MMIC和OCA-proof机制的交集，并利用这个表征来证明只有平凡的机制是DSIC、迷失的矿工激励兼容（MMIC）和OCA-proof。我们还展示了...",
    "tldr": "本论文研究了防止勾结的交易费机制在实施上的难题，其中包括了不同的合谋抵抗概念和其对确定性主导策略激励兼容的影响。",
    "en_tdlr": "This paper examines the challenges in implementing collusion-resistant transaction fee mechanisms, including different collusion resistance notions and their impact on deterministic dominant strategy incentive compatibility."
}