{
    "title": "The Fourier-Malliavin Volatility (FMVol) MATLAB library",
    "abstract": "This paper presents the Fourier-Malliavin Volatility (FMVol) estimation library for MATLAB. This library includes functions that implement Fourier- Malliavin estimators (see Malliavin and Mancino (2002, 2009)) of the volatility and co-volatility of continuous stochastic volatility processes and second-order quantities, like the quarticity (the squared volatility), the volatility of volatility and the leverage (the covariance between changes in the process and changes in its volatility). The Fourier-Malliavin method is fully non-parametric, does not require equally-spaced observations and is robust to measurement errors, or noise, without any preliminary bias correction or pre-treatment of the observations. Further, in its multivariate version, it is intrinsically robust to irregular and asynchronous sampling. Although originally introduced for a specific application in financial econometrics, namely the estimation of asset volatilities, the Fourier-Malliavin method is a general method ",
    "link": "https://arxiv.org/abs/2402.00172",
    "context": "Title: The Fourier-Malliavin Volatility (FMVol) MATLAB library\nAbstract: This paper presents the Fourier-Malliavin Volatility (FMVol) estimation library for MATLAB. This library includes functions that implement Fourier- Malliavin estimators (see Malliavin and Mancino (2002, 2009)) of the volatility and co-volatility of continuous stochastic volatility processes and second-order quantities, like the quarticity (the squared volatility), the volatility of volatility and the leverage (the covariance between changes in the process and changes in its volatility). The Fourier-Malliavin method is fully non-parametric, does not require equally-spaced observations and is robust to measurement errors, or noise, without any preliminary bias correction or pre-treatment of the observations. Further, in its multivariate version, it is intrinsically robust to irregular and asynchronous sampling. Although originally introduced for a specific application in financial econometrics, namely the estimation of asset volatilities, the Fourier-Malliavin method is a general method ",
    "path": "papers/24/02/2402.00172.json",
    "total_tokens": 849,
    "translated_title": "The Fourier-Malliavin Volatility (FMVol) MATLAB库",
    "translated_abstract": "本文介绍了用于MATLAB的Fourier-Malliavin Volatility (FMVol)估计库。该库包括实现连续随机波动性过程和二阶量（如方差的平方、波动性的波动性和变化过程与波动性变化之间的协方差）的波动性和共波动性的Fourier-Malliavin估计器的函数（参见Malliavin and Mancino (2002, 2009)）。Fourier-Malliavin方法完全是非参数的，不需要等间隔观测，并且对测量误差或噪声具有鲁棒性，不需要任何预处理或观测的预处理。此外，在多变量版本中，它本质上对非规则和异步采样具有鲁棒性。尽管最初是针对金融计量学中的特定应用，即资产波动性的估计，但Fourier-Malliavin方法是一种通用方法。",
    "tldr": "本文介绍了用于MATLAB的Fourier-Malliavin Volatility (FMVol)估计库，该库实现了非参数的波动性和共波动性估计方法，并适用于连续随机波动性过程和二阶量的估计。"
}