{
    "title": "ZeroG: Investigating Cross-dataset Zero-shot Transferability in Graphs",
    "abstract": "arXiv:2402.11235v1 Announce Type: new  Abstract: With the development of foundation models such as large language models, zero-shot transfer learning has become increasingly significant. This is highlighted by the generative capabilities of NLP models like GPT-4, and the retrieval-based approaches of CV models like CLIP, both of which effectively bridge the gap between seen and unseen data. In the realm of graph learning, the continuous emergence of new graphs and the challenges of human labeling also amplify the necessity for zero-shot transfer learning, driving the exploration of approaches that can generalize across diverse graph data without necessitating dataset-specific and label-specific fine-tuning. In this study, we extend such paradigms to zero-shot transferability in graphs by introducing ZeroG, a new framework tailored to enable cross-dataset generalization. Addressing the inherent challenges such as feature misalignment, mismatched label spaces, and negative transfer, we l",
    "link": "https://arxiv.org/abs/2402.11235",
    "context": "Title: ZeroG: Investigating Cross-dataset Zero-shot Transferability in Graphs\nAbstract: arXiv:2402.11235v1 Announce Type: new  Abstract: With the development of foundation models such as large language models, zero-shot transfer learning has become increasingly significant. This is highlighted by the generative capabilities of NLP models like GPT-4, and the retrieval-based approaches of CV models like CLIP, both of which effectively bridge the gap between seen and unseen data. In the realm of graph learning, the continuous emergence of new graphs and the challenges of human labeling also amplify the necessity for zero-shot transfer learning, driving the exploration of approaches that can generalize across diverse graph data without necessitating dataset-specific and label-specific fine-tuning. In this study, we extend such paradigms to zero-shot transferability in graphs by introducing ZeroG, a new framework tailored to enable cross-dataset generalization. Addressing the inherent challenges such as feature misalignment, mismatched label spaces, and negative transfer, we l",
    "path": "papers/24/02/2402.11235.json",
    "total_tokens": 846,
    "translated_title": "ZeroG：探究图中跨数据集零射击可迁移性",
    "translated_abstract": "随着如GPT-4这样的大型语言模型的发展，零射击迁移学习变得越来越重要。NLP模型的生成能力和CV模型的基于检索的方法突显了这一点，二者有效地弥合了已见数据和未见数据之间的差距。在图学习领域，新图的不断涌现和人类标注的挑战也加剧了零射击迁移学习的必要性，推动了探索能够在不需要特定数据集和标签特定微调的情况下泛化跨多样图数据的方法。在本研究中，我们通过引入ZeroG，一个旨在实现跨数据集泛化的新框架，将这样的范例扩展到了图中的零射击迁移性。解决诸如特征不对齐、不匹配的标签空间和负迁移等固有挑战。",
    "tldr": "ZeroG是一个新框架，旨在实现图中跨数据集零射击迁移，解决了特征不对齐、标签空间不匹配和负迁移等挑战",
    "en_tdlr": "ZeroG is a new framework aimed at achieving cross-dataset zero-shot transferability in graphs, addressing challenges such as feature misalignment, mismatched label spaces, and negative transfer."
}