{
    "title": "CounterCLR: Counterfactual Contrastive Learning with Non-random Missing Data in Recommendation",
    "abstract": "Recommender systems are designed to learn user preferences from observed feedback and comprise many fundamental tasks, such as rating prediction and post-click conversion rate (pCVR) prediction. However, the observed feedback usually suffer from two issues: selection bias and data sparsity, where biased and insufficient feedback seriously degrade the performance of recommender systems in terms of accuracy and ranking. Existing solutions for handling the issues, such as data imputation and inverse propensity score, are highly susceptible to additional trained imputation or propensity models. In this work, we propose a novel counterfactual contrastive learning framework for recommendation, named CounterCLR, to tackle the problem of non-random missing data by exploiting the advances in contrast learning. Specifically, the proposed CounterCLR employs a deep representation network, called CauNet, to infer non-random missing data in recommendations and perform user preference modeling by fur",
    "link": "https://arxiv.org/abs/2402.05740",
    "context": "Title: CounterCLR: Counterfactual Contrastive Learning with Non-random Missing Data in Recommendation\nAbstract: Recommender systems are designed to learn user preferences from observed feedback and comprise many fundamental tasks, such as rating prediction and post-click conversion rate (pCVR) prediction. However, the observed feedback usually suffer from two issues: selection bias and data sparsity, where biased and insufficient feedback seriously degrade the performance of recommender systems in terms of accuracy and ranking. Existing solutions for handling the issues, such as data imputation and inverse propensity score, are highly susceptible to additional trained imputation or propensity models. In this work, we propose a novel counterfactual contrastive learning framework for recommendation, named CounterCLR, to tackle the problem of non-random missing data by exploiting the advances in contrast learning. Specifically, the proposed CounterCLR employs a deep representation network, called CauNet, to infer non-random missing data in recommendations and perform user preference modeling by fur",
    "path": "papers/24/02/2402.05740.json",
    "total_tokens": 723,
    "translated_title": "CounterCLR: 推荐中具有非随机缺失数据的反事实对比学习",
    "translated_abstract": "推荐系统的观测反馈通常存在选择偏差和数据稀疏等问题，这严重影响了准确性和排名等性能。本研究提出了一种新颖的反事实对比学习框架——CounterCLR，通过利用对比学习的进展来解决非随机缺失数据的问题。具体而言，CounterCLR采用了一个称为CauNet的深度表示网络，推断推荐中的非随机缺失数据，并进行用户偏好建模。",
    "tldr": "CounterCLR是一种处理推荐系统中非随机缺失数据的反事实对比学习框架，通过利用对比学习的进展，采用深度表示网络CauNet来推断缺失数据并进行用户偏好建模。",
    "en_tdlr": "CounterCLR is a counterfactual contrastive learning framework for handling non-random missing data in recommender systems, which utilizes advances in contrastive learning and employs a deep representation network called CauNet to infer missing data and model user preferences."
}