{
    "title": "Combining shape and contour features to improve tool wear monitoring in milling processes",
    "abstract": "In this paper, a new system based on combinations of a shape descriptor and a contour descriptor has been proposed for classifying inserts in milling processes according to their wear level following a computer vision based approach. To describe the wear region shape we have proposed a new descriptor called ShapeFeat and its contour has been characterized using the method BORCHIZ that, to the best of our knowledge, achieves the best performance for tool wear monitoring following a computer vision-based approach. Results show that the combination of BORCHIZ with ShapeFeat using a late fusion method improves the classification performance significantly, obtaining an accuracy of 91.44% in the binary classification (i.e. the classification of the wear as high or low) and 82.90% using three target classes (i.e. classification of the wear as high, medium or low). These results outperform the ones obtained by both descriptors used on their own, which achieve accuracies of 88.70 and 80.67% for",
    "link": "https://arxiv.org/abs/2402.05978",
    "context": "Title: Combining shape and contour features to improve tool wear monitoring in milling processes\nAbstract: In this paper, a new system based on combinations of a shape descriptor and a contour descriptor has been proposed for classifying inserts in milling processes according to their wear level following a computer vision based approach. To describe the wear region shape we have proposed a new descriptor called ShapeFeat and its contour has been characterized using the method BORCHIZ that, to the best of our knowledge, achieves the best performance for tool wear monitoring following a computer vision-based approach. Results show that the combination of BORCHIZ with ShapeFeat using a late fusion method improves the classification performance significantly, obtaining an accuracy of 91.44% in the binary classification (i.e. the classification of the wear as high or low) and 82.90% using three target classes (i.e. classification of the wear as high, medium or low). These results outperform the ones obtained by both descriptors used on their own, which achieve accuracies of 88.70 and 80.67% for",
    "path": "papers/24/02/2402.05978.json",
    "total_tokens": 905,
    "translated_title": "结合形状和轮廓特征来提高铣削过程中的刀具磨损监测",
    "translated_abstract": "本文提出了一种新的基于形状描述符和轮廓描述符组合的系统，用于根据磨损程度对铣削过程中的插入物进行分类，采用基于计算机视觉的方法。为了描述磨损区域的形状，我们提出了一种新的描述符ShapeFeat，并使用BORCHIZ方法对其轮廓进行表征，根据我们的调查，该方法在基于计算机视觉的刀具磨损监测中取得了最佳性能。实验结果表明，使用后期融合方法将BORCHIZ和ShapeFeat组合在一起，显著提高了分类性能，二元分类将磨损分为高或低的准确率达到91.44%，三个目标类别（高、中、低磨损）的准确率达到82.90%。这些结果优于单独使用两个描述符的结果，其准确率分别为88.70%和80.67%。",
    "tldr": "本文提出了一种新的系统，结合了形状描述符和轮廓描述符，用于铣削过程中插入物的磨损监测。实验结果表明，使用后期融合方法将两个描述符组合在一起，可以显著提高分类性能，取得更好的准确率。"
}