{
    "title": "Fast Online Changepoint Detection",
    "abstract": "We study online changepoint detection in the context of a linear regression model. We propose a class of heavily weighted statistics based on the CUSUM process of the regression residuals, which are specifically designed to ensure timely detection of breaks occurring early on during the monitoring horizon. We subsequently propose a class of composite statistics, constructed using different weighing schemes; the decision rule to mark a changepoint is based on the largest statistic across the various weights, thus effectively working like a veto-based voting mechanism, which ensures fast detection irrespective of the location of the changepoint. Our theory is derived under a very general form of weak dependence, thus being able to apply our tests to virtually all time series encountered in economics, medicine, and other applied sciences. Monte Carlo simulations show that our methodologies are able to control the procedure-wise Type I Error, and have short detection delays in the presence",
    "link": "https://arxiv.org/abs/2402.04433",
    "context": "Title: Fast Online Changepoint Detection\nAbstract: We study online changepoint detection in the context of a linear regression model. We propose a class of heavily weighted statistics based on the CUSUM process of the regression residuals, which are specifically designed to ensure timely detection of breaks occurring early on during the monitoring horizon. We subsequently propose a class of composite statistics, constructed using different weighing schemes; the decision rule to mark a changepoint is based on the largest statistic across the various weights, thus effectively working like a veto-based voting mechanism, which ensures fast detection irrespective of the location of the changepoint. Our theory is derived under a very general form of weak dependence, thus being able to apply our tests to virtually all time series encountered in economics, medicine, and other applied sciences. Monte Carlo simulations show that our methodologies are able to control the procedure-wise Type I Error, and have short detection delays in the presence",
    "path": "papers/24/02/2402.04433.json",
    "total_tokens": 994,
    "translated_title": "快速在线变点检测",
    "translated_abstract": "我们研究在线变点检测在线性回归模型的背景下。我们提出了一类基于回归残差的累积和（CUSUM）过程的高加权统计量，这些统计量专门设计用于确保在监测时间段的早期及时检测到变点。我们随后提出了一类复合统计量，使用不同的加权方案构造；标记变点的决策规则基于各个权重中最大的统计量，从而有效地像否决制投票机制一样工作，确保无论变点位置在哪里，都能快速检测到。我们的理论推导基于一种非常普遍的弱相关性形式，因此能够将我们的测试应用于经济学、医学和其他应用科学中遇到的几乎所有时间序列。蒙特卡罗模拟表明，我们的方法能够控制程序级别的I型错误，并且在存在变点时具有较短的检测延迟。",
    "tldr": "该论文研究了在线变点检测在线性回归模型中的应用，并提出了一种基于CUSUM过程的高加权统计量，以确保及时检测到早期发生的变点。通过使用不同的加权方案构造复合统计量，并使用最大统计量作为标记变点的决策规则，实现了快速检测无论变点位置在哪里。此方法适用于几乎所有经济学、医学和其他应用科学中的时间序列。在蒙特卡罗模拟中验证了方法的有效性。",
    "en_tdlr": "This paper studies the application of online changepoint detection in a linear regression model and proposes a heavily weighted statistic based on the CUSUM process for timely detection of early changepoints. Using a combination of weighing schemes and a veto-based voting mechanism, this method ensures fast detection regardless of the changepoint's location. It can be applied to various time series in economics, medicine, and other applied sciences. Monte Carlo simulations confirm the effectiveness of the proposed methodology."
}