{
    "title": "Empowering Computing and Networks Convergence System with Distributed Cooperative Routing",
    "abstract": "The emergence of intelligent applications and recent advances in the fields of computing and networks are driving the development of computing and networks convergence (CNC) system. However, existing researches failed to achieve comprehensive scheduling optimization of computing and network resources. This shortfall results in some requirements of computing requests unable to be guaranteed in an end-to-end service pattern, negatively impacting the development of CNC systems. In this article, we propose a distributed cooperative routing framework for the CNC system to ensure the deadline requirements and minimize the computation cost of requests. The framework includes trading plane, management plane, control plane and forwarding plane. The cross-plane cooperative end-to-end routing schemes consider both computation efficiency of heterogeneous servers and the network congestion degrees while making routing plan, thereby determining where to execute requests and corresponding routing pat",
    "link": "https://arxiv.org/abs/2402.02381",
    "context": "Title: Empowering Computing and Networks Convergence System with Distributed Cooperative Routing\nAbstract: The emergence of intelligent applications and recent advances in the fields of computing and networks are driving the development of computing and networks convergence (CNC) system. However, existing researches failed to achieve comprehensive scheduling optimization of computing and network resources. This shortfall results in some requirements of computing requests unable to be guaranteed in an end-to-end service pattern, negatively impacting the development of CNC systems. In this article, we propose a distributed cooperative routing framework for the CNC system to ensure the deadline requirements and minimize the computation cost of requests. The framework includes trading plane, management plane, control plane and forwarding plane. The cross-plane cooperative end-to-end routing schemes consider both computation efficiency of heterogeneous servers and the network congestion degrees while making routing plan, thereby determining where to execute requests and corresponding routing pat",
    "path": "papers/24/02/2402.02381.json",
    "total_tokens": 761,
    "translated_title": "通过分布协作路由增强计算与网络融合系统",
    "translated_abstract": "智能应用的出现和计算与网络领域的最新进展推动了计算与网络融合（CNC）系统的发展。然而，现有研究未能实现对计算和网络资源的全面调度优化。这种不足导致了某些计算请求在端到端服务模式下无法保证需求，并对CNC系统的发展产生了负面影响。在本文中，我们提出了一种针对CNC系统的分布式协作路由框架，以确保截止日期要求并最小化请求的计算成本。该框架包括交易平面、管理平面、控制平面和转发平面。跨平面协作端到端路由方案在制定路由计划时考虑了异构服务器的计算效率和网络拥塞程度，从而确定了在何处执行请求和相应的路由方案。",
    "tldr": "本文提出了一个分布式协作路由框架，用于增强计算与网络融合系统，以确保截止日期要求并最小化请求计算成本。"
}