{
    "title": "Hybrid-Prediction Integrated Planning for Autonomous Driving",
    "abstract": "Autonomous driving systems require the ability to fully understand and predict the surrounding environment to make informed decisions in complex scenarios. Recent advancements in learning-based systems have highlighted the importance of integrating prediction and planning modules. However, this integration has brought forth three major challenges: inherent trade-offs by sole prediction, consistency between prediction patterns, and social coherence in prediction and planning. To address these challenges, we introduce a hybrid-prediction integrated planning (HPP) system, which possesses three novelly designed modules. First, we introduce marginal-conditioned occupancy prediction to align joint occupancy with agent-wise perceptions. Our proposed MS-OccFormer module achieves multi-stage alignment per occupancy forecasting with consistent awareness from agent-wise motion predictions. Second, we propose a game-theoretic motion predictor, GTFormer, to model the interactive future among indivi",
    "link": "https://arxiv.org/abs/2402.02426",
    "context": "Title: Hybrid-Prediction Integrated Planning for Autonomous Driving\nAbstract: Autonomous driving systems require the ability to fully understand and predict the surrounding environment to make informed decisions in complex scenarios. Recent advancements in learning-based systems have highlighted the importance of integrating prediction and planning modules. However, this integration has brought forth three major challenges: inherent trade-offs by sole prediction, consistency between prediction patterns, and social coherence in prediction and planning. To address these challenges, we introduce a hybrid-prediction integrated planning (HPP) system, which possesses three novelly designed modules. First, we introduce marginal-conditioned occupancy prediction to align joint occupancy with agent-wise perceptions. Our proposed MS-OccFormer module achieves multi-stage alignment per occupancy forecasting with consistent awareness from agent-wise motion predictions. Second, we propose a game-theoretic motion predictor, GTFormer, to model the interactive future among indivi",
    "path": "papers/24/02/2402.02426.json",
    "total_tokens": 864,
    "translated_title": "自动驾驶的混合预测综合规划",
    "translated_abstract": "自动驾驶系统需要全面理解并预测周围环境，以在复杂场景中做出明智的决策。最近学习型系统的进展凸显了整合预测和规划模块的重要性。然而，这种整合带来了三个主要挑战：单一预测的固有权衡，预测模式之间的一致性，以及预测和规划中的社交一致性。为了解决这些挑战，我们引入了一个混合预测综合规划（HPP）系统，该系统具有三个创新设计的模块。首先，我们引入了边缘条件下的占用预测，以使联合占用与代理感知保持一致。我们提出的MS-OccFormer模块通过代理方向运动预测实现了多阶段的占用预测对齐。其次，我们提出了一个博弈论运动预测器GTFormer，来模拟个体之间的交互未来。",
    "tldr": "本论文介绍了一个混合预测综合规划（HPP）系统，通过引入边缘条件下的占用预测和博弈论运动预测器，解决了自动驾驶系统中预测和规划模块整合所面临的挑战。",
    "en_tdlr": "This paper introduces a hybrid-prediction integrated planning (HPP) system, which addresses the challenges of integrating prediction and planning modules in autonomous driving systems by incorporating marginal-conditioned occupancy prediction and a game-theoretic motion predictor."
}