{
    "title": "Mirror: A Multiple-perspective Self-Reflection Method for Knowledge-rich Reasoning",
    "abstract": "arXiv:2402.14963v1 Announce Type: cross  Abstract: While Large language models (LLMs) have the capability to iteratively reflect on their own outputs, recent studies have observed their struggles with knowledge-rich problems without access to external resources. In addition to the inefficiency of LLMs in self-assessment, we also observe that LLMs struggle to revisit their predictions despite receiving explicit negative feedback. Therefore, We propose Mirror, a Multiple-perspective self-reflection method for knowledge-rich reasoning, to avoid getting stuck at a particular reflection iteration. Mirror enables LLMs to reflect from multiple-perspective clues, achieved through a heuristic interaction between a Navigator and a Reasoner. It guides agents toward diverse yet plausibly reliable reasoning trajectory without access to ground truth by encouraging (1) diversity of directions generated by Navigator and (2) agreement among strategically induced perturbations in responses generated by ",
    "link": "https://arxiv.org/abs/2402.14963",
    "context": "Title: Mirror: A Multiple-perspective Self-Reflection Method for Knowledge-rich Reasoning\nAbstract: arXiv:2402.14963v1 Announce Type: cross  Abstract: While Large language models (LLMs) have the capability to iteratively reflect on their own outputs, recent studies have observed their struggles with knowledge-rich problems without access to external resources. In addition to the inefficiency of LLMs in self-assessment, we also observe that LLMs struggle to revisit their predictions despite receiving explicit negative feedback. Therefore, We propose Mirror, a Multiple-perspective self-reflection method for knowledge-rich reasoning, to avoid getting stuck at a particular reflection iteration. Mirror enables LLMs to reflect from multiple-perspective clues, achieved through a heuristic interaction between a Navigator and a Reasoner. It guides agents toward diverse yet plausibly reliable reasoning trajectory without access to ground truth by encouraging (1) diversity of directions generated by Navigator and (2) agreement among strategically induced perturbations in responses generated by ",
    "path": "papers/24/02/2402.14963.json",
    "total_tokens": 895,
    "translated_title": "镜像：一种适用于知识丰富推理的多视角自我反思方法",
    "translated_abstract": "虽然大型语言模型（LLMs）有能力反复反思自己的输出，但最近的研究观察到它们在没有外部资源的情况下处理知识丰富问题时存在困难。除了LLMs在自我评估方面的低效率外，我们还观察到尽管受到明确负面反馈，LLMs仍然难以重新审视其预测。因此，我们提出了Mirror，一种适用于知识丰富推理的多角度自我反思方法，以避免在特定反思迭代中卡住。Mirror使LLMs能够通过导航者和推理者之间的启发式交互获得多视角线索的反思，引导代理向多样性而具有可靠性的推理轨迹发展，而无需访问地面真相，通过鼓励（1）导航者生成的方向的多样性与（2）策略性引发的扰动在产生的回应中的一致性。",
    "tldr": "Mirror 提出了一种多视角自我反思方法，通过导航者和推理者之间的启发式交互，促进多样性而具有可靠性的推理轨迹发展，解决了大型语言模型在处理知识丰富问题上的困难。",
    "en_tdlr": "Mirror proposes a multiple-perspective self-reflection method that guides the development of diverse yet reliable reasoning trajectories through heuristic interaction between a navigator and a reasoner, addressing the struggles of large language models in dealing with knowledge-rich problems."
}