{
    "title": "Accurate and Well-Calibrated ICD Code Assignment Through Attention Over Diverse Label Embeddings",
    "abstract": "Although the International Classification of Diseases (ICD) has been adopted worldwide, manually assigning ICD codes to clinical text is time-consuming, error-prone, and expensive, motivating the development of automated approaches. This paper describes a novel approach for automated ICD coding, combining several ideas from previous related work. We specifically employ a strong Transformer-based model as a text encoder and, to handle lengthy clinical narratives, we explored either (a) adapting the base encoder model into a Longformer, or (b) dividing the text into chunks and processing each chunk independently. The representations produced by the encoder are combined with a label embedding mechanism that explores diverse ICD code synonyms. Experiments with different splits of the MIMIC-III dataset show that the proposed approach outperforms the current state-of-the-art models in ICD coding, with the label embeddings significantly contributing to the good performance. Our approach also ",
    "link": "https://arxiv.org/abs/2402.03172",
    "context": "Title: Accurate and Well-Calibrated ICD Code Assignment Through Attention Over Diverse Label Embeddings\nAbstract: Although the International Classification of Diseases (ICD) has been adopted worldwide, manually assigning ICD codes to clinical text is time-consuming, error-prone, and expensive, motivating the development of automated approaches. This paper describes a novel approach for automated ICD coding, combining several ideas from previous related work. We specifically employ a strong Transformer-based model as a text encoder and, to handle lengthy clinical narratives, we explored either (a) adapting the base encoder model into a Longformer, or (b) dividing the text into chunks and processing each chunk independently. The representations produced by the encoder are combined with a label embedding mechanism that explores diverse ICD code synonyms. Experiments with different splits of the MIMIC-III dataset show that the proposed approach outperforms the current state-of-the-art models in ICD coding, with the label embeddings significantly contributing to the good performance. Our approach also ",
    "path": "papers/24/02/2402.03172.json",
    "total_tokens": 929,
    "translated_title": "通过对多样标签嵌入进行注意力的精确和良好校准的ICD代码分配",
    "translated_abstract": "尽管国际疾病分类（ICD）已在全球范围内得到采用，但将ICD代码手动分配给临床文本耗时、容易出错且昂贵，这促使了自动化方法的发展。本文描述了一种用于自动ICD编码的新方法，结合了先前相关工作的几个思想。我们特别使用了一个强大的基于Transformer的模型作为文本编码器，并且为处理冗长的临床叙述，我们探索了将基础编码器模型改造成为Longformer，或者将文本分成多个块并独立处理每个块的方法。编码器产生的表示与一个标签嵌入机制相结合，该机制探索了多样的ICD代码近义词。对MIMIC-III数据集的不同划分进行的实验表明，所提出的方法在ICD编码中优于当前最先进的模型，标签嵌入对良好性能的贡献也是显著的。我们的方法还...",
    "tldr": "本论文提出了一种新颖的方法来实现自动化ICD编码，通过在文本中使用注意力机制的方法来精确分配ICD代码。实验结果表明，该方法在ICD编码中优于当前最先进的模型，并且标签嵌入机制对模型性能也有显著贡献。",
    "en_tdlr": "This paper proposes a novel method for automated ICD coding by accurately assigning ICD codes through attention mechanism in the text. Experimental results show that the proposed method outperforms the current state-of-the-art models in ICD coding, with the label embedding mechanism significantly contributing to the model performance."
}