{
    "title": "All Thresholds Barred: Direct Estimation of Call Density in Bioacoustic Data",
    "abstract": "arXiv:2402.15360v1 Announce Type: cross  Abstract: Passive acoustic monitoring (PAM) studies generate thousands of hours of audio, which may be used to monitor specific animal populations, conduct broad biodiversity surveys, detect threats such as poachers, and more. Machine learning classifiers for species identification are increasingly being used to process the vast amount of audio generated by bioacoustic surveys, expediting analysis and increasing the utility of PAM as a management tool. In common practice, a threshold is applied to classifier output scores, and scores above the threshold are aggregated into a detection count. The choice of threshold produces biased counts of vocalizations, which are subject to false positive/negative rates that may vary across subsets of the dataset. In this work, we advocate for directly estimating call density: The proportion of detection windows containing the target vocalization, regardless of classifier score. Our approach targets a desirabl",
    "link": "https://arxiv.org/abs/2402.15360",
    "context": "Title: All Thresholds Barred: Direct Estimation of Call Density in Bioacoustic Data\nAbstract: arXiv:2402.15360v1 Announce Type: cross  Abstract: Passive acoustic monitoring (PAM) studies generate thousands of hours of audio, which may be used to monitor specific animal populations, conduct broad biodiversity surveys, detect threats such as poachers, and more. Machine learning classifiers for species identification are increasingly being used to process the vast amount of audio generated by bioacoustic surveys, expediting analysis and increasing the utility of PAM as a management tool. In common practice, a threshold is applied to classifier output scores, and scores above the threshold are aggregated into a detection count. The choice of threshold produces biased counts of vocalizations, which are subject to false positive/negative rates that may vary across subsets of the dataset. In this work, we advocate for directly estimating call density: The proportion of detection windows containing the target vocalization, regardless of classifier score. Our approach targets a desirabl",
    "path": "papers/24/02/2402.15360.json",
    "total_tokens": 854,
    "translated_title": "禁止使用所有阈值：生物声学数据中呼叫密度的直接估计",
    "translated_abstract": "无线电学报：2402.15360v1 类型：交叉 摘要：被动声学监测(PAM)研究产生成千上万小时的音频，可以用于监测特定动物种群、进行广泛的生物多样性调查、检测盗猎等威胁，等等。用于物种识别的机器学习分类器越来越多地用于处理生物声学调查生成的大量音频，加快了分析速度并增加了PAM作为管理工具的效用。在常见做法中，对分类器输出分数应用阈值，并将超过阈值的分数聚合成检测计数。阈值的选择产生了有偏见的鸣叫计数，这些鸣叫计数受到在数据集子集间可能变化的误报/漏报率的影响。在这项工作中，我们倡导直接估计通话密度：包含目标鸣声的检测窗口的比例，而不考虑分类器分数。我们的方法致力于实现一种理想的",
    "tldr": "直接估计生物声学数据中的呼叫密度而不考虑分类器分数，从而消除阈值选择引起的偏差计数。",
    "en_tdlr": "Directly estimate call density in bioacoustic data regardless of classifier scores, eliminating biased counts caused by threshold selection."
}