{
    "title": "What's the Plan? Evaluating and Developing Planning-Aware Techniques for LLMs",
    "abstract": "arXiv:2402.11489v1 Announce Type: new  Abstract: Planning is a fundamental task in artificial intelligence that involves finding a sequence of actions that achieve a specified goal in a given environment. Large language models (LLMs) are increasingly used for applications that require planning capabilities, such as web or embodied agents. In line with recent studies, we demonstrate through experimentation that LLMs lack necessary skills required for planning. Based on these observations, we advocate for the potential of a hybrid approach that combines LLMs with classical planning methodology. Then, we introduce SimPlan, a novel hybrid-method, and evaluate its performance in a new challenging setup. Our extensive experiments across various planning domains demonstrate that SimPlan significantly outperforms existing LLM-based planners.",
    "link": "https://arxiv.org/abs/2402.11489",
    "context": "Title: What's the Plan? Evaluating and Developing Planning-Aware Techniques for LLMs\nAbstract: arXiv:2402.11489v1 Announce Type: new  Abstract: Planning is a fundamental task in artificial intelligence that involves finding a sequence of actions that achieve a specified goal in a given environment. Large language models (LLMs) are increasingly used for applications that require planning capabilities, such as web or embodied agents. In line with recent studies, we demonstrate through experimentation that LLMs lack necessary skills required for planning. Based on these observations, we advocate for the potential of a hybrid approach that combines LLMs with classical planning methodology. Then, we introduce SimPlan, a novel hybrid-method, and evaluate its performance in a new challenging setup. Our extensive experiments across various planning domains demonstrate that SimPlan significantly outperforms existing LLM-based planners.",
    "path": "papers/24/02/2402.11489.json",
    "total_tokens": 808,
    "translated_title": "论文标题: 计划是什么？评估和开发针对LLMs的计划意识技术",
    "translated_abstract": "arXiv:2402.11489v1 公告类型: 新摘要: 计划是人工智能中的基本任务，涉及在给定环境中找到实现特定目标的一系列行动。 大型语言模型（LLMs）越来越多地用于需要计划能力的应用，如网络或具体代理。 与最近的研究一致，我们通过实验表明LLMs缺乏计划所需的必要技能。 基于这些观察结果，我们倡导一种将LLMs与经典计划方法结合的混合方法的潜力。 然后，我们介绍了SimPlan，一种新颖的混合方法，并评估其在新的具有挑战性的设置中的表现。 我们在各种规划领域进行的大量实验证明，SimPlan明显优于现有基于LLM的规划者。",
    "tldr": "提出了一种新的混合方法SimPlan，结合了LLMs和经典规划方法，在各种规划领域的实验表明SimPlan明显优于现有的基于LLM的规划者",
    "en_tdlr": "Introduced a novel hybrid approach called SimPlan, combining LLMs with classical planning methodology, and extensive experiments across various planning domains show that SimPlan significantly outperforms existing LLM-based planners."
}