{
    "title": "Deploying ADVISER: Impact and Lessons from Using Artificial Intelligence for Child Vaccination Uptake in Nigeria",
    "abstract": "More than 5 million children under five years die from largely preventable or treatable medical conditions every year, with an overwhelmingly large proportion of deaths occurring in underdeveloped countries with low vaccination uptake. One of the United Nations' sustainable development goals (SDG 3) aims to end preventable deaths of newborns and children under five years of age. We focus on Nigeria, where the rate of infant mortality is appalling. In particular, low vaccination uptake in Nigeria is a major driver of more than 2,000 daily deaths of children under the age of five years. In this paper, we describe our collaboration with government partners in Nigeria to deploy ADVISER: AI-Driven Vaccination Intervention Optimiser. The framework, based on an integer linear program that seeks to maximize the cumulative probability of successful vaccination, is the first successful deployment of an AI-enabled toolchain for optimizing the allocation of health interventions in Nigeria. In this",
    "link": "https://arxiv.org/abs/2402.00017",
    "context": "Title: Deploying ADVISER: Impact and Lessons from Using Artificial Intelligence for Child Vaccination Uptake in Nigeria\nAbstract: More than 5 million children under five years die from largely preventable or treatable medical conditions every year, with an overwhelmingly large proportion of deaths occurring in underdeveloped countries with low vaccination uptake. One of the United Nations' sustainable development goals (SDG 3) aims to end preventable deaths of newborns and children under five years of age. We focus on Nigeria, where the rate of infant mortality is appalling. In particular, low vaccination uptake in Nigeria is a major driver of more than 2,000 daily deaths of children under the age of five years. In this paper, we describe our collaboration with government partners in Nigeria to deploy ADVISER: AI-Driven Vaccination Intervention Optimiser. The framework, based on an integer linear program that seeks to maximize the cumulative probability of successful vaccination, is the first successful deployment of an AI-enabled toolchain for optimizing the allocation of health interventions in Nigeria. In this",
    "path": "papers/24/02/2402.00017.json",
    "total_tokens": 962,
    "translated_title": "使用人工智能提高尼日利亚儿童疫苗接种率的ADVISE工具的部署：影响与经验教训",
    "translated_abstract": "每年有500多万五岁以下的儿童死于可预防或可治疗的医疗状况，其中绝大部分死亡发生在接种疫苗率低的欠发达国家。联合国的可持续发展目标之一（SDG 3）旨在结束新生儿和五岁以下儿童的可预防死亡。我们关注尼日利亚，该国婴儿死亡率令人震惊。特别是在尼日利亚，低疫苗接种率是每天导致2000多名五岁以下儿童死亡的主要原因。本文描述了我们与尼日利亚政府合作部署ADVISE：AI-驱动的疫苗接种干预优化器。该框架基于整数线性规划，旨在最大化成功疫苗接种的累计概率，在尼日利亚优化卫生干预配置方面是首次成功部署AI工具链。",
    "tldr": "这个论文描述了我们与尼日利亚政府合作部署了ADVISE：AI-驱动的疫苗接种干预优化器，该框架基于整数线性规划，旨在最大化成功疫苗接种的累计概率，在尼日利亚是首次成功部署的AI工具链。"
}