{
    "title": "Ant Colony Optimization for Cooperative Inspection Path Planning Using Multiple Unmanned Aerial Vehicles",
    "abstract": "This paper presents a new swarm intelligence-based approach to deal with the cooperative path planning problem of unmanned aerial vehicles (UAVs), which is essential for the automatic inspection of infrastructure. The approach uses a 3D model of the structure to generate viewpoints for the UAVs. The calculation of the viewpoints considers the constraints related to the UAV formation model, camera parameters, and requirements for data post-processing. The viewpoints are then used as input to formulate the path planning as an extended traveling salesman problem and the definition of a new cost function. Ant colony optimization is finally used to solve the problem to yield optimal inspection paths. Experiments with 3D models of real structures have been conducted to evaluate the performance of the proposed approach. The results show that our system is not only capable of generating feasible inspection paths for UAVs but also reducing the path length by 29.47\\% for complex structures when ",
    "link": "https://arxiv.org/abs/2402.08246",
    "context": "Title: Ant Colony Optimization for Cooperative Inspection Path Planning Using Multiple Unmanned Aerial Vehicles\nAbstract: This paper presents a new swarm intelligence-based approach to deal with the cooperative path planning problem of unmanned aerial vehicles (UAVs), which is essential for the automatic inspection of infrastructure. The approach uses a 3D model of the structure to generate viewpoints for the UAVs. The calculation of the viewpoints considers the constraints related to the UAV formation model, camera parameters, and requirements for data post-processing. The viewpoints are then used as input to formulate the path planning as an extended traveling salesman problem and the definition of a new cost function. Ant colony optimization is finally used to solve the problem to yield optimal inspection paths. Experiments with 3D models of real structures have been conducted to evaluate the performance of the proposed approach. The results show that our system is not only capable of generating feasible inspection paths for UAVs but also reducing the path length by 29.47\\% for complex structures when ",
    "path": "papers/24/02/2402.08246.json",
    "total_tokens": 869,
    "translated_title": "多无人机合作巡检路径规划的蚁群优化",
    "translated_abstract": "本文提出一种基于群集智能的新方法来处理无人机协作路径规划问题，该问题对于基础设施的自动化巡检至关重要。该方法利用结构的三维模型生成无人机的视点。视点的计算考虑了与无人机编队模型、相机参数和数据后处理要求相关的约束。然后，将这些视点作为输入，将路径规划表示为扩展旅行推销员问题，并定义新的成本函数。最后使用蚁群优化来解决问题，得到最优的巡检路径。通过对真实结构的三维模型进行实验，评估了所提方法的性能。结果表明，我们的系统不仅能够为无人机生成可行的巡检路径，而且在复杂结构上将路径长度减少了29.47％。",
    "tldr": "该论文提出了一种基于蚁群优化的新方法，用于解决无人机协作路径规划问题。该方法通过利用结构的三维模型生成无人机的视点，并将路径规划转化为旅行推销员问题。实验结果表明，该系统不仅能够生成可行的巡检路径，而且能够减少路径长度。",
    "en_tdlr": "This paper presents a new approach based on ant colony optimization for cooperative path planning of multiple UAVs. The approach generates viewpoints using 3D models of structures and formulates the path planning as a traveling salesman problem. Experimental results show that the system is capable of generating feasible inspection paths and reducing path length."
}