{
    "title": "Rethinking Mutual Information for Language Conditioned Skill Discovery on Imitation Learning",
    "abstract": "arXiv:2402.17511v1 Announce Type: cross  Abstract: Language-conditioned robot behavior plays a vital role in executing complex tasks by associating human commands or instructions with perception and actions. The ability to compose long-horizon tasks based on unconstrained language instructions necessitates the acquisition of a diverse set of general-purpose skills. However, acquiring inherent primitive skills in a coupled and long-horizon environment without external rewards or human supervision presents significant challenges. In this paper, we evaluate the relationship between skills and language instructions from a mathematical perspective, employing two forms of mutual information within the framework of language-conditioned policy learning. To maximize the mutual information between language and skills in an unsupervised manner, we propose an end-to-end imitation learning approach known as Language Conditioned Skill Discovery (LCSD). Specifically, we utilize vector quantization to",
    "link": "https://arxiv.org/abs/2402.17511",
    "context": "Title: Rethinking Mutual Information for Language Conditioned Skill Discovery on Imitation Learning\nAbstract: arXiv:2402.17511v1 Announce Type: cross  Abstract: Language-conditioned robot behavior plays a vital role in executing complex tasks by associating human commands or instructions with perception and actions. The ability to compose long-horizon tasks based on unconstrained language instructions necessitates the acquisition of a diverse set of general-purpose skills. However, acquiring inherent primitive skills in a coupled and long-horizon environment without external rewards or human supervision presents significant challenges. In this paper, we evaluate the relationship between skills and language instructions from a mathematical perspective, employing two forms of mutual information within the framework of language-conditioned policy learning. To maximize the mutual information between language and skills in an unsupervised manner, we propose an end-to-end imitation learning approach known as Language Conditioned Skill Discovery (LCSD). Specifically, we utilize vector quantization to",
    "path": "papers/24/02/2402.17511.json",
    "total_tokens": 829,
    "translated_title": "重新思考语言条件下的互信息对模仿学习中技能发现的影响",
    "translated_abstract": "arXiv:2402.17511v1 公告类型:跨越 摘要:语言条件下的机器人行为通过将人类命令或指令与感知和动作相关联，在执行复杂任务中起着至关重要的作用。基于不受限制的语言指令构成长视距任务的能力需要获得各种通用技能集。然而，在没有外部奖励或人类监督的耦合和长视距环境中获得固有原始技能存在重大挑战。本文从数学角度评估了技能和语言指令之间的关系，在语言条件策略学习框架内采用了两种形式的互信息。为了以无监督方式最大化语言和技能之间的互信息，我们提出了一种称为语言条件下技能发现（LCSD）的端到端模仿学习方法。具体来说，我们利用矢量量化来",
    "tldr": "通过重新思考互信息在语言条件下的作用，我们提出了一种端到端模仿学习方法LCSD，以无监督的方式最大化语言和技能之间的互信息。",
    "en_tdlr": "By rethinking the role of mutual information in language conditioned settings, we propose an end-to-end imitation learning approach LCSD to maximize the mutual information between language and skills in an unsupervised manner."
}