{
    "title": "The Colorful Future of LLMs: Evaluating and Improving LLMs as Emotional Supporters for Queer Youth",
    "abstract": "arXiv:2402.11886v1 Announce Type: cross  Abstract: Queer youth face increased mental health risks, such as depression, anxiety, and suicidal ideation. Hindered by negative stigma, they often avoid seeking help and rely on online resources, which may provide incompatible information. Although access to a supportive environment and reliable information is invaluable, many queer youth worldwide have no access to such support. However, this could soon change due to the rapid adoption of Large Language Models (LLMs) such as ChatGPT. This paper aims to comprehensively explore the potential of LLMs to revolutionize emotional support for queers. To this end, we conduct a qualitative and quantitative analysis of LLM's interactions with queer-related content. To evaluate response quality, we develop a novel ten-question scale that is inspired by psychological standards and expert input. We apply this scale to score several LLMs and human comments to posts where queer youth seek advice and share ",
    "link": "https://arxiv.org/abs/2402.11886",
    "context": "Title: The Colorful Future of LLMs: Evaluating and Improving LLMs as Emotional Supporters for Queer Youth\nAbstract: arXiv:2402.11886v1 Announce Type: cross  Abstract: Queer youth face increased mental health risks, such as depression, anxiety, and suicidal ideation. Hindered by negative stigma, they often avoid seeking help and rely on online resources, which may provide incompatible information. Although access to a supportive environment and reliable information is invaluable, many queer youth worldwide have no access to such support. However, this could soon change due to the rapid adoption of Large Language Models (LLMs) such as ChatGPT. This paper aims to comprehensively explore the potential of LLMs to revolutionize emotional support for queers. To this end, we conduct a qualitative and quantitative analysis of LLM's interactions with queer-related content. To evaluate response quality, we develop a novel ten-question scale that is inspired by psychological standards and expert input. We apply this scale to score several LLMs and human comments to posts where queer youth seek advice and share ",
    "path": "papers/24/02/2402.11886.json",
    "total_tokens": 935,
    "translated_title": "LLM的多彩未来：评估和改进LLM作为酷儿青少年情感支持者的作用",
    "translated_abstract": "酷儿青少年面临着增加的心理健康风险，如抑郁、焦虑和自杀意念。受负面标签的影响，他们经常避免寻求帮助，依赖在线资源，这可能提供不相容的信息。虽然获得支持环境和可靠信息是无价的，但全球许多酷儿青少年无法获得这种支持。然而，由于ChatGPT等大型语言模型（LLM）的快速采用，情况可能很快发生变化。本文旨在全面探讨LLM改变酷儿情感支持的潜力。为此，我们对LLM与酷儿相关内容的互动进行定性和定量分析。为了评估回应质量，我们开发了一个受心理标准和专家意见启发的新颖十个问题量表。我们将该量表应用于评分几个LLM和人类评论，这些评论是酷儿青少年寻求建议和分享时发表的。",
    "tldr": "本文旨在评估和改进LLM作为酷儿青少年情感支持者的潜力，通过定性和定量分析LLM与酷儿相关内容的互动，并开发了一个新颖的评估标准量表。",
    "en_tdlr": "This paper aims to evaluate and improve the potential of LLMs as emotional supporters for queer youth through qualitative and quantitative analysis of LLM interactions with queer-related content and the development of a novel evaluation scale."
}