{
    "title": "Contrastive Learning of Shared Spatiotemporal EEG Representations Across Individuals for Naturalistic Neuroscience",
    "abstract": "arXiv:2402.14213v1 Announce Type: cross  Abstract: Neural representations induced by naturalistic stimuli offer insights into how humans respond to peripheral stimuli in daily life. The key to understanding the general neural mechanisms underlying naturalistic stimuli processing involves aligning neural activities across individuals and extracting inter-subject shared neural representations. Targeting the Electroencephalogram (EEG) technique, known for its rich spatial and temporal information, this study presents a general framework for Contrastive Learning of Shared SpatioTemporal EEG Representations across individuals (CL-SSTER). Harnessing the representational capabilities of contrastive learning, CL-SSTER utilizes a neural network to maximize the similarity of EEG representations across individuals for identical stimuli, contrasting with those for varied stimuli. The network employed spatial and temporal convolutions to simultaneously learn the spatial and temporal patterns inhere",
    "link": "https://arxiv.org/abs/2402.14213",
    "context": "Title: Contrastive Learning of Shared Spatiotemporal EEG Representations Across Individuals for Naturalistic Neuroscience\nAbstract: arXiv:2402.14213v1 Announce Type: cross  Abstract: Neural representations induced by naturalistic stimuli offer insights into how humans respond to peripheral stimuli in daily life. The key to understanding the general neural mechanisms underlying naturalistic stimuli processing involves aligning neural activities across individuals and extracting inter-subject shared neural representations. Targeting the Electroencephalogram (EEG) technique, known for its rich spatial and temporal information, this study presents a general framework for Contrastive Learning of Shared SpatioTemporal EEG Representations across individuals (CL-SSTER). Harnessing the representational capabilities of contrastive learning, CL-SSTER utilizes a neural network to maximize the similarity of EEG representations across individuals for identical stimuli, contrasting with those for varied stimuli. The network employed spatial and temporal convolutions to simultaneously learn the spatial and temporal patterns inhere",
    "path": "papers/24/02/2402.14213.json",
    "total_tokens": 819,
    "translated_title": "个体间共享脑电图时空表示的对比学习用于自然神经科学",
    "translated_abstract": "自然刺激诱导的神经表征揭示了人类如何对日常生活中的外围刺激做出反应。理解自然刺激处理的一般神经机制的关键在于对齐各个个体的神经活动并提取个体间的共享神经表征。本研究针对脑电图（EEG）技术，该技术以其丰富的空间和时间信息而闻名，提出了一个用于个体间共享时空脑电图表示的对比学习的通用框架（CL-SSTER）。利用对比学习的表征能力，CL-SSTER利用神经网络最大化相同刺激下各个个体的EEG表示的相似性，与不同刺激的相对应。该网络采用空间和时间卷积同时学习空间和时间模式。",
    "tldr": "通过对比学习，利用神经网络最大化相同刺激下各个个体的EEG表示的相似性，以此实现个体间共享时空脑电图表示的学习。",
    "en_tdlr": "By contrastive learning, maximizing the similarity of EEG representations across individuals for identical stimuli is achieved using neural networks, facilitating the learning of shared spatiotemporal EEG representations across individuals."
}