{
    "title": "NewsQs: Multi-Source Question Generation for the Inquiring Mind",
    "abstract": "arXiv:2402.18479v1 Announce Type: new  Abstract: We present NewsQs (news-cues), a dataset that provides question-answer pairs for multiple news documents. To create NewsQs, we augment a traditional multi-document summarization dataset with questions automatically generated by a T5-Large model fine-tuned on FAQ-style news articles from the News On the Web corpus. We show that fine-tuning a model with control codes produces questions that are judged acceptable more often than the same model without them as measured through human evaluation. We use a QNLI model with high correlation with human annotations to filter our data. We release our final dataset of high-quality questions, answers, and document clusters as a resource for future work in query-based multi-document summarization.",
    "link": "https://arxiv.org/abs/2402.18479",
    "context": "Title: NewsQs: Multi-Source Question Generation for the Inquiring Mind\nAbstract: arXiv:2402.18479v1 Announce Type: new  Abstract: We present NewsQs (news-cues), a dataset that provides question-answer pairs for multiple news documents. To create NewsQs, we augment a traditional multi-document summarization dataset with questions automatically generated by a T5-Large model fine-tuned on FAQ-style news articles from the News On the Web corpus. We show that fine-tuning a model with control codes produces questions that are judged acceptable more often than the same model without them as measured through human evaluation. We use a QNLI model with high correlation with human annotations to filter our data. We release our final dataset of high-quality questions, answers, and document clusters as a resource for future work in query-based multi-document summarization.",
    "path": "papers/24/02/2402.18479.json",
    "total_tokens": 807,
    "translated_title": "NewsQs: 多源问题生成助力探知心灵",
    "translated_abstract": "我们提出了 NewsQs（news-cues），这是一个为多个新闻文档提供问题-答案对的数据集。为了创建 NewsQs，我们利用一个经过 T5-Large 模型在 News On the Web 语料库中的 FAQ 样式新闻文章上进行微调的模型，自动生成问题来扩充传统的多文档总结数据集。我们展示了使用控制码对模型进行微调可以产生更多被人类评价为可接受的问题，这是通过人工评估所测得的。我们使用与人类注释高度相关的 QNLI 模型来过滤我们的数据。我们发布了作为未来基于查询的多文档总结工作资源的高质量问题、答案和文档聚类的最终数据集。",
    "tldr": "NewsQs是一个为多个新闻文档提供问题-答案对的数据集，利用T5-Large模型fine-tune自动生成问题，通过对模型进行控制码微调，可以产生更多可接受的问题，释放高质量的数据集供未来基于查询的多文档总结研究使用。",
    "en_tdlr": "NewsQs is a dataset that provides question-answer pairs for multiple news documents, generating questions using the T5-Large model fine-tuned on FAQ-style news articles, and fine-tuning the model with control codes results in more acceptable questions, releasing a high-quality dataset for future research in query-based multi-document summarization."
}