{
    "title": "Breaking the HISCO Barrier: Automatic Occupational Standardization with OccCANINE",
    "abstract": "arXiv:2402.13604v1 Announce Type: new  Abstract: This paper introduces a new tool, OccCANINE, to automatically transform occupational descriptions into the HISCO classification system. The manual work involved in processing and classifying occupational descriptions is error-prone, tedious, and time-consuming. We finetune a preexisting language model (CANINE) to do this automatically thereby performing in seconds and minutes what previously took days and weeks. The model is trained on 14 million pairs of occupational descriptions and HISCO codes in 13 different languages contributed by 22 different sources. Our approach is shown to have accuracy, recall and precision above 90 percent. Our tool breaks the metaphorical HISCO barrier and makes this data readily available for analysis of occupational structures with broad applicability in economics, economic history and various related disciplines.",
    "link": "https://arxiv.org/abs/2402.13604",
    "context": "Title: Breaking the HISCO Barrier: Automatic Occupational Standardization with OccCANINE\nAbstract: arXiv:2402.13604v1 Announce Type: new  Abstract: This paper introduces a new tool, OccCANINE, to automatically transform occupational descriptions into the HISCO classification system. The manual work involved in processing and classifying occupational descriptions is error-prone, tedious, and time-consuming. We finetune a preexisting language model (CANINE) to do this automatically thereby performing in seconds and minutes what previously took days and weeks. The model is trained on 14 million pairs of occupational descriptions and HISCO codes in 13 different languages contributed by 22 different sources. Our approach is shown to have accuracy, recall and precision above 90 percent. Our tool breaks the metaphorical HISCO barrier and makes this data readily available for analysis of occupational structures with broad applicability in economics, economic history and various related disciplines.",
    "path": "papers/24/02/2402.13604.json",
    "total_tokens": 834,
    "translated_title": "打破HISCO障碍：使用OccCANINE进行自动职业标准化",
    "translated_abstract": "这篇论文介绍了一种新工具OccCANINE，可自动将职业描述转换为HISCO分类系统。处理和分类职业描述涉及的手动工作容易出错、繁琐且耗时。我们对一个现有的语言模型（CANINE）进行了微调，使其能够在几秒钟到几分钟内自动完成此过程，而以前需要数天甚至数周。该模型在来自22个不同来源贡献的13种语言中的1400万对职业描述和HISCO代码上进行训练。我们的方法表现出精度、召回率和准确率均超过90%。我们的工具突破了象征性HISCO障碍，并使这些数据可供经济学、经济历史和各种相关学科中的职业结构分析使用。",
    "tldr": "通过OccCANINE工具，我们成功打破了HISCO障碍，实现了自动化职业标准化，从而大大简化了对职业描述的处理和分类过程，为经济学、经济历史等领域的职业结构分析提供了高效且准确的数据。",
    "en_tdlr": "By using the OccCANINE tool, the paper successfully breaks the HISCO barrier and achieves automatic occupational standardization, significantly streamlining the processing and classification of occupational descriptions, providing efficient and accurate data for analyzing occupational structures in economics, economic history, and related fields."
}