{
    "title": "Modelling Human Values for AI Reasoning",
    "abstract": "One of today's most significant societal challenges is building AI systems whose behaviour, or the behaviour it enables within communities of interacting agents (human and artificial), aligns with human values. To address this challenge, we detail a formal model of human values for their explicit computational representation. To our knowledge, this has not been attempted as yet, which is surprising given the growing volume of research integrating values within AI. Taking as our starting point the wealth of research investigating the nature of human values from social psychology over the last few decades, we set out to provide such a formal model. We show how this model can provide the foundational apparatus for AI-based reasoning over values, and demonstrate its applicability in real-world use cases. We illustrate how our model captures the key ideas from social psychology research and propose a roadmap for future integrated, and interdisciplinary, research into human values in AI. The",
    "link": "https://arxiv.org/abs/2402.06359",
    "context": "Title: Modelling Human Values for AI Reasoning\nAbstract: One of today's most significant societal challenges is building AI systems whose behaviour, or the behaviour it enables within communities of interacting agents (human and artificial), aligns with human values. To address this challenge, we detail a formal model of human values for their explicit computational representation. To our knowledge, this has not been attempted as yet, which is surprising given the growing volume of research integrating values within AI. Taking as our starting point the wealth of research investigating the nature of human values from social psychology over the last few decades, we set out to provide such a formal model. We show how this model can provide the foundational apparatus for AI-based reasoning over values, and demonstrate its applicability in real-world use cases. We illustrate how our model captures the key ideas from social psychology research and propose a roadmap for future integrated, and interdisciplinary, research into human values in AI. The",
    "path": "papers/24/02/2402.06359.json",
    "total_tokens": 908,
    "translated_title": "为AI推理建模人类价值观",
    "translated_abstract": "当今最重要的社会挑战之一是构建其行为与人类价值观一致的AI系统，或是其使人工和人工之间相互作用的社区行为与人类价值观一致。为了解决这一挑战，我们详细介绍了一个关于人类价值观的形式化模型，以进行其明确的计算表示。据我们所知，目前尚未有人尝试过这种模型，这在考虑到将价值观与AI整合的研究数量不断增长的情况下是令人惊讶的。我们以社会心理学领域近几十年来研究人类价值观性质的大量研究为起点，致力于提供这样一个形式化模型。我们展示了这个模型如何为基于AI的价值推理提供基础装置，并证明了它在实际应用案例中的适用性。我们阐述了我们的模型如何捕捉到社会心理学研究的关键思想，并提出了未来关于人类价值观在AI中集成和跨学科研究的路线图。",
    "tldr": "本研究详细介绍了一个关于人类价值观的形式化模型，并展示了它在AI推理中的应用。研究通过基于社会心理学研究的关键思想，为AI系统与人类价值观的一致性提供了具体的计算表示。"
}