{
    "title": "Interactive Mars Image Content-Based Search with Interpretable Machine Learning",
    "abstract": "arXiv:2402.16860v1 Announce Type: cross  Abstract: The NASA Planetary Data System (PDS) hosts millions of images of planets, moons, and other bodies collected throughout many missions. The ever-expanding nature of data and user engagement demands an interpretable content classification system to support scientific discovery and individual curiosity. In this paper, we leverage a prototype-based architecture to enable users to understand and validate the evidence used by a classifier trained on images from the Mars Science Laboratory (MSL) Curiosity rover mission. In addition to providing explanations, we investigate the diversity and correctness of evidence used by the content-based classifier. The work presented in this paper will be deployed on the PDS Image Atlas, replacing its non- interpretable counterpart.",
    "link": "https://arxiv.org/abs/2402.16860",
    "context": "Title: Interactive Mars Image Content-Based Search with Interpretable Machine Learning\nAbstract: arXiv:2402.16860v1 Announce Type: cross  Abstract: The NASA Planetary Data System (PDS) hosts millions of images of planets, moons, and other bodies collected throughout many missions. The ever-expanding nature of data and user engagement demands an interpretable content classification system to support scientific discovery and individual curiosity. In this paper, we leverage a prototype-based architecture to enable users to understand and validate the evidence used by a classifier trained on images from the Mars Science Laboratory (MSL) Curiosity rover mission. In addition to providing explanations, we investigate the diversity and correctness of evidence used by the content-based classifier. The work presented in this paper will be deployed on the PDS Image Atlas, replacing its non- interpretable counterpart.",
    "path": "papers/24/02/2402.16860.json",
    "total_tokens": 725,
    "translated_title": "基于可解释机器学习的交互式火星图像内容搜索",
    "translated_abstract": "NASA行星数据系统(PDS)托管着数百万张不同任务期间收集的行星、卫星和其他天体的图像。数据的不断扩展和用户参与的需求促使我们建立一个可解释的内容分类系统，以支持科学发现和个人好奇心。本文利用基于原型的架构，使用户能够理解并验证火星科学实验室(MSL)好奇号任务图像上训练的分类器所用的证据。除了提供解释，我们还研究了基于内容的分类器所使用的证据的多样性和正确性。本文提出的工作将部署在PDS图像图集上，取代其不可解释的对应物。",
    "tldr": "提出了一种基于可解释机器学习的交互式火星图像内容搜索方法，可以帮助用户理解和验证分类器使用的证据，并替换现有的不可解释图像搜索系统。"
}