{
    "title": "Spinal Osteophyte Detection via Robust Patch Extraction on minimally annotated X-rays",
    "abstract": "arXiv:2402.19263v1 Announce Type: cross  Abstract: The development and progression of arthritis is strongly associated with osteophytes, which are small and elusive bone growths. This paper presents one of the first efforts towards automated spinal osteophyte detection in spinal X-rays. A novel automated patch extraction process, called SegPatch, has been proposed based on deep learning-driven vertebrae segmentation and the enlargement of mask contours. A final patch classification accuracy of 84.5\\% is secured, surpassing a baseline tiling-based patch generation technique by 9.5%. This demonstrates that even with limited annotations, SegPatch can deliver superior performance for detection of tiny structures such as osteophytes. The proposed approach has potential to assist clinicians in expediting the process of manually identifying osteophytes in spinal X-ray.",
    "link": "https://arxiv.org/abs/2402.19263",
    "context": "Title: Spinal Osteophyte Detection via Robust Patch Extraction on minimally annotated X-rays\nAbstract: arXiv:2402.19263v1 Announce Type: cross  Abstract: The development and progression of arthritis is strongly associated with osteophytes, which are small and elusive bone growths. This paper presents one of the first efforts towards automated spinal osteophyte detection in spinal X-rays. A novel automated patch extraction process, called SegPatch, has been proposed based on deep learning-driven vertebrae segmentation and the enlargement of mask contours. A final patch classification accuracy of 84.5\\% is secured, surpassing a baseline tiling-based patch generation technique by 9.5%. This demonstrates that even with limited annotations, SegPatch can deliver superior performance for detection of tiny structures such as osteophytes. The proposed approach has potential to assist clinicians in expediting the process of manually identifying osteophytes in spinal X-ray.",
    "path": "papers/24/02/2402.19263.json",
    "total_tokens": 908,
    "translated_title": "通过对 X 射线上的鲜有标注的强大斑块提取来检测脊柱骨赘",
    "translated_abstract": "关节炎的发展和进展与骨赘密切相关，骨赘是小而难以察觉的骨增生物。本文提出了针对脊柱 X 射线中自动检测脊柱骨赘的首次努力。提出了一种新颖的自动斑块提取过程，称为 SegPatch，基于深度学习驱动的椎骨分割和掩模轮廓的扩大。最终获得了 84.5\\% 的最终斑块分类准确率，比基线瓦片化斑块生成技术高出 9.5\\%。这表明，即使有限的注释，SegPatch 也可以为骨赘等微小结构的检测提供优越性能。所提出的方法有潜力帮助临床医生加快手动识别脊柱 X 射线中的骨赘的过程。",
    "tldr": "通过新颖的 SegPatch 自动斑块提取技术，本研究实现了对脊柱 X 射线中骨赘的自动化检测，准确率达到 84.5\\%，比基线方法高出 9.5%，有望帮助临床医生加速骨赘识别过程。",
    "en_tdlr": "Through the novel SegPatch automated patch extraction technique, this study achieved automated detection of osteophytes in spinal X-rays with an accuracy of 84.5%, surpassing the baseline method by 9.5%, potentially assisting clinicians in expediting osteophyte identification."
}