{
    "title": "Supporting Experts with a Multimodal Machine-Learning-Based Tool for Human Behavior Analysis of Conversational Videos",
    "abstract": "arXiv:2402.11145v1 Announce Type: cross  Abstract: Multimodal scene search of conversations is essential for unlocking valuable insights into social dynamics and enhancing our communication. While experts in conversational analysis have their own knowledge and skills to find key scenes, a lack of comprehensive, user-friendly tools that streamline the processing of diverse multimodal queries impedes efficiency and objectivity. To solve it, we developed Providence, a visual-programming-based tool based on design considerations derived from a formative study with experts. It enables experts to combine various machine learning algorithms to capture human behavioral cues without writing code. Our study showed its preferable usability and satisfactory output with less cognitive load imposed in accomplishing scene search tasks of conversations, verifying the importance of its customizability and transparency. Furthermore, through the in-the-wild trial, we confirmed the objectivity and reusabi",
    "link": "https://arxiv.org/abs/2402.11145",
    "context": "Title: Supporting Experts with a Multimodal Machine-Learning-Based Tool for Human Behavior Analysis of Conversational Videos\nAbstract: arXiv:2402.11145v1 Announce Type: cross  Abstract: Multimodal scene search of conversations is essential for unlocking valuable insights into social dynamics and enhancing our communication. While experts in conversational analysis have their own knowledge and skills to find key scenes, a lack of comprehensive, user-friendly tools that streamline the processing of diverse multimodal queries impedes efficiency and objectivity. To solve it, we developed Providence, a visual-programming-based tool based on design considerations derived from a formative study with experts. It enables experts to combine various machine learning algorithms to capture human behavioral cues without writing code. Our study showed its preferable usability and satisfactory output with less cognitive load imposed in accomplishing scene search tasks of conversations, verifying the importance of its customizability and transparency. Furthermore, through the in-the-wild trial, we confirmed the objectivity and reusabi",
    "path": "papers/24/02/2402.11145.json",
    "total_tokens": 745,
    "translated_title": "为人类行为分析对话视频支持专家的多模式机器学习工具",
    "translated_abstract": "跨学科对话的多模式场景搜索对解锁有价值的社会动态见解和增强沟通至关重要。我们开发了Providence，这是一个基于视觉编程的工具，旨在提供从专家研究中得出的设计考虑，使专家能够结合各种机器学习算法捕获人类行为线索，而无需编写代码。我们的研究表明，该工具具有可取的可用性和令人满意的输出，执行对话场景搜索任务时所施加的认知负荷较小，验证了其可定制性和透明性的重要性。",
    "tldr": "Providence是一个基于视觉编程的多模式机器学习工具，旨在帮助专家捕获人类行为线索，无需编写代码，具有可取的可用性和令人满意的输出。",
    "en_tdlr": "Providence is a visual-programming-based multimodal machine learning tool designed to assist experts in capturing human behavioral cues without writing code, showing preferable usability and satisfactory output."
}