{
    "title": "Learning and Sustaining Shared Normative Systems via Bayesian Rule Induction in Markov Games",
    "abstract": "arXiv:2402.13399v1 Announce Type: new  Abstract: A universal feature of human societies is the adoption of systems of rules and norms in the service of cooperative ends. How can we build learning agents that do the same, so that they may flexibly cooperate with the human institutions they are embedded in? We hypothesize that agents can achieve this by assuming there exists a shared set of norms that most others comply with while pursuing their individual desires, even if they do not know the exact content of those norms. By assuming shared norms, a newly introduced agent can infer the norms of an existing population from observations of compliance and violation. Furthermore, groups of agents can converge to a shared set of norms, even if they initially diverge in their beliefs about what the norms are. This in turn enables the stability of the normative system: since agents can bootstrap common knowledge of the norms, this leads the norms to be widely adhered to, enabling new entrants ",
    "link": "https://arxiv.org/abs/2402.13399",
    "context": "Title: Learning and Sustaining Shared Normative Systems via Bayesian Rule Induction in Markov Games\nAbstract: arXiv:2402.13399v1 Announce Type: new  Abstract: A universal feature of human societies is the adoption of systems of rules and norms in the service of cooperative ends. How can we build learning agents that do the same, so that they may flexibly cooperate with the human institutions they are embedded in? We hypothesize that agents can achieve this by assuming there exists a shared set of norms that most others comply with while pursuing their individual desires, even if they do not know the exact content of those norms. By assuming shared norms, a newly introduced agent can infer the norms of an existing population from observations of compliance and violation. Furthermore, groups of agents can converge to a shared set of norms, even if they initially diverge in their beliefs about what the norms are. This in turn enables the stability of the normative system: since agents can bootstrap common knowledge of the norms, this leads the norms to be widely adhered to, enabling new entrants ",
    "path": "papers/24/02/2402.13399.json",
    "total_tokens": 891,
    "translated_title": "通过贝叶斯规则归纳在马尔科夫博弈中学习和维持共享的规范系统",
    "translated_abstract": "人类社会的一个普遍特征是采用规则和规范体系来服务于合作目的。我们如何构建可以学习并遵守这一体系的智能体，以便它们可以灵活地与人类机构合作？我们假设，通过假定存在一个共享的规范集，大多数其他人会遵守这些规范，同时追求他们个人的愿望，即使他们不知道这些规范的确切内容。通过假设共享规范，新引入的智能体可以从遵守和违反的观察中推断现有人群的规范。此外，即使最初在对规范的信念上存在分歧，一组智能体也可以收敛到共享的规范，从而实现规范体系的稳定性：由于智能体可以使规范变为共识知识，这导致规范得到广泛遵守，从而使新的参与者得以加入",
    "tldr": "通过贝叶斯规则归纳，新引入的智能体可以推断现有人群的规范，使智能体收敛到共享的规范，从而实现规范体系的稳定性",
    "en_tdlr": "Through Bayesian rule induction, newly introduced agents can infer the norms of an existing population, allowing agents to converge to a shared set of norms and achieve stability in the normative system."
}