{
    "title": "Improving the Worst-Case Bidirectional Communication Complexity for Nonconvex Distributed Optimization under Function Similarity",
    "abstract": "Effective communication between the server and workers plays a key role in distributed optimization. In this paper, we focus on optimizing the server-to-worker communication, uncovering inefficiencies in prevalent downlink compression approaches. Considering first the pure setup where the uplink communication costs are negligible, we introduce MARINA-P, a novel method for downlink compression, employing a collection of correlated compressors. Theoretical analyses demonstrates that MARINA-P with permutation compressors can achieve a server-to-worker communication complexity improving with the number of workers, thus being provably superior to existing algorithms. We further show that MARINA-P can serve as a starting point for extensions such as methods supporting bidirectional compression. We introduce M3, a method combining MARINA-P with uplink compression and a momentum step, achieving bidirectional compression with provable improvements in total communication complexity as the number",
    "link": "https://arxiv.org/abs/2402.06412",
    "context": "Title: Improving the Worst-Case Bidirectional Communication Complexity for Nonconvex Distributed Optimization under Function Similarity\nAbstract: Effective communication between the server and workers plays a key role in distributed optimization. In this paper, we focus on optimizing the server-to-worker communication, uncovering inefficiencies in prevalent downlink compression approaches. Considering first the pure setup where the uplink communication costs are negligible, we introduce MARINA-P, a novel method for downlink compression, employing a collection of correlated compressors. Theoretical analyses demonstrates that MARINA-P with permutation compressors can achieve a server-to-worker communication complexity improving with the number of workers, thus being provably superior to existing algorithms. We further show that MARINA-P can serve as a starting point for extensions such as methods supporting bidirectional compression. We introduce M3, a method combining MARINA-P with uplink compression and a momentum step, achieving bidirectional compression with provable improvements in total communication complexity as the number",
    "path": "papers/24/02/2402.06412.json",
    "total_tokens": 931,
    "translated_title": "提高非凸分布式优化在函数相似性下的最坏情况双向通信复杂性",
    "translated_abstract": "服务器和工作节点之间的有效通信在分布式优化中起着关键作用。本文主要关注优化服务器到工作节点的通信，并揭示了当前流行的下行压缩方法中的低效性。首先考虑上行通信成本可忽略的纯粹情况下，我们引入MARINA-P，一种使用一系列相关压缩器的新型下行压缩方法。理论分析证明，使用排列压缩器的MARINA-P可以实现服务器到工作节点的通信复杂度随工作节点数量提高，因此在算法上可证明优于现有算法。我们进一步展示了MARINA-P可以作为支持双向压缩的方法的起点。我们介绍了M3，这是一种将MARINA-P与上行压缩和动量步骤组合的方法，能够实现双向压缩，并在总通信复杂度上证明了改进。",
    "tldr": "本文提出了MARINA-P方法，通过引入一系列相关压缩器，优化了服务器到工作节点的通信复杂度。理论分析证明，MARINA-P在算法上优于现有方法，并可以作为支持双向压缩的起点。通过与上行压缩和动量步骤的结合，M3方法实现了双向压缩，并在总通信复杂度上改进。",
    "en_tdlr": "This paper introduces MARINA-P, a method that optimizes the server-to-worker communication complexity by introducing a collection of correlated compressors. Theoretical analysis shows the superiority of MARINA-P over existing methods and its potential as a starting point for bidirectional compression. The M3 method, which combines MARINA-P with uplink compression and a momentum step, achieves bidirectional compression and improves the total communication complexity."
}