{
    "title": "The Use of a Large Language Model for Cyberbullying Detection",
    "abstract": "The dominance of social media has added to the channels of bullying for perpetrators. Unfortunately, cyberbullying (CB) is the most prevalent phenomenon in todays cyber world, and is a severe threat to the mental and physical health of citizens. This opens the need to develop a robust system to prevent bullying content from online forums, blogs, and social media platforms to manage the impact in our society. Several machine learning (ML) algorithms have been proposed for this purpose. However, their performances are not consistent due to high class imbalance and generalisation issues. In recent years, large language models (LLMs) like BERT and RoBERTa have achieved state-of-the-art (SOTA) results in several natural language processing (NLP) tasks. Unfortunately, the LLMs have not been applied extensively for CB detection. In our paper, we explored the use of these models for cyberbullying (CB) detection. We have prepared a new dataset (D2) from existing studies (Formspring and Twitter)",
    "link": "https://arxiv.org/abs/2402.04088",
    "context": "Title: The Use of a Large Language Model for Cyberbullying Detection\nAbstract: The dominance of social media has added to the channels of bullying for perpetrators. Unfortunately, cyberbullying (CB) is the most prevalent phenomenon in todays cyber world, and is a severe threat to the mental and physical health of citizens. This opens the need to develop a robust system to prevent bullying content from online forums, blogs, and social media platforms to manage the impact in our society. Several machine learning (ML) algorithms have been proposed for this purpose. However, their performances are not consistent due to high class imbalance and generalisation issues. In recent years, large language models (LLMs) like BERT and RoBERTa have achieved state-of-the-art (SOTA) results in several natural language processing (NLP) tasks. Unfortunately, the LLMs have not been applied extensively for CB detection. In our paper, we explored the use of these models for cyberbullying (CB) detection. We have prepared a new dataset (D2) from existing studies (Formspring and Twitter)",
    "path": "papers/24/02/2402.04088.json",
    "total_tokens": 904,
    "translated_title": "使用大型语言模型进行网络欺凌检测的研究",
    "translated_abstract": "社交媒体的盛行为恶意用户提供了更多的网络欺凌渠道。不幸的是，网络欺凌是当今网络世界中最普遍的现象，对公民的心理和身体健康构成严重威胁。这就需要开发一个强大的系统，以阻止在线论坛、博客和社交媒体平台上的欺凌内容，以管理其对我们社会的影响。已经提出了一些用于此目的的机器学习算法。然而，由于高度的类别不平衡和泛化问题，它们的性能并不稳定。近年来，像BERT和RoBERTa这样的大型语言模型在几个自然语言处理任务中取得了最先进的结果。不幸的是，LLM在网络欺凌检测方面尚未得到广泛应用。在我们的论文中，我们研究了使用这些模型进行网络欺凌检测。我们从现有研究（Formspring和Twitter）中准备了一个新的数据集（D2）。",
    "tldr": "这项研究探索了使用大型语言模型（LLMs）如BERT和RoBERTa进行网络欺凌检测，并准备了一个新的数据集（D2）以应对高度不平衡的类别和泛化问题。",
    "en_tdlr": "This study explores the use of large language models (LLMs) like BERT and RoBERTa for cyberbullying detection and prepares a new dataset (D2) to address the issues of high class imbalance and generalisation."
}