{
    "title": "WiOpen: A Robust Wi-Fi-based Open-set Gesture Recognition Framework",
    "abstract": "Recent years have witnessed a growing interest in Wi-Fi-based gesture recognition. However, existing works have predominantly focused on closed-set paradigms, where all testing gestures are predefined during training. This poses a significant challenge in real-world applications, as unseen gestures might be misclassified as known classes during testing. To address this issue, we propose WiOpen, a robust Wi-Fi-based Open-Set Gesture Recognition (OSGR) framework. Implementing OSGR requires addressing challenges caused by the unique uncertainty in Wi-Fi sensing. This uncertainty, resulting from noise and domains, leads to widely scattered and irregular data distributions in collected Wi-Fi sensing data. Consequently, data ambiguity between classes and challenges in defining appropriate decision boundaries to identify unknowns arise. To tackle these challenges, WiOpen adopts a two-fold approach to eliminate uncertainty and define precise decision boundaries. Initially, it addresses uncerta",
    "link": "https://arxiv.org/abs/2402.00822",
    "context": "Title: WiOpen: A Robust Wi-Fi-based Open-set Gesture Recognition Framework\nAbstract: Recent years have witnessed a growing interest in Wi-Fi-based gesture recognition. However, existing works have predominantly focused on closed-set paradigms, where all testing gestures are predefined during training. This poses a significant challenge in real-world applications, as unseen gestures might be misclassified as known classes during testing. To address this issue, we propose WiOpen, a robust Wi-Fi-based Open-Set Gesture Recognition (OSGR) framework. Implementing OSGR requires addressing challenges caused by the unique uncertainty in Wi-Fi sensing. This uncertainty, resulting from noise and domains, leads to widely scattered and irregular data distributions in collected Wi-Fi sensing data. Consequently, data ambiguity between classes and challenges in defining appropriate decision boundaries to identify unknowns arise. To tackle these challenges, WiOpen adopts a two-fold approach to eliminate uncertainty and define precise decision boundaries. Initially, it addresses uncerta",
    "path": "papers/24/02/2402.00822.json",
    "total_tokens": 878,
    "translated_title": "WiOpen: 一种稳健的基于Wi-Fi的开放式手势识别框架",
    "translated_abstract": "近年来，基于Wi-Fi的手势识别引起了广泛关注。然而，现有的工作主要集中在封闭集范式上，其中所有测试手势在训练期间都是预定义的。这在实际应用中存在重大挑战，因为在测试中，未见过的手势可能会被错误分类为已知类别。为了解决这个问题，我们提出了WiOpen，一种稳健的基于Wi-Fi的开放式手势识别框架。实现开放式手势识别需要解决Wi-Fi感测中的不确定性带来的挑战。这种不确定性由噪声和领域引起，在收集的Wi-Fi感测数据中导致了广泛散布和不规则的数据分布。因此，类别之间的数据模糊以及定义适当的决策边界以识别未知手势的挑战也随之出现。为了解决这些挑战，WiOpen采用了一个双重方法来消除不确定性并定义精确的决策边界。",
    "tldr": "WiOpen是一种稳健的基于Wi-Fi的开放式手势识别框架，通过消除不确定性和定义精确的决策边界来解决在实际应用中未见手势被错误分类的问题。",
    "en_tdlr": "WiOpen is a robust Wi-Fi-based open-set gesture recognition framework that addresses the challenge of misclassifying unseen gestures in real-world applications by eliminating uncertainty and defining precise decision boundaries."
}