{
    "title": "Distributions of Posterior Quantiles via Matching",
    "abstract": "arXiv:2402.17142v1 Announce Type: new  Abstract: We offer a simple analysis of the problem of choosing a statistical experiment to optimize the induced distribution of posterior medians, or more generally $q$-quantiles for any $q \\in (0,1)$. We show that all implementable distributions of the posterior $q$-quantile are implemented by a single experiment, the $q$-quantile matching experiment, which pools pairs of states across the $q$-quantile of the prior in a positively assortative manner, with weight $q$ on the lower state in each pair. A dense subset of implementable distributions of posterior $q$-quantiles can be uniquely implemented by perturbing the $q$-quantile matching experiment. A linear functional is optimized over distributions of posterior $q$-quantiles by taking the optimal selection from each set of $q$-quantiles induced by the $q$-quantile matching experiment. The $q$-quantile matching experiment is the only experiment that simultaneously implements all implementable di",
    "link": "https://arxiv.org/abs/2402.17142",
    "context": "Title: Distributions of Posterior Quantiles via Matching\nAbstract: arXiv:2402.17142v1 Announce Type: new  Abstract: We offer a simple analysis of the problem of choosing a statistical experiment to optimize the induced distribution of posterior medians, or more generally $q$-quantiles for any $q \\in (0,1)$. We show that all implementable distributions of the posterior $q$-quantile are implemented by a single experiment, the $q$-quantile matching experiment, which pools pairs of states across the $q$-quantile of the prior in a positively assortative manner, with weight $q$ on the lower state in each pair. A dense subset of implementable distributions of posterior $q$-quantiles can be uniquely implemented by perturbing the $q$-quantile matching experiment. A linear functional is optimized over distributions of posterior $q$-quantiles by taking the optimal selection from each set of $q$-quantiles induced by the $q$-quantile matching experiment. The $q$-quantile matching experiment is the only experiment that simultaneously implements all implementable di",
    "path": "papers/24/02/2402.17142.json",
    "total_tokens": 904,
    "translated_title": "后验分位数的分布通过匹配",
    "translated_abstract": "我们提供了一种简单的分析方法来解决选择统计实验以优化后验中位数或更一般地说是任意$q \\in (0,1)$分位数的分布的问题。我们表明后验$q$分位数的所有可实现分布均可通过单一实验实现，即$q$分位数匹配实验，该实验以正相关的方式在先验的$q$分位对中汇聚两个状态，并且在每个对中对较低的状态赋予权重$q$。实验中一种密集子集的后验$q$分位数的所有可实现分布都可以通过扰动$q$分位数匹配实验唯一实现。通过从由$q$分位数匹配实验诱导的每组$q$分位数中选择最佳选项，可以对后验$q$分位数的分布进行线性功能的优化。$q$分位数匹配实验是唯一同时实现所有可实现分位数的实验。",
    "tldr": "选择统计实验以优化后验分位数的分布问题中，我们发现后验分位数的所有可实现分布均可通过单一实验—$q$分位数匹配实验来实现，并且该实验同时可实现一种密集子集的后验分位数的所有可实现分布。",
    "en_tdlr": "In the problem of choosing a statistical experiment to optimize the induced distribution of posterior quantiles, it is found that all implementable distributions of posterior quantiles can be achieved by a single experiment, the quantile matching experiment, which also simultaneously implements a dense subset of implementable distributions of posterior quantiles."
}