{
    "title": "Deep Separable Spatiotemporal Learning for Fast Dynamic Cardiac MRI",
    "abstract": "arXiv:2402.15939v1 Announce Type: cross  Abstract: Dynamic magnetic resonance imaging (MRI) plays an indispensable role in cardiac diagnosis. To enable fast imaging, the k-space data can be undersampled but the image reconstruction poses a great challenge of high-dimensional processing. This challenge leads to necessitate extensive training data in many deep learning reconstruction methods. This work proposes a novel and efficient approach, leveraging a dimension-reduced separable learning scheme that excels even with highly limited training data. We further integrate it with spatiotemporal priors to develop a Deep Separable Spatiotemporal Learning network (DeepSSL), which unrolls an iteration process of a reconstruction model with both temporal low-rankness and spatial sparsity. Intermediate outputs are visualized to provide insights into the network's behavior and enhance its interpretability. Extensive results on cardiac cine datasets show that the proposed DeepSSL is superior to th",
    "link": "https://arxiv.org/abs/2402.15939",
    "context": "Title: Deep Separable Spatiotemporal Learning for Fast Dynamic Cardiac MRI\nAbstract: arXiv:2402.15939v1 Announce Type: cross  Abstract: Dynamic magnetic resonance imaging (MRI) plays an indispensable role in cardiac diagnosis. To enable fast imaging, the k-space data can be undersampled but the image reconstruction poses a great challenge of high-dimensional processing. This challenge leads to necessitate extensive training data in many deep learning reconstruction methods. This work proposes a novel and efficient approach, leveraging a dimension-reduced separable learning scheme that excels even with highly limited training data. We further integrate it with spatiotemporal priors to develop a Deep Separable Spatiotemporal Learning network (DeepSSL), which unrolls an iteration process of a reconstruction model with both temporal low-rankness and spatial sparsity. Intermediate outputs are visualized to provide insights into the network's behavior and enhance its interpretability. Extensive results on cardiac cine datasets show that the proposed DeepSSL is superior to th",
    "path": "papers/24/02/2402.15939.json",
    "total_tokens": 887,
    "translated_title": "深度可分离时空学习用于快速动态心脏磁共振成像",
    "translated_abstract": "动态磁共振成像（MRI）在心脏诊断中起着不可或缺的作用。为了实现快速成像，k-空间数据可以进行欠采样，但图像重建面临着高维处理的巨大挑战。为了解决这一挑战，许多深度学习重建方法需要大量的训练数据。本文提出了一种新颖高效的方法，利用降维可分离学习方案，即使在训练数据极为有限的情况下也能表现卓越。我们进一步将其与时空先验相结合，开发了一个深度可分离时空学习网络（DeepSSL），该网络展开了一个具有时间低秩性和空间稀疏性的重建模型的迭代过程。中间输出被可视化，以提供有关网络行为的见解并增强其可解释性。对心脏短片数据集的广泛结果表明，所提出的DeepSSL优于其他方法。",
    "tldr": "提出了一种使用深度可分离时空学习网络（DeepSSL）的方法，结合时空先验开发了一个高效的图像重建方案，即使在训练数据有限的情况下也表现出色。"
}