{
    "title": "A Machine Learning Approach to Detect Customer Satisfaction From Multiple Tweet Parameters",
    "abstract": "arXiv:2402.15992v1 Announce Type: cross  Abstract: Since internet technologies have advanced, one of the primary factors in company development is customer happiness. Online platforms have become prominent places for sharing reviews. Twitter is one of these platforms where customers frequently post their thoughts. Reviews of flights on these platforms have become a concern for the airline business. A positive review can help the company grow, while a negative one can quickly ruin its revenue and reputation. So it's vital for airline businesses to examine the feedback and experiences of their customers and enhance their services to remain competitive. But studying thousands of tweets and analyzing them to find the satisfaction of the customer is quite a difficult task. This tedious process can be made easier by using a machine learning approach to analyze tweets to determine client satisfaction levels. Some work has already been done on this strategy to automate the procedure using mach",
    "link": "https://arxiv.org/abs/2402.15992",
    "context": "Title: A Machine Learning Approach to Detect Customer Satisfaction From Multiple Tweet Parameters\nAbstract: arXiv:2402.15992v1 Announce Type: cross  Abstract: Since internet technologies have advanced, one of the primary factors in company development is customer happiness. Online platforms have become prominent places for sharing reviews. Twitter is one of these platforms where customers frequently post their thoughts. Reviews of flights on these platforms have become a concern for the airline business. A positive review can help the company grow, while a negative one can quickly ruin its revenue and reputation. So it's vital for airline businesses to examine the feedback and experiences of their customers and enhance their services to remain competitive. But studying thousands of tweets and analyzing them to find the satisfaction of the customer is quite a difficult task. This tedious process can be made easier by using a machine learning approach to analyze tweets to determine client satisfaction levels. Some work has already been done on this strategy to automate the procedure using mach",
    "path": "papers/24/02/2402.15992.json",
    "total_tokens": 814,
    "translated_title": "从多个推文参数中检测客户满意度的机器学习方法",
    "translated_abstract": "自互联网技术得以发展以来，客户满意度已成为企业发展的主要因素之一。在线平台已成为分享评论的主要场所之一。Twitter是其中之一，客户经常在该平台上发布他们的想法。在这些平台上对航班的评论已成为航空公司关注的焦点。积极的评论可以帮助公司增长，而消极的评论则可能迅速破坏其收入和声誉。因此，对航空公司来说，审查客户的反馈和体验、改进其服务以保持竞争力至关重要。然而，研究成千上万条推文并分析它们以确定客户满意度是一项相当困难的任务。利用机器学习方法分析推文以确定客户满意水平可以简化这一费时的过程。已经有一些关于这种策略的工作可自动化该过程使用机器学",
    "tldr": "使用机器学习方法分析推文以确定客户满意水平，有助于简化研究成千上万条推文并改进航空公司服务的繁琐过程。",
    "en_tdlr": "Analyzing tweets using machine learning to determine customer satisfaction levels can help simplify the tedious process of studying thousands of tweets and improving airline services."
}