{
    "title": "A Comparative Analysis of Gene Expression Profiling by Statistical and Machine Learning Approaches",
    "abstract": "Many machine learning models have been proposed to classify phenotypes from gene expression data. In addition to their good performance, these models can potentially provide some understanding of phenotypes by extracting explanations for their decisions. These explanations often take the form of a list of genes ranked in order of importance for the predictions, the highest-ranked genes being interpreted as linked to the phenotype. We discuss the biological and the methodological limitations of such explanations. Experiments are performed on several datasets gathering cancer and healthy tissue samples from the TCGA, GTEx and TARGET databases. A collection of machine learning models including logistic regression, multilayer perceptron, and graph neural network are trained to classify samples according to their cancer type. Gene rankings are obtained from explainability methods adapted to these models, and compared to the ones from classical statistical feature selection methods such as m",
    "link": "https://rss.arxiv.org/abs/2402.00926",
    "context": "Title: A Comparative Analysis of Gene Expression Profiling by Statistical and Machine Learning Approaches\nAbstract: Many machine learning models have been proposed to classify phenotypes from gene expression data. In addition to their good performance, these models can potentially provide some understanding of phenotypes by extracting explanations for their decisions. These explanations often take the form of a list of genes ranked in order of importance for the predictions, the highest-ranked genes being interpreted as linked to the phenotype. We discuss the biological and the methodological limitations of such explanations. Experiments are performed on several datasets gathering cancer and healthy tissue samples from the TCGA, GTEx and TARGET databases. A collection of machine learning models including logistic regression, multilayer perceptron, and graph neural network are trained to classify samples according to their cancer type. Gene rankings are obtained from explainability methods adapted to these models, and compared to the ones from classical statistical feature selection methods such as m",
    "path": "papers/24/02/2402.00926.json",
    "total_tokens": 841,
    "translated_title": "统计和机器学习方法对基因表达谱进行比较分析",
    "translated_abstract": "许多机器学习模型被提出来从基因表达数据中分类表型。除了表现好之外，这些模型还可以通过提取决策的解释来对表型进行一定的理解。这些解释通常以基因按重要性排名的列表形式呈现，排名最高的基因被解释为与表型相关联。我们讨论了这种解释的生物学和方法学限制。在TCGA、GTEx和TARGET数据库中收集的癌症和健康组织样本上进行了实验。使用逻辑回归、多层感知器和图神经网络等多种机器学习模型对样本进行了癌症类型分类。从适应于这些模型的解释性方法中获取基因排名，并与经典统计特征选择方法（如m）进行比较。",
    "tldr": "这篇论文比较了统计和机器学习方法在基因表达谱的分析中的应用。通过解释性方法得到的基因排名可以帮助理解表型，但存在一些生物学和方法学上的限制。实验证明在癌症分类中，多种机器学习模型都可以用于预测癌症类型。",
    "en_tdlr": "This paper compares the applications of statistical and machine learning approaches in analyzing gene expression profiles. The rankings of genes obtained from explainability methods can help understand phenotypes, but there are biological and methodological limitations. Experiments show that multiple machine learning models can be used to predict cancer types."
}