{
    "title": "Training microrobots to swim by a large language model",
    "abstract": "Machine learning and artificial intelligence have recently represented a popular paradigm for designing and optimizing robotic systems across various scales. Recent studies have showcased the innovative application of large language models (LLMs) in industrial control [1] and in directing legged walking robots [2]. In this study, we utilize an LLM, GPT-4, to train two prototypical microrobots for swimming in viscous fluids. Adopting a few-shot learning approach, we develop a minimal, unified prompt composed of only five sentences. The same concise prompt successfully guides two distinct articulated microrobots -- the three-link swimmer and the three-sphere swimmer -- in mastering their signature strokes. These strokes, initially conceptualized by physicists, are now effectively interpreted and applied by the LLM, enabling the microrobots to circumvent the physical constraints inherent to micro-locomotion. Remarkably, our LLM-based decision-making strategy substantially surpasses a trad",
    "link": "https://arxiv.org/abs/2402.00044",
    "context": "Title: Training microrobots to swim by a large language model\nAbstract: Machine learning and artificial intelligence have recently represented a popular paradigm for designing and optimizing robotic systems across various scales. Recent studies have showcased the innovative application of large language models (LLMs) in industrial control [1] and in directing legged walking robots [2]. In this study, we utilize an LLM, GPT-4, to train two prototypical microrobots for swimming in viscous fluids. Adopting a few-shot learning approach, we develop a minimal, unified prompt composed of only five sentences. The same concise prompt successfully guides two distinct articulated microrobots -- the three-link swimmer and the three-sphere swimmer -- in mastering their signature strokes. These strokes, initially conceptualized by physicists, are now effectively interpreted and applied by the LLM, enabling the microrobots to circumvent the physical constraints inherent to micro-locomotion. Remarkably, our LLM-based decision-making strategy substantially surpasses a trad",
    "path": "papers/24/02/2402.00044.json",
    "total_tokens": 922,
    "translated_title": "使用大型语言模型训练微型机器人游泳",
    "translated_abstract": "机器学习和人工智能近年来成为设计和优化各种尺度机器人系统的流行范式。最近的研究展示了大型语言模型（LLMs）在工业控制[1]和指导腿式行走机器人[2]方面的创新应用。在本研究中，我们利用一个LLM，GPT-4，来训练两个原型微型机器人在粘性流体中游泳。采用少样本学习方法，我们开发了一个仅由五个句子组成的简洁统一提示。相同的简洁提示成功地引导了两种不同的关节式微型机器人——三连杆游泳机器人和三球游泳机器人——掌握它们的特色划水动作。这些动作最初由物理学家构思，现在通过LLM得到有效的解释和应用，使得微型机器人能够克服微小运动中固有的物理约束。值得注意的是，我们基于LLM的决策策略明显超越了传统方法。",
    "tldr": "本研究利用大型语言模型(GPT-4)训练两个微型机器人游泳，采用少样本学习方法，开发了一个简洁统一提示，成功引导这两种微型机器人掌握其特色划水动作，从而超越了传统方法。",
    "en_tdlr": "This study trains two microrobots to swim using a large language model (GPT-4), utilizing a few-shot learning approach and a concise prompt. The microrobots are able to master their signature strokes in viscous fluids, surpassing traditional methods."
}