{
    "title": "Automatic Segmentation of the Spinal Cord Nerve Rootlets",
    "abstract": "Precise identification of spinal nerve rootlets is relevant to delineate spinal levels for the study of functional activity in the spinal cord. The goal of this study was to develop an automatic method for the semantic segmentation of spinal nerve rootlets from T2-weighted magnetic resonance imaging (MRI) scans. Images from two open-access MRI datasets were used to train a 3D multi-class convolutional neural network using an active learning approach to segment C2-C8 dorsal nerve rootlets. Each output class corresponds to a spinal level. The method was tested on 3T T2-weighted images from datasets unseen during training to assess inter-site, inter-session, and inter-resolution variability. The test Dice score was 0.67 +- 0.16 (mean +- standard deviation across rootlets levels), suggesting a good performance. The method also demonstrated low inter-vendor and inter-site variability (coefficient of variation <= 1.41 %), as well as low inter-session variability (coefficient of variation <= ",
    "link": "https://arxiv.org/abs/2402.00724",
    "context": "Title: Automatic Segmentation of the Spinal Cord Nerve Rootlets\nAbstract: Precise identification of spinal nerve rootlets is relevant to delineate spinal levels for the study of functional activity in the spinal cord. The goal of this study was to develop an automatic method for the semantic segmentation of spinal nerve rootlets from T2-weighted magnetic resonance imaging (MRI) scans. Images from two open-access MRI datasets were used to train a 3D multi-class convolutional neural network using an active learning approach to segment C2-C8 dorsal nerve rootlets. Each output class corresponds to a spinal level. The method was tested on 3T T2-weighted images from datasets unseen during training to assess inter-site, inter-session, and inter-resolution variability. The test Dice score was 0.67 +- 0.16 (mean +- standard deviation across rootlets levels), suggesting a good performance. The method also demonstrated low inter-vendor and inter-site variability (coefficient of variation <= 1.41 %), as well as low inter-session variability (coefficient of variation <= ",
    "path": "papers/24/02/2402.00724.json",
    "total_tokens": 883,
    "translated_title": "脊髓神经根分支的自动分割",
    "translated_abstract": "准确识别脊髓神经根分支对于描绘脊髓的功能活动具有重要意义。本研究旨在开发一种自动方法，用于从T2加权磁共振成像（MRI）扫描中语义分割脊髓神经根分支。通过使用两个开放存取的MRI数据集中的图像，采用主动学习方法训练了一个三维多类卷积神经网络，以分割C2-C8背面神经根分支。每个输出类别对应一个脊髓水平。该方法在训练阶段未见的数据集中进行了测试，以评估不同场地、不同会话和不同分辨率之间的变异性。测试结果的Dice分数为0.67+-0.16（均值+-标准差，针对不同神经根分支水平），表明方法具有良好的性能。该方法还展示了低厂商间和场地间的变异性（变异系数<=1.41%），以及低会话间变异性（变异系数",
    "tldr": "本研究开发了一种自动化的方法，可以从MRI扫描中准确地分割脊髓神经根分支，并且具有良好的性能和稳定性。",
    "en_tdlr": "This study developed an automatic method for precise segmentation of spinal nerve rootlets from MRI scans, demonstrating good performance and stability."
}