{
    "title": "Character-based Outfit Generation with Vision-augmented Style Extraction via LLMs",
    "abstract": "The outfit generation problem involves recommending a complete outfit to a user based on their interests. Existing approaches focus on recommending items based on anchor items or specific query styles but do not consider customer interests in famous characters from movie, social media, etc. In this paper, we define a new Character-based Outfit Generation (COG) problem, designed to accurately interpret character information and generate complete outfit sets according to customer specifications such as age and gender. To tackle this problem, we propose a novel framework LVA-COG that leverages Large Language Models (LLMs) to extract insights from customer interests (e.g., character information) and employ prompt engineering techniques for accurate understanding of customer preferences. Additionally, we incorporate text-to-image models to enhance the visual understanding and generation (factual or counterfactual) of cohesive outfits. Our framework integrates LLMs with text-to-image models ",
    "link": "https://arxiv.org/abs/2402.05941",
    "context": "Title: Character-based Outfit Generation with Vision-augmented Style Extraction via LLMs\nAbstract: The outfit generation problem involves recommending a complete outfit to a user based on their interests. Existing approaches focus on recommending items based on anchor items or specific query styles but do not consider customer interests in famous characters from movie, social media, etc. In this paper, we define a new Character-based Outfit Generation (COG) problem, designed to accurately interpret character information and generate complete outfit sets according to customer specifications such as age and gender. To tackle this problem, we propose a novel framework LVA-COG that leverages Large Language Models (LLMs) to extract insights from customer interests (e.g., character information) and employ prompt engineering techniques for accurate understanding of customer preferences. Additionally, we incorporate text-to-image models to enhance the visual understanding and generation (factual or counterfactual) of cohesive outfits. Our framework integrates LLMs with text-to-image models ",
    "path": "papers/24/02/2402.05941.json",
    "total_tokens": 925,
    "translated_title": "基于人物的服装生成与通过LLMs进行视觉增强的风格提取",
    "translated_abstract": "服装生成问题涉及根据用户的兴趣推荐一个完整的服装。现有方法主要基于锚定商品或指定查询风格来推荐物品，但不考虑用户对电影、社交媒体等中著名人物的兴趣。本文定义了一个新的基于人物的服装生成（COG）问题，旨在准确解释人物信息，并根据用户的规范（如年龄和性别）生成完整的服装组合。为了解决这个问题，我们提出了一个新颖的框架LVA-COG，利用大型语言模型（LLMs）从用户的兴趣（例如人物信息）中提取见解，并采用提示工程技术准确理解用户的喜好。此外，我们还结合了文本到图像模型，增强了对连贯服装的视觉理解和生成（事实或反事实）。我们的框架将LLMs与文本到图像模型整合起来。",
    "tldr": "本文提出了一个新的基于人物的服装生成（COG）问题，旨在准确解释人物信息并根据用户的规范生成服装组合。我们提出了一个新颖的框架LVA-COG，利用大型语言模型（LLMs）从用户的兴趣中提取见解，并结合文本到图像模型，增强了对连贯服装的视觉理解和生成。"
}