{
    "title": "Investigating the Generalizability of Physiological Characteristics of Anxiety",
    "abstract": "arXiv:2402.15513v1 Announce Type: cross  Abstract: Recent works have demonstrated the effectiveness of machine learning (ML) techniques in detecting anxiety and stress using physiological signals, but it is unclear whether ML models are learning physiological features specific to stress. To address this ambiguity, we evaluated the generalizability of physiological features that have been shown to be correlated with anxiety and stress to high-arousal emotions. Specifically, we examine features extracted from electrocardiogram (ECG) and electrodermal (EDA) signals from the following three datasets: Anxiety Phases Dataset (APD), Wearable Stress and Affect Detection (WESAD), and the Continuously Annotated Signals of Emotion (CASE) dataset. We aim to understand whether these features are specific to anxiety or general to other high-arousal emotions through a statistical regression analysis, in addition to a within-corpus, cross-corpus, and leave-one-corpus-out cross-validation across instan",
    "link": "https://arxiv.org/abs/2402.15513",
    "context": "Title: Investigating the Generalizability of Physiological Characteristics of Anxiety\nAbstract: arXiv:2402.15513v1 Announce Type: cross  Abstract: Recent works have demonstrated the effectiveness of machine learning (ML) techniques in detecting anxiety and stress using physiological signals, but it is unclear whether ML models are learning physiological features specific to stress. To address this ambiguity, we evaluated the generalizability of physiological features that have been shown to be correlated with anxiety and stress to high-arousal emotions. Specifically, we examine features extracted from electrocardiogram (ECG) and electrodermal (EDA) signals from the following three datasets: Anxiety Phases Dataset (APD), Wearable Stress and Affect Detection (WESAD), and the Continuously Annotated Signals of Emotion (CASE) dataset. We aim to understand whether these features are specific to anxiety or general to other high-arousal emotions through a statistical regression analysis, in addition to a within-corpus, cross-corpus, and leave-one-corpus-out cross-validation across instan",
    "path": "papers/24/02/2402.15513.json",
    "total_tokens": 821,
    "translated_title": "研究焦虑的生理特征的泛化能力",
    "translated_abstract": "最近的研究表明，利用生理信号检测焦虑和压力的机器学习（ML）技术的有效性，但目前尚不清楚ML模型是否正在学习与压力特定相关的生理特征。为了解决这一歧义，我们评估了已被证明与焦虑和压力相关的生理特征的泛化能力，以适应高激活情绪。具体来说，我们检查了从以下三个数据集提取的特征：焦虑阶段数据集（APD），可穿戴压力和情感检测（WESAD），以及情绪连续标注信号（CASE）数据集的心电图（ECG）和皮电（EDA）信号。我们旨在通过统计回归分析，以及在语料库内部、跨语料库和留一语料库外的交叉验证，了解这些特征是特定于焦虑还是普遍于其他高激活情绪。",
    "tldr": "评估了焦虑和压力相关的生理特征在其他高激活情绪中的泛化能力。",
    "en_tdlr": "Investigated the generalizability of physiological features related to anxiety and stress in other high-arousal emotions."
}