{
    "title": "Autonomous Reality Modelling for Cultural Heritage Sites employing cooperative quadrupedal robots and unmanned aerial vehicles",
    "abstract": "arXiv:2402.12794v1 Announce Type: cross  Abstract: Nowadays, the use of advanced sensors, such as terrestrial 3D laser scanners, mobile LiDARs and Unmanned Aerial Vehicles (UAV) photogrammetric imaging, has become the prevalent practice for 3D Reality Modeling and digitization of large-scale monuments of Cultural Heritage (CH). In practice, this process is heavily related to the expertise of the surveying team, handling the laborious planning and time-consuming execution of the 3D mapping process that is tailored to the specific requirements and constraints of each site. To minimize human intervention, this paper introduces a novel methodology for autonomous 3D Reality Modeling for CH monuments by employing au-tonomous biomimetic quadrupedal robotic agents and UAVs equipped with the appropriate sensors. These autonomous robotic agents carry out the 3D RM process in a systematic and repeatable ap-proach. The outcomes of this automated process may find applications in digital twin platfo",
    "link": "https://arxiv.org/abs/2402.12794",
    "context": "Title: Autonomous Reality Modelling for Cultural Heritage Sites employing cooperative quadrupedal robots and unmanned aerial vehicles\nAbstract: arXiv:2402.12794v1 Announce Type: cross  Abstract: Nowadays, the use of advanced sensors, such as terrestrial 3D laser scanners, mobile LiDARs and Unmanned Aerial Vehicles (UAV) photogrammetric imaging, has become the prevalent practice for 3D Reality Modeling and digitization of large-scale monuments of Cultural Heritage (CH). In practice, this process is heavily related to the expertise of the surveying team, handling the laborious planning and time-consuming execution of the 3D mapping process that is tailored to the specific requirements and constraints of each site. To minimize human intervention, this paper introduces a novel methodology for autonomous 3D Reality Modeling for CH monuments by employing au-tonomous biomimetic quadrupedal robotic agents and UAVs equipped with the appropriate sensors. These autonomous robotic agents carry out the 3D RM process in a systematic and repeatable ap-proach. The outcomes of this automated process may find applications in digital twin platfo",
    "path": "papers/24/02/2402.12794.json",
    "total_tokens": 866,
    "translated_title": "利用协作四足机器人和无人机进行文化遗产遗址的自主现实建模",
    "translated_abstract": "如今，先进传感器的使用，如地面3D激光扫描仪、移动LiDAR和无人机摄影测量，已经成为文化遗产(CH)大型文物的3D现实建模和数字化的主要实践。在实践中，这个过程与调查团队的专业知识密切相关，处理针对每个遗址特定要求和约束的耗时规划和执行3D映射过程。为了最小化人类干预，本文引入了一种新颖的方法，通过利用配备适当传感器的自主仿生四足机器人代理和无人机来实现文化遗产(CH)文物的自主3D现实建模。这些自主机器人代理以系统化且可重复的方式进行3D RM过程。这个自动化过程的结果可能在数字孪生平台中找到应用。",
    "tldr": "通过使用自主仿生四足机器人代理和无人机，本文提出了一种自主的3D现实建模方法，可以用于文化遗产(CH)文物，实现了系统化和可重复的3D RM过程。",
    "en_tdlr": "An autonomous method for 3D reality modeling using autonomous biomimetic quadrupedal robotic agents and UAVs is proposed for cultural heritage (CH) artifacts, achieving a systematic and repeatable 3D RM process."
}