{
    "title": "A Simple Measure of Economic Complexity. (arXiv:1601.05012v6 [q-fin.ST] UPDATED)",
    "abstract": "Contrary to conventional economic growth theory, which reduces a country's output to one aggregate variable (GDP), product diversity is central to economic development, as recent 'economic complexity' research suggests. A country's product diversity reflects its diversity of knowhow or 'capabilities'. Researchers proposed the Economic Complexity Index (ECI) and the country Fitness index to estimate a country's number of capabilities from international export data; these measures predict economic growth better than conventional variables such as human capital. This paper offers a simpler measure of a country's knowhow, Log Product Diversity (or LPD, the logarithm of a country's number of products), which can be derived from a one-parameter combinatorial model of production in which a set of knowhows combine with some probability to turn raw materials into a product. ECI and log-fitness can be interpreted theoretically (using the combinatorial model) and empirically as potentially noisy ",
    "link": "http://arxiv.org/abs/1601.05012",
    "context": "Title: A Simple Measure of Economic Complexity. (arXiv:1601.05012v6 [q-fin.ST] UPDATED)\nAbstract: Contrary to conventional economic growth theory, which reduces a country's output to one aggregate variable (GDP), product diversity is central to economic development, as recent 'economic complexity' research suggests. A country's product diversity reflects its diversity of knowhow or 'capabilities'. Researchers proposed the Economic Complexity Index (ECI) and the country Fitness index to estimate a country's number of capabilities from international export data; these measures predict economic growth better than conventional variables such as human capital. This paper offers a simpler measure of a country's knowhow, Log Product Diversity (or LPD, the logarithm of a country's number of products), which can be derived from a one-parameter combinatorial model of production in which a set of knowhows combine with some probability to turn raw materials into a product. ECI and log-fitness can be interpreted theoretically (using the combinatorial model) and empirically as potentially noisy ",
    "path": "papers/16/01/1601.05012.json",
    "total_tokens": 880,
    "translated_title": "一个简单的经济复杂度度量方法",
    "translated_abstract": "与传统经济增长理论将一个国家的产出简化为一个聚合变量（GDP）不同，最近所称的“经济复杂度”研究指出，产品多样性是经济发展的核心。一个国家的产品多样性反映了其技能或“能力”的多样性。研究人员提出了经济复杂度指数（ECI）和国家适应性指数，以从国际出口数据中估计一个国家的能力数量；这些指标比传统变量（如人力资本）更好地预测经济增长。本文提出了一个更简单的国家技能测量方法，即Log Product Diversity（或简写为LPD，即一个国家产品数量的对数），可以从生产的组合模型中派生出一个参数，其中一组技能以某种概率将原材料转化为成品。 ECI和log-fitness可以从理论上（使用组合模型）和经验上解释为潜在的嘈杂因素。",
    "tldr": "这篇论文提出了一个简单的方法来测量一个国家的技能，即一个国家拥有的产品种类数量的对数。该方法能够更好地预测经济增长，相较传统变量，有更好的理论和经验基础。",
    "en_tdlr": "This paper proposes a simple way to measure a country's skills, the logarithm of the number of products a country possesses. This method can better predict economic growth and has a stronger theoretical and empirical basis compared to traditional variables."
}