{
    "title": "Super-Nash performance in games. (arXiv:1912.00211v5 [econ.TH] UPDATED)",
    "abstract": "Since the 1990s, artificial intelligence (AI) systems have achieved 'superhuman performance' in major zero-sum games, where winning has an unambiguous definition. However, most economic and social interactions are non-zero-sum, where measuring 'performance' is a non-trivial task. In this paper, I introduce a novel benchmark, super-Nash performance, and a solution concept, optimin, whereby every player maximizes their minimal payoff under unilateral profitable deviations of the others. Optimin achieves super-Nash performance in that, for every Nash equilibrium, there exists an optimin where each player not only receives but also guarantees super-Nash payoffs, even if other players deviate unilaterally and profitably from the optimin. Further, optimin generalizes and unifies several key results across domains: it coincides with (i) the maximin strategies in zero-sum games, and (ii) the core in cooperative games when the core is nonempty, though it exists even if the core is empty; additi",
    "link": "http://arxiv.org/abs/1912.00211",
    "context": "Title: Super-Nash performance in games. (arXiv:1912.00211v5 [econ.TH] UPDATED)\nAbstract: Since the 1990s, artificial intelligence (AI) systems have achieved 'superhuman performance' in major zero-sum games, where winning has an unambiguous definition. However, most economic and social interactions are non-zero-sum, where measuring 'performance' is a non-trivial task. In this paper, I introduce a novel benchmark, super-Nash performance, and a solution concept, optimin, whereby every player maximizes their minimal payoff under unilateral profitable deviations of the others. Optimin achieves super-Nash performance in that, for every Nash equilibrium, there exists an optimin where each player not only receives but also guarantees super-Nash payoffs, even if other players deviate unilaterally and profitably from the optimin. Further, optimin generalizes and unifies several key results across domains: it coincides with (i) the maximin strategies in zero-sum games, and (ii) the core in cooperative games when the core is nonempty, though it exists even if the core is empty; additi",
    "path": "papers/19/12/1912.00211.json",
    "total_tokens": 1009,
    "translated_title": "游戏中的超纳什性能",
    "translated_abstract": "自20世纪90年代以来，人工智能（AI）系统在主要的零和游戏中实现了“超人类水平的表现”，其中胜利的定义是明确的。然而，大多数经济和社会互动是非零和的，衡量“性能”是一个非平凡的任务。在本文中，我介绍了一个新的基准，超纳什性能，以及一个解决概念，optimin，其中每个参与者都通过其他人的单方面有利的偏离来最大化其最小回报。Optimin实现了超纳什性能，对于每个纳什均衡，都存在一个optimin，在这个optimin中，每个参与者不仅收到，而且保证超纳什回报，即使其他参与者单方面且有利地偏离这个optimin。此外，optimin在各领域广泛且统一地推广了一些关键结果：它与（i）零和游戏中的最大最小策略相一致，并且（ii）与合作游戏中的核心相一致（当核心存在时），尽管即使核心为空，它仍然存在；",
    "tldr": "本文引入了一个新的基准——超纳什性能，并提出了一种解决概念——optimin。Optimin在非零和游戏中实现了超纳什性能，每个参与者都通过其他人的单方面有利的偏离来最大化其最小回报。此外，optimin具有普适性，并在各领域中推广了一些关键结果。",
    "en_tdlr": "This paper introduces a new benchmark called super-Nash performance and proposes a solution concept called optimin. Optimin achieves super-Nash performance in non-zero-sum games, where each player maximizes their minimal payoff under unilateral profitable deviations of the others. Furthermore, optimin generalizes and unifies key results across different domains."
}