{
    "title": "How Advance Sales can Reduce Profits: When to Buy, When to Sell, and What Price to Charge. (arXiv:1912.02869v2 [econ.GN] UPDATED)",
    "abstract": "A consumer who wants to consume a good in a particular period may nevertheless attempt to buy it earlier if he is concerned that in delaying he would find the good already sold. This paper considers a model in which the good may be offered in two periods; the period in which all consumers most value the good (period 2), and an earlier period (period 1). Examining the profit-maximizing strategy of the firm under unbounded demand, we find that even with no cost of making the product available early, the firm does not profit, and usually loses, by making the product available early. Interestingly, the price that maximizes profits induces all arrivals to occur early, or all arrivals to occur late, depending on the parameters. The firm would not set a price which induces consumers to arrive in both periods. In particular, if the firm controls the penalty for arriving early, then it should set a high penalty so that no one arrives early. The Nash equilibrium behavior of consumers, when decid",
    "link": "http://arxiv.org/abs/1912.02869",
    "context": "Title: How Advance Sales can Reduce Profits: When to Buy, When to Sell, and What Price to Charge. (arXiv:1912.02869v2 [econ.GN] UPDATED)\nAbstract: A consumer who wants to consume a good in a particular period may nevertheless attempt to buy it earlier if he is concerned that in delaying he would find the good already sold. This paper considers a model in which the good may be offered in two periods; the period in which all consumers most value the good (period 2), and an earlier period (period 1). Examining the profit-maximizing strategy of the firm under unbounded demand, we find that even with no cost of making the product available early, the firm does not profit, and usually loses, by making the product available early. Interestingly, the price that maximizes profits induces all arrivals to occur early, or all arrivals to occur late, depending on the parameters. The firm would not set a price which induces consumers to arrive in both periods. In particular, if the firm controls the penalty for arriving early, then it should set a high penalty so that no one arrives early. The Nash equilibrium behavior of consumers, when decid",
    "path": "papers/19/12/1912.02869.json",
    "total_tokens": 914,
    "translated_title": "预售如何降低利润：何时购买，何时出售，以及何价售卖",
    "translated_abstract": "如果消费者担心耽误时间会导致商品售罄，消费者想要在某个特定的时间消费商品，可能会尝试提前购买。该论文考虑了一个模型，其中商品可以在两个时期提供; 所有消费者最重视商品的时期（第2时期）和早期时期（第1时期）。在考虑无限需求下，研究了公司的利润最大化策略，发现即使没有提前制造产品的成本，公司也不会盈利，通常会亏损，使产品能够提前上市。有趣的是，最大化利润的价格会导致所有到达早期或所有到达晚期，具体取决于参数。公司不会设定能够导致消费者在两个时期都到达的价格。特别是，如果公司控制到达时间过早的惩罚，则应设置高的惩罚，以确保没有人提前到达。当消费者决定何时购买商品时，Nash均衡的行为。",
    "tldr": "该论文讨论了在不同时期销售商品的市场，发现即使没有提前制造产品的成本，公司也不会盈利，通常会亏损，使产品能够提前上市。",
    "en_tdlr": "This paper discusses the market for selling products in different periods and finds that even with no cost of making the product available early, the company does not profit and usually loses by making the product available early."
}